#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Agenda_MostDownvoted

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Agenda_MostDownvoted.Agenda_MostDownvoted_C
// 0x0020 (0x0068 - 0x0048)
class UAgenda_MostDownvoted_C final : public UAgendaObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         TargetPlayer;                                      // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAgendaGenericEvent*                    OnVoteEvent;                                       // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAgendaGenericEvent*                    OnGameEndedEvent;                                  // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Agenda_MostDownvoted(int32 EntryPoint);
	void K2_Initialize();
	void SetTargetPlayer(bool* IsValid);
	void OnVotesChanged();
	void OnGameEnded();

	class FString GetDescription() const;
	class ASCTPlayerState* GetTargetPlayerState() const;
	void IsTargetMostDownvoted(bool* Return_Value) const;
	class FString GetProgression() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Agenda_MostDownvoted_C">();
	}
	static class UAgenda_MostDownvoted_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgenda_MostDownvoted_C>();
	}
};
static_assert(alignof(UAgenda_MostDownvoted_C) == 0x000008, "Wrong alignment on UAgenda_MostDownvoted_C");
static_assert(sizeof(UAgenda_MostDownvoted_C) == 0x000068, "Wrong size on UAgenda_MostDownvoted_C");
static_assert(offsetof(UAgenda_MostDownvoted_C, UberGraphFrame) == 0x000048, "Member 'UAgenda_MostDownvoted_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAgenda_MostDownvoted_C, TargetPlayer) == 0x000050, "Member 'UAgenda_MostDownvoted_C::TargetPlayer' has a wrong offset!");
static_assert(offsetof(UAgenda_MostDownvoted_C, OnVoteEvent) == 0x000058, "Member 'UAgenda_MostDownvoted_C::OnVoteEvent' has a wrong offset!");
static_assert(offsetof(UAgenda_MostDownvoted_C, OnGameEndedEvent) == 0x000060, "Member 'UAgenda_MostDownvoted_C::OnGameEndedEvent' has a wrong offset!");

}

