#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AirlockVoteEntryWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function AirlockVoteEntryWI.AirlockVoteEntryWI_C.ExecuteUbergraph_AirlockVoteEntryWI
// 0x0098 (0x0098 - 0x0000)
struct AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerNameBPI_Name;                    // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT_1;             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetPortrait_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT_2;             // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI) == 0x000008, "Wrong alignment on AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI");
static_assert(sizeof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI) == 0x000098, "Wrong size on AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, EntryPoint) == 0x000000, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000008, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, K2Node_ComponentBoundEvent_bIsChecked) == 0x000010, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, K2Node_DynamicCast_AsICharacter_SCT) == 0x000018, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, CallFunc_GetPlayerNameBPI_Name) == 0x000030, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::CallFunc_GetPlayerNameBPI_Name' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, K2Node_DynamicCast_AsICharacter_SCT_1) == 0x000040, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::K2Node_DynamicCast_AsICharacter_SCT_1' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, CallFunc_GetPortrait_ReturnValue) == 0x000058, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::CallFunc_GetPortrait_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000078, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, K2Node_DynamicCast_AsICharacter_SCT_2) == 0x000080, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::K2Node_DynamicCast_AsICharacter_SCT_2' has a wrong offset!");
static_assert(offsetof(AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'AirlockVoteEntryWI_C_ExecuteUbergraph_AirlockVoteEntryWI::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function AirlockVoteEntryWI.AirlockVoteEntryWI_C.BndEvt__VoteButton_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct AirlockVoteEntryWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirlockVoteEntryWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on AirlockVoteEntryWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(AirlockVoteEntryWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on AirlockVoteEntryWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(AirlockVoteEntryWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'AirlockVoteEntryWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function AirlockVoteEntryWI.AirlockVoteEntryWI_C.LockButton
// 0x0001 (0x0001 - 0x0000)
struct AirlockVoteEntryWI_C_LockButton final
{
public:
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirlockVoteEntryWI_C_LockButton) == 0x000001, "Wrong alignment on AirlockVoteEntryWI_C_LockButton");
static_assert(sizeof(AirlockVoteEntryWI_C_LockButton) == 0x000001, "Wrong size on AirlockVoteEntryWI_C_LockButton");
static_assert(offsetof(AirlockVoteEntryWI_C_LockButton, CallFunc_IsChecked_ReturnValue) == 0x000000, "Member 'AirlockVoteEntryWI_C_LockButton::CallFunc_IsChecked_ReturnValue' has a wrong offset!");

}

