#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AirlockFlushSCTBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AirlockFlushSCTBP.AirlockFlushSCTBP_C.ExecuteUbergraph_AirlockFlushSCTBP
// 0x02C0 (0x02C0 - 0x0000)
struct AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacter*>                     K2Node_CustomEvent_DoomedCharacters;               // 0x0080(0x0010)(ConstParm, ReferenceParm)
	class ACharacter*                             CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x016C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x021C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02B0(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP) == 0x000010, "Wrong alignment on AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP");
static_assert(sizeof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP) == 0x0002C0, "Wrong size on AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, EntryPoint) == 0x000000, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, Temp_bool_Has_Been_Initd_Variable) == 0x000060, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, Temp_int_Loop_Counter_Variable_1) == 0x000064, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x00006C, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_Array_Get_Item) == 0x000078, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, K2Node_CustomEvent_DoomedCharacters) == 0x000080, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::K2Node_CustomEvent_DoomedCharacters' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, K2Node_DynamicCast_AsIAnim_Bp) == 0x0000A0, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B1, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, K2Node_DynamicCast_AsICharacter_SCT) == 0x0000B8, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, Temp_bool_IsClosed_Variable) == 0x0000C9, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_GetTransform_ReturnValue) == 0x0000D0, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_ComposeTransforms_ReturnValue) == 0x000100, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_BreakVector_X) == 0x000130, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_BreakVector_Y) == 0x000134, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_BreakVector_Z) == 0x000138, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_BreakTransform_Location) == 0x00013C, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_BreakTransform_Rotation) == 0x000148, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_BreakTransform_Scale) == 0x000154, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_MakeVector_ReturnValue) == 0x000160, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00016C, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_GetActorRightVector_ReturnValue) == 0x0001F8, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000204, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000210, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00021C, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0002A8, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002B0, "Member 'AirlockFlushSCTBP_C_ExecuteUbergraph_AirlockFlushSCTBP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function AirlockFlushSCTBP.AirlockFlushSCTBP_C.SetupFlush
// 0x0010 (0x0010 - 0x0000)
struct AirlockFlushSCTBP_C_SetupFlush final
{
public:
	TArray<class ACharacter*>                     DoomedCharacters_0;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AirlockFlushSCTBP_C_SetupFlush) == 0x000008, "Wrong alignment on AirlockFlushSCTBP_C_SetupFlush");
static_assert(sizeof(AirlockFlushSCTBP_C_SetupFlush) == 0x000010, "Wrong size on AirlockFlushSCTBP_C_SetupFlush");
static_assert(offsetof(AirlockFlushSCTBP_C_SetupFlush, DoomedCharacters_0) == 0x000000, "Member 'AirlockFlushSCTBP_C_SetupFlush::DoomedCharacters_0' has a wrong offset!");

// Function AirlockFlushSCTBP.AirlockFlushSCTBP_C.Server_LatentInteractionSuccess
// 0x0020 (0x0020 - 0x0000)
struct AirlockFlushSCTBP_C_Server_LatentInteractionSuccess final
{
public:
	bool                                          InteractingActorIsCharacter;                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InteractingInstigator;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InteractionFacilitator;                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Void;                                              // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirlockFlushSCTBP_C_Server_LatentInteractionSuccess) == 0x000008, "Wrong alignment on AirlockFlushSCTBP_C_Server_LatentInteractionSuccess");
static_assert(sizeof(AirlockFlushSCTBP_C_Server_LatentInteractionSuccess) == 0x000020, "Wrong size on AirlockFlushSCTBP_C_Server_LatentInteractionSuccess");
static_assert(offsetof(AirlockFlushSCTBP_C_Server_LatentInteractionSuccess, InteractingActorIsCharacter) == 0x000000, "Member 'AirlockFlushSCTBP_C_Server_LatentInteractionSuccess::InteractingActorIsCharacter' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_Server_LatentInteractionSuccess, InteractingInstigator) == 0x000008, "Member 'AirlockFlushSCTBP_C_Server_LatentInteractionSuccess::InteractingInstigator' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_Server_LatentInteractionSuccess, InteractionFacilitator) == 0x000010, "Member 'AirlockFlushSCTBP_C_Server_LatentInteractionSuccess::InteractionFacilitator' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_Server_LatentInteractionSuccess, Void) == 0x000018, "Member 'AirlockFlushSCTBP_C_Server_LatentInteractionSuccess::Void' has a wrong offset!");

// Function AirlockFlushSCTBP.AirlockFlushSCTBP_C.InteractReleased
// 0x0018 (0x0018 - 0x0000)
struct AirlockFlushSCTBP_C_InteractReleased final
{
public:
	bool                                          InteractingActorIsCharacter;                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InteractingActor;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Void;                                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirlockFlushSCTBP_C_InteractReleased) == 0x000008, "Wrong alignment on AirlockFlushSCTBP_C_InteractReleased");
static_assert(sizeof(AirlockFlushSCTBP_C_InteractReleased) == 0x000018, "Wrong size on AirlockFlushSCTBP_C_InteractReleased");
static_assert(offsetof(AirlockFlushSCTBP_C_InteractReleased, InteractingActorIsCharacter) == 0x000000, "Member 'AirlockFlushSCTBP_C_InteractReleased::InteractingActorIsCharacter' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_InteractReleased, InteractingActor) == 0x000008, "Member 'AirlockFlushSCTBP_C_InteractReleased::InteractingActor' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_InteractReleased, Void) == 0x000010, "Member 'AirlockFlushSCTBP_C_InteractReleased::Void' has a wrong offset!");

// Function AirlockFlushSCTBP.AirlockFlushSCTBP_C.GetCanInteract
// 0x0018 (0x0018 - 0x0000)
struct AirlockFlushSCTBP_C_GetCanInteract final
{
public:
	bool                                          IsSimulated;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InteractingActorIsCharacter;                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InteractingActor;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInteract;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirlockFlushSCTBP_C_GetCanInteract) == 0x000008, "Wrong alignment on AirlockFlushSCTBP_C_GetCanInteract");
static_assert(sizeof(AirlockFlushSCTBP_C_GetCanInteract) == 0x000018, "Wrong size on AirlockFlushSCTBP_C_GetCanInteract");
static_assert(offsetof(AirlockFlushSCTBP_C_GetCanInteract, IsSimulated) == 0x000000, "Member 'AirlockFlushSCTBP_C_GetCanInteract::IsSimulated' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_GetCanInteract, InteractingActorIsCharacter) == 0x000001, "Member 'AirlockFlushSCTBP_C_GetCanInteract::InteractingActorIsCharacter' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_GetCanInteract, InteractingActor) == 0x000008, "Member 'AirlockFlushSCTBP_C_GetCanInteract::InteractingActor' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_GetCanInteract, CanInteract) == 0x000010, "Member 'AirlockFlushSCTBP_C_GetCanInteract::CanInteract' has a wrong offset!");

// Function AirlockFlushSCTBP.AirlockFlushSCTBP_C.InteractPressed
// 0x00A0 (0x00A0 - 0x0000)
struct AirlockFlushSCTBP_C_InteractPressed final
{
public:
	bool                                          InteractingActorIsCharacter;                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InteractingActor;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             InteractedHitResult;                               // 0x0010(0x008C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Success;                                           // 0x009C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirlockFlushSCTBP_C_InteractPressed) == 0x000008, "Wrong alignment on AirlockFlushSCTBP_C_InteractPressed");
static_assert(sizeof(AirlockFlushSCTBP_C_InteractPressed) == 0x0000A0, "Wrong size on AirlockFlushSCTBP_C_InteractPressed");
static_assert(offsetof(AirlockFlushSCTBP_C_InteractPressed, InteractingActorIsCharacter) == 0x000000, "Member 'AirlockFlushSCTBP_C_InteractPressed::InteractingActorIsCharacter' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_InteractPressed, InteractingActor) == 0x000008, "Member 'AirlockFlushSCTBP_C_InteractPressed::InteractingActor' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_InteractPressed, InteractedHitResult) == 0x000010, "Member 'AirlockFlushSCTBP_C_InteractPressed::InteractedHitResult' has a wrong offset!");
static_assert(offsetof(AirlockFlushSCTBP_C_InteractPressed, Success) == 0x00009C, "Member 'AirlockFlushSCTBP_C_InteractPressed::Success' has a wrong offset!");

}

