#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AKEventHolder

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AKEventHolder.AKEventHolder_C
// 0x0020 (0x0240 - 0x0220)
class AAKEventHolder_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAkAudioEvent*                          AKEventFindGame;                                   // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AKEventFindGameSucces;                             // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AKEventFindGameFail;                               // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AKEventHolder_C">();
	}
	static class AAKEventHolder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAKEventHolder_C>();
	}
};
static_assert(alignof(AAKEventHolder_C) == 0x000008, "Wrong alignment on AAKEventHolder_C");
static_assert(sizeof(AAKEventHolder_C) == 0x000240, "Wrong size on AAKEventHolder_C");
static_assert(offsetof(AAKEventHolder_C, DefaultSceneRoot) == 0x000220, "Member 'AAKEventHolder_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAKEventHolder_C, AKEventFindGame) == 0x000228, "Member 'AAKEventHolder_C::AKEventFindGame' has a wrong offset!");
static_assert(offsetof(AAKEventHolder_C, AKEventFindGameSucces) == 0x000230, "Member 'AAKEventHolder_C::AKEventFindGameSucces' has a wrong offset!");
static_assert(offsetof(AAKEventHolder_C, AKEventFindGameFail) == 0x000238, "Member 'AAKEventHolder_C::AKEventFindGameFail' has a wrong offset!");

}

