#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimPropBpSCT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimPropBpSCT.AnimPropBpSCT_C
// 0x0060 (0x0280 - 0x0220)
class AAnimPropBpSCT_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         LifeTime;                                          // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             DebugCharacter;                                    // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DebugSocket;                                       // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DebugRelativeTransform;                            // 0x0250(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AnimPropBpSCT(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimPropBpSCT_C">();
	}
	static class AAnimPropBpSCT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAnimPropBpSCT_C>();
	}
};
static_assert(alignof(AAnimPropBpSCT_C) == 0x000010, "Wrong alignment on AAnimPropBpSCT_C");
static_assert(sizeof(AAnimPropBpSCT_C) == 0x000280, "Wrong size on AAnimPropBpSCT_C");
static_assert(offsetof(AAnimPropBpSCT_C, UberGraphFrame) == 0x000220, "Member 'AAnimPropBpSCT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAnimPropBpSCT_C, StaticMesh) == 0x000228, "Member 'AAnimPropBpSCT_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AAnimPropBpSCT_C, DefaultSceneRoot) == 0x000230, "Member 'AAnimPropBpSCT_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAnimPropBpSCT_C, LifeTime) == 0x000238, "Member 'AAnimPropBpSCT_C::LifeTime' has a wrong offset!");
static_assert(offsetof(AAnimPropBpSCT_C, DebugCharacter) == 0x000240, "Member 'AAnimPropBpSCT_C::DebugCharacter' has a wrong offset!");
static_assert(offsetof(AAnimPropBpSCT_C, DebugSocket) == 0x000248, "Member 'AAnimPropBpSCT_C::DebugSocket' has a wrong offset!");
static_assert(offsetof(AAnimPropBpSCT_C, DebugRelativeTransform) == 0x000250, "Member 'AAnimPropBpSCT_C::DebugRelativeTransform' has a wrong offset!");

}

