#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseInteractableSCTBP

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function BaseInteractableSCTBP.BaseInteractableSCTBP_C.ExecuteUbergraph_BaseInteractableSCTBP
// 0x00B8 (0x00B8 - 0x0000)
struct BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_GetOutlineMeshes_ReturnValue;             // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_1;              // 0x0050(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload;                // 0x0080(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP) == 0x000008, "Wrong alignment on BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP");
static_assert(sizeof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP) == 0x0000B8, "Wrong size on BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, EntryPoint) == 0x000000, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, CallFunc_GetOutlineMeshes_ReturnValue) == 0x000008, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::CallFunc_GetOutlineMeshes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, Temp_int_Variable) == 0x000018, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, CallFunc_Array_Get_Item) == 0x000028, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, Temp_int_Variable_1) == 0x000034, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000048, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, K2Node_ComponentBoundEvent_payload_1) == 0x000050, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::K2Node_ComponentBoundEvent_payload_1' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, K2Node_ComponentBoundEvent_payload) == 0x000080, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::K2Node_ComponentBoundEvent_payload' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP, K2Node_ComponentBoundEvent_wasCancelled) == 0x0000B0, "Member 'BaseInteractableSCTBP_C_ExecuteUbergraph_BaseInteractableSCTBP::K2Node_ComponentBoundEvent_wasCancelled' has a wrong offset!");

// Function BaseInteractableSCTBP.BaseInteractableSCTBP_C.BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature");
static_assert(sizeof(BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature) == 0x000038, "Wrong size on BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature");
static_assert(offsetof(BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature, Payload) == 0x000000, "Member 'BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature::Payload' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature, WasCancelled) == 0x000030, "Member 'BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature::WasCancelled' has a wrong offset!");

// Function BaseInteractableSCTBP.BaseInteractableSCTBP_C.BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature");
static_assert(sizeof(BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature");
static_assert(offsetof(BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'BaseInteractableSCTBP_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function BaseInteractableSCTBP.BaseInteractableSCTBP_C.GetOutlineMeshes
// 0x0020 (0x0020 - 0x0000)
struct BaseInteractableSCTBP_C_GetOutlineMeshes final
{
public:
	TArray<class UPrimitiveComponent*>            ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BaseInteractableSCTBP_C_GetOutlineMeshes) == 0x000008, "Wrong alignment on BaseInteractableSCTBP_C_GetOutlineMeshes");
static_assert(sizeof(BaseInteractableSCTBP_C_GetOutlineMeshes) == 0x000020, "Wrong size on BaseInteractableSCTBP_C_GetOutlineMeshes");
static_assert(offsetof(BaseInteractableSCTBP_C_GetOutlineMeshes, ReturnValue) == 0x000000, "Member 'BaseInteractableSCTBP_C_GetOutlineMeshes::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseInteractableSCTBP_C_GetOutlineMeshes, K2Node_MakeArray_Array) == 0x000010, "Member 'BaseInteractableSCTBP_C_GetOutlineMeshes::K2Node_MakeArray_Array' has a wrong offset!");

}

