#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelBytePreviewUserCard

#include "Basic.hpp"

#include "AccelByteUe4Sdk_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelBytePreviewUserCard.BP_AccelBytePreviewUserCard_C
// 0x0168 (0x0428 - 0x02C0)
class UBP_AccelBytePreviewUserCard_C final : public UFriendCardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_ClickableSubTitleWI_C*              AcceptRequestButton;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              AddFriendButton;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               AddFriendCard;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BlockedPlayerCard;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              BlockUserButton;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlatformIcon_C*                     BP_PlatformIcon;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              CancelRequestButton;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DisplayNameTextBlock;                              // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               FriendsListCard;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              FriendTitle;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GamepadFocus;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_30;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_76;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_111;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_350;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_498;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IncomingRequestCard;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              InviteFriendToParty;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InviteFriendToPartyCard;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              InviteToPartyButton;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelTextBlock;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OutgoingRequestCard;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PlatformIconButton;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              RejectRequestButton;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              RemoveFriendButton;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              UnblockPlayerButton;                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              UserBlockedTextTitle;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_1;                                     // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AccelBytePreviewUserCardTooltip_C*  ToolTip;                                           // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERelationshipStatusCode                       Friendship;                                        // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CustomizationSettings_C*            CustomizationConfig;                               // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterPreviewerSCTBP_C*             CharacterPreviewer;                                // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerProfileMainMenu_BP_C*            PlayerProfile;                                     // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GamepadInputActive;                                // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsBlocked;                                         // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_412[0x6];                                      // 0x0412(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlatformId;                                        // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AccelBytePreviewUserCard(int32 EntryPoint);
	void Open_Gamercard();
	void Construct();
	void BndEvt__BP_AccelBytePreviewUserCard_Button_1_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void OnAddPresence();
	void BndEvt__BP_AccelBytePreviewUserCard_InviteFriendToParty_1_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature();
	void BndEvt__BP_AccelBytePreviewUserCard_BlockUserButton_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__BP_AccelBytePreviewUserCard_GamepadFocus_K2Node_ComponentBoundEvent_6_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__BP_AccelBytePreviewUserCard_GamepadFocus_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__BP_AccelBytePreviewUserCard_AddFriendButton_K2Node_ComponentBoundEvent_1_OnHoldComplete__DelegateSignature();
	void BndEvt__BP_AccelBytePreviewUserCard_RemoveFriendButton_K2Node_ComponentBoundEvent_0_OnHoldComplete__DelegateSignature();
	void OnStopListeningForGamepadInput();
	void OnStartListeningForGamepadInput();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__BP_AccelBytePreviewUserCard_RemoveFriendButton_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature();
	void BndEvt__BP_AccelBytePreviewUserCard_AddFriendButton_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature();
	void BndEvt__BP_AccelBytePreviewUserCard_InviteToPartyButton_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void OnProfileInfoSet(const struct FAccelByteModelsListBlockedUserResponse& BlockedList);
	void OnSuccess_7A18D8584BE64484B244678948F33E0A(const struct FFCTPlatformPlayerInfo& PlatformInfo, int32 Code, const class FString& Message);
	void OnError_7A18D8584BE64484B244678948F33E0A(const struct FFCTPlatformPlayerInfo& PlatformInfo, int32 Code, const class FString& Message);
	void OnSuccess_14F682004B2FD0BCAEA66A9153A3708C(const struct FFCTPublicPlayerData& Payload, int32 Code, const class FString& Message);
	void OnError_14F682004B2FD0BCAEA66A9153A3708C(int32 Code, const class FString& Message);
	void OnSuccess_A98CF02E491362BF43BF0C9C9235A909(const struct FFCTPlatformPlayerInfo& PlatformInfo, int32 Code, const class FString& Message);
	void OnError_A98CF02E491362BF43BF0C9C9235A909(const struct FFCTPlatformPlayerInfo& PlatformInfo, int32 Code, const class FString& Message);
	void OnSuccess_3D6CC52A463CCA6F9CE6468CF6999A91(int32 Code, const class FString& Message);
	void OnFailure_3D6CC52A463CCA6F9CE6468CF6999A91(int32 Code, const class FString& Message);
	void OnResponseSuccess_3D6CC52A463CCA6F9CE6468CF6999A91(int32 Code, const class FString& Message);
	void OnSuccess_F2DC45A144871D952C1AD7B53238F494(int32 Code, const class FString& Message);
	void OnFailure_F2DC45A144871D952C1AD7B53238F494(int32 Code, const class FString& Message);
	void OnResponseSuccess_F2DC45A144871D952C1AD7B53238F494(int32 Code, const class FString& Message);
	void OnSuccess_9C762AFD481DC5C526F813BEF037CC2E(const class FString& FriendId, const class FString& Message);
	void OnError_9C762AFD481DC5C526F813BEF037CC2E(const class FString& Message);
	void OnSuccess_1B97CE434E5B4A15B3F9888D626E7E61(const class FString& FriendId, const class FString& Message);
	void OnError_1B97CE434E5B4A15B3F9888D626E7E61(const class FString& Message);
	void OnSuccess_2F0D43304FAB6F8CD4059EB959EFE7FF(const class FString& PlayerId);
	void OnFail_2F0D43304FAB6F8CD4059EB959EFE7FF(const class FString& PlayerId);
	void OnSuccess_785165B84E1BFF6EECC1A0A638075C55(const struct FFCTCloudCustomizationGender& Payload, bool IsMale, int32 Code, const class FString& Message);
	void OnError_785165B84E1BFF6EECC1A0A638075C55(int32 Code, const class FString& Message);
	class UWidget* GetTooltip();
	void SetProfileInfo(const struct FFCTFriendProfile& Profile, const struct FAccelByteModelsListBlockedUserResponse& BlockedList);
	void Assign_Previewer();
	void SetCustomization(bool IsMale, const struct FFCTCloudCustomizationGender& Customization);
	void InitPreviewCard(class UFriendLobbyWidget* Parent);
	void AssignPlayerProfile();
	void StopListeningForControllerEvents();
	void ListenForControllerEvents();
	void GetBlockedStatus(const struct FAccelByteModelsListBlockedUserResponse& BlockedList, bool* OutIsBlocked);
	ESlateVisibility GetVisibility_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelBytePreviewUserCard_C">();
	}
	static class UBP_AccelBytePreviewUserCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelBytePreviewUserCard_C>();
	}
};
static_assert(alignof(UBP_AccelBytePreviewUserCard_C) == 0x000008, "Wrong alignment on UBP_AccelBytePreviewUserCard_C");
static_assert(sizeof(UBP_AccelBytePreviewUserCard_C) == 0x000428, "Wrong size on UBP_AccelBytePreviewUserCard_C");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_AccelBytePreviewUserCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, AcceptRequestButton) == 0x0002C8, "Member 'UBP_AccelBytePreviewUserCard_C::AcceptRequestButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, AddFriendButton) == 0x0002D0, "Member 'UBP_AccelBytePreviewUserCard_C::AddFriendButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, AddFriendCard) == 0x0002D8, "Member 'UBP_AccelBytePreviewUserCard_C::AddFriendCard' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, BlockedPlayerCard) == 0x0002E0, "Member 'UBP_AccelBytePreviewUserCard_C::BlockedPlayerCard' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, BlockUserButton) == 0x0002E8, "Member 'UBP_AccelBytePreviewUserCard_C::BlockUserButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, BP_PlatformIcon) == 0x0002F0, "Member 'UBP_AccelBytePreviewUserCard_C::BP_PlatformIcon' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Button_0) == 0x0002F8, "Member 'UBP_AccelBytePreviewUserCard_C::Button_0' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, CancelRequestButton) == 0x000300, "Member 'UBP_AccelBytePreviewUserCard_C::CancelRequestButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, DisplayNameTextBlock) == 0x000308, "Member 'UBP_AccelBytePreviewUserCard_C::DisplayNameTextBlock' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, FriendsListCard) == 0x000310, "Member 'UBP_AccelBytePreviewUserCard_C::FriendsListCard' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, FriendTitle) == 0x000318, "Member 'UBP_AccelBytePreviewUserCard_C::FriendTitle' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, GamepadFocus) == 0x000320, "Member 'UBP_AccelBytePreviewUserCard_C::GamepadFocus' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_2) == 0x000328, "Member 'UBP_AccelBytePreviewUserCard_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_3) == 0x000330, "Member 'UBP_AccelBytePreviewUserCard_C::Image_3' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_4) == 0x000338, "Member 'UBP_AccelBytePreviewUserCard_C::Image_4' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_5) == 0x000340, "Member 'UBP_AccelBytePreviewUserCard_C::Image_5' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_6) == 0x000348, "Member 'UBP_AccelBytePreviewUserCard_C::Image_6' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_7) == 0x000350, "Member 'UBP_AccelBytePreviewUserCard_C::Image_7' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_30) == 0x000358, "Member 'UBP_AccelBytePreviewUserCard_C::Image_30' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_76) == 0x000360, "Member 'UBP_AccelBytePreviewUserCard_C::Image_76' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_111) == 0x000368, "Member 'UBP_AccelBytePreviewUserCard_C::Image_111' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_350) == 0x000370, "Member 'UBP_AccelBytePreviewUserCard_C::Image_350' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Image_498) == 0x000378, "Member 'UBP_AccelBytePreviewUserCard_C::Image_498' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, IncomingRequestCard) == 0x000380, "Member 'UBP_AccelBytePreviewUserCard_C::IncomingRequestCard' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, InviteFriendToParty) == 0x000388, "Member 'UBP_AccelBytePreviewUserCard_C::InviteFriendToParty' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, InviteFriendToPartyCard) == 0x000390, "Member 'UBP_AccelBytePreviewUserCard_C::InviteFriendToPartyCard' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, InviteToPartyButton) == 0x000398, "Member 'UBP_AccelBytePreviewUserCard_C::InviteToPartyButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, LevelTextBlock) == 0x0003A0, "Member 'UBP_AccelBytePreviewUserCard_C::LevelTextBlock' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, OutgoingRequestCard) == 0x0003A8, "Member 'UBP_AccelBytePreviewUserCard_C::OutgoingRequestCard' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, PlatformIconButton) == 0x0003B0, "Member 'UBP_AccelBytePreviewUserCard_C::PlatformIconButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, RejectRequestButton) == 0x0003B8, "Member 'UBP_AccelBytePreviewUserCard_C::RejectRequestButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, RemoveFriendButton) == 0x0003C0, "Member 'UBP_AccelBytePreviewUserCard_C::RemoveFriendButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, UnblockPlayerButton) == 0x0003C8, "Member 'UBP_AccelBytePreviewUserCard_C::UnblockPlayerButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, UserBlockedTextTitle) == 0x0003D0, "Member 'UBP_AccelBytePreviewUserCard_C::UserBlockedTextTitle' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, VerticalBox_1) == 0x0003D8, "Member 'UBP_AccelBytePreviewUserCard_C::VerticalBox_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, ToolTip) == 0x0003E0, "Member 'UBP_AccelBytePreviewUserCard_C::ToolTip' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Friendship) == 0x0003E8, "Member 'UBP_AccelBytePreviewUserCard_C::Friendship' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, CustomizationConfig) == 0x0003F0, "Member 'UBP_AccelBytePreviewUserCard_C::CustomizationConfig' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, CharacterPreviewer) == 0x0003F8, "Member 'UBP_AccelBytePreviewUserCard_C::CharacterPreviewer' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, Ak) == 0x000400, "Member 'UBP_AccelBytePreviewUserCard_C::Ak' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, PlayerProfile) == 0x000408, "Member 'UBP_AccelBytePreviewUserCard_C::PlayerProfile' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, GamepadInputActive) == 0x000410, "Member 'UBP_AccelBytePreviewUserCard_C::GamepadInputActive' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, IsBlocked) == 0x000411, "Member 'UBP_AccelBytePreviewUserCard_C::IsBlocked' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCard_C, PlatformId) == 0x000418, "Member 'UBP_AccelBytePreviewUserCard_C::PlatformId' has a wrong offset!");

}

