#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AquaticCaustic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AquaticCaustic.BP_AquaticCaustic_C.ExecuteUbergraph_BP_AquaticCaustic
// 0x0010 (0x0010 - 0x0000)
struct BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic) == 0x000004, "Wrong alignment on BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic");
static_assert(sizeof(BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic) == 0x000010, "Wrong size on BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic");
static_assert(offsetof(BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic, EntryPoint) == 0x000000, "Member 'BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic, CallFunc_Percent_IntInt_ReturnValue) == 0x00000C, "Member 'BP_AquaticCaustic_C_ExecuteUbergraph_BP_AquaticCaustic::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AquaticCaustic.BP_AquaticCaustic_C.UserConstructionScript
// 0x0178 (0x0178 - 0x0000)
struct BP_AquaticCaustic_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x004C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00E4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticCaustic_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_AquaticCaustic_C_UserConstructionScript");
static_assert(sizeof(BP_AquaticCaustic_C_UserConstructionScript) == 0x000178, "Wrong size on BP_AquaticCaustic_C_UserConstructionScript");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00000C, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000018, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000024, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000028, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x00002C, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x000030, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000034, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000038, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00004C, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0000D8, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000E4, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000170, "Member 'BP_AquaticCaustic_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_AquaticCaustic.BP_AquaticCaustic_C.SetParameters
// 0x0150 (0x0150 - 0x0000)
struct BP_AquaticCaustic_C_SetParameters final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0010(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticCaustic_C_SetParameters) == 0x000008, "Wrong alignment on BP_AquaticCaustic_C_SetParameters");
static_assert(sizeof(BP_AquaticCaustic_C_SetParameters) == 0x000150, "Wrong size on BP_AquaticCaustic_C_SetParameters");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000004, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000010, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_GetForwardVector_ReturnValue) == 0x00009C, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_Cross_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_BreakVector2D_X) == 0x0000B4, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_BreakVector2D_Y) == 0x0000B8, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_Normal_ReturnValue) == 0x0000BC, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000C8, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x0000D8, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_Normal_ReturnValue_1) == 0x0000E4, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_BreakVector2D_X_1) == 0x0000F0, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_BreakVector2D_Y_1) == 0x0000F4, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F8, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000104, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_BreakVector_X) == 0x000110, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_BreakVector_Y) == 0x000114, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_BreakVector_Z) == 0x000118, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_BreakVector_X_1) == 0x00011C, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_BreakVector_Y_1) == 0x000120, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_BreakVector_Z_1) == 0x000124, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, K2Node_MakeStruct_LinearColor) == 0x000128, "Member 'BP_AquaticCaustic_C_SetParameters::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, K2Node_MakeStruct_LinearColor_1) == 0x000138, "Member 'BP_AquaticCaustic_C_SetParameters::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticCaustic_C_SetParameters, CallFunc_Array_Get_Item) == 0x000148, "Member 'BP_AquaticCaustic_C_SetParameters::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_AquaticCaustic.BP_AquaticCaustic_C.SetInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_AquaticCaustic_C_SetInteraction final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticCaustic_C_SetInteraction) == 0x000008, "Wrong alignment on BP_AquaticCaustic_C_SetInteraction");
static_assert(sizeof(BP_AquaticCaustic_C_SetInteraction) == 0x000008, "Wrong size on BP_AquaticCaustic_C_SetInteraction");
static_assert(offsetof(BP_AquaticCaustic_C_SetInteraction, Texture) == 0x000000, "Member 'BP_AquaticCaustic_C_SetInteraction::Texture' has a wrong offset!");

}

