#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelByteLobbyMenu

#include "Basic.hpp"

#include "AccelByteUe4Sdk_structs.hpp"
#include "Engine_structs.hpp"
#include "SCT_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelByteLobbyMenu.BP_AccelByteLobbyMenu_C
// 0x0158 (0x03B8 - 0x0260)
class UBP_AccelByteLobbyMenu_C final : public UMatchmakingLobbyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetSwitcher*                        LobbyRelationSwitcher;                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Customization;                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_HostCancelFindGame;                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_HostFindGame;                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_InviteFriends;                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_LeaveLobby;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Settings;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Customization;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_DefaultLoading;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Guest_HostIsSearching;                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_GuestFindGame;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_HostCancelFindGame;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_HostFindGame;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_InviteFriends;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Joining;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LobbyName;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Settings;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ShuttingDown;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thinline;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFindGame_0;                                      // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnInviteFriends;                                   // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCustomize;                                       // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnLeaveLobby;                                      // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          SearchingForGame;                                  // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             NewEventDispatcher_0_0;                            // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsHost;                                            // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             HostStartCountdownTimer;                           // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             HostEndCountdownTimer;                             // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAkComponent*                           AK1;                                               // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ServerName1;                                       // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnBackClicked;                                     // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMatchmakingCanceled;                             // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnFindGame_0__DelegateSignature(bool SearchingForGame_0);
	void OnInviteFriends__DelegateSignature();
	void OnCustomize__DelegateSignature();
	void OnLeaveLobby__DelegateSignature();
	void NewEventDispatcher_0_0__DelegateSignature();
	void HostStartCountdownTimer__DelegateSignature();
	void HostEndCountdownTimer__DelegateSignature();
	void OnBackClicked__DelegateSignature();
	void OnMatchmakingCanceled__DelegateSignature(EAccelByteMatchmakingStatus Reason);
	void ExecuteUbergraph_BP_AccelByteLobbyMenu(int32 EntryPoint);
	void BndEvt__MenuButton_Quit_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void OnMatchmakingNotif(const struct FAccelByteModelsMatchmakingNotice& Notification);
	void Audio_OnMatchmakingFailed();
	void Audio_OnJoiningMatch();
	void OnFindGame();
	void CustomEvent();
	void OnMatchmakingFailed(EAccelByteMatchmakingStatus Reason);
	void BndEvt__MenuButton_InviteFriends_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MenuButton_HostCancelFindGame_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__MenuButton_HostFindGame_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void OnEnableFindGame();
	void Construct();
	void OnMemberIsHost();
	void OnMemberIsGuest();
	void BndEvt__MenuButton_Customization_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void OnSuccess_80D19801402C3FCCDA4FC69D637023B8();
	void OnFail_80D19801402C3FCCDA4FC69D637023B8();
	void OnSuccess_00E3C80F4A2EE6250AC9868FBF85F904();
	void OnFail_00E3C80F4A2EE6250AC9868FBF85F904();
	void OnSuccess_69FE21B84BB6DE8DF15994B2B6F3FE16();
	void OnFail_69FE21B84BB6DE8DF15994B2B6F3FE16();
	void SetMemberWidget(bool IsHost_0);
	void SetStartMatchmakingUI();
	void SetJoiningMatchUI();
	void GetABGameMode(class FString* GameMode);
	void SetCancelMatchmakingUI();
	void SwitchToShutdownUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelByteLobbyMenu_C">();
	}
	static class UBP_AccelByteLobbyMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelByteLobbyMenu_C>();
	}
};
static_assert(alignof(UBP_AccelByteLobbyMenu_C) == 0x000008, "Wrong alignment on UBP_AccelByteLobbyMenu_C");
static_assert(sizeof(UBP_AccelByteLobbyMenu_C) == 0x0003B8, "Wrong size on UBP_AccelByteLobbyMenu_C");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, UberGraphFrame) == 0x000260, "Member 'UBP_AccelByteLobbyMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, LobbyRelationSwitcher) == 0x000268, "Member 'UBP_AccelByteLobbyMenu_C::LobbyRelationSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, MenuButton_Customization) == 0x000270, "Member 'UBP_AccelByteLobbyMenu_C::MenuButton_Customization' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, MenuButton_HostCancelFindGame) == 0x000278, "Member 'UBP_AccelByteLobbyMenu_C::MenuButton_HostCancelFindGame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, MenuButton_HostFindGame) == 0x000280, "Member 'UBP_AccelByteLobbyMenu_C::MenuButton_HostFindGame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, MenuButton_InviteFriends) == 0x000288, "Member 'UBP_AccelByteLobbyMenu_C::MenuButton_InviteFriends' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, MenuButton_LeaveLobby) == 0x000290, "Member 'UBP_AccelByteLobbyMenu_C::MenuButton_LeaveLobby' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, MenuButton_Settings) == 0x000298, "Member 'UBP_AccelByteLobbyMenu_C::MenuButton_Settings' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_Customization) == 0x0002A0, "Member 'UBP_AccelByteLobbyMenu_C::Text_Customization' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_DefaultLoading) == 0x0002A8, "Member 'UBP_AccelByteLobbyMenu_C::Text_DefaultLoading' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_Guest_HostIsSearching) == 0x0002B0, "Member 'UBP_AccelByteLobbyMenu_C::Text_Guest_HostIsSearching' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_GuestFindGame) == 0x0002B8, "Member 'UBP_AccelByteLobbyMenu_C::Text_GuestFindGame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_HostCancelFindGame) == 0x0002C0, "Member 'UBP_AccelByteLobbyMenu_C::Text_HostCancelFindGame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_HostFindGame) == 0x0002C8, "Member 'UBP_AccelByteLobbyMenu_C::Text_HostFindGame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_InviteFriends) == 0x0002D0, "Member 'UBP_AccelByteLobbyMenu_C::Text_InviteFriends' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_Joining) == 0x0002D8, "Member 'UBP_AccelByteLobbyMenu_C::Text_Joining' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_LobbyName) == 0x0002E0, "Member 'UBP_AccelByteLobbyMenu_C::Text_LobbyName' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_Settings) == 0x0002E8, "Member 'UBP_AccelByteLobbyMenu_C::Text_Settings' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Text_ShuttingDown) == 0x0002F0, "Member 'UBP_AccelByteLobbyMenu_C::Text_ShuttingDown' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, Thinline) == 0x0002F8, "Member 'UBP_AccelByteLobbyMenu_C::Thinline' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, OnFindGame_0) == 0x000300, "Member 'UBP_AccelByteLobbyMenu_C::OnFindGame_0' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, OnInviteFriends) == 0x000310, "Member 'UBP_AccelByteLobbyMenu_C::OnInviteFriends' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, OnCustomize) == 0x000320, "Member 'UBP_AccelByteLobbyMenu_C::OnCustomize' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, OnLeaveLobby) == 0x000330, "Member 'UBP_AccelByteLobbyMenu_C::OnLeaveLobby' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, SearchingForGame) == 0x000340, "Member 'UBP_AccelByteLobbyMenu_C::SearchingForGame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, NewEventDispatcher_0_0) == 0x000348, "Member 'UBP_AccelByteLobbyMenu_C::NewEventDispatcher_0_0' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, IsHost) == 0x000358, "Member 'UBP_AccelByteLobbyMenu_C::IsHost' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, HostStartCountdownTimer) == 0x000360, "Member 'UBP_AccelByteLobbyMenu_C::HostStartCountdownTimer' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, HostEndCountdownTimer) == 0x000370, "Member 'UBP_AccelByteLobbyMenu_C::HostEndCountdownTimer' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, AK1) == 0x000380, "Member 'UBP_AccelByteLobbyMenu_C::AK1' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, ServerName1) == 0x000388, "Member 'UBP_AccelByteLobbyMenu_C::ServerName1' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, OnBackClicked) == 0x000398, "Member 'UBP_AccelByteLobbyMenu_C::OnBackClicked' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMenu_C, OnMatchmakingCanceled) == 0x0003A8, "Member 'UBP_AccelByteLobbyMenu_C::OnMatchmakingCanceled' has a wrong offset!");

}

