#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelByteFriendsListBanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelByteFriendsListBanner.BP_AccelByteFriendsListBanner_C
// 0x0040 (0x02A0 - 0x0260)
class UBP_AccelByteFriendsListBanner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UTextBlock*                             BannerText;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_51;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BannerString;                                      // 0x0288(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_AccelByteFriendsListBanner(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelByteFriendsListBanner_C">();
	}
	static class UBP_AccelByteFriendsListBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelByteFriendsListBanner_C>();
	}
};
static_assert(alignof(UBP_AccelByteFriendsListBanner_C) == 0x000008, "Wrong alignment on UBP_AccelByteFriendsListBanner_C");
static_assert(sizeof(UBP_AccelByteFriendsListBanner_C) == 0x0002A0, "Wrong size on UBP_AccelByteFriendsListBanner_C");
static_assert(offsetof(UBP_AccelByteFriendsListBanner_C, UberGraphFrame) == 0x000260, "Member 'UBP_AccelByteFriendsListBanner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteFriendsListBanner_C, BannerText) == 0x000268, "Member 'UBP_AccelByteFriendsListBanner_C::BannerText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteFriendsListBanner_C, Image) == 0x000270, "Member 'UBP_AccelByteFriendsListBanner_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteFriendsListBanner_C, Image_51) == 0x000278, "Member 'UBP_AccelByteFriendsListBanner_C::Image_51' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteFriendsListBanner_C, Image_68) == 0x000280, "Member 'UBP_AccelByteFriendsListBanner_C::Image_68' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteFriendsListBanner_C, BannerString) == 0x000288, "Member 'UBP_AccelByteFriendsListBanner_C::BannerString' has a wrong offset!");

}

