#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelByteVerifyEmailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AccelByteVerifyEmailWidget.BP_AccelByteVerifyEmailWidget_C.OnSubmittedRegistrationVerifyCode__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AccelByteVerifyEmailWidget_C_OnSubmittedRegistrationVerifyCode__DelegateSignature final
{
public:
	class FString                                 VerificationCode;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteVerifyEmailWidget_C_OnSubmittedRegistrationVerifyCode__DelegateSignature) == 0x000008, "Wrong alignment on BP_AccelByteVerifyEmailWidget_C_OnSubmittedRegistrationVerifyCode__DelegateSignature");
static_assert(sizeof(BP_AccelByteVerifyEmailWidget_C_OnSubmittedRegistrationVerifyCode__DelegateSignature) == 0x000010, "Wrong size on BP_AccelByteVerifyEmailWidget_C_OnSubmittedRegistrationVerifyCode__DelegateSignature");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_OnSubmittedRegistrationVerifyCode__DelegateSignature, VerificationCode) == 0x000000, "Member 'BP_AccelByteVerifyEmailWidget_C_OnSubmittedRegistrationVerifyCode__DelegateSignature::VerificationCode' has a wrong offset!");

// Function BP_AccelByteVerifyEmailWidget.BP_AccelByteVerifyEmailWidget_C.ExecuteUbergraph_BP_AccelByteVerifyEmailWidget
// 0x0118 (0x0118 - 0x0000)
struct BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Result_3;                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_3;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Result, int32 Code)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Result_2;                       // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_2;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Result, int32 Code)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Result_1;                       // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Result, int32 Code)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Result;                         // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Result, int32 Code)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAuthSendVerificationCodeCallbackProxy* CallFunc_SendVerificationCodeForAccount_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetVerificationCodeInputString_OutVerificationCode; // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAuthVerifyAccountCallbackProxy*     CallFunc_VerifyExistingAccount_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget) == 0x000008, "Wrong alignment on BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget");
static_assert(sizeof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget) == 0x000118, "Wrong size on BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, EntryPoint) == 0x000000, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_IsWinGDKPlatform_ReturnValue) == 0x000004, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_IsWinGDKPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CustomEvent_Result_3) == 0x000008, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CustomEvent_Result_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CustomEvent_Code_3) == 0x000018, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CustomEvent_Code_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CustomEvent_Result_2) == 0x000030, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CustomEvent_Result_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CustomEvent_Code_2) == 0x000040, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CustomEvent_Code_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, Temp_int_Variable) == 0x000054, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, Temp_string_Variable) == 0x000058, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CustomEvent_Result_1) == 0x000068, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CustomEvent_Code_1) == 0x000078, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x00007C, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CustomEvent_Result) == 0x000090, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CustomEvent_Code) == 0x0000A0, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A4, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, Temp_int_Variable_1) == 0x0000B4, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, Temp_string_Variable_1) == 0x0000B8, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_SendVerificationCodeForAccount_ReturnValue) == 0x0000C8, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_SendVerificationCodeForAccount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000D4, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000E4, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E8, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_GetVerificationCodeInputString_OutVerificationCode) == 0x0000F0, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_GetVerificationCodeInputString_OutVerificationCode' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_VerifyExistingAccount_ReturnValue) == 0x000100, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_VerifyExistingAccount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_IsValid_ReturnValue_1) == 0x000108, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_IsConsolePlatform_ReturnValue) == 0x000109, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_BooleanOR_ReturnValue) == 0x00010A, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000110, "Member 'BP_AccelByteVerifyEmailWidget_C_ExecuteUbergraph_BP_AccelByteVerifyEmailWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function BP_AccelByteVerifyEmailWidget.BP_AccelByteVerifyEmailWidget_C.OnSuccess_17ED0FEC486BB4C97345078694B74F5F
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteVerifyEmailWidget_C_OnSuccess_17ED0FEC486BB4C97345078694B74F5F final
{
public:
	class FString                                 Result;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Code;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteVerifyEmailWidget_C_OnSuccess_17ED0FEC486BB4C97345078694B74F5F) == 0x000008, "Wrong alignment on BP_AccelByteVerifyEmailWidget_C_OnSuccess_17ED0FEC486BB4C97345078694B74F5F");
static_assert(sizeof(BP_AccelByteVerifyEmailWidget_C_OnSuccess_17ED0FEC486BB4C97345078694B74F5F) == 0x000018, "Wrong size on BP_AccelByteVerifyEmailWidget_C_OnSuccess_17ED0FEC486BB4C97345078694B74F5F");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_OnSuccess_17ED0FEC486BB4C97345078694B74F5F, Result) == 0x000000, "Member 'BP_AccelByteVerifyEmailWidget_C_OnSuccess_17ED0FEC486BB4C97345078694B74F5F::Result' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_OnSuccess_17ED0FEC486BB4C97345078694B74F5F, Code) == 0x000010, "Member 'BP_AccelByteVerifyEmailWidget_C_OnSuccess_17ED0FEC486BB4C97345078694B74F5F::Code' has a wrong offset!");

// Function BP_AccelByteVerifyEmailWidget.BP_AccelByteVerifyEmailWidget_C.OnError_17ED0FEC486BB4C97345078694B74F5F
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteVerifyEmailWidget_C_OnError_17ED0FEC486BB4C97345078694B74F5F final
{
public:
	class FString                                 Result;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Code;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteVerifyEmailWidget_C_OnError_17ED0FEC486BB4C97345078694B74F5F) == 0x000008, "Wrong alignment on BP_AccelByteVerifyEmailWidget_C_OnError_17ED0FEC486BB4C97345078694B74F5F");
static_assert(sizeof(BP_AccelByteVerifyEmailWidget_C_OnError_17ED0FEC486BB4C97345078694B74F5F) == 0x000018, "Wrong size on BP_AccelByteVerifyEmailWidget_C_OnError_17ED0FEC486BB4C97345078694B74F5F");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_OnError_17ED0FEC486BB4C97345078694B74F5F, Result) == 0x000000, "Member 'BP_AccelByteVerifyEmailWidget_C_OnError_17ED0FEC486BB4C97345078694B74F5F::Result' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_OnError_17ED0FEC486BB4C97345078694B74F5F, Code) == 0x000010, "Member 'BP_AccelByteVerifyEmailWidget_C_OnError_17ED0FEC486BB4C97345078694B74F5F::Code' has a wrong offset!");

// Function BP_AccelByteVerifyEmailWidget.BP_AccelByteVerifyEmailWidget_C.OnSuccess_C849F3A344AA74B56D233198C29FACB1
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteVerifyEmailWidget_C_OnSuccess_C849F3A344AA74B56D233198C29FACB1 final
{
public:
	class FString                                 Result;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Code;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteVerifyEmailWidget_C_OnSuccess_C849F3A344AA74B56D233198C29FACB1) == 0x000008, "Wrong alignment on BP_AccelByteVerifyEmailWidget_C_OnSuccess_C849F3A344AA74B56D233198C29FACB1");
static_assert(sizeof(BP_AccelByteVerifyEmailWidget_C_OnSuccess_C849F3A344AA74B56D233198C29FACB1) == 0x000018, "Wrong size on BP_AccelByteVerifyEmailWidget_C_OnSuccess_C849F3A344AA74B56D233198C29FACB1");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_OnSuccess_C849F3A344AA74B56D233198C29FACB1, Result) == 0x000000, "Member 'BP_AccelByteVerifyEmailWidget_C_OnSuccess_C849F3A344AA74B56D233198C29FACB1::Result' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_OnSuccess_C849F3A344AA74B56D233198C29FACB1, Code) == 0x000010, "Member 'BP_AccelByteVerifyEmailWidget_C_OnSuccess_C849F3A344AA74B56D233198C29FACB1::Code' has a wrong offset!");

// Function BP_AccelByteVerifyEmailWidget.BP_AccelByteVerifyEmailWidget_C.OnError_C849F3A344AA74B56D233198C29FACB1
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteVerifyEmailWidget_C_OnError_C849F3A344AA74B56D233198C29FACB1 final
{
public:
	class FString                                 Result;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Code;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteVerifyEmailWidget_C_OnError_C849F3A344AA74B56D233198C29FACB1) == 0x000008, "Wrong alignment on BP_AccelByteVerifyEmailWidget_C_OnError_C849F3A344AA74B56D233198C29FACB1");
static_assert(sizeof(BP_AccelByteVerifyEmailWidget_C_OnError_C849F3A344AA74B56D233198C29FACB1) == 0x000018, "Wrong size on BP_AccelByteVerifyEmailWidget_C_OnError_C849F3A344AA74B56D233198C29FACB1");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_OnError_C849F3A344AA74B56D233198C29FACB1, Result) == 0x000000, "Member 'BP_AccelByteVerifyEmailWidget_C_OnError_C849F3A344AA74B56D233198C29FACB1::Result' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_OnError_C849F3A344AA74B56D233198C29FACB1, Code) == 0x000010, "Member 'BP_AccelByteVerifyEmailWidget_C_OnError_C849F3A344AA74B56D233198C29FACB1::Code' has a wrong offset!");

// Function BP_AccelByteVerifyEmailWidget.BP_AccelByteVerifyEmailWidget_C.GetVerificationCodeInputString
// 0x0038 (0x0038 - 0x0000)
struct BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString final
{
public:
	class FString                                 OutVerificationCode;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString) == 0x000008, "Wrong alignment on BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString");
static_assert(sizeof(BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString) == 0x000038, "Wrong size on BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString, OutVerificationCode) == 0x000000, "Member 'BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString::OutVerificationCode' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'BP_AccelByteVerifyEmailWidget_C_GetVerificationCodeInputString::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BP_AccelByteVerifyEmailWidget.BP_AccelByteVerifyEmailWidget_C.StoreRegisteringUserInfo
// 0x0038 (0x0038 - 0x0000)
struct BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Email;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Password;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsFullAccount;                                    // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo) == 0x000008, "Wrong alignment on BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo");
static_assert(sizeof(BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo) == 0x000038, "Wrong size on BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo, DisplayName) == 0x000000, "Member 'BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo::DisplayName' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo, Email) == 0x000010, "Member 'BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo::Email' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo, Password) == 0x000020, "Member 'BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo::Password' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo, bIsFullAccount) == 0x000030, "Member 'BP_AccelByteVerifyEmailWidget_C_StoreRegisteringUserInfo::bIsFullAccount' has a wrong offset!");

// Function BP_AccelByteVerifyEmailWidget.BP_AccelByteVerifyEmailWidget_C.Set Error Message By Code
// 0x0080 (0x0080 - 0x0000)
struct BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             Text_Widget;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
};
static_assert(alignof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code) == 0x000008, "Wrong alignment on BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code");
static_assert(sizeof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code) == 0x000080, "Wrong size on BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code, ErrorMessage) == 0x000000, "Member 'BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code::ErrorMessage' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code, ErrorCode) == 0x000010, "Member 'BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code::ErrorCode' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code, Text_Widget) == 0x000018, "Member 'BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code::Text_Widget' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000030, "Member 'BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code, K2Node_SwitchString_CmpSuccess) == 0x000040, "Member 'BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'BP_AccelByteVerifyEmailWidget_C_Set_Error_Message_By_Code::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BP_AccelByteVerifyEmailWidget.BP_AccelByteVerifyEmailWidget_C.SetMessage
// 0x0028 (0x0028 - 0x0000)
struct BP_AccelByteVerifyEmailWidget_C_SetMessage final
{
public:
	class UTextBlock*                             Text_Widget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   MessageText;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteVerifyEmailWidget_C_SetMessage) == 0x000008, "Wrong alignment on BP_AccelByteVerifyEmailWidget_C_SetMessage");
static_assert(sizeof(BP_AccelByteVerifyEmailWidget_C_SetMessage) == 0x000028, "Wrong size on BP_AccelByteVerifyEmailWidget_C_SetMessage");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_SetMessage, Text_Widget) == 0x000000, "Member 'BP_AccelByteVerifyEmailWidget_C_SetMessage::Text_Widget' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_SetMessage, MessageText) == 0x000008, "Member 'BP_AccelByteVerifyEmailWidget_C_SetMessage::MessageText' has a wrong offset!");
static_assert(offsetof(BP_AccelByteVerifyEmailWidget_C_SetMessage, CallFunc_GetParent_ReturnValue) == 0x000020, "Member 'BP_AccelByteVerifyEmailWidget_C_SetMessage::CallFunc_GetParent_ReturnValue' has a wrong offset!");

}

