#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AchievementUnlockedPopUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AchievementUnlockedPopUp.BP_AchievementUnlockedPopUp_C
// 0x0030 (0x02B8 - 0x0288)
class UBP_AchievementUnlockedPopUp_C final : public UFCTAchievementPopUp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_103;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_148;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_362;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AchievementUnlockedPopUp(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AchievementUnlockedPopUp_C">();
	}
	static class UBP_AchievementUnlockedPopUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AchievementUnlockedPopUp_C>();
	}
};
static_assert(alignof(UBP_AchievementUnlockedPopUp_C) == 0x000008, "Wrong alignment on UBP_AchievementUnlockedPopUp_C");
static_assert(sizeof(UBP_AchievementUnlockedPopUp_C) == 0x0002B8, "Wrong size on UBP_AchievementUnlockedPopUp_C");
static_assert(offsetof(UBP_AchievementUnlockedPopUp_C, UberGraphFrame) == 0x000288, "Member 'UBP_AchievementUnlockedPopUp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AchievementUnlockedPopUp_C, Image) == 0x000290, "Member 'UBP_AchievementUnlockedPopUp_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AchievementUnlockedPopUp_C, Image_1) == 0x000298, "Member 'UBP_AchievementUnlockedPopUp_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_AchievementUnlockedPopUp_C, Image_103) == 0x0002A0, "Member 'UBP_AchievementUnlockedPopUp_C::Image_103' has a wrong offset!");
static_assert(offsetof(UBP_AchievementUnlockedPopUp_C, Image_148) == 0x0002A8, "Member 'UBP_AchievementUnlockedPopUp_C::Image_148' has a wrong offset!");
static_assert(offsetof(UBP_AchievementUnlockedPopUp_C, VerticalBox_362) == 0x0002B0, "Member 'UBP_AchievementUnlockedPopUp_C::VerticalBox_362' has a wrong offset!");

}

