#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_ac_AkVolumetricStaticMeshEmitter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function bp_ac_AkVolumetricStaticMeshEmitter.bp_ac_AkVolumetricStaticMeshEmitter_C.ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter
// 0x03A8 (0x03A8 - 0x0000)
struct bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetControlledPawnLocation_PlayerReference; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetControlledPawnLocation_PlayerLocation; // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetPlayerControllerCameraRotation_PlayerControllerCameraRotation; // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetPlayerControllerCameraRotation_PlayerControllerCameraRotation_1; // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x00A0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToPlayerFromClosestPointOnMesh_DistanceToPlayerFromClosestSplinePoint; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToPlayerFromClosestPointOnMesh_DistanceToPlayerFromClosestSplinePoint_1; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0148(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0160(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x01B4(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x01C8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_1;            // 0x01E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01F8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0238(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetControlledPawnLocation_PlayerReference_1; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetControlledPawnLocation_PlayerLocation_1; // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0260(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetControlledPawnLocation_PlayerReference_2; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetControlledPawnLocation_PlayerLocation_2; // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x02F0(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter) == 0x000008, "Wrong alignment on bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter");
static_assert(sizeof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter) == 0x0003A8, "Wrong size on bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, EntryPoint) == 0x000000, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_Conv_BoolToText_ReturnValue) == 0x000008, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetControlledPawnLocation_PlayerReference) == 0x000060, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetControlledPawnLocation_PlayerReference' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetControlledPawnLocation_PlayerLocation) == 0x000068, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetControlledPawnLocation_PlayerLocation' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_Add_FloatFloat_ReturnValue) == 0x000074, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetActorForwardVector_ReturnValue) == 0x00007C, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetPlayerControllerCameraRotation_PlayerControllerCameraRotation) == 0x000088, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetPlayerControllerCameraRotation_PlayerControllerCameraRotation' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetPlayerControllerCameraRotation_PlayerControllerCameraRotation_1) == 0x000094, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetPlayerControllerCameraRotation_PlayerControllerCameraRotation_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x0000A0, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00012C, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetDistanceToPlayerFromClosestPointOnMesh_DistanceToPlayerFromClosestSplinePoint) == 0x000138, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetDistanceToPlayerFromClosestPointOnMesh_DistanceToPlayerFromClosestSplinePoint' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetDistanceToPlayerFromClosestPointOnMesh_DistanceToPlayerFromClosestSplinePoint_1) == 0x00013C, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetDistanceToPlayerFromClosestPointOnMesh_DistanceToPlayerFromClosestSplinePoint_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_MapRangeClamped_ReturnValue) == 0x000140, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000144, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_Conv_FloatToText_ReturnValue) == 0x000148, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_MakeStruct_FormatArgumentData_1) == 0x000160, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0001A0, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x0001A4, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x0001B0, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, Temp_delegate_Variable) == 0x0001B4, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, Temp_struct_Variable) == 0x0001C8, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_PostAkEvent_ReturnValue) == 0x0001D8, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_Conv_BoolToText_ReturnValue_1) == 0x0001E0, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_Conv_BoolToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001F8, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_MakeArray_Array) == 0x000238, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetControlledPawnLocation_PlayerReference_1) == 0x000248, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetControlledPawnLocation_PlayerReference_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetControlledPawnLocation_PlayerLocation_1) == 0x000250, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetControlledPawnLocation_PlayerLocation_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_Format_ReturnValue) == 0x000260, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_IsValid_ReturnValue_1) == 0x000278, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_Conv_TextToString_ReturnValue) == 0x000280, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetControlledPawnLocation_PlayerReference_2) == 0x000290, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetControlledPawnLocation_PlayerReference_2' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_GetControlledPawnLocation_PlayerLocation_2) == 0x000298, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_GetControlledPawnLocation_PlayerLocation_2' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_IsValid_ReturnValue_2) == 0x0002A4, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_CreateDelegate_OutputDelegate) == 0x0002A8, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002B8, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_Add_VectorVector_ReturnValue) == 0x0002C0, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0002D0, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0002D8, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0002E0, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0002E8, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_ComponentBoundEvent_bFromSweep) == 0x0002EC, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_ComponentBoundEvent_SweepResult) == 0x0002F0, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00037C, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000388, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_ComponentBoundEvent_OtherActor) == 0x000390, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_ComponentBoundEvent_OtherComp) == 0x000398, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0003A0, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ExecuteUbergraph_bp_ac_AkVolumetricStaticMeshEmitter::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");

// Function bp_ac_AkVolumetricStaticMeshEmitter.bp_ac_AkVolumetricStaticMeshEmitter_C.BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function bp_ac_AkVolumetricStaticMeshEmitter.bp_ac_AkVolumetricStaticMeshEmitter_C.BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function bp_ac_AkVolumetricStaticMeshEmitter.bp_ac_AkVolumetricStaticMeshEmitter_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct bp_ac_AkVolumetricStaticMeshEmitter_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ac_AkVolumetricStaticMeshEmitter_C_ReceiveTick) == 0x000004, "Wrong alignment on bp_ac_AkVolumetricStaticMeshEmitter_C_ReceiveTick");
static_assert(sizeof(bp_ac_AkVolumetricStaticMeshEmitter_C_ReceiveTick) == 0x000004, "Wrong size on bp_ac_AkVolumetricStaticMeshEmitter_C_ReceiveTick");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function bp_ac_AkVolumetricStaticMeshEmitter.bp_ac_AkVolumetricStaticMeshEmitter_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct bp_ac_AkVolumetricStaticMeshEmitter_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_ac_AkVolumetricStaticMeshEmitter_C_UserConstructionScript) == 0x000001, "Wrong alignment on bp_ac_AkVolumetricStaticMeshEmitter_C_UserConstructionScript");
static_assert(sizeof(bp_ac_AkVolumetricStaticMeshEmitter_C_UserConstructionScript) == 0x000001, "Wrong size on bp_ac_AkVolumetricStaticMeshEmitter_C_UserConstructionScript");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function bp_ac_AkVolumetricStaticMeshEmitter.bp_ac_AkVolumetricStaticMeshEmitter_C.GetControlledPawnLocation
// 0x0040 (0x0040 - 0x0000)
struct bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation final
{
public:
	class AActor*                                 PlayerReference;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerLocation;                                    // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_ControlledPawnLocation;                          // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 L_PlayerLocation;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation) == 0x000008, "Wrong alignment on bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation");
static_assert(sizeof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation) == 0x000040, "Wrong size on bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation, PlayerReference) == 0x000000, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation::PlayerReference' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation, PlayerLocation) == 0x000008, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation::PlayerLocation' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation, L_ControlledPawnLocation) == 0x000014, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation::L_ControlledPawnLocation' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation, L_PlayerLocation) == 0x000020, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation::L_PlayerLocation' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetControlledPawnLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function bp_ac_AkVolumetricStaticMeshEmitter.bp_ac_AkVolumetricStaticMeshEmitter_C.GetPlayerControllerCameraRotation
// 0x0028 (0x0028 - 0x0000)
struct bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation final
{
public:
	struct FRotator                               PlayerControllerCameraRotation;                    // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation) == 0x000008, "Wrong alignment on bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation");
static_assert(sizeof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation) == 0x000028, "Wrong size on bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation, PlayerControllerCameraRotation) == 0x000000, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation::PlayerControllerCameraRotation' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation, CallFunc_GetCameraRotation_ReturnValue) == 0x000018, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetPlayerControllerCameraRotation::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");

// Function bp_ac_AkVolumetricStaticMeshEmitter.bp_ac_AkVolumetricStaticMeshEmitter_C.GetDistanceToPlayerFromClosestPointOnMesh
// 0x0048 (0x0048 - 0x0000)
struct bp_ac_AkVolumetricStaticMeshEmitter_C_GetDistanceToPlayerFromClosestPointOnMesh final
{
public:
	float                                         DistanceToPlayerFromClosestSplinePoint;            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_Distance;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  L_ControlledPawn;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetDistanceToPlayerFromClosestPointOnMesh) == 0x000008, "Wrong alignment on bp_ac_AkVolumetricStaticMeshEmitter_C_GetDistanceToPlayerFromClosestPointOnMesh");
static_assert(sizeof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetDistanceToPlayerFromClosestPointOnMesh) == 0x000048, "Wrong size on bp_ac_AkVolumetricStaticMeshEmitter_C_GetDistanceToPlayerFromClosestPointOnMesh");
static_assert(offsetof(bp_ac_AkVolumetricStaticMeshEmitter_C_GetDistanceToPlayerFromClosestPointOnMesh, DistanceToPlayerFromClosestSplinePoint) == 0x000000, "Member 'bp_ac_AkVolumetricStaticMeshEmitter_C_GetDistanceToPlayerFromClosestPointOnMesh::DistanceToPlayerFromClosestSplinePoint' has a wrong offset!");
