#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelByteLobbyMessenger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelByteLobbyMessenger.BP_AccelByteLobbyMessenger_C
// 0x00D8 (0x0338 - 0x0260)
class UBP_AccelByteLobbyMessenger_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Image;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_47;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_163;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_255;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       MessageBox;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MessengerOpenButton;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MessengerStateText;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             MessengerViewport;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SendButton;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               UnreadMessagesCountOverlay;                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UnreadMessagesText;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          MessengerIsHidden;                                 // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UnreadMessagesCount;                               // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OpenColor;                                         // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ClosedColor;                                       // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnOpen;                                            // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnClose;                                           // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPositionMessenger;                               // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         OpenTargetY;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           MessageCountTimerHandle;                           // 0x0330(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnOpen__DelegateSignature();
	void OnClose__DelegateSignature();
	void OnPositionMessenger__DelegateSignature(float TargetY);
	void ExecuteUbergraph_BP_AccelByteLobbyMessenger(int32 EntryPoint);
	void ExpandUnreadMessageCountUI();
	void StartExpandUnreadMessageCountUI();
	void ShrinkUnreadMessageCountUI();
	void OnFinishedAnimating();
	void BndEvt__SendButton_1_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__MessageBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__SendButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Add_Message(const class FString& Payload);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelByteLobbyMessenger_C">();
	}
	static class UBP_AccelByteLobbyMessenger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelByteLobbyMessenger_C>();
	}
};
static_assert(alignof(UBP_AccelByteLobbyMessenger_C) == 0x000008, "Wrong alignment on UBP_AccelByteLobbyMessenger_C");
static_assert(sizeof(UBP_AccelByteLobbyMessenger_C) == 0x000338, "Wrong size on UBP_AccelByteLobbyMessenger_C");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, UberGraphFrame) == 0x000260, "Member 'UBP_AccelByteLobbyMessenger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, Image) == 0x000268, "Member 'UBP_AccelByteLobbyMessenger_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, Image_1) == 0x000270, "Member 'UBP_AccelByteLobbyMessenger_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, Image_2) == 0x000278, "Member 'UBP_AccelByteLobbyMessenger_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, Image_47) == 0x000280, "Member 'UBP_AccelByteLobbyMessenger_C::Image_47' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, Image_163) == 0x000288, "Member 'UBP_AccelByteLobbyMessenger_C::Image_163' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, Image_255) == 0x000290, "Member 'UBP_AccelByteLobbyMessenger_C::Image_255' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, MessageBox) == 0x000298, "Member 'UBP_AccelByteLobbyMessenger_C::MessageBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, MessengerOpenButton) == 0x0002A0, "Member 'UBP_AccelByteLobbyMessenger_C::MessengerOpenButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, MessengerStateText) == 0x0002A8, "Member 'UBP_AccelByteLobbyMessenger_C::MessengerStateText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, MessengerViewport) == 0x0002B0, "Member 'UBP_AccelByteLobbyMessenger_C::MessengerViewport' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, SendButton) == 0x0002B8, "Member 'UBP_AccelByteLobbyMessenger_C::SendButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, UnreadMessagesCountOverlay) == 0x0002C0, "Member 'UBP_AccelByteLobbyMessenger_C::UnreadMessagesCountOverlay' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, UnreadMessagesText) == 0x0002C8, "Member 'UBP_AccelByteLobbyMessenger_C::UnreadMessagesText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, MessengerIsHidden) == 0x0002D0, "Member 'UBP_AccelByteLobbyMessenger_C::MessengerIsHidden' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, UnreadMessagesCount) == 0x0002D4, "Member 'UBP_AccelByteLobbyMessenger_C::UnreadMessagesCount' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, OpenColor) == 0x0002D8, "Member 'UBP_AccelByteLobbyMessenger_C::OpenColor' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, ClosedColor) == 0x0002E8, "Member 'UBP_AccelByteLobbyMessenger_C::ClosedColor' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, OnOpen) == 0x0002F8, "Member 'UBP_AccelByteLobbyMessenger_C::OnOpen' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, OnClose) == 0x000308, "Member 'UBP_AccelByteLobbyMessenger_C::OnClose' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, OnPositionMessenger) == 0x000318, "Member 'UBP_AccelByteLobbyMessenger_C::OnPositionMessenger' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, OpenTargetY) == 0x000328, "Member 'UBP_AccelByteLobbyMessenger_C::OpenTargetY' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLobbyMessenger_C, MessageCountTimerHandle) == 0x000330, "Member 'UBP_AccelByteLobbyMessenger_C::MessageCountTimerHandle' has a wrong offset!");

}

