#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelByteNotConnectedWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AccelByteNotConnectedWidget.BP_AccelByteNotConnectedWidget_C.ExecuteUbergraph_BP_AccelByteNotConnectedWidget
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AccelBytePreloaderWidget_C*         CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget) == 0x000008, "Wrong alignment on BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget");
static_assert(sizeof(BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget) == 0x000018, "Wrong size on BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget");
static_assert(offsetof(BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget, EntryPoint) == 0x000000, "Member 'BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget, K2Node_SwitchString_CmpSuccess) == 0x000004, "Member 'BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BP_AccelByteNotConnectedWidget_C_ExecuteUbergraph_BP_AccelByteNotConnectedWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

}

