#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelBytePartyMemberList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelBytePartyMemberList.BP_AccelBytePartyMemberList_C
// 0x01E0 (0x0460 - 0x0280)
class UBP_AccelBytePartyMemberList_C final : public UPartyLobbyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBP_AccelBytePartyEmptyUserCard_C*      BP_AccelBytePartyEmptyUserCard;                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AccelBytePartyEmptyUserCard_C*      BP_AccelBytePartyEmptyUserCard_1;                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AccelBytePartyEmptyUserCard_C*      BP_AccelBytePartyEmptyUserCard_2;                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AccelBytePartyEmptyUserCard_C*      BP_AccelBytePartyEmptyUserCard_3;                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AccelBytePartyEmptyUserCard_C*      BP_AccelBytePartyEmptyUserCard_4;                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AccelBytePartyEmptyUserCard_C*      BP_AccelBytePartyEmptyUserCard_5;                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PartyButton_C*                      BP_PartyButton;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_113;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_165;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_234;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           InviteMemberButtonsBox;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MemberListBox;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         LobbyNames;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UObject*>                        LobbyList;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnFriendInvited;                                   // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_AccelByteFriends_C*                 AccelByteFriendsBP;                                // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AccelBytePartyInvitePopup_C*        CurrentInvitePopup;                                // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMemberLeftParty;                                 // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCheckCreatePartyPrivileges;                      // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCheckLoggedInPrivileges;                         // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCheckJoinConsoleSessionPrivileges;               // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FString>                         TempPartyMemberNames;                              // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnPartyAvailable;                                  // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class ACharacterPreviewerPartyMemberSCTBP_C*> PartyMemberAvatars;                                // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class FString, class ACharacterPreviewerPartyMemberSCTBP_C*> ActivePartyMemberAvatars;                          // 0x03C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnPartyListButtonInvoked;                          // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSetMemberUI;                                     // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPartyFullMessage;                                // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPartyJoinFailedMessage;                          // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPartyCrossplayRestrictedMessage;                 // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnFriendInvited__DelegateSignature();
	void OnMemberLeftParty__DelegateSignature(const class FString& LeaderId);
	void OnCheckCreatePartyPrivileges__DelegateSignature();
	void OnCheckLoggedInPrivileges__DelegateSignature();
	void OnCheckJoinConsoleSessionPrivileges__DelegateSignature();
	void OnPartyAvailable__DelegateSignature();
	void OnPartyListButtonInvoked__DelegateSignature();
	void OnSetMemberUI__DelegateSignature(bool IsHost, int32 Count);
	void OnPartyFullMessage__DelegateSignature();
	void OnPartyJoinFailedMessage__DelegateSignature();
	void OnPartyCrossplayRestrictedMessage__DelegateSignature();
	void ExecuteUbergraph_BP_AccelBytePartyMemberList(int32 EntryPoint);
	void OnUpdateXboxCrossPlaySetting();
	void BndEvt__BP_AccelBytePartyMemberList_BP_PartyButton_K2Node_ComponentBoundEvent_5_OnInvoke__DelegateSignature();
	void OnLoginBlocked();
	void OnLoginAllowed();
	void OnNewMemberJoinedParty(const struct FAccelByteModelsPartyJoinNotice& Notification);
	void OnLeaveParty(const struct FAccelByteModelsLeavePartyNotice& Notification);
	void OnClientLoggedIn();
	void Construct();
	void OnBuildPartyList();
	void OnJoinParty(const struct FAccelByteModelsPartyJoinResponse& Response);
	void OnInviteToParty(const struct FAccelByteModelsPartyGetInvitedNotice& Notification);
	void BndEvt__BP_AccelBytePartyEmptyUserCard_2_K2Node_ComponentBoundEvent_4_OnInviteFriendsClicked__DelegateSignature();
	void BndEvt__BP_AccelBytePartyEmptyUserCard_1_K2Node_ComponentBoundEvent_3_OnInviteFriendsClicked__DelegateSignature();
	void BndEvt__BP_AccelBytePartyEmptyUserCard_5_K2Node_ComponentBoundEvent_2_OnInviteFriendsClicked__DelegateSignature();
	void BndEvt__BP_AccelBytePartyEmptyUserCard_4_K2Node_ComponentBoundEvent_1_OnInviteFriendsClicked__DelegateSignature();
	void BndEvt__BP_AccelBytePartyEmptyUserCard_3_K2Node_ComponentBoundEvent_0_OnInviteFriendsClicked__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void OnCreateLobby();
	void OnSuccess_C16202994FF13103C502149D8DBE7192(const struct FAccelByteModelsInfoPartyResponse& PartyInfo);
	void OnFail_C16202994FF13103C502149D8DBE7192();
	void OnSuccess_AED602304BE11E92F6C69A87A564CA07(const struct FFCTRecentlyPlayedWithPayload& Payload, const class FString& Message, int32 Code);
	void OnError_AED602304BE11E92F6C69A87A564CA07(const struct FFCTRecentlyPlayedWithPayload& Payload, const class FString& Message, int32 Code);
	void OnSuccess_800971F64323B86E7BFF968D8161EC49(const struct FFCTFriendsList& FriendsList, const class FString& Message);
	void OnError_800971F64323B86E7BFF968D8161EC49(const class FString& Message);
	void OnSuccess_3350B7594FA88312858DC783863A0CC8(const struct FFCTFriendsList& FriendsList, const class FString& Message);
	void OnError_3350B7594FA88312858DC783863A0CC8(const class FString& Message);
	void OnSuccess_FA2B64EF451D815191D97C993E956056(const struct FFCTFriendsList& FriendsList, const class FString& Message);
	void OnError_FA2B64EF451D815191D97C993E956056(const class FString& Message);
	void OnSuccess_82CC323C4190610A01011AAC38620298();
	void OnFail_82CC323C4190610A01011AAC38620298();
	void OnSuccess_956145554588A986439D09B0FEC15362(const struct FAccelByteModelsPartyJoinResponse& PartyInfo);
	void OnFail_956145554588A986439D09B0FEC15362(const struct FAccelByteModelsPartyJoinResponse& PartyInfo);
	void OnFailPartyFull_956145554588A986439D09B0FEC15362(const struct FAccelByteModelsPartyJoinResponse& PartyInfo);
	void OnFailCrossplayRestricted_956145554588A986439D09B0FEC15362(const struct FAccelByteModelsPartyJoinResponse& PartyInfo);
	void OnSuccess_09202CE34242056D815C9997E3D89D23();
	void OnFail_09202CE34242056D815C9997E3D89D23();
	void OnSuccess_590496834564E16376B4C79C36FDEC99(const struct FAccelByteModelsPartyJoinResponse& PartyInfo);
	void OnFail_590496834564E16376B4C79C36FDEC99(const struct FAccelByteModelsPartyJoinResponse& PartyInfo);
	void OnFailPartyFull_590496834564E16376B4C79C36FDEC99(const struct FAccelByteModelsPartyJoinResponse& PartyInfo);
	void OnFailCrossplayRestricted_590496834564E16376B4C79C36FDEC99(const struct FAccelByteModelsPartyJoinResponse& PartyInfo);
	void OnSuccess_E2BCDDD548306FA5FC3E45BEF5D31450(const class FString& Result, int32 Code);
	void OnError_E2BCDDD548306FA5FC3E45BEF5D31450(const class FString& Result, int32 Code);
	void OnSuccess_39EC49F94BD4DD75B5CEF3849262825A();
	void OnFail_39EC49F94BD4DD75B5CEF3849262825A();
	void OnSuccess_6C40BFD647CBB55547CD589F1F535ABC();
	void OnFail_6C40BFD647CBB55547CD589F1F535ABC();
	void OnSuccess_5ABB217B4E260EB9EDA30AA386A1C05B(const struct FSimpleUserData& UserData);
	void OnFail_5ABB217B4E260EB9EDA30AA386A1C05B(int32 Code, const class FString& Message);
	void OnSuccess_1C23C18F4120E008CD51FCBF0E4CAF4B(const struct FAccelByteModelsInfoPartyResponse& PartyInfo);
	void OnFail_1C23C18F4120E008CD51FCBF0E4CAF4B();
	void OnSuccess_B6B5AD084067EDFC035EBC8CB0D14AE7(const struct FSimpleUserData& UserData);
	void OnFail_B6B5AD084067EDFC035EBC8CB0D14AE7(int32 Code, const class FString& Message);
	void OnSuccess_689890634363ADDAE3FFECA587FC3ECC(const struct FAccelByteModelsInfoPartyResponse& PartyInfo);
	void OnFail_689890634363ADDAE3FFECA587FC3ECC();
	class FText GetRandomLobbyName();
	void AddFriendToLobbyList(const class FString& UserId, const class FString& Username, bool IsPartyLeader);
	void SetHostIconState(class UBP_AccelBytePartyUserCard_C* FriendBanner);
	void Clear_Member_List();
	void RemoveMemberById(const class FString& UserId, bool DeleteFromPartyList);
	void RefreshPartyLeader(const class FString& LeaderId);
	void SetButtonsEnabledState(bool InIsEnabled);
	void CreateOrUpdateInvitePopUp(const struct FSimpleUserData& UserData, const class FString& PartyId, const class FString& InviationToken);
	void Init_Avatar_Previewer_List();
	void Try_Assigning_Avatar_Previewers(TArray<class FString>& UserIds);
	void Unassign_Avatar_Previewer(const class FString& UserId);
	void Set_Party_Members(const struct FAccelByteModelsInfoPartyResponse& PE);
	void SetFriendsList(class UBP_AccelByteFriends_C* AccelByteFriendsBP_0);
	void HostSendCrossplayStatusMessage();
	void ClearMembers();
	void Host_Send_Party_Language_Preference();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelBytePartyMemberList_C">();
	}
	static class UBP_AccelBytePartyMemberList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelBytePartyMemberList_C>();
	}
};
static_assert(alignof(UBP_AccelBytePartyMemberList_C) == 0x000008, "Wrong alignment on UBP_AccelBytePartyMemberList_C");
static_assert(sizeof(UBP_AccelBytePartyMemberList_C) == 0x000460, "Wrong size on UBP_AccelBytePartyMemberList_C");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, UberGraphFrame) == 0x000280, "Member 'UBP_AccelBytePartyMemberList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, BP_AccelBytePartyEmptyUserCard) == 0x000288, "Member 'UBP_AccelBytePartyMemberList_C::BP_AccelBytePartyEmptyUserCard' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, BP_AccelBytePartyEmptyUserCard_1) == 0x000290, "Member 'UBP_AccelBytePartyMemberList_C::BP_AccelBytePartyEmptyUserCard_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, BP_AccelBytePartyEmptyUserCard_2) == 0x000298, "Member 'UBP_AccelBytePartyMemberList_C::BP_AccelBytePartyEmptyUserCard_2' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, BP_AccelBytePartyEmptyUserCard_3) == 0x0002A0, "Member 'UBP_AccelBytePartyMemberList_C::BP_AccelBytePartyEmptyUserCard_3' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, BP_AccelBytePartyEmptyUserCard_4) == 0x0002A8, "Member 'UBP_AccelBytePartyMemberList_C::BP_AccelBytePartyEmptyUserCard_4' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, BP_AccelBytePartyEmptyUserCard_5) == 0x0002B0, "Member 'UBP_AccelBytePartyMemberList_C::BP_AccelBytePartyEmptyUserCard_5' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, BP_PartyButton) == 0x0002B8, "Member 'UBP_AccelBytePartyMemberList_C::BP_PartyButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, Image) == 0x0002C0, "Member 'UBP_AccelBytePartyMemberList_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, Image_1) == 0x0002C8, "Member 'UBP_AccelBytePartyMemberList_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, Image_2) == 0x0002D0, "Member 'UBP_AccelBytePartyMemberList_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, Image_3) == 0x0002D8, "Member 'UBP_AccelBytePartyMemberList_C::Image_3' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, Image_4) == 0x0002E0, "Member 'UBP_AccelBytePartyMemberList_C::Image_4' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, Image_113) == 0x0002E8, "Member 'UBP_AccelBytePartyMemberList_C::Image_113' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, Image_165) == 0x0002F0, "Member 'UBP_AccelBytePartyMemberList_C::Image_165' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, Image_234) == 0x0002F8, "Member 'UBP_AccelBytePartyMemberList_C::Image_234' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, InviteMemberButtonsBox) == 0x000300, "Member 'UBP_AccelBytePartyMemberList_C::InviteMemberButtonsBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, MemberListBox) == 0x000308, "Member 'UBP_AccelBytePartyMemberList_C::MemberListBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, LobbyNames) == 0x000310, "Member 'UBP_AccelBytePartyMemberList_C::LobbyNames' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, LobbyList) == 0x000320, "Member 'UBP_AccelBytePartyMemberList_C::LobbyList' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnFriendInvited) == 0x000330, "Member 'UBP_AccelBytePartyMemberList_C::OnFriendInvited' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, AccelByteFriendsBP) == 0x000340, "Member 'UBP_AccelBytePartyMemberList_C::AccelByteFriendsBP' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, CurrentInvitePopup) == 0x000348, "Member 'UBP_AccelBytePartyMemberList_C::CurrentInvitePopup' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnMemberLeftParty) == 0x000350, "Member 'UBP_AccelBytePartyMemberList_C::OnMemberLeftParty' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnCheckCreatePartyPrivileges) == 0x000360, "Member 'UBP_AccelBytePartyMemberList_C::OnCheckCreatePartyPrivileges' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnCheckLoggedInPrivileges) == 0x000370, "Member 'UBP_AccelBytePartyMemberList_C::OnCheckLoggedInPrivileges' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnCheckJoinConsoleSessionPrivileges) == 0x000380, "Member 'UBP_AccelBytePartyMemberList_C::OnCheckJoinConsoleSessionPrivileges' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, TempPartyMemberNames) == 0x000390, "Member 'UBP_AccelBytePartyMemberList_C::TempPartyMemberNames' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnPartyAvailable) == 0x0003A0, "Member 'UBP_AccelBytePartyMemberList_C::OnPartyAvailable' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, PartyMemberAvatars) == 0x0003B0, "Member 'UBP_AccelBytePartyMemberList_C::PartyMemberAvatars' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, ActivePartyMemberAvatars) == 0x0003C0, "Member 'UBP_AccelBytePartyMemberList_C::ActivePartyMemberAvatars' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnPartyListButtonInvoked) == 0x000410, "Member 'UBP_AccelBytePartyMemberList_C::OnPartyListButtonInvoked' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnSetMemberUI) == 0x000420, "Member 'UBP_AccelBytePartyMemberList_C::OnSetMemberUI' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnPartyFullMessage) == 0x000430, "Member 'UBP_AccelBytePartyMemberList_C::OnPartyFullMessage' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnPartyJoinFailedMessage) == 0x000440, "Member 'UBP_AccelBytePartyMemberList_C::OnPartyJoinFailedMessage' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyMemberList_C, OnPartyCrossplayRestrictedMessage) == 0x000450, "Member 'UBP_AccelBytePartyMemberList_C::OnPartyCrossplayRestrictedMessage' has a wrong offset!");

}

