#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AquaticSurface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AquaticSurface.BP_AquaticSurface_C.ExecuteUbergraph_BP_AquaticSurface
// 0x0350 (0x0350 - 0x0000)
struct BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_5;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_5;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_5;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_5;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_2;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_2;          // 0x0060(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_4;  // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_4;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_4;            // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_4;       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0110(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_3;  // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_3;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_3;            // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_3;       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0150(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_1; // 0x0200(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21E[0x2];                                      // 0x021E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0220(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_Event_Old_Origin;                           // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_Event_New_Origin;                           // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0260(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_2; // 0x0330(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface) == 0x000008, "Wrong alignment on BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface");
static_assert(sizeof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface) == 0x000350, "Wrong size on BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, EntryPoint) == 0x000000, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, Temp_bool_IsClosed_Variable) == 0x00002C, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, Temp_bool_Has_Been_Initd_Variable) == 0x00002D, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, Temp_int_Loop_Counter_Variable_2) == 0x000030, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, Temp_bool_IsClosed_Variable_1) == 0x000038, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, Temp_bool_Has_Been_Initd_Variable_1) == 0x000039, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00003A, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OverlappedComponent_5) == 0x000040, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OverlappedComponent_5' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherActor_5) == 0x000048, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherActor_5' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherComp_5) == 0x000050, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherComp_5' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherBodyIndex_5) == 0x000058, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherBodyIndex_5' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_bFromSweep_2) == 0x00005C, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_bFromSweep_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_SweepResult_2) == 0x000060, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_SweepResult_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OverlappedComponent_4) == 0x0000F0, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OverlappedComponent_4' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherActor_4) == 0x0000F8, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherActor_4' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherComp_4) == 0x000100, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherComp_4' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherBodyIndex_4) == 0x000108, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherBodyIndex_4' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, Temp_int_Array_Index_Variable_2) == 0x00010C, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000110, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Array_Get_Item) == 0x000120, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Array_Length_ReturnValue) == 0x000128, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Less_IntInt_ReturnValue) == 0x00012C, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OverlappedComponent_3) == 0x000130, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OverlappedComponent_3' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherActor_3) == 0x000138, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherActor_3' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherComp_3) == 0x000140, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherComp_3' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherBodyIndex_3) == 0x000148, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherBodyIndex_3' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x00014C, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000150, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x0001E0, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherActor_2) == 0x0001E8, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherComp_2) == 0x0001F0, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x0001F8, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_GetOverlappingActors_OverlappingActors_1) == 0x000200, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_GetOverlappingActors_OverlappingActors_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Array_Get_Item_1) == 0x000210, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Array_Length_ReturnValue_1) == 0x000218, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Less_IntInt_ReturnValue_1) == 0x00021C, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00021D, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000220, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_Event_Old_Origin) == 0x000228, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_Event_Old_Origin' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_Event_New_Origin) == 0x000234, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_Event_New_Origin' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000240, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000248, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000250, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000258, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_bFromSweep) == 0x00025C, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_SweepResult) == 0x000260, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0002F0, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherActor) == 0x0002F8, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherComp) == 0x000300, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000308, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000310, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_DynamicCast_bSuccess) == 0x000318, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000320, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, K2Node_DynamicCast_bSuccess_1) == 0x000328, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_GetOverlappingActors_OverlappingActors_2) == 0x000330, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_GetOverlappingActors_OverlappingActors_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Array_Get_Item_2) == 0x000340, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Array_Length_ReturnValue_2) == 0x000348, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_Less_IntInt_ReturnValue_2) == 0x00034C, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface, CallFunc_IsValid_ReturnValue) == 0x00034D, "Member 'BP_AquaticSurface_C_ExecuteUbergraph_BP_AquaticSurface::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AquaticSurface.BP_AquaticSurface_C.BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_AquaticSurface.BP_AquaticSurface_C.BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_AquaticSurface_C_BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_AquaticSurface.BP_AquaticSurface_C.OnWorldOriginChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_AquaticSurface_C_OnWorldOriginChanged final
{
public:
	struct FIntVector                             Old_Origin;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             New_Origin;                                        // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticSurface_C_OnWorldOriginChanged) == 0x000004, "Wrong alignment on BP_AquaticSurface_C_OnWorldOriginChanged");
static_assert(sizeof(BP_AquaticSurface_C_OnWorldOriginChanged) == 0x000018, "Wrong size on BP_AquaticSurface_C_OnWorldOriginChanged");
static_assert(offsetof(BP_AquaticSurface_C_OnWorldOriginChanged, Old_Origin) == 0x000000, "Member 'BP_AquaticSurface_C_OnWorldOriginChanged::Old_Origin' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_OnWorldOriginChanged, New_Origin) == 0x00000C, "Member 'BP_AquaticSurface_C_OnWorldOriginChanged::New_Origin' has a wrong offset!");

// Function BP_AquaticSurface.BP_AquaticSurface_C.BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_AquaticSurface.BP_AquaticSurface_C.BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_AquaticSurface_C_BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_AquaticSurface.BP_AquaticSurface_C.BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_AquaticSurface.BP_AquaticSurface_C.BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_AquaticSurface_C_BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_AquaticSurface.BP_AquaticSurface_C.UpdateVolume
// 0x0020 (0x0020 - 0x0000)
struct BP_AquaticSurface_C_UpdateVolume final
{
public:
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticSurface_C_UpdateVolume) == 0x000004, "Wrong alignment on BP_AquaticSurface_C_UpdateVolume");
static_assert(sizeof(BP_AquaticSurface_C_UpdateVolume) == 0x000020, "Wrong size on BP_AquaticSurface_C_UpdateVolume");
static_assert(offsetof(BP_AquaticSurface_C_UpdateVolume, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000000, "Member 'BP_AquaticSurface_C_UpdateVolume::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_UpdateVolume, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x000004, "Member 'BP_AquaticSurface_C_UpdateVolume::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_UpdateVolume, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_AquaticSurface_C_UpdateVolume::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_UpdateVolume, CallFunc_BreakVector_X) == 0x000014, "Member 'BP_AquaticSurface_C_UpdateVolume::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_UpdateVolume, CallFunc_BreakVector_Y) == 0x000018, "Member 'BP_AquaticSurface_C_UpdateVolume::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AquaticSurface_C_UpdateVolume, CallFunc_BreakVector_Z) == 0x00001C, "Member 'BP_AquaticSurface_C_UpdateVolume::CallFunc_BreakVector_Z' has a wrong offset!");

// Function BP_AquaticSurface.BP_AquaticSurface_C.UpdateReflectionShape
// 0x0190 (0x0190 - 0x0000)
struct BP_AquaticSurface_C_UpdateReflectionShape final
{
public:
