#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AchievementPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AchievementPanel.BP_AchievementPanel_C.Initialize__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AchievementPanel_C_Initialize__DelegateSignature final
{
public:
	class UFCTAchievement*                        Achievement;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AchievementPanel_C_Initialize__DelegateSignature) == 0x000008, "Wrong alignment on BP_AchievementPanel_C_Initialize__DelegateSignature");
static_assert(sizeof(BP_AchievementPanel_C_Initialize__DelegateSignature) == 0x000008, "Wrong size on BP_AchievementPanel_C_Initialize__DelegateSignature");
static_assert(offsetof(BP_AchievementPanel_C_Initialize__DelegateSignature, Achievement) == 0x000000, "Member 'BP_AchievementPanel_C_Initialize__DelegateSignature::Achievement' has a wrong offset!");

// Function BP_AchievementPanel.BP_AchievementPanel_C.ExecuteUbergraph_BP_AchievementPanel
// 0x0068 (0x0068 - 0x0000)
struct BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTAchievement*                        K2Node_CustomEvent_Achievement;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0038(0x0018)()
	TDelegate<void(class UTexture2DDynamic* Icon)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture2DDynamic*                      K2Node_CustomEvent_Icon;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel) == 0x000008, "Wrong alignment on BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel");
static_assert(sizeof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel) == 0x000068, "Wrong size on BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel");
static_assert(offsetof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel, EntryPoint) == 0x000000, "Member 'BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel, K2Node_CustomEvent_Achievement) == 0x000008, "Member 'BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel::K2Node_CustomEvent_Achievement' has a wrong offset!");
static_assert(offsetof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000018, "Member 'BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000038, "Member 'BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel, K2Node_CustomEvent_Icon) == 0x000060, "Member 'BP_AchievementPanel_C_ExecuteUbergraph_BP_AchievementPanel::K2Node_CustomEvent_Icon' has a wrong offset!");

// Function BP_AchievementPanel.BP_AchievementPanel_C.IconCreated
// 0x0008 (0x0008 - 0x0000)
struct BP_AchievementPanel_C_IconCreated final
{
public:
	class UTexture2DDynamic*                      Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AchievementPanel_C_IconCreated) == 0x000008, "Wrong alignment on BP_AchievementPanel_C_IconCreated");
static_assert(sizeof(BP_AchievementPanel_C_IconCreated) == 0x000008, "Wrong size on BP_AchievementPanel_C_IconCreated");
static_assert(offsetof(BP_AchievementPanel_C_IconCreated, Icon) == 0x000000, "Member 'BP_AchievementPanel_C_IconCreated::Icon' has a wrong offset!");

// Function BP_AchievementPanel.BP_AchievementPanel_C.Initialize_Event
// 0x0008 (0x0008 - 0x0000)
struct BP_AchievementPanel_C_Initialize_Event final
{
public:
	class UFCTAchievement*                        Achievement;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AchievementPanel_C_Initialize_Event) == 0x000008, "Wrong alignment on BP_AchievementPanel_C_Initialize_Event");
static_assert(sizeof(BP_AchievementPanel_C_Initialize_Event) == 0x000008, "Wrong size on BP_AchievementPanel_C_Initialize_Event");
static_assert(offsetof(BP_AchievementPanel_C_Initialize_Event, Achievement) == 0x000000, "Member 'BP_AchievementPanel_C_Initialize_Event::Achievement' has a wrong offset!");

}

