#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelByteFriends

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SCT_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"


namespace SDK::Params
{

// Function BP_AccelByteFriends.BP_AccelByteFriends_C.OnPartyMemberReadyToPlay__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AccelByteFriends_C_OnPartyMemberReadyToPlay__DelegateSignature final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteFriends_C_OnPartyMemberReadyToPlay__DelegateSignature) == 0x000008, "Wrong alignment on BP_AccelByteFriends_C_OnPartyMemberReadyToPlay__DelegateSignature");
static_assert(sizeof(BP_AccelByteFriends_C_OnPartyMemberReadyToPlay__DelegateSignature) == 0x000010, "Wrong size on BP_AccelByteFriends_C_OnPartyMemberReadyToPlay__DelegateSignature");
static_assert(offsetof(BP_AccelByteFriends_C_OnPartyMemberReadyToPlay__DelegateSignature, UserId) == 0x000000, "Member 'BP_AccelByteFriends_C_OnPartyMemberReadyToPlay__DelegateSignature::UserId' has a wrong offset!");

// Function BP_AccelByteFriends.BP_AccelByteFriends_C.OnPartyMemberNotReadyToPlay__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AccelByteFriends_C_OnPartyMemberNotReadyToPlay__DelegateSignature final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteFriends_C_OnPartyMemberNotReadyToPlay__DelegateSignature) == 0x000008, "Wrong alignment on BP_AccelByteFriends_C_OnPartyMemberNotReadyToPlay__DelegateSignature");
static_assert(sizeof(BP_AccelByteFriends_C_OnPartyMemberNotReadyToPlay__DelegateSignature) == 0x000010, "Wrong size on BP_AccelByteFriends_C_OnPartyMemberNotReadyToPlay__DelegateSignature");
static_assert(offsetof(BP_AccelByteFriends_C_OnPartyMemberNotReadyToPlay__DelegateSignature, UserId) == 0x000000, "Member 'BP_AccelByteFriends_C_OnPartyMemberNotReadyToPlay__DelegateSignature::UserId' has a wrong offset!");

// Function BP_AccelByteFriends.BP_AccelByteFriends_C.ExecuteUbergraph_BP_AccelByteFriends
// 0x10A0 (0x10A0 - 0x0000)
struct BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTFriendProfile& FriendProfile, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTRecentlyPlayedWithPayload          K2Node_CustomEvent_Payload_3;                      // 0x0018(0x0010)()
	class FString                                 K2Node_CustomEvent_Message_13;                     // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_9;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTRecentlyPlayedWithPayload& Payload, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTRecentlyPlayedWithPayload          K2Node_CustomEvent_Payload_2;                      // 0x0050(0x0010)()
	class FString                                 K2Node_CustomEvent_Message_12;                     // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_8;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTRecentlyPlayedWithPayload& Payload, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTRecentlyPlayedWithPayload          Temp_struct_Variable;                              // 0x0098(0x0010)()
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGetRecentlyPlayedWithListAsyncProxy* CallFunc_CacheMostRecentlyPlayedWith_ReturnValue;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_11;                     // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	struct FFCTFriendsList                        K2Node_CustomEvent_FriendsList_1;                  // 0x00E8(0x0028)()
	class FString                                 K2Node_CustomEvent_Message_10;                     // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTFriendsList& FriendsList, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_1;                            // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTFriendsList                        Temp_struct_Variable_1;                            // 0x0140(0x0028)()
	TDelegate<void(const class FString& Title)>   K2Node_CreateDelegate_OutputDelegate_5;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_Message_9;                      // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTFriendsList                        K2Node_CustomEvent_FriendsList;                    // 0x0198(0x0028)()
	class FString                                 K2Node_CustomEvent_Message_8;                      // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTFriendsList& FriendsList, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_2;                            // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTFriendsList                        Temp_struct_Variable_2;                            // 0x01F0(0x0028)()
	class UFCTGetFriendsListAsyncProxy*           CallFunc_GetRecentList_ReturnValue;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTFriendProfile& FriendProfile, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTFriendProfile                      K2Node_CustomEvent_FriendProfile_3;                // 0x0238(0x0060)()
	class FString                                 K2Node_CustomEvent_Message_7;                      // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_7;                         // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTFriendProfile                      K2Node_CustomEvent_FriendProfile_2;                // 0x02B0(0x0060)()
	class FString                                 K2Node_CustomEvent_Message_6;                      // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_6;                         // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTFriendProfile& FriendProfile, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0324(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTFriendProfile                      Temp_struct_Variable_3;                            // 0x0348(0x0060)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x03A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsInfoPartyResponse      K2Node_CustomEvent_PartyInfo;                      // 0x03B8(0x0070)()
	TDelegate<void(const struct FAccelByteModelsInfoPartyResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0428(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsInfoPartyResponse      Temp_struct_Variable_4;                            // 0x0438(0x0070)()
	class UFCTPartyInfoCallbackProxy*             CallFunc_GetPartyInfo_ReturnValue;                 // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_5;                      // 0x04B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_5;                         // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x04CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBulkUserInfoPayload                   K2Node_CustomEvent_Result;                         // 0x04E0(0x0010)(ConstParm)
	class FString                                 K2Node_CustomEvent_Message_4;                      // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_4;                         // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FBulkUserInfoPayload& Result, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x0504(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_2;                               // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBulkUserInfoPayload                   Temp_struct_Variable_5;                            // 0x0528(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0538(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x054C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue;                   // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x0568(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x057C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_CreateParty_ReturnValue;                  // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTFriendProfile& FriendProfile, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_18;           // 0x0598(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTFriendProfile                      K2Node_CustomEvent_FriendProfile_1;                // 0x05B0(0x0060)()
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x0610(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_3;                         // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTFriendProfile                      K2Node_CustomEvent_FriendProfile;                  // 0x0628(0x0060)()
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x0688(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_2;                         // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTFriendProfile& FriendProfile, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_19;           // 0x069C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_3;                               // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x06B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTFriendProfile                      Temp_struct_Variable_6;                            // 0x06C0(0x0060)()
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FAccelByteModelsListBlockedUserResponse& Payload, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x0730(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsListBlockedUserResponse K2Node_CustomEvent_Payload_1;                      // 0x0740(0x0010)()
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0750(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsListBlockedUserResponse K2Node_CustomEvent_Payload;                        // 0x0768(0x0010)()
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0778(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code;                           // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FAccelByteModelsListBlockedUserResponse& Payload, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_21;           // 0x078C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_4;                               // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_6;                            // 0x07A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAccelByteModelsListBlockedUserResponse Temp_struct_Variable_7;                            // 0x07B0(0x0010)()
	class UFCTGetBlockedPlayerListCallbackProxy*  CallFunc_GetBlockedPlayerList_ReturnValue;         // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C9[0x3];                                      // 0x07C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x07D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D5[0x3];                                      // 0x07D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DD[0x3];                                      // 0x07DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_22;           // 0x07E4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x07F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F5[0x3];                                      // 0x07F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x07FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSimpleUserData                        CallFunc_Array_Get_Item;                           // 0x0800(0x0040)()
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84C[0x4];                                      // 0x084C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTFriendProfile                      Temp_struct_Variable_8;                            // 0x0850(0x0060)()
	class FString                                 Temp_string_Variable_7;                            // 0x08B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTPartyInfoCallbackProxy*             CallFunc_GetPartyInfo_ReturnValue_1;               // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x08D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x08D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D5[0x3];                                      // 0x08D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsInfoPartyResponse      Temp_struct_Variable_9;                            // 0x08D8(0x0070)()
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x094C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0954(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_955[0x3];                                      // 0x0955(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTFriendProfile                      K2Node_CustomEvent_FriendProfile_6;                // 0x0958(0x0060)()
	class FString                                 K2Node_CustomEvent_Message_16;                     // 0x09B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_12;                        // 0x09C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x09CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9CD[0x3];                                      // 0x09CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x09D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D4[0x4];                                      // 0x09D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x09D8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x09F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0A00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A01[0x7];                                      // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0A08(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EFFCTFriendListType                           K2Node_Event_friendListType;                       // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendsSortType                              K2Node_CustomEvent_SortMethod;                     // 0x0A19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0A1A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1B[0x5];                                      // 0x0A1B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsInfoPartyResponse      K2Node_CustomEvent_PartyInfo_1;                    // 0x0A20(0x0070)()
	TDelegate<void(const struct FFCTFriendProfile& FriendProfile, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_23;           // 0x0A90(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FAccelByteModelsInfoPartyResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_24;           // 0x0AA0(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsUsersPresenceNotice    K2Node_Event_Notification_5;                       // 0x0AB0(0x0028)()
	struct FAccelByteModelsUsersPresenceNotice    K2Node_CustomEvent_Notification;                   // 0x0AD8(0x0028)(ConstParm)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0B00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0B01(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0B02(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B03[0x5];                                      // 0x0B03(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Title;                          // 0x0B08(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0B18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B19[0x7];                                      // 0x0B19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0B20(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0B38(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0B48(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0B58(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTGetFriendsListAsyncProxy*           CallFunc_SearchForUser_ReturnValue;                // 0x0B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0B70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0B78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AccelByteUserCard_C*                K2Node_CustomEvent_UserCard;                       // 0x0B80(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0B88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8C[0x4];                                      // 0x0B8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0B90(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0BA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA1[0x7];                                      // 0x0BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTFriendProfile                      K2Node_CustomEvent_FriendProfile_7;                // 0x0BA8(0x0060)()
	class FString                                 K2Node_CustomEvent_Message_17;                     // 0x0C08(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_13;                        // 0x0C18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0C1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0C20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C21[0x3];                                      // 0x0C21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_25;           // 0x0C24(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0C34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0C38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_2;        // 0x0C39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0C3A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3B[0x5];                                      // 0x0C3B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             K2Node_CustomEvent_Scrollbox;                      // 0x0C40(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0C48(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0C58(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AccelByteUserCard_C*                K2Node_DynamicCast_AsBP_Accel_Byte_User_Card;      // 0x0C60(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0C68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C69[0x3];                                      // 0x0C69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0C6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0C70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0C74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0C75(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0C76(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C77[0x1];                                      // 0x0C77(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0C78(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0C80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C81[0x7];                                      // 0x0C81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTFriendProfile                      Temp_struct_Variable_10;                           // 0x0C88(0x0060)()
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0CE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTFriendProfile& FriendProfile, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_26;           // 0x0CEC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_CFC[0x4];                                      // 0x0CFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_CustomEvent_Members;                        // 0x0D00(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_LeaderId;                       // 0x0D10(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_AccelByteUserCard_C*                CallFunc_CreatePartyMemberUserCard_ReturnValue;    // 0x0D20(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_SetPartyMembers_Output;                   // 0x0D28(0x0010)(ReferenceParm)
	class FString                                 Temp_string_Variable_8;                            // 0x0D38(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBulkUserDataCallbackProxy*             CallFunc_GetBulkUsersData_ReturnValue;             // 0x0D48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0D50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0D54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bPartyMenuOpened;               // 0x0D55(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConnected_ReturnValue;                  // 0x0D56(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D57[0x1];                                      // 0x0D57(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0D58(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FAccelByteModelsUsersPresenceNotice& Notification)> K2Node_CreateDelegate_OutputDelegate_27;           // 0x0D60(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0D70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D74[0x4];                                      // 0x0D74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTFriendProfile                      K2Node_CustomEvent_FriendProfile_4;                // 0x0D78(0x0060)()
	class FString                                 K2Node_CustomEvent_Message_14;                     // 0x0DD8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_10;                        // 0x0DE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0DEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DED[0x3];                                      // 0x0DED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0DF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF4[0x4];                                      // 0x0DF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_FriendId_4;                     // 0x0DF8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTGetFriendProfileAsyncProxy*         CallFunc_GetFriendProfileById_ReturnValue;         // 0x0E08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0E10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0E11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0E12(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E13[0x1];                                      // 0x0E13(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0E14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAccelByteModelsAcceptFriendsNotif     K2Node_Event_Notification_4;                       // 0x0E18(0x0010)(ConstParm)
	struct FAccelByteModelsUnfriendNotif          K2Node_Event_Notification_3;                       // 0x0E28(0x0010)(ConstParm)
	class UFCTGetFriendProfileAsyncProxy*         CallFunc_GetFriendProfileById_ReturnValue_1;       // 0x0E38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0E40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E41[0x7];                                      // 0x0E41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsCancelFriendsNotif     K2Node_Event_Notification_2;                       // 0x0E48(0x0010)(ConstParm)
	struct FAccelByteModelsRejectFriendsNotif     K2Node_Event_Notification_1;                       // 0x0E58(0x0010)(ConstParm)
	struct FAccelByteModelsRequestFriendsNotif    K2Node_Event_Notification;                         // 0x0E68(0x0010)(ConstParm)
	class FString                                 K2Node_CustomEvent_FriendId_3;                     // 0x0E78(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTGetFriendProfileAsyncProxy*         CallFunc_GetFriendProfileById_ReturnValue_2;       // 0x0E88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_FriendId_2;                     // 0x0E90(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0EA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA1[0x7];                                      // 0x0EA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_FriendId_1;                     // 0x0EA8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_FriendId;                       // 0x0EB8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTGetFriendProfileAsyncProxy*         CallFunc_GetFriendProfileById_ReturnValue_3;       // 0x0EC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FAccelByteModelsUsersPresenceNotice& Notification)> K2Node_CreateDelegate_OutputDelegate_28;           // 0x0ED0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0EE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE1[0x7];                                      // 0x0EE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTFriendProfile                      CallFunc_Array_Get_Item_3;                         // 0x0EE8(0x0060)()
	TDelegate<void(const struct FFCTFriendProfile& FriendProfile, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_29;           // 0x0F48(0x0010)(ZeroConstructor, NoDestructor)
	struct FFCTFriendProfile                      K2Node_SetFieldsInStruct_StructOut;                // 0x0F58(0x0060)()
	struct FFCTFriendProfile                      K2Node_SetFieldsInStruct_StructOut_1;              // 0x0FB8(0x0060)()
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x1018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x101C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x101D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x101E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFriendsSortType                              K2Node_ComponentBoundEvent_SortMethod;             // 0x101F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCTFriendProfile                      K2Node_CustomEvent_FriendProfile_5;                // 0x1020(0x0060)()
	class FString                                 K2Node_CustomEvent_Message_15;                     // 0x1080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_11;                        // 0x1090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x1094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x1098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends) == 0x000008, "Wrong alignment on BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends");
static_assert(sizeof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends) == 0x0010A0, "Wrong size on BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, EntryPoint) == 0x000000, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Payload_3) == 0x000018, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Payload_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Message_13) == 0x000028, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Message_13' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Code_9) == 0x000038, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Code_9' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Payload_2) == 0x000050, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Message_12) == 0x000060, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Message_12' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Code_8) == 0x000070, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Code_8' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate_2) == 0x000074, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, Temp_int_Variable) == 0x000084, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, Temp_string_Variable) == 0x000088, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, Temp_struct_Variable) == 0x000098, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000A8, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, CallFunc_CacheMostRecentlyPlayedWith_ReturnValue) == 0x0000B0, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::CallFunc_CacheMostRecentlyPlayedWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000C0, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Message_11) == 0x0000C8, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Message_11' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_FriendsList_1) == 0x0000E8, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_FriendsList_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Message_10) == 0x000110, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Message_10' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate_4) == 0x000120, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, Temp_string_Variable_1) == 0x000130, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, Temp_struct_Variable_1) == 0x000140, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate_5) == 0x000168, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate_6) == 0x000178, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Message_9) == 0x000188, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Message_9' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_FriendsList) == 0x000198, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_FriendsList' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Message_8) == 0x0001C0, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Message_8' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001D0, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, Temp_string_Variable_2) == 0x0001E0, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, Temp_struct_Variable_2) == 0x0001F0, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, CallFunc_GetRecentList_ReturnValue) == 0x000218, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::CallFunc_GetRecentList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate_8) == 0x000220, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, CallFunc_IsValid_ReturnValue_1) == 0x000230, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_FriendProfile_3) == 0x000238, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_FriendProfile_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Message_7) == 0x000298, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Message_7' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Code_7) == 0x0002A8, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Code_7' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_FriendProfile_2) == 0x0002B0, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_FriendProfile_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Message_6) == 0x000310, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Message_6' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_Code_6) == 0x000320, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_Code_6' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate_9) == 0x000324, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, Temp_int_Variable_1) == 0x000334, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, Temp_string_Variable_3) == 0x000338, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, Temp_struct_Variable_3) == 0x000348, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CreateDelegate_OutputDelegate_10) == 0x0003A8, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends, K2Node_CustomEvent_PartyInfo) == 0x0003B8, "Member 'BP_AccelByteFriends_C_ExecuteUbergraph_BP_AccelByteFriends::K2Node_CustomEvent_PartyInfo' has a wrong offset!");
