#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationMeshSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CustomizationMeshSlot.BP_CustomizationMeshSlot_C
// 0x0090 (0x03A0 - 0x0310)
class UBP_CustomizationMeshSlot_C final : public UCustomizationSlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 IconThumbnail;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemThumbnailBG;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemThumbnailFrame;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LockedLayer;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockIcon;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UnlockLevelText;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             SelectedTexture;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             UnselectedTexture;                                 // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnUpdateSlotUIOverTime;                            // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnEndSlotUIUpdateImmediately;                      // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUpdateUITexture;                                 // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsUnlocked_0;                                     // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSetLocked;                                       // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnUpdateSlotUIOverTime__DelegateSignature(float TargetValue, float InterpSpeed);
	void OnEndSlotUIUpdateImmediately__DelegateSignature(float TargetScale, float TargetOpacity, float TargetPadding);
	void OnUpdateUITexture__DelegateSignature(bool IsSelected);
	void OnSetLocked__DelegateSignature();
	void ExecuteUbergraph_BP_CustomizationMeshSlot(int32 EntryPoint);
	void Construct();
	void OnSetLockedUIState(int32 UnlockLevel);
	void OnUpdateSizeOverTime(float TargetValue, float InterpSpeed);
	void OnUpdateHorizontalPaddingOverTime(float TargetValue, float InterpSpeed);
	void OnUpdateUIImmediately(float TargetSize, float TargetOpacity, float TargetHorizontalPadding);
	void OnUpdateOpacityOverTime(float TargetValue, float InterpSpeed);
	void OnUpdateUITexture_Event(bool IsSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CustomizationMeshSlot_C">();
	}
	static class UBP_CustomizationMeshSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomizationMeshSlot_C>();
	}
};
static_assert(alignof(UBP_CustomizationMeshSlot_C) == 0x000008, "Wrong alignment on UBP_CustomizationMeshSlot_C");
static_assert(sizeof(UBP_CustomizationMeshSlot_C) == 0x0003A0, "Wrong size on UBP_CustomizationMeshSlot_C");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, UberGraphFrame) == 0x000310, "Member 'UBP_CustomizationMeshSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, IconThumbnail) == 0x000318, "Member 'UBP_CustomizationMeshSlot_C::IconThumbnail' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, ItemThumbnailBG) == 0x000320, "Member 'UBP_CustomizationMeshSlot_C::ItemThumbnailBG' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, ItemThumbnailFrame) == 0x000328, "Member 'UBP_CustomizationMeshSlot_C::ItemThumbnailFrame' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, LockedLayer) == 0x000330, "Member 'UBP_CustomizationMeshSlot_C::LockedLayer' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, LockIcon) == 0x000338, "Member 'UBP_CustomizationMeshSlot_C::LockIcon' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, UnlockLevelText) == 0x000340, "Member 'UBP_CustomizationMeshSlot_C::UnlockLevelText' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, SelectedTexture) == 0x000348, "Member 'UBP_CustomizationMeshSlot_C::SelectedTexture' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, UnselectedTexture) == 0x000350, "Member 'UBP_CustomizationMeshSlot_C::UnselectedTexture' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, OnUpdateSlotUIOverTime) == 0x000358, "Member 'UBP_CustomizationMeshSlot_C::OnUpdateSlotUIOverTime' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, OnEndSlotUIUpdateImmediately) == 0x000368, "Member 'UBP_CustomizationMeshSlot_C::OnEndSlotUIUpdateImmediately' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, OnUpdateUITexture) == 0x000378, "Member 'UBP_CustomizationMeshSlot_C::OnUpdateUITexture' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, bIsUnlocked_0) == 0x000388, "Member 'UBP_CustomizationMeshSlot_C::bIsUnlocked_0' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMeshSlot_C, OnSetLocked) == 0x000390, "Member 'UBP_CustomizationMeshSlot_C::OnSetLocked' has a wrong offset!");

}

