#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomationMaterialSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CustomationMaterialSelector.BP_CustomationMaterialSelector_C
// 0x0078 (0x02E8 - 0x0270)
class UBP_CustomationMaterialSelector_C final : public UMaterialCustomizationRowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBP_CustomizationMaterialSlot_C*        BP_OptionCustomizationSlot;                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CustomizationMaterialSlot_C*        BP_OptionCustomizationSlot_1;                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CustomizationMaterialSlot_C*        BP_OptionCustomizationSlot_2;                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CustomizationMaterialSlot_C*        BP_OptionCustomizationSlot_3;                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CustomizationMaterialSlot_C*        BP_OptionCustomizationSlot_4;                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OptionName;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OptionNameText;                                    // 0x02A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SelectedMaterialIndex;                             // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnUpdateMaterial;                                  // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EPlayerCustomizationGender                    Gender;                                            // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCustomizationType                      Category;                                          // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaterialElementIndex;                              // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    SelectedMesh;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnUpdateMaterial__DelegateSignature(int32 OptionIndex);
	void ExecuteUbergraph_BP_CustomationMaterialSelector(int32 EntryPoint);
	void OnUpdateMaterial_Event(int32 OptionIndex);
	void OnGenerateOptions(int32 InMaterialIndex, const TArray<class UMaterialInstance*>& InOptions, class UPrimitiveComponent* InClothingComponent, EPlayerCustomizationGender InGender, EPlayerCustomizationType InCustomizationCategory);
	void Initialize(const class FText& InSelectorName, int32 InOptionIndex, EPlayerCustomizationGender InGender);
	void Set_Temp_Customization_Material(struct FCloudCustomizationPayload& CustomizationPayload);
	void UpdateMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CustomationMaterialSelector_C">();
	}
	static class UBP_CustomationMaterialSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomationMaterialSelector_C>();
	}
};
static_assert(alignof(UBP_CustomationMaterialSelector_C) == 0x000008, "Wrong alignment on UBP_CustomationMaterialSelector_C");
static_assert(sizeof(UBP_CustomationMaterialSelector_C) == 0x0002E8, "Wrong size on UBP_CustomationMaterialSelector_C");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, UberGraphFrame) == 0x000270, "Member 'UBP_CustomationMaterialSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, BP_OptionCustomizationSlot) == 0x000278, "Member 'UBP_CustomationMaterialSelector_C::BP_OptionCustomizationSlot' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, BP_OptionCustomizationSlot_1) == 0x000280, "Member 'UBP_CustomationMaterialSelector_C::BP_OptionCustomizationSlot_1' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, BP_OptionCustomizationSlot_2) == 0x000288, "Member 'UBP_CustomationMaterialSelector_C::BP_OptionCustomizationSlot_2' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, BP_OptionCustomizationSlot_3) == 0x000290, "Member 'UBP_CustomationMaterialSelector_C::BP_OptionCustomizationSlot_3' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, BP_OptionCustomizationSlot_4) == 0x000298, "Member 'UBP_CustomationMaterialSelector_C::BP_OptionCustomizationSlot_4' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, OptionName) == 0x0002A0, "Member 'UBP_CustomationMaterialSelector_C::OptionName' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, OptionNameText) == 0x0002A8, "Member 'UBP_CustomationMaterialSelector_C::OptionNameText' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, SelectedMaterialIndex) == 0x0002C0, "Member 'UBP_CustomationMaterialSelector_C::SelectedMaterialIndex' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, OnUpdateMaterial) == 0x0002C8, "Member 'UBP_CustomationMaterialSelector_C::OnUpdateMaterial' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, Gender) == 0x0002D8, "Member 'UBP_CustomationMaterialSelector_C::Gender' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, Category) == 0x0002D9, "Member 'UBP_CustomationMaterialSelector_C::Category' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, MaterialElementIndex) == 0x0002DC, "Member 'UBP_CustomationMaterialSelector_C::MaterialElementIndex' has a wrong offset!");
static_assert(offsetof(UBP_CustomationMaterialSelector_C, SelectedMesh) == 0x0002E0, "Member 'UBP_CustomationMaterialSelector_C::SelectedMesh' has a wrong offset!");

}

