#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationSlotTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomizationSlotTooltip.BP_CustomizationSlotTooltip_C.ExecuteUbergraph_BP_CustomizationSlotTooltip
// 0x0060 (0x0060 - 0x0000)
struct BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip) == 0x000008, "Wrong alignment on BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip");
static_assert(sizeof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip) == 0x000060, "Wrong size on BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, EntryPoint) == 0x000000, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000014, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000018, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_GetRenderOpacity_ReturnValue) == 0x00001C, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_FInterpTo_ReturnValue) == 0x000020, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x000024, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x00002C, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000058, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'BP_CustomizationSlotTooltip_C_ExecuteUbergraph_BP_CustomizationSlotTooltip::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

