#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationItemCard

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomizationItemCard.BP_CustomizationItemCard_C.OnItemFocused_0__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_CustomizationItemCard_C_OnItemFocused_0__DelegateSignature final
{
public:
	class UBP_ItemCard_C*                         Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationItemCard_C_OnItemFocused_0__DelegateSignature) == 0x000008, "Wrong alignment on BP_CustomizationItemCard_C_OnItemFocused_0__DelegateSignature");
static_assert(sizeof(BP_CustomizationItemCard_C_OnItemFocused_0__DelegateSignature) == 0x000008, "Wrong size on BP_CustomizationItemCard_C_OnItemFocused_0__DelegateSignature");
static_assert(offsetof(BP_CustomizationItemCard_C_OnItemFocused_0__DelegateSignature, Item) == 0x000000, "Member 'BP_CustomizationItemCard_C_OnItemFocused_0__DelegateSignature::Item' has a wrong offset!");

// Function BP_CustomizationItemCard.BP_CustomizationItemCard_C.ExecuteUbergraph_BP_CustomizationItemCard
// 0x000C (0x000C - 0x0000)
struct BP_CustomizationItemCard_C_ExecuteUbergraph_BP_CustomizationItemCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
};
static_assert(alignof(BP_CustomizationItemCard_C_ExecuteUbergraph_BP_CustomizationItemCard) == 0x000004, "Wrong alignment on BP_CustomizationItemCard_C_ExecuteUbergraph_BP_CustomizationItemCard");
static_assert(sizeof(BP_CustomizationItemCard_C_ExecuteUbergraph_BP_CustomizationItemCard) == 0x00000C, "Wrong size on BP_CustomizationItemCard_C_ExecuteUbergraph_BP_CustomizationItemCard");
static_assert(offsetof(BP_CustomizationItemCard_C_ExecuteUbergraph_BP_CustomizationItemCard, EntryPoint) == 0x000000, "Member 'BP_CustomizationItemCard_C_ExecuteUbergraph_BP_CustomizationItemCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_ExecuteUbergraph_BP_CustomizationItemCard, K2Node_Event_InFocusEvent) == 0x000004, "Member 'BP_CustomizationItemCard_C_ExecuteUbergraph_BP_CustomizationItemCard::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function BP_CustomizationItemCard.BP_CustomizationItemCard_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_CustomizationItemCard_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_CustomizationItemCard_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on BP_CustomizationItemCard_C_OnAddedToFocusPath");
static_assert(sizeof(BP_CustomizationItemCard_C_OnAddedToFocusPath) == 0x000008, "Wrong size on BP_CustomizationItemCard_C_OnAddedToFocusPath");
static_assert(offsetof(BP_CustomizationItemCard_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'BP_CustomizationItemCard_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function BP_CustomizationItemCard.BP_CustomizationItemCard_C.InitSlot
// 0x05E0 (0x05E0 - 0x0000)
struct BP_CustomizationItemCard_C_InitSlot final
{
public:
	class FString                                 DTRowName_0;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EPlayerCustomizationType                      CustomizationCategory;                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Level;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCustomizationScrollBox_C*     Parent;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             QualityGrid;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLevel;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Visible, class UBP_ItemCard_C* ItemCard, uint8 CategoryAsByte)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Focused, class UBP_ItemCard_C* Item)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Focused, class UBP_ItemCard_C* Item)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Focused, class UBP_ItemCard_C* Item)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Focused, class UBP_ItemCard_C* Item)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Focused, class UBP_ItemCard_C* Item)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Focused, class UBP_ItemCard_C* Item)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Focused, class UBP_ItemCard_C* Item)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UBP_ItemCard_C* Item)>   K2Node_CreateDelegate_OutputDelegate_8;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationItemTableRow       CallFunc_GetFacialHairItemFromDT_Item;             // 0x00C0(0x00A8)()
	TDelegate<void(class UBP_ItemCard_C* Item)>   K2Node_CreateDelegate_OutputDelegate_9;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetAccessoryItemFromDT_Item;              // 0x0178(0x00A8)()
	TDelegate<void(class UBP_ItemCard_C* Item)>   K2Node_CreateDelegate_OutputDelegate_10;           // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetEyewearItemFromDT_Item;                // 0x0230(0x00A8)()
	class UGridPanel*                             CallFunc_Set_Quality_to_Card_QualityGrid;          // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPlayerProfileMainMenu_BP_C*>    CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x02E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPlayerProfileMainMenu_BP_C*            CallFunc_Array_Get_Item;                           // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetFeetItemFromDT_Item;                   // 0x0300(0x00A8)()
	struct FPlayerCustomizationItemTableRow       CallFunc_GetLegsItemFromDT_Item;                   // 0x03A8(0x00A8)()
	struct FPlayerCustomizationItemTableRow       CallFunc_GetBodyItemFromDT_Item;                   // 0x0450(0x00A8)()
	TDelegate<void(class UBP_ItemCard_C* Item)>   K2Node_CreateDelegate_OutputDelegate_11;           // 0x04F8(0x0010)(ZeroConstructor, NoDestructor)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetHeadItemFromDT_Item;                   // 0x0508(0x00A8)()
	TDelegate<void(class UBP_ItemCard_C* Item)>   K2Node_CreateDelegate_OutputDelegate_12;           // 0x05B0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UBP_ItemCard_C* Item)>   K2Node_CreateDelegate_OutputDelegate_13;           // 0x05C0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UBP_ItemCard_C* Item)>   K2Node_CreateDelegate_OutputDelegate_14;           // 0x05D0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_CustomizationItemCard_C_InitSlot) == 0x000008, "Wrong alignment on BP_CustomizationItemCard_C_InitSlot");
static_assert(sizeof(BP_CustomizationItemCard_C_InitSlot) == 0x0005E0, "Wrong size on BP_CustomizationItemCard_C_InitSlot");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, DTRowName_0) == 0x000000, "Member 'BP_CustomizationItemCard_C_InitSlot::DTRowName_0' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CustomizationCategory) == 0x000010, "Member 'BP_CustomizationItemCard_C_InitSlot::CustomizationCategory' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, Level) == 0x000014, "Member 'BP_CustomizationItemCard_C_InitSlot::Level' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, Parent) == 0x000018, "Member 'BP_CustomizationItemCard_C_InitSlot::Parent' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, QualityGrid) == 0x000020, "Member 'BP_CustomizationItemCard_C_InitSlot::QualityGrid' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CurrentLevel) == 0x000028, "Member 'BP_CustomizationItemCard_C_InitSlot::CurrentLevel' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_4) == 0x00006C, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_5) == 0x00007C, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_6) == 0x00008C, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_7) == 0x00009C, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000AC, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CallFunc_GetFacialHairItemFromDT_Item) == 0x0000C0, "Member 'BP_CustomizationItemCard_C_InitSlot::CallFunc_GetFacialHairItemFromDT_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_9) == 0x000168, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CallFunc_GetAccessoryItemFromDT_Item) == 0x000178, "Member 'BP_CustomizationItemCard_C_InitSlot::CallFunc_GetAccessoryItemFromDT_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_10) == 0x000220, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CallFunc_GetEyewearItemFromDT_Item) == 0x000230, "Member 'BP_CustomizationItemCard_C_InitSlot::CallFunc_GetEyewearItemFromDT_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CallFunc_Set_Quality_to_Card_QualityGrid) == 0x0002D8, "Member 'BP_CustomizationItemCard_C_InitSlot::CallFunc_Set_Quality_to_Card_QualityGrid' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_SwitchEnum_CmpSuccess) == 0x0002E0, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0002E8, "Member 'BP_CustomizationItemCard_C_InitSlot::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CallFunc_Array_Get_Item) == 0x0002F8, "Member 'BP_CustomizationItemCard_C_InitSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CallFunc_GetFeetItemFromDT_Item) == 0x000300, "Member 'BP_CustomizationItemCard_C_InitSlot::CallFunc_GetFeetItemFromDT_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CallFunc_GetLegsItemFromDT_Item) == 0x0003A8, "Member 'BP_CustomizationItemCard_C_InitSlot::CallFunc_GetLegsItemFromDT_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CallFunc_GetBodyItemFromDT_Item) == 0x000450, "Member 'BP_CustomizationItemCard_C_InitSlot::CallFunc_GetBodyItemFromDT_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_11) == 0x0004F8, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, CallFunc_GetHeadItemFromDT_Item) == 0x000508, "Member 'BP_CustomizationItemCard_C_InitSlot::CallFunc_GetHeadItemFromDT_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_12) == 0x0005B0, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_13) == 0x0005C0, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_InitSlot, K2Node_CreateDelegate_OutputDelegate_14) == 0x0005D0, "Member 'BP_CustomizationItemCard_C_InitSlot::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");

// Function BP_CustomizationItemCard.BP_CustomizationItemCard_C.SetCharacterItemCard
// 0x00E0 (0x00E0 - 0x0000)
struct BP_CustomizationItemCard_C_SetCharacterItemCard final
{
public:
	struct FPlayerCustomizationItemTableRow       Item;                                              // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CurrentLevel;                                      // 0x00A8(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTAchievementList                    AchievementList;                                   // 0x00B0(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UFCTAchievement*                        TempAchievement;                                   // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationItemCard_C_SetCharacterItemCard) == 0x000008, "Wrong alignment on BP_CustomizationItemCard_C_SetCharacterItemCard");
static_assert(sizeof(BP_CustomizationItemCard_C_SetCharacterItemCard) == 0x0000E0, "Wrong size on BP_CustomizationItemCard_C_SetCharacterItemCard");
static_assert(offsetof(BP_CustomizationItemCard_C_SetCharacterItemCard, Item) == 0x000000, "Member 'BP_CustomizationItemCard_C_SetCharacterItemCard::Item' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_SetCharacterItemCard, CurrentLevel) == 0x0000A8, "Member 'BP_CustomizationItemCard_C_SetCharacterItemCard::CurrentLevel' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_SetCharacterItemCard, AchievementList) == 0x0000B0, "Member 'BP_CustomizationItemCard_C_SetCharacterItemCard::AchievementList' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_SetCharacterItemCard, TempAchievement) == 0x0000D8, "Member 'BP_CustomizationItemCard_C_SetCharacterItemCard::TempAchievement' has a wrong offset!");

// Function BP_CustomizationItemCard.BP_CustomizationItemCard_C.Set Quality to Card
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomizationItemCard_C_Set_Quality_to_Card final
{
public:
	class UCharacterCustomizationScrollBox_C*     Parent;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             QualityGrid;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomizationItemCard_C_Set_Quality_to_Card) == 0x000008, "Wrong alignment on BP_CustomizationItemCard_C_Set_Quality_to_Card");
static_assert(sizeof(BP_CustomizationItemCard_C_Set_Quality_to_Card) == 0x000018, "Wrong size on BP_CustomizationItemCard_C_Set_Quality_to_Card");
static_assert(offsetof(BP_CustomizationItemCard_C_Set_Quality_to_Card, Parent) == 0x000000, "Member 'BP_CustomizationItemCard_C_Set_Quality_to_Card::Parent' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_Set_Quality_to_Card, QualityGrid) == 0x000008, "Member 'BP_CustomizationItemCard_C_Set_Quality_to_Card::QualityGrid' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_Set_Quality_to_Card, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'BP_CustomizationItemCard_C_Set_Quality_to_Card::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CustomizationItemCard.BP_CustomizationItemCard_C.CreateTooltipWidget
// 0x0028 (0x0028 - 0x0000)
struct BP_CustomizationItemCard_C_CreateTooltipWidget final
{
public:
	class FString                                 InAchievementString;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          InEquipped;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CustomizationSlotTooltip_C*         ToolTip;                                           // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomizationSlotTooltip_C*         CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationItemCard_C_CreateTooltipWidget) == 0x000008, "Wrong alignment on BP_CustomizationItemCard_C_CreateTooltipWidget");
static_assert(sizeof(BP_CustomizationItemCard_C_CreateTooltipWidget) == 0x000028, "Wrong size on BP_CustomizationItemCard_C_CreateTooltipWidget");
static_assert(offsetof(BP_CustomizationItemCard_C_CreateTooltipWidget, InAchievementString) == 0x000000, "Member 'BP_CustomizationItemCard_C_CreateTooltipWidget::InAchievementString' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_CreateTooltipWidget, InEquipped) == 0x000010, "Member 'BP_CustomizationItemCard_C_CreateTooltipWidget::InEquipped' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_CreateTooltipWidget, ToolTip) == 0x000018, "Member 'BP_CustomizationItemCard_C_CreateTooltipWidget::ToolTip' has a wrong offset!");
static_assert(offsetof(BP_CustomizationItemCard_C_CreateTooltipWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'BP_CustomizationItemCard_C_CreateTooltipWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

}

