#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationMenu

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "Engine_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.OnUpdateClothing__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_CustomizationMenu_C_OnUpdateClothing__DelegateSignature final
{
public:
	struct FPlayerCustomizationItem               CustomizationElement;                              // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_CustomizationMenu_C_OnUpdateClothing__DelegateSignature) == 0x000008, "Wrong alignment on BP_CustomizationMenu_C_OnUpdateClothing__DelegateSignature");
static_assert(sizeof(BP_CustomizationMenu_C_OnUpdateClothing__DelegateSignature) == 0x0000A8, "Wrong size on BP_CustomizationMenu_C_OnUpdateClothing__DelegateSignature");
static_assert(offsetof(BP_CustomizationMenu_C_OnUpdateClothing__DelegateSignature, CustomizationElement) == 0x000000, "Member 'BP_CustomizationMenu_C_OnUpdateClothing__DelegateSignature::CustomizationElement' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.OnChangeGender__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_CustomizationMenu_C_OnChangeGender__DelegateSignature final
{
public:
	EPlayerCustomizationGender                    CustomizationGender;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMenu_C_OnChangeGender__DelegateSignature) == 0x000001, "Wrong alignment on BP_CustomizationMenu_C_OnChangeGender__DelegateSignature");
static_assert(sizeof(BP_CustomizationMenu_C_OnChangeGender__DelegateSignature) == 0x000001, "Wrong size on BP_CustomizationMenu_C_OnChangeGender__DelegateSignature");
static_assert(offsetof(BP_CustomizationMenu_C_OnChangeGender__DelegateSignature, CustomizationGender) == 0x000000, "Member 'BP_CustomizationMenu_C_OnChangeGender__DelegateSignature::CustomizationGender' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.OnInitializeSavedCameraName__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_CustomizationMenu_C_OnInitializeSavedCameraName__DelegateSignature final
{
public:
	EPlayerCustomizationGender                    CustomizationGender;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMenu_C_OnInitializeSavedCameraName__DelegateSignature) == 0x000001, "Wrong alignment on BP_CustomizationMenu_C_OnInitializeSavedCameraName__DelegateSignature");
static_assert(sizeof(BP_CustomizationMenu_C_OnInitializeSavedCameraName__DelegateSignature) == 0x000001, "Wrong size on BP_CustomizationMenu_C_OnInitializeSavedCameraName__DelegateSignature");
static_assert(offsetof(BP_CustomizationMenu_C_OnInitializeSavedCameraName__DelegateSignature, CustomizationGender) == 0x000000, "Member 'BP_CustomizationMenu_C_OnInitializeSavedCameraName__DelegateSignature::CustomizationGender' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.OnCharactersUpdated__DelegateSignature
// 0x01A8 (0x01A8 - 0x0000)
struct BP_CustomizationMenu_C_OnCharactersUpdated__DelegateSignature final
{
public:
	struct FFCTCloudCustomizationPayload          CustomizationPayload;                              // 0x0000(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_CustomizationMenu_C_OnCharactersUpdated__DelegateSignature) == 0x000008, "Wrong alignment on BP_CustomizationMenu_C_OnCharactersUpdated__DelegateSignature");
static_assert(sizeof(BP_CustomizationMenu_C_OnCharactersUpdated__DelegateSignature) == 0x0001A8, "Wrong size on BP_CustomizationMenu_C_OnCharactersUpdated__DelegateSignature");
static_assert(offsetof(BP_CustomizationMenu_C_OnCharactersUpdated__DelegateSignature, CustomizationPayload) == 0x000000, "Member 'BP_CustomizationMenu_C_OnCharactersUpdated__DelegateSignature::CustomizationPayload' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.ExecuteUbergraph_BP_CustomizationMenu
// 0x0F38 (0x0F38 - 0x0000)
struct BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_5;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_5;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FFCTCloudCustomizationPayload          K2Node_CustomEvent_Payload;                        // 0x0028(0x01A8)()
	int32                                         K2Node_CustomEvent_Code_4;                         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_4;                      // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTCloudCustomizationPayload& Payload, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTCloudCustomizationPayload          Temp_struct_Variable;                              // 0x0210(0x01A8)()
	class UFCTAccelByteCustomizationPayloadCallbackProxy* CallFunc_GetUserCustomizationPayload_ReturnValue;  // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_3;                         // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x03E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccountUserData                       K2Node_CustomEvent_Result;                         // 0x03F8(0x0120)(ConstParm)
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_2;                         // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FAccountUserData& Result, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x052C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0540(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAccountUserData                       Temp_struct_Variable_1;                            // 0x0550(0x0120)()
	class UUserDataCallbackProxy*                 CallFunc_GetUserData_ReturnValue;                  // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_679[0x3];                                      // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0680(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0690(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_Code;                           // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x06A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x06B8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_2;                            // 0x06C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTSyncPlatformPurchases*              CallFunc_SyncPlatformPurchases_ReturnValue;        // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Title)>   K2Node_CreateDelegate_OutputDelegate_6;            // 0x06E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F9[0x3];                                      // 0x06F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPlayerCustomizationGender Gender)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x06FC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0710(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0730(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_741[0x3];                                      // 0x0741(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x074C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74D[0x3];                                      // 0x074D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Code_7;                         // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_754[0x4];                                      // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_7;                      // 0x0758(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTCloudCustomizationGender           CallFunc_ConfirmGenderSettings_UpdatedSetting;     // 0x0768(0x00B0)()
	struct FFCTCloudCustomizationGender           CallFunc_ConfirmGenderSettings_UpdatedSetting_1;   // 0x0818(0x00B0)()
	struct FFCTCloudCustomizationPayload          Temp_struct_Variable_2;                            // 0x08C8(0x01A8)()
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0A70(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0A78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0A7C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A8C[0x4];                                      // 0x0A8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_3;                            // 0x0A90(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_1; // 0x0AA0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCTAchievementList                    K2Node_CustomEvent_AchievementList;                // 0x0AA8(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0AD0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0AE0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsConnected_ReturnValue;                  // 0x0AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerCustomizationGender                    K2Node_ComponentBoundEvent_Gender_1;               // 0x0AF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCustomizationGender                    K2Node_ComponentBoundEvent_Gender;                 // 0x0AF2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0AF3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0AF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF5[0x3];                                      // 0x0AF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_2; // 0x0AF8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCTCloudCustomizationPayload          K2Node_CustomEvent_Payload_1;                      // 0x0B00(0x01A8)()
	int32                                         K2Node_CustomEvent_Code_6;                         // 0x0CA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAC[0x4];                                      // 0x0CAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_6;                      // 0x0CB0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTCloudCustomizationPayload& Payload, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0CC0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_Title;                          // 0x0CD0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EPlayerCustomizationGender                    K2Node_CustomEvent_Gender;                         // 0x0CE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0CE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE2[0x6];                                      // 0x0CE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Focusable_C>        K2Node_DynamicCast_AsI_Focusable;                  // 0x0CE8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF9[0x7];                                      // 0x0CF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Focusable_C>        K2Node_DynamicCast_AsI_Focusable_1;                // 0x0D00(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0D10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D11[0x7];                                      // 0x0D11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0D18(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Focusable_C>        K2Node_DynamicCast_AsI_Focusable_2;                // 0x0D20(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0D30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D31[0x7];                                      // 0x0D31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTCloudCustomizationVruumba          CallFunc_ConfirmVruumbaSettings_UpdatedSetting;    // 0x0D38(0x0030)()
	class UFCTAccelByteCustomizationPayloadCallbackProxy* CallFunc_SetUserCustomizationPayload_ReturnValue;  // 0x0D68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0D70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D71[0x7];                                      // 0x0D71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTCloudCustomizationPayload          CallFunc_MakeCurrentPayload_Payload;               // 0x0D78(0x01A8)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0F20(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ShouldShowButtonIconPrompt_ReturnValue;   // 0x0F30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu) == 0x000008, "Wrong alignment on BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu");
static_assert(sizeof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu) == 0x000F38, "Wrong size on BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, EntryPoint) == 0x000000, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Code_5) == 0x000004, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Code_5' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Message_5) == 0x000008, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Message_5' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Payload) == 0x000028, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Code_4) == 0x0001D0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Code_4' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Message_4) == 0x0001D8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Message_4' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001E8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_string_Variable) == 0x0001F8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_int_Variable) == 0x000208, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_struct_Variable) == 0x000210, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_GetUserCustomizationPayload_ReturnValue) == 0x0003B8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_GetUserCustomizationPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_IsValid_ReturnValue) == 0x0003C0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0003C8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Message_3) == 0x0003D0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Message_3' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Code_3) == 0x0003E0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Code_3' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003E4, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Result) == 0x0003F8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Message_2) == 0x000518, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Code_2) == 0x000528, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Code_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x00052C, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_int_Variable_1) == 0x00053C, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_string_Variable_1) == 0x000540, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_struct_Variable_1) == 0x000550, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_GetUserData_ReturnValue) == 0x000670, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_GetUserData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_IsValid_ReturnValue_1) == 0x000678, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Code_1) == 0x00067C, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Message_1) == 0x000680, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x000690, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Code) == 0x0006A0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Message) == 0x0006A8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x0006B8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_string_Variable_2) == 0x0006C8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_int_Variable_2) == 0x0006D8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_SyncPlatformPurchases_ReturnValue) == 0x0006E0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_SyncPlatformPurchases_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_6) == 0x0006E8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_IsValid_ReturnValue_2) == 0x0006F8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_7) == 0x0006FC, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00070C, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_8) == 0x000710, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_GetRenderOpacity_ReturnValue) == 0x000720, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000724, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000728, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000730, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_FInterpTo_ReturnValue) == 0x000738, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x00073C, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_Less_FloatFloat_ReturnValue) == 0x000740, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000744, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_FInterpTo_ReturnValue_1) == 0x000748, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_Event_IsDesignTime) == 0x00074C, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Code_7) == 0x000750, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Code_7' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Message_7) == 0x000758, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Message_7' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_ConfirmGenderSettings_UpdatedSetting) == 0x000768, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_ConfirmGenderSettings_UpdatedSetting' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_ConfirmGenderSettings_UpdatedSetting_1) == 0x000818, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_ConfirmGenderSettings_UpdatedSetting_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_struct_Variable_2) == 0x0008C8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000A70, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_int_Variable_3) == 0x000A78, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_9) == 0x000A7C, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, Temp_string_Variable_3) == 0x000A90, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_SpawnAkComponentAtLocation_ReturnValue_1) == 0x000AA0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_SpawnAkComponentAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_AchievementList) == 0x000AA8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_AchievementList' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_10) == 0x000AD0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_11) == 0x000AE0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_IsConnected_ReturnValue) == 0x000AF0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_IsConnected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_ComponentBoundEvent_Gender_1) == 0x000AF1, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_ComponentBoundEvent_Gender_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_ComponentBoundEvent_Gender) == 0x000AF2, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_ComponentBoundEvent_Gender' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000AF3, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_SwitchEnum_CmpSuccess_1) == 0x000AF4, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_SpawnAkComponentAtLocation_ReturnValue_2) == 0x000AF8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_SpawnAkComponentAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Payload_1) == 0x000B00, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Code_6) == 0x000CA8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Code_6' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Message_6) == 0x000CB0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Message_6' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_12) == 0x000CC0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Title) == 0x000CD0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Title' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CustomEvent_Gender) == 0x000CE0, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CustomEvent_Gender' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_SwitchEnum_CmpSuccess_2) == 0x000CE1, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_DynamicCast_AsI_Focusable) == 0x000CE8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_DynamicCast_AsI_Focusable' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_DynamicCast_bSuccess) == 0x000CF8, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_DynamicCast_AsI_Focusable_1) == 0x000D00, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_DynamicCast_AsI_Focusable_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_DynamicCast_bSuccess_1) == 0x000D10, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_GetActiveWidget_ReturnValue) == 0x000D18, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_DynamicCast_AsI_Focusable_2) == 0x000D20, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_DynamicCast_AsI_Focusable_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_DynamicCast_bSuccess_2) == 0x000D30, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_ConfirmVruumbaSettings_UpdatedSetting) == 0x000D38, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_ConfirmVruumbaSettings_UpdatedSetting' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_SetUserCustomizationPayload_ReturnValue) == 0x000D68, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_SetUserCustomizationPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_IsValid_ReturnValue_3) == 0x000D70, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_MakeCurrentPayload_Payload) == 0x000D78, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_MakeCurrentPayload_Payload' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_13) == 0x000F20, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu, CallFunc_ShouldShowButtonIconPrompt_ReturnValue) == 0x000F30, "Member 'BP_CustomizationMenu_C_ExecuteUbergraph_BP_CustomizationMenu::CallFunc_ShouldShowButtonIconPrompt_ReturnValue' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.On Swap Gender
// 0x0001 (0x0001 - 0x0000)
struct BP_CustomizationMenu_C_On_Swap_Gender final
{
public:
	EPlayerCustomizationGender                    Gender;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMenu_C_On_Swap_Gender) == 0x000001, "Wrong alignment on BP_CustomizationMenu_C_On_Swap_Gender");
static_assert(sizeof(BP_CustomizationMenu_C_On_Swap_Gender) == 0x000001, "Wrong size on BP_CustomizationMenu_C_On_Swap_Gender");
static_assert(offsetof(BP_CustomizationMenu_C_On_Swap_Gender, Gender) == 0x000000, "Member 'BP_CustomizationMenu_C_On_Swap_Gender::Gender' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.On Navigate Menu With Gamepad
// 0x0010 (0x0010 - 0x0000)
struct BP_CustomizationMenu_C_On_Navigate_Menu_With_Gamepad final
{
public:
	class FString                                 Title;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMenu_C_On_Navigate_Menu_With_Gamepad) == 0x000008, "Wrong alignment on BP_CustomizationMenu_C_On_Navigate_Menu_With_Gamepad");
static_assert(sizeof(BP_CustomizationMenu_C_On_Navigate_Menu_With_Gamepad) == 0x000010, "Wrong size on BP_CustomizationMenu_C_On_Navigate_Menu_With_Gamepad");
static_assert(offsetof(BP_CustomizationMenu_C_On_Navigate_Menu_With_Gamepad, Title) == 0x000000, "Member 'BP_CustomizationMenu_C_On_Navigate_Menu_With_Gamepad::Title' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.BndEvt__BP_CustomizationMenu_MaleMenu_K2Node_ComponentBoundEvent_3_OnChangeGenders__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_MaleMenu_K2Node_ComponentBoundEvent_3_OnChangeGenders__DelegateSignature final
{
public:
	EPlayerCustomizationGender                    Gender;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_MaleMenu_K2Node_ComponentBoundEvent_3_OnChangeGenders__DelegateSignature) == 0x000001, "Wrong alignment on BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_MaleMenu_K2Node_ComponentBoundEvent_3_OnChangeGenders__DelegateSignature");
static_assert(sizeof(BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_MaleMenu_K2Node_ComponentBoundEvent_3_OnChangeGenders__DelegateSignature) == 0x000001, "Wrong size on BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_MaleMenu_K2Node_ComponentBoundEvent_3_OnChangeGenders__DelegateSignature");
static_assert(offsetof(BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_MaleMenu_K2Node_ComponentBoundEvent_3_OnChangeGenders__DelegateSignature, Gender) == 0x000000, "Member 'BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_MaleMenu_K2Node_ComponentBoundEvent_3_OnChangeGenders__DelegateSignature::Gender' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.BndEvt__BP_CustomizationMenu_FemaleMenu_K2Node_ComponentBoundEvent_1_OnChangeGenders__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_FemaleMenu_K2Node_ComponentBoundEvent_1_OnChangeGenders__DelegateSignature final
{
public:
	EPlayerCustomizationGender                    Gender;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_FemaleMenu_K2Node_ComponentBoundEvent_1_OnChangeGenders__DelegateSignature) == 0x000001, "Wrong alignment on BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_FemaleMenu_K2Node_ComponentBoundEvent_1_OnChangeGenders__DelegateSignature");
static_assert(sizeof(BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_FemaleMenu_K2Node_ComponentBoundEvent_1_OnChangeGenders__DelegateSignature) == 0x000001, "Wrong size on BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_FemaleMenu_K2Node_ComponentBoundEvent_1_OnChangeGenders__DelegateSignature");
static_assert(offsetof(BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_FemaleMenu_K2Node_ComponentBoundEvent_1_OnChangeGenders__DelegateSignature, Gender) == 0x000000, "Member 'BP_CustomizationMenu_C_BndEvt__BP_CustomizationMenu_FemaleMenu_K2Node_ComponentBoundEvent_1_OnChangeGenders__DelegateSignature::Gender' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.OnGetAchievementInfo
// 0x0028 (0x0028 - 0x0000)
struct BP_CustomizationMenu_C_OnGetAchievementInfo final
{
public:
	struct FFCTAchievementList                    AchievementList;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_CustomizationMenu_C_OnGetAchievementInfo) == 0x000008, "Wrong alignment on BP_CustomizationMenu_C_OnGetAchievementInfo");
static_assert(sizeof(BP_CustomizationMenu_C_OnGetAchievementInfo) == 0x000028, "Wrong size on BP_CustomizationMenu_C_OnGetAchievementInfo");
static_assert(offsetof(BP_CustomizationMenu_C_OnGetAchievementInfo, AchievementList) == 0x000000, "Member 'BP_CustomizationMenu_C_OnGetAchievementInfo::AchievementList' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_CustomizationMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomizationMenu_C_PreConstruct) == 0x000001, "Wrong alignment on BP_CustomizationMenu_C_PreConstruct");
static_assert(sizeof(BP_CustomizationMenu_C_PreConstruct) == 0x000001, "Wrong size on BP_CustomizationMenu_C_PreConstruct");
static_assert(offsetof(BP_CustomizationMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_CustomizationMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomizationMenu_C_OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8 final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMenu_C_OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8) == 0x000008, "Wrong alignment on BP_CustomizationMenu_C_OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8");
static_assert(sizeof(BP_CustomizationMenu_C_OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8) == 0x000018, "Wrong size on BP_CustomizationMenu_C_OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8");
static_assert(offsetof(BP_CustomizationMenu_C_OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8, Code) == 0x000000, "Member 'BP_CustomizationMenu_C_OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8::Code' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8, Message) == 0x000008, "Member 'BP_CustomizationMenu_C_OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8::Message' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.OnFail_3B8E29E84A5B3451C11404AE43BEB0C8
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomizationMenu_C_OnFail_3B8E29E84A5B3451C11404AE43BEB0C8 final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMenu_C_OnFail_3B8E29E84A5B3451C11404AE43BEB0C8) == 0x000008, "Wrong alignment on BP_CustomizationMenu_C_OnFail_3B8E29E84A5B3451C11404AE43BEB0C8");
static_assert(sizeof(BP_CustomizationMenu_C_OnFail_3B8E29E84A5B3451C11404AE43BEB0C8) == 0x000018, "Wrong size on BP_CustomizationMenu_C_OnFail_3B8E29E84A5B3451C11404AE43BEB0C8");
static_assert(offsetof(BP_CustomizationMenu_C_OnFail_3B8E29E84A5B3451C11404AE43BEB0C8, Code) == 0x000000, "Member 'BP_CustomizationMenu_C_OnFail_3B8E29E84A5B3451C11404AE43BEB0C8::Code' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_OnFail_3B8E29E84A5B3451C11404AE43BEB0C8, Message) == 0x000008, "Member 'BP_CustomizationMenu_C_OnFail_3B8E29E84A5B3451C11404AE43BEB0C8::Message' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF
// 0x0138 (0x0138 - 0x0000)
struct BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF final
{
public:
	struct FAccountUserData                       Result;                                            // 0x0000(0x0120)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Message;                                           // 0x0120(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Code;                                              // 0x0130(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF) == 0x000008, "Wrong alignment on BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF");
static_assert(sizeof(BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF) == 0x000138, "Wrong size on BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF");
static_assert(offsetof(BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF, Result) == 0x000000, "Member 'BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF::Result' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF, Message) == 0x000120, "Member 'BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF::Message' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF, Code) == 0x000130, "Member 'BP_CustomizationMenu_C_OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF::Code' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.OnError_1B4ED71645BD77BE270C3BA15DF0EFAF
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomizationMenu_C_OnError_1B4ED71645BD77BE270C3BA15DF0EFAF final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Code;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMenu_C_OnError_1B4ED71645BD77BE270C3BA15DF0EFAF) == 0x000008, "Wrong alignment on BP_CustomizationMenu_C_OnError_1B4ED71645BD77BE270C3BA15DF0EFAF");
static_assert(sizeof(BP_CustomizationMenu_C_OnError_1B4ED71645BD77BE270C3BA15DF0EFAF) == 0x000018, "Wrong size on BP_CustomizationMenu_C_OnError_1B4ED71645BD77BE270C3BA15DF0EFAF");
static_assert(offsetof(BP_CustomizationMenu_C_OnError_1B4ED71645BD77BE270C3BA15DF0EFAF, Message) == 0x000000, "Member 'BP_CustomizationMenu_C_OnError_1B4ED71645BD77BE270C3BA15DF0EFAF::Message' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMenu_C_OnError_1B4ED71645BD77BE270C3BA15DF0EFAF, Code) == 0x000010, "Member 'BP_CustomizationMenu_C_OnError_1B4ED71645BD77BE270C3BA15DF0EFAF::Code' has a wrong offset!");

// Function BP_CustomizationMenu.BP_CustomizationMenu_C.OnSuccess_91EDAD8E4AA37381DCED7F9CC612EDD3
// 0x01C0 (0x01C0 - 0x0000)
struct BP_CustomizationMenu_C_OnSuccess_91EDAD8E4AA37381DCED7F9CC612EDD3 final
{
public:
	struct FFCTCloudCustomizationPayload          Payload;                                           // 0x0000(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Code;                                              // 0x01A8(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x01B0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
