#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_LiquidTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bp_LiquidTrigger.bp_LiquidTrigger_C
// 0x0018 (0x0238 - 0x0220)
class Abp_LiquidTrigger_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBoxComponent*                          Collider;                                          // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bp_LiquidTrigger(int32 EntryPoint);
	void BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_LiquidTrigger_C">();
	}
	static class Abp_LiquidTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abp_LiquidTrigger_C>();
	}
};
static_assert(alignof(Abp_LiquidTrigger_C) == 0x000008, "Wrong alignment on Abp_LiquidTrigger_C");
static_assert(sizeof(Abp_LiquidTrigger_C) == 0x000238, "Wrong size on Abp_LiquidTrigger_C");
static_assert(offsetof(Abp_LiquidTrigger_C, UberGraphFrame) == 0x000220, "Member 'Abp_LiquidTrigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Abp_LiquidTrigger_C, Collider) == 0x000228, "Member 'Abp_LiquidTrigger_C::Collider' has a wrong offset!");
static_assert(offsetof(Abp_LiquidTrigger_C, DefaultSceneRoot) == 0x000230, "Member 'Abp_LiquidTrigger_C::DefaultSceneRoot' has a wrong offset!");

}

