#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_New_Showdown_Controllable

#include "Basic.hpp"


namespace SDK::Params
{

// Function bp_New_Showdown_Controllable.bp_New_Showdown_Controllable_C.ExecuteUbergraph_bp_New_Showdown_Controllable
// 0x0008 (0x0008 - 0x0000)
struct bp_New_Showdown_Controllable_C_ExecuteUbergraph_bp_New_Showdown_Controllable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsOpening;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_New_Showdown_Controllable_C_ExecuteUbergraph_bp_New_Showdown_Controllable) == 0x000004, "Wrong alignment on bp_New_Showdown_Controllable_C_ExecuteUbergraph_bp_New_Showdown_Controllable");
static_assert(sizeof(bp_New_Showdown_Controllable_C_ExecuteUbergraph_bp_New_Showdown_Controllable) == 0x000008, "Wrong size on bp_New_Showdown_Controllable_C_ExecuteUbergraph_bp_New_Showdown_Controllable");
static_assert(offsetof(bp_New_Showdown_Controllable_C_ExecuteUbergraph_bp_New_Showdown_Controllable, EntryPoint) == 0x000000, "Member 'bp_New_Showdown_Controllable_C_ExecuteUbergraph_bp_New_Showdown_Controllable::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_New_Showdown_Controllable_C_ExecuteUbergraph_bp_New_Showdown_Controllable, K2Node_ComponentBoundEvent_IsOpening) == 0x000004, "Member 'bp_New_Showdown_Controllable_C_ExecuteUbergraph_bp_New_Showdown_Controllable::K2Node_ComponentBoundEvent_IsOpening' has a wrong offset!");

// Function bp_New_Showdown_Controllable.bp_New_Showdown_Controllable_C.BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_0_OnOpenStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct bp_New_Showdown_Controllable_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_0_OnOpenStateChanged__DelegateSignature final
{
public:
	bool                                          IsOpening;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_New_Showdown_Controllable_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_0_OnOpenStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on bp_New_Showdown_Controllable_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_0_OnOpenStateChanged__DelegateSignature");
static_assert(sizeof(bp_New_Showdown_Controllable_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_0_OnOpenStateChanged__DelegateSignature) == 0x000001, "Wrong size on bp_New_Showdown_Controllable_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_0_OnOpenStateChanged__DelegateSignature");
static_assert(offsetof(bp_New_Showdown_Controllable_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_0_OnOpenStateChanged__DelegateSignature, IsOpening) == 0x000000, "Member 'bp_New_Showdown_Controllable_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_0_OnOpenStateChanged__DelegateSignature::IsOpening' has a wrong offset!");

}

