#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PartyButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PartyButton.BP_PartyButton_C
// 0x0040 (0x02F0 - 0x02B0)
class UBP_PartyButton_C final : public UControllerIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 IconImage;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PartyButton;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlaystationIcon;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              PCButtonSize;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              GamepadButtonSize;                                 // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnInvoke;                                          // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnInvoke__DelegateSignature();
	void ExecuteUbergraph_BP_PartyButton(int32 EntryPoint);
	void ResetDisplay();
	void ListenForGamepadInput();
	void StopListeningForGamepadInput();
	void OnGamepadButtonPressed();
	void BndEvt__BP_PartyButton_PartyButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void SetPartyButtonSize(const struct FVector2D& InButtonSize);
	void SetControllerIcon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PartyButton_C">();
	}
	static class UBP_PartyButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PartyButton_C>();
	}
};
static_assert(alignof(UBP_PartyButton_C) == 0x000008, "Wrong alignment on UBP_PartyButton_C");
static_assert(sizeof(UBP_PartyButton_C) == 0x0002F0, "Wrong size on UBP_PartyButton_C");
static_assert(offsetof(UBP_PartyButton_C, UberGraphFrame) == 0x0002B0, "Member 'UBP_PartyButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PartyButton_C, IconImage) == 0x0002B8, "Member 'UBP_PartyButton_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_PartyButton_C, PartyButton) == 0x0002C0, "Member 'UBP_PartyButton_C::PartyButton' has a wrong offset!");
static_assert(offsetof(UBP_PartyButton_C, PlaystationIcon) == 0x0002C8, "Member 'UBP_PartyButton_C::PlaystationIcon' has a wrong offset!");
static_assert(offsetof(UBP_PartyButton_C, PCButtonSize) == 0x0002D0, "Member 'UBP_PartyButton_C::PCButtonSize' has a wrong offset!");
static_assert(offsetof(UBP_PartyButton_C, GamepadButtonSize) == 0x0002D8, "Member 'UBP_PartyButton_C::GamepadButtonSize' has a wrong offset!");
static_assert(offsetof(UBP_PartyButton_C, OnInvoke) == 0x0002E0, "Member 'UBP_PartyButton_C::OnInvoke' has a wrong offset!");

}

