#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PresetButton

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_PresetButton.BP_PresetButton_C.ExecuteUbergraph_BP_PresetButton
// 0x0048 (0x0048 - 0x0000)
struct BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0038(0x0008)(NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton) == 0x000008, "Wrong alignment on BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton");
static_assert(sizeof(BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton) == 0x000048, "Wrong size on BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton");
static_assert(offsetof(BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton, EntryPoint) == 0x000000, "Member 'BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton, K2Node_Event_InFocusEvent) == 0x000004, "Member 'BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton, Temp_struct_Variable) == 0x000010, "Member 'BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton, Temp_delegate_Variable) == 0x000020, "Member 'BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000030, "Member 'BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton, K2Node_Event_InFocusEvent_1) == 0x000038, "Member 'BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton, CallFunc_PostAkEvent_ReturnValue) == 0x000040, "Member 'BP_PresetButton_C_ExecuteUbergraph_BP_PresetButton::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function BP_PresetButton.BP_PresetButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_PresetButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_PresetButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on BP_PresetButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(BP_PresetButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on BP_PresetButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(BP_PresetButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'BP_PresetButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function BP_PresetButton.BP_PresetButton_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_PresetButton_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_PresetButton_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on BP_PresetButton_C_OnAddedToFocusPath");
static_assert(sizeof(BP_PresetButton_C_OnAddedToFocusPath) == 0x000008, "Wrong size on BP_PresetButton_C_OnAddedToFocusPath");
static_assert(offsetof(BP_PresetButton_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'BP_PresetButton_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

}

