#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PresetButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PresetButton.BP_PresetButton_C
// 0x0020 (0x05F0 - 0x05D0)
class UBP_PresetButton_C final : public UCustomizationPresetSlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 CosmeticImage_1;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconThumbnail_3;                                   // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PresetButton(int32 EntryPoint);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__Button_109_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PresetButton_C">();
	}
	static class UBP_PresetButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PresetButton_C>();
	}
};
static_assert(alignof(UBP_PresetButton_C) == 0x000008, "Wrong alignment on UBP_PresetButton_C");
static_assert(sizeof(UBP_PresetButton_C) == 0x0005F0, "Wrong size on UBP_PresetButton_C");
static_assert(offsetof(UBP_PresetButton_C, UberGraphFrame) == 0x0005D0, "Member 'UBP_PresetButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PresetButton_C, CosmeticImage_1) == 0x0005D8, "Member 'UBP_PresetButton_C::CosmeticImage_1' has a wrong offset!");
static_assert(offsetof(UBP_PresetButton_C, IconThumbnail_3) == 0x0005E0, "Member 'UBP_PresetButton_C::IconThumbnail_3' has a wrong offset!");
static_assert(offsetof(UBP_PresetButton_C, Ak) == 0x0005E8, "Member 'UBP_PresetButton_C::Ak' has a wrong offset!");

}

