#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StatisticsAndAchievementView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_StatisticsAndAchievementView.BP_StatisticsAndAchievementView_C
// 0x00B0 (0x0310 - 0x0260)
class UBP_StatisticsAndAchievementView_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBP_AchievementList_C*                  BP_AchievementList;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AchievementRecentUnlocksPanel_C*    BP_AchievementRecentUnlocksPanel;                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AchievementRecentUnlocksPanel_C*    BP_AchievementRecentUnlocksPanel_1;                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AchievementRecentUnlocksPanel_C*    BP_AchievementRecentUnlocksPanel_2;                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Exit;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_23;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_53;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RecentUnlocks;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           UnlockedProgressBar;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UnlockedProgressText;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnExitAchievements;                                // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FFCTAchievementList                    AchievementList;                                   // 0x02D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnAchievementsQueried;                             // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnExitAchievements__DelegateSignature();
	void OnAchievementsQueried__DelegateSignature(const struct FFCTAchievementList& AchievementList_0);
	void ExecuteUbergraph_BP_StatisticsAndAchievementView(int32 EntryPoint);
	void OnClientLoggedIn();
	void BndEvt__Button_310_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A(const struct FFCTAchievementList& AchievementList_0, const class FString& Message);
	void OnError_3CE9B40F422012B8BE63C786B5FBBE1A(const class FString& Message);
	void InitializeAchievementsList(const struct FFCTAchievementList& Achievements);
	void BuildRecentUnlocksList(TArray<class UFCTAchievement*>& RecentlyUnlockedAchievements);
	void SetProgressBar(int32 UnlockedCount, int32 TotalCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StatisticsAndAchievementView_C">();
	}
	static class UBP_StatisticsAndAchievementView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_StatisticsAndAchievementView_C>();
	}
};
static_assert(alignof(UBP_StatisticsAndAchievementView_C) == 0x000008, "Wrong alignment on UBP_StatisticsAndAchievementView_C");
static_assert(sizeof(UBP_StatisticsAndAchievementView_C) == 0x000310, "Wrong size on UBP_StatisticsAndAchievementView_C");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, UberGraphFrame) == 0x000260, "Member 'UBP_StatisticsAndAchievementView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, BP_AchievementList) == 0x000268, "Member 'UBP_StatisticsAndAchievementView_C::BP_AchievementList' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, BP_AchievementRecentUnlocksPanel) == 0x000270, "Member 'UBP_StatisticsAndAchievementView_C::BP_AchievementRecentUnlocksPanel' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, BP_AchievementRecentUnlocksPanel_1) == 0x000278, "Member 'UBP_StatisticsAndAchievementView_C::BP_AchievementRecentUnlocksPanel_1' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, BP_AchievementRecentUnlocksPanel_2) == 0x000280, "Member 'UBP_StatisticsAndAchievementView_C::BP_AchievementRecentUnlocksPanel_2' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, Exit) == 0x000288, "Member 'UBP_StatisticsAndAchievementView_C::Exit' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, Image) == 0x000290, "Member 'UBP_StatisticsAndAchievementView_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, Image_1) == 0x000298, "Member 'UBP_StatisticsAndAchievementView_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, Image_23) == 0x0002A0, "Member 'UBP_StatisticsAndAchievementView_C::Image_23' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, Image_53) == 0x0002A8, "Member 'UBP_StatisticsAndAchievementView_C::Image_53' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, RecentUnlocks) == 0x0002B0, "Member 'UBP_StatisticsAndAchievementView_C::RecentUnlocks' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, UnlockedProgressBar) == 0x0002B8, "Member 'UBP_StatisticsAndAchievementView_C::UnlockedProgressBar' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, UnlockedProgressText) == 0x0002C0, "Member 'UBP_StatisticsAndAchievementView_C::UnlockedProgressText' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, OnExitAchievements) == 0x0002C8, "Member 'UBP_StatisticsAndAchievementView_C::OnExitAchievements' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, AchievementList) == 0x0002D8, "Member 'UBP_StatisticsAndAchievementView_C::AchievementList' has a wrong offset!");
static_assert(offsetof(UBP_StatisticsAndAchievementView_C, OnAchievementsQueried) == 0x000300, "Member 'UBP_StatisticsAndAchievementView_C::OnAchievementsQueried' has a wrong offset!");

}

