#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StatisticsAndAchievementView

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function BP_StatisticsAndAchievementView.BP_StatisticsAndAchievementView_C.OnAchievementsQueried__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_StatisticsAndAchievementView_C_OnAchievementsQueried__DelegateSignature final
{
public:
	struct FFCTAchievementList                    AchievementList_0;                                 // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_StatisticsAndAchievementView_C_OnAchievementsQueried__DelegateSignature) == 0x000008, "Wrong alignment on BP_StatisticsAndAchievementView_C_OnAchievementsQueried__DelegateSignature");
static_assert(sizeof(BP_StatisticsAndAchievementView_C_OnAchievementsQueried__DelegateSignature) == 0x000028, "Wrong size on BP_StatisticsAndAchievementView_C_OnAchievementsQueried__DelegateSignature");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_OnAchievementsQueried__DelegateSignature, AchievementList_0) == 0x000000, "Member 'BP_StatisticsAndAchievementView_C_OnAchievementsQueried__DelegateSignature::AchievementList_0' has a wrong offset!");

// Function BP_StatisticsAndAchievementView.BP_StatisticsAndAchievementView_C.ExecuteUbergraph_BP_StatisticsAndAchievementView
// 0x0100 (0x0100 - 0x0000)
struct BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTAchievementList                    K2Node_CustomEvent_AchievementList;                // 0x0028(0x0028)(ConstParm)
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(struct FFCTAchievementList& AchievementList, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTAchievementList                    Temp_struct_Variable;                              // 0x0080(0x0028)()
	class UFCTAchievementListCallbackProxy*       CallFunc_GetUserAchievements_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggedIn_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView) == 0x000008, "Wrong alignment on BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView");
static_assert(sizeof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView) == 0x000100, "Wrong size on BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, EntryPoint) == 0x000000, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, K2Node_CustomEvent_Message_1) == 0x000018, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, K2Node_CustomEvent_AchievementList) == 0x000028, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::K2Node_CustomEvent_AchievementList' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, K2Node_CustomEvent_Message) == 0x000050, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, Temp_string_Variable) == 0x000070, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, Temp_struct_Variable) == 0x000080, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, CallFunc_GetUserAchievements_ReturnValue) == 0x0000A8, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::CallFunc_GetUserAchievements_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000B0, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000C0, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, CallFunc_IsLoggedIn_ReturnValue) == 0x0000C8, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::CallFunc_IsLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000D0, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0000D8, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E0, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F0, "Member 'BP_StatisticsAndAchievementView_C_ExecuteUbergraph_BP_StatisticsAndAchievementView::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function BP_StatisticsAndAchievementView.BP_StatisticsAndAchievementView_C.OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A
// 0x0038 (0x0038 - 0x0000)
struct BP_StatisticsAndAchievementView_C_OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A final
{
public:
	struct FFCTAchievementList                    AchievementList_0;                                 // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Message;                                           // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StatisticsAndAchievementView_C_OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A) == 0x000008, "Wrong alignment on BP_StatisticsAndAchievementView_C_OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A");
static_assert(sizeof(BP_StatisticsAndAchievementView_C_OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A) == 0x000038, "Wrong size on BP_StatisticsAndAchievementView_C_OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A, AchievementList_0) == 0x000000, "Member 'BP_StatisticsAndAchievementView_C_OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A::AchievementList_0' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A, Message) == 0x000028, "Member 'BP_StatisticsAndAchievementView_C_OnSuccess_3CE9B40F422012B8BE63C786B5FBBE1A::Message' has a wrong offset!");

// Function BP_StatisticsAndAchievementView.BP_StatisticsAndAchievementView_C.OnError_3CE9B40F422012B8BE63C786B5FBBE1A
// 0x0010 (0x0010 - 0x0000)
struct BP_StatisticsAndAchievementView_C_OnError_3CE9B40F422012B8BE63C786B5FBBE1A final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StatisticsAndAchievementView_C_OnError_3CE9B40F422012B8BE63C786B5FBBE1A) == 0x000008, "Wrong alignment on BP_StatisticsAndAchievementView_C_OnError_3CE9B40F422012B8BE63C786B5FBBE1A");
static_assert(sizeof(BP_StatisticsAndAchievementView_C_OnError_3CE9B40F422012B8BE63C786B5FBBE1A) == 0x000010, "Wrong size on BP_StatisticsAndAchievementView_C_OnError_3CE9B40F422012B8BE63C786B5FBBE1A");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_OnError_3CE9B40F422012B8BE63C786B5FBBE1A, Message) == 0x000000, "Member 'BP_StatisticsAndAchievementView_C_OnError_3CE9B40F422012B8BE63C786B5FBBE1A::Message' has a wrong offset!");

// Function BP_StatisticsAndAchievementView.BP_StatisticsAndAchievementView_C.InitializeAchievementsList
// 0x0030 (0x0030 - 0x0000)
struct BP_StatisticsAndAchievementView_C_InitializeAchievementsList final
{
public:
	struct FFCTAchievementList                    Achievements;                                      // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatisticsAndAchievementView_C_InitializeAchievementsList) == 0x000008, "Wrong alignment on BP_StatisticsAndAchievementView_C_InitializeAchievementsList");
static_assert(sizeof(BP_StatisticsAndAchievementView_C_InitializeAchievementsList) == 0x000030, "Wrong size on BP_StatisticsAndAchievementView_C_InitializeAchievementsList");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_InitializeAchievementsList, Achievements) == 0x000000, "Member 'BP_StatisticsAndAchievementView_C_InitializeAchievementsList::Achievements' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_InitializeAchievementsList, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_StatisticsAndAchievementView_C_InitializeAchievementsList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_InitializeAchievementsList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BP_StatisticsAndAchievementView_C_InitializeAchievementsList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_StatisticsAndAchievementView.BP_StatisticsAndAchievementView_C.BuildRecentUnlocksList
// 0x0048 (0x0048 - 0x0000)
struct BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList final
{
public:
	TArray<class UFCTAchievement*>                RecentlyUnlockedAchievements;                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTAchievement*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AchievementRecentUnlocksPanel_C*    K2Node_DynamicCast_AsBP_Achievement_Recent_Unlocks_Panel; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList) == 0x000008, "Wrong alignment on BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList");
static_assert(sizeof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList) == 0x000048, "Wrong size on BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList, RecentlyUnlockedAchievements) == 0x000000, "Member 'BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList::RecentlyUnlockedAchievements' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList, K2Node_DynamicCast_AsBP_Achievement_Recent_Unlocks_Panel) == 0x000038, "Member 'BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList::K2Node_DynamicCast_AsBP_Achievement_Recent_Unlocks_Panel' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_StatisticsAndAchievementView_C_BuildRecentUnlocksList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_StatisticsAndAchievementView.BP_StatisticsAndAchievementView_C.SetProgressBar
// 0x0078 (0x0078 - 0x0000)
struct BP_StatisticsAndAchievementView_C_SetProgressBar final
{
public:
	int32                                         UnlockedCount;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalCount;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StatisticsAndAchievementView_C_SetProgressBar) == 0x000008, "Wrong alignment on BP_StatisticsAndAchievementView_C_SetProgressBar");
static_assert(sizeof(BP_StatisticsAndAchievementView_C_SetProgressBar) == 0x000078, "Wrong size on BP_StatisticsAndAchievementView_C_SetProgressBar");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, UnlockedCount) == 0x000000, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::UnlockedCount' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, TotalCount) == 0x000004, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::TotalCount' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000018, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000038, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00006C, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StatisticsAndAchievementView_C_SetProgressBar, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'BP_StatisticsAndAchievementView_C_SetProgressBar::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

