#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkinToneButton

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_SkinToneButton.BP_SkinToneButton_C.ExecuteUbergraph_BP_SkinToneButton
// 0x0048 (0x0048 - 0x0000)
struct BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0034(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x003C(0x0008)(NoDestructor)
};
static_assert(alignof(BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton) == 0x000008, "Wrong alignment on BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton");
static_assert(sizeof(BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton) == 0x000048, "Wrong size on BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton");
static_assert(offsetof(BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton, EntryPoint) == 0x000000, "Member 'BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton, Temp_struct_Variable) == 0x000008, "Member 'BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton, Temp_delegate_Variable) == 0x000018, "Member 'BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000028, "Member 'BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton, CallFunc_PostAkEvent_ReturnValue) == 0x000030, "Member 'BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton, K2Node_Event_InFocusEvent_1) == 0x000034, "Member 'BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton, K2Node_Event_InFocusEvent) == 0x00003C, "Member 'BP_SkinToneButton_C_ExecuteUbergraph_BP_SkinToneButton::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function BP_SkinToneButton.BP_SkinToneButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_SkinToneButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_SkinToneButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on BP_SkinToneButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(BP_SkinToneButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on BP_SkinToneButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(BP_SkinToneButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'BP_SkinToneButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function BP_SkinToneButton.BP_SkinToneButton_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_SkinToneButton_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_SkinToneButton_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on BP_SkinToneButton_C_OnAddedToFocusPath");
static_assert(sizeof(BP_SkinToneButton_C_OnAddedToFocusPath) == 0x000008, "Wrong size on BP_SkinToneButton_C_OnAddedToFocusPath");
static_assert(offsetof(BP_SkinToneButton_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'BP_SkinToneButton_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

}

