#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ToiletSink

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ToiletSink.BP_ToiletSink_C
// 0x0018 (0x0238 - 0x0220)
class ABP_ToiletSink_C final : public AActor
{
public:
	class UStaticMeshComponent*                   RightHandle;                                       // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LeftHandle;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sink;                                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ToiletSink_C">();
	}
	static class ABP_ToiletSink_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ToiletSink_C>();
	}
};
static_assert(alignof(ABP_ToiletSink_C) == 0x000008, "Wrong alignment on ABP_ToiletSink_C");
static_assert(sizeof(ABP_ToiletSink_C) == 0x000238, "Wrong size on ABP_ToiletSink_C");
static_assert(offsetof(ABP_ToiletSink_C, RightHandle) == 0x000220, "Member 'ABP_ToiletSink_C::RightHandle' has a wrong offset!");
static_assert(offsetof(ABP_ToiletSink_C, LeftHandle) == 0x000228, "Member 'ABP_ToiletSink_C::LeftHandle' has a wrong offset!");
static_assert(offsetof(ABP_ToiletSink_C, Sink) == 0x000230, "Member 'ABP_ToiletSink_C::Sink' has a wrong offset!");

}

