#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_PlayTutorial

#include "Basic.hpp"


namespace SDK::Params
{

// Function bp_wi_PlayTutorial.bp_wi_PlayTutorial_C.ExecuteUbergraph_bp_wi_PlayTutorial
// 0x0008 (0x0008 - 0x0000)
struct bp_wi_PlayTutorial_C_ExecuteUbergraph_bp_wi_PlayTutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_PlayTutorial_C_ExecuteUbergraph_bp_wi_PlayTutorial) == 0x000004, "Wrong alignment on bp_wi_PlayTutorial_C_ExecuteUbergraph_bp_wi_PlayTutorial");
static_assert(sizeof(bp_wi_PlayTutorial_C_ExecuteUbergraph_bp_wi_PlayTutorial) == 0x000008, "Wrong size on bp_wi_PlayTutorial_C_ExecuteUbergraph_bp_wi_PlayTutorial");
static_assert(offsetof(bp_wi_PlayTutorial_C_ExecuteUbergraph_bp_wi_PlayTutorial, EntryPoint) == 0x000000, "Member 'bp_wi_PlayTutorial_C_ExecuteUbergraph_bp_wi_PlayTutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_PlayTutorial_C_ExecuteUbergraph_bp_wi_PlayTutorial, K2Node_Event_IsDesignTime) == 0x000004, "Member 'bp_wi_PlayTutorial_C_ExecuteUbergraph_bp_wi_PlayTutorial::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function bp_wi_PlayTutorial.bp_wi_PlayTutorial_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_PlayTutorial_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_PlayTutorial_C_PreConstruct) == 0x000001, "Wrong alignment on bp_wi_PlayTutorial_C_PreConstruct");
static_assert(sizeof(bp_wi_PlayTutorial_C_PreConstruct) == 0x000001, "Wrong size on bp_wi_PlayTutorial_C_PreConstruct");
static_assert(offsetof(bp_wi_PlayTutorial_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'bp_wi_PlayTutorial_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

