#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_Options

#include "Basic.hpp"

#include "AccelByteUe4Sdk_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_Options.bp_wi_Options_C.OnOptionsOpenVERegisterDialog__DelegateSignature
// 0x0120 (0x0120 - 0x0000)
struct bp_wi_Options_C_OnOptionsOpenVERegisterDialog__DelegateSignature final
{
public:
	struct FAccountUserData                       UserData;                                          // 0x0000(0x0120)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(bp_wi_Options_C_OnOptionsOpenVERegisterDialog__DelegateSignature) == 0x000008, "Wrong alignment on bp_wi_Options_C_OnOptionsOpenVERegisterDialog__DelegateSignature");
static_assert(sizeof(bp_wi_Options_C_OnOptionsOpenVERegisterDialog__DelegateSignature) == 0x000120, "Wrong size on bp_wi_Options_C_OnOptionsOpenVERegisterDialog__DelegateSignature");
static_assert(offsetof(bp_wi_Options_C_OnOptionsOpenVERegisterDialog__DelegateSignature, UserData) == 0x000000, "Member 'bp_wi_Options_C_OnOptionsOpenVERegisterDialog__DelegateSignature::UserData' has a wrong offset!");

// Function bp_wi_Options.bp_wi_Options_C.ExecuteUbergraph_bp_wi_Options
// 0x0A48 (0x0A48 - 0x0000)
struct bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccountUserData                       K2Node_CustomEvent_Result;                         // 0x0030(0x0120)(ConstParm)
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code;                           // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FAccountUserData& Result, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAccountUserData                       Temp_struct_Variable;                              // 0x0188(0x0120)()
	class UUserDataCallbackProxy*                 CallFunc_GetUserData_ReturnValue;                  // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_Message;                        // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x02E8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_1;                            // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTFriendImportByPlatformCallbackProxy* CallFunc_ImportFriendsByPlatform_ReturnValue;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AccelByteRedeemCodeWidget_C*        CallFunc_Create_ReturnValue;                       // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333[0x5];                                      // 0x0333(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserSettingsGIS*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0340(0x0010)(ZeroConstructor, NoDestructor)
	class UUserSettingsGIS*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0368(0x0028)()
	bool                                          Temp_bool_Variable_1;                              // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UButton*                                K2Node_CustomEvent_Active_Tab_Button;              // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_CustomEvent_Highlight_Image_1;              // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_CustomEvent_Highlight_Image;                // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_wi_OptionsVoice_C*                  CallFunc_Create_ReturnValue_1;                     // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C* CallFunc_Create_ReturnValue_2;                     // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      CallFunc_GetSupportedFullscreenResolutions_Resolutions; // 0x03E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSupportedFullscreenResolutions_ReturnValue; // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetScreenResolution_ReturnValue;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_2;         // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_2;        // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetHumanReadableResolution_ReturnValue;   // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetResolutionFromString_Resolution;       // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_1;         // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_1;        // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetFullscreenModeFromString_ReturnValue;  // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A[0x6];                                      // 0x045A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_3;        // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetFullscreenMode_ReturnValue;            // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47B[0x5];                                      // 0x047B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_3;           // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_4;        // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_5;        // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Array_Get_Item;                           // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetHumanReadableResolution_ReturnValue_1; // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_6;        // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVSyncEnabled_ReturnValue;               // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USCTGameUserSettings*                   CallFunc_GetSCTGameUserSettings_ReturnValue;       // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameUserSettings*                   CallFunc_GetSCTGameUserSettings_ReturnValue_1;     // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMasterSoundVolume_ReturnValue;         // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x04E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable_2;                              // 0x04E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_3;                              // 0x04E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x04E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 Temp_string_Variable_2;                            // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_3;                            // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EWindowMode                                   Temp_byte_Variable_4;                              // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_1;                           // 0x0528(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x3];                                      // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectionIndex;         // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_7;        // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetDesktopResolution_ReturnValue;         // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetHumanReadableResolution_ReturnValue_2; // 0x0580(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_8;        // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_9;        // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B2[0x6];                                      // 0x05B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x05B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C5[0x3];                                      // 0x05C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_1; // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x05D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9[0x3];                                      // 0x05E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UButton*                                CallFunc_Array_Get_Item_1;                         // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x05FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FB[0x1];                                      // 0x05FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x05FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0610(0x0028)()
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0640(0x0088)()
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x06C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitialLoadComplete_ReturnValue;          // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F2[0x2];                                      // 0x06F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x06F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_704[0x4];                                      // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0708(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0730(0x0088)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x07B8(0x0278)()
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptionsSave_SpecialOptionsSave; // 0x0A30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptionsSave_SpecialOptionsSave_1; // 0x0A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x0A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveGame_ReturnValue_1;                   // 0x0A41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue;             // 0x0A42(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options) == 0x000008, "Wrong alignment on bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options");
static_assert(sizeof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options) == 0x000A48, "Wrong size on bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, EntryPoint) == 0x000000, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CustomEvent_Message_3) == 0x000018, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CustomEvent_Message_3' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CustomEvent_Code_1) == 0x000028, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CustomEvent_Result) == 0x000030, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CustomEvent_Message_2) == 0x000150, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CustomEvent_Code) == 0x000160, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CreateDelegate_OutputDelegate_1) == 0x000164, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_int_Variable) == 0x000174, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_string_Variable) == 0x000178, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_struct_Variable) == 0x000188, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetUserData_ReturnValue) == 0x0002A8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetUserData_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_IsValid_ReturnValue) == 0x0002B0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CustomEvent_Message_1) == 0x0002B8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002C8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CustomEvent_Message) == 0x0002D8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002E8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_string_Variable_1) == 0x0002F8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_ImportFriendsByPlatform_ReturnValue) == 0x000308, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_ImportFriendsByPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_IsValid_ReturnValue_1) == 0x000310, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_int_Variable_1) == 0x000314, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_float_Variable) == 0x000318, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_float_Variable_1) == 0x00031C, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_float_Variable_2) == 0x000320, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_float_Variable_3) == 0x000324, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Create_ReturnValue) == 0x000328, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_bool_Variable) == 0x000330, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_byte_Variable) == 0x000331, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_byte_Variable_1) == 0x000332, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000338, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CreateDelegate_OutputDelegate_4) == 0x000340, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000350, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_int_Loop_Counter_Variable) == 0x000358, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x00035C, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Add_IntInt_ReturnValue) == 0x000360, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_MakeStruct_SlateColor) == 0x000368, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_bool_Variable_1) == 0x000390, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CustomEvent_Active_Tab_Button) == 0x000398, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CustomEvent_Active_Tab_Button' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CustomEvent_Highlight_Image_1) == 0x0003A0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CustomEvent_Highlight_Image_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_CustomEvent_Highlight_Image) == 0x0003A8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_CustomEvent_Highlight_Image' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_Event_IsDesignTime) == 0x0003B0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Array_Length_ReturnValue) == 0x0003B4, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Less_IntInt_ReturnValue) == 0x0003B8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetOwningPlayer_ReturnValue) == 0x0003C0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Create_ReturnValue_1) == 0x0003C8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0003D0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Create_ReturnValue_2) == 0x0003D8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0003E0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetSupportedFullscreenResolutions_Resolutions) == 0x0003E8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetSupportedFullscreenResolutions_Resolutions' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetSupportedFullscreenResolutions_ReturnValue) == 0x0003F8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetSupportedFullscreenResolutions_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Array_Length_ReturnValue_1) == 0x0003FC, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameUserSettings_ReturnValue) == 0x000400, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetScreenResolution_ReturnValue) == 0x000408, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetScreenResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_SelectedItem_2) == 0x000410, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_SelectedItem_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_SelectionType_2) == 0x000420, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_SelectionType_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetHumanReadableResolution_ReturnValue) == 0x000428, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetHumanReadableResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetResolutionFromString_Resolution) == 0x000438, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetResolutionFromString_Resolution' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000440, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_SelectedItem_1) == 0x000448, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_SelectionType_1) == 0x000458, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_SelectionType_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetFullscreenModeFromString_ReturnValue) == 0x000459, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetFullscreenModeFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x000460, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000468, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Not_PreBool_ReturnValue) == 0x000469, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameUserSettings_ReturnValue_3) == 0x000470, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetFullscreenMode_ReturnValue) == 0x000478, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetFullscreenMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000479, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Not_PreBool_ReturnValue_1) == 0x00047A, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000480, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_bool_Has_Been_Initd_Variable) == 0x000488, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_bIsChecked_3) == 0x000489, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_bIsChecked_3' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameUserSettings_ReturnValue_4) == 0x000490, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameUserSettings_ReturnValue_5) == 0x000498, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_IsValid_ReturnValue_2) == 0x0004A0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_int_Array_Index_Variable) == 0x0004A4, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Array_Get_Item) == 0x0004A8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetHumanReadableResolution_ReturnValue_1) == 0x0004B0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetHumanReadableResolution_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameUserSettings_ReturnValue_6) == 0x0004C0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_IsVSyncEnabled_ReturnValue) == 0x0004C8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_IsVSyncEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetSCTGameUserSettings_ReturnValue) == 0x0004D0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetSCTGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetSCTGameUserSettings_ReturnValue_1) == 0x0004D8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetSCTGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetMasterSoundVolume_ReturnValue) == 0x0004E0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetMasterSoundVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_bIsChecked_2) == 0x0004E4, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_bIsChecked_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_byte_Variable_2) == 0x0004E5, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_byte_Variable_3) == 0x0004E6, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_bool_Variable_2) == 0x0004E7, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_string_Variable_2) == 0x0004E8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_Select_Default) == 0x0004F8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_string_Variable_3) == 0x000500, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_string_Variable_4) == 0x000510, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_byte_Variable_4) == 0x000520, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_Select_Default_1) == 0x000528, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_IsValid_ReturnValue_3) == 0x000538, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_int_Loop_Counter_Variable_1) == 0x00053C, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_Value_2) == 0x000540, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Less_IntInt_ReturnValue_1) == 0x000544, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_Add_IntInt_ReturnValue_1) == 0x000548, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_SelectionIndex) == 0x00054C, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_SelectionIndex' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_SelectedItem) == 0x000550, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_SelectionType) == 0x000560, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_Select_Default_2) == 0x000564, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameUserSettings_ReturnValue_7) == 0x000568, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameUserSettings_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetDesktopResolution_ReturnValue) == 0x000570, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetDesktopResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x000578, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetHumanReadableResolution_ReturnValue_2) == 0x000580, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetHumanReadableResolution_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_bIsChecked) == 0x000590, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameUserSettings_ReturnValue_8) == 0x000598, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameUserSettings_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_IsValid_ReturnValue_4) == 0x0005A0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetGameUserSettings_ReturnValue_9) == 0x0005A8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetGameUserSettings_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_IsValid_ReturnValue_5) == 0x0005B0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, Temp_bool_IsClosed_Variable) == 0x0005B1, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x0005B8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_Value_1) == 0x0005C0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0005C4, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_SpawnAkComponentAtLocation_ReturnValue_1) == 0x0005C8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_SpawnAkComponentAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, K2Node_ComponentBoundEvent_Value) == 0x0005D0, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_GetCurrentLevelName_ReturnValue) == 0x0005D8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0005E8, "Member 'bp_wi_Options_C_ExecuteUbergraph_bp_wi_Options::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
