#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_Puzzle

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_Puzzle.bp_wi_Puzzle_C.ExecuteUbergraph_bp_wi_Puzzle
// 0x0288 (0x0288 - 0x0000)
struct bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_New_Locked;                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Jammed;                         // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_NeighbourSolutionSeed;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetCorrectSymbol_Correct_Symbol;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CorrectSymbolClicked;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool CorrectSymbolClicked)>    K2Node_CreateDelegate_OutputDelegate;              // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0150(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsOpening;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubpc_ac_Opener_C*                       CallFunc_GetOpener_ReturnValue;                    // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSolved_Return_Value;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsOpening)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x01D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x01E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01F8(0x0028)()
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Ubp_wi_Puzzle_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0248(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_wi_Puzzle_C*                        CallFunc_Array_Get_Item;                           // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle) == 0x000008, "Wrong alignment on bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle");
static_assert(sizeof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle) == 0x000288, "Wrong size on bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, EntryPoint) == 0x000000, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_byte_Variable) == 0x000004, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_byte_Variable_1) == 0x000005, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_int_Array_Index_Variable) == 0x000010, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_Event_IsDesignTime) == 0x000014, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_CustomEvent_New_Locked) == 0x000015, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_CustomEvent_New_Locked' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_CustomEvent_Jammed) == 0x000016, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_CustomEvent_Jammed' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Not_PreBool_ReturnValue) == 0x000017, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_CustomEvent_NeighbourSolutionSeed) == 0x000018, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_CustomEvent_NeighbourSolutionSeed' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_bool_Variable) == 0x00001C, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_MakeArray_Array) == 0x000068, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Format_ReturnValue) == 0x000078, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_bool_Variable_1) == 0x000091, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_GetCorrectSymbol_Correct_Symbol) == 0x000098, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_GetCorrectSymbol_Correct_Symbol' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_CustomEvent_CorrectSymbolClicked) == 0x0000A0, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_CustomEvent_CorrectSymbolClicked' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_bool_IsClosed_Variable) == 0x0000B4, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_int_Variable) == 0x0000B8, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Less_IntInt_ReturnValue) == 0x0000BC, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_Select_Default) == 0x0000BD, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_MakeStruct_FormatArgumentData_2) == 0x000100, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_MakeArray_Array_1) == 0x000140, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Format_ReturnValue_1) == 0x000150, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_bool_Variable_2) == 0x000168, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000169, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_Select_Default_1) == 0x000170, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_CustomEvent_IsOpening) == 0x000178, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_CustomEvent_IsOpening' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Not_PreBool_ReturnValue_1) == 0x000179, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_GetOpener_ReturnValue) == 0x000180, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_GetOpener_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_IsValid_ReturnValue) == 0x000188, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_IsSolved_Return_Value) == 0x000189, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_IsSolved_Return_Value' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_CreateDelegate_OutputDelegate_1) == 0x00018C, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_CreateDelegate_OutputDelegate_2) == 0x00019C, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001B0, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0001B8, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_struct_Variable) == 0x0001C0, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_BooleanOR_ReturnValue) == 0x0001D0, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, Temp_bool_Variable_3) == 0x0001D1, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_Select_Default_2) == 0x0001D4, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_Select_Default_3) == 0x0001E4, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_MakeStruct_SlateColor) == 0x0001F8, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000220, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_GetPlayerController_ReturnValue) == 0x000228, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000230, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_PostEventAtLocation_ReturnValue) == 0x00023C, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x000240, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000248, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_GetPlayerController_ReturnValue_1) == 0x000258, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Array_Get_Item) == 0x000260, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_K2_GetPawn_ReturnValue) == 0x000268, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000270, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Array_Length_ReturnValue) == 0x00027C, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle, CallFunc_Less_IntInt_ReturnValue_1) == 0x000280, "Member 'bp_wi_Puzzle_C_ExecuteUbergraph_bp_wi_Puzzle::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function bp_wi_Puzzle.bp_wi_Puzzle_C.HandleOpenStateChanged
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_Puzzle_C_HandleOpenStateChanged final
{
public:
	bool                                          IsOpening;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_Puzzle_C_HandleOpenStateChanged) == 0x000001, "Wrong alignment on bp_wi_Puzzle_C_HandleOpenStateChanged");
static_assert(sizeof(bp_wi_Puzzle_C_HandleOpenStateChanged) == 0x000001, "Wrong size on bp_wi_Puzzle_C_HandleOpenStateChanged");
static_assert(offsetof(bp_wi_Puzzle_C_HandleOpenStateChanged, IsOpening) == 0x000000, "Member 'bp_wi_Puzzle_C_HandleOpenStateChanged::IsOpening' has a wrong offset!");

// Function bp_wi_Puzzle.bp_wi_Puzzle_C.HandleOptionSymbolClicked
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_Puzzle_C_HandleOptionSymbolClicked final
{
public:
	bool                                          CorrectSymbolClicked;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_Puzzle_C_HandleOptionSymbolClicked) == 0x000001, "Wrong alignment on bp_wi_Puzzle_C_HandleOptionSymbolClicked");
static_assert(sizeof(bp_wi_Puzzle_C_HandleOptionSymbolClicked) == 0x000001, "Wrong size on bp_wi_Puzzle_C_HandleOptionSymbolClicked");
static_assert(offsetof(bp_wi_Puzzle_C_HandleOptionSymbolClicked, CorrectSymbolClicked) == 0x000000, "Member 'bp_wi_Puzzle_C_HandleOptionSymbolClicked::CorrectSymbolClicked' has a wrong offset!");

// Function bp_wi_Puzzle.bp_wi_Puzzle_C.RevealRoomSymbolBySeed
// 0x0004 (0x0004 - 0x0000)
struct bp_wi_Puzzle_C_RevealRoomSymbolBySeed final
{
public:
	int32                                         NeighbourSolutionSeed_0;                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_Puzzle_C_RevealRoomSymbolBySeed) == 0x000004, "Wrong alignment on bp_wi_Puzzle_C_RevealRoomSymbolBySeed");
static_assert(sizeof(bp_wi_Puzzle_C_RevealRoomSymbolBySeed) == 0x000004, "Wrong size on bp_wi_Puzzle_C_RevealRoomSymbolBySeed");
static_assert(offsetof(bp_wi_Puzzle_C_RevealRoomSymbolBySeed, NeighbourSolutionSeed_0) == 0x000000, "Member 'bp_wi_Puzzle_C_RevealRoomSymbolBySeed::NeighbourSolutionSeed_0' has a wrong offset!");

// Function bp_wi_Puzzle.bp_wi_Puzzle_C.SetLocked
// 0x0002 (0x0002 - 0x0000)
struct bp_wi_Puzzle_C_SetLocked final
{
public:
	bool                                          New_Locked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Jammed;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_Puzzle_C_SetLocked) == 0x000001, "Wrong alignment on bp_wi_Puzzle_C_SetLocked");
static_assert(sizeof(bp_wi_Puzzle_C_SetLocked) == 0x000002, "Wrong size on bp_wi_Puzzle_C_SetLocked");
static_assert(offsetof(bp_wi_Puzzle_C_SetLocked, New_Locked) == 0x000000, "Member 'bp_wi_Puzzle_C_SetLocked::New_Locked' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_SetLocked, Jammed) == 0x000001, "Member 'bp_wi_Puzzle_C_SetLocked::Jammed' has a wrong offset!");

// Function bp_wi_Puzzle.bp_wi_Puzzle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_Puzzle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_Puzzle_C_PreConstruct) == 0x000001, "Wrong alignment on bp_wi_Puzzle_C_PreConstruct");
static_assert(sizeof(bp_wi_Puzzle_C_PreConstruct) == 0x000001, "Wrong size on bp_wi_Puzzle_C_PreConstruct");
static_assert(offsetof(bp_wi_Puzzle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'bp_wi_Puzzle_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function bp_wi_Puzzle.bp_wi_Puzzle_C.BlockOtherWidgets
// 0x0010 (0x0010 - 0x0000)
struct bp_wi_Puzzle_C_BlockOtherWidgets final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(bp_wi_Puzzle_C_BlockOtherWidgets) == 0x000004, "Wrong alignment on bp_wi_Puzzle_C_BlockOtherWidgets");
static_assert(sizeof(bp_wi_Puzzle_C_BlockOtherWidgets) == 0x000010, "Wrong size on bp_wi_Puzzle_C_BlockOtherWidgets");
static_assert(offsetof(bp_wi_Puzzle_C_BlockOtherWidgets, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'bp_wi_Puzzle_C_BlockOtherWidgets::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function bp_wi_Puzzle.bp_wi_Puzzle_C.IsSolved
// 0x0018 (0x0018 - 0x0000)
struct bp_wi_Puzzle_C_IsSolved final
{
public:
	bool                                          Return_Value;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubpc_ac_Opener_C*                       CallFunc_GetOpener_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_Puzzle_C_IsSolved) == 0x000008, "Wrong alignment on bp_wi_Puzzle_C_IsSolved");
static_assert(sizeof(bp_wi_Puzzle_C_IsSolved) == 0x000018, "Wrong size on bp_wi_Puzzle_C_IsSolved");
static_assert(offsetof(bp_wi_Puzzle_C_IsSolved, Return_Value) == 0x000000, "Member 'bp_wi_Puzzle_C_IsSolved::Return_Value' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_IsSolved, CallFunc_GetOpener_ReturnValue) == 0x000008, "Member 'bp_wi_Puzzle_C_IsSolved::CallFunc_GetOpener_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_IsSolved, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'bp_wi_Puzzle_C_IsSolved::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function bp_wi_Puzzle.bp_wi_Puzzle_C.GetOpener
// 0x0028 (0x0028 - 0x0000)
struct bp_wi_Puzzle_C_GetOpener final
{
public:
	class Ubpc_ac_Opener_C*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubpc_ac_Opener_C*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_Puzzle_C_GetOpener) == 0x000008, "Wrong alignment on bp_wi_Puzzle_C_GetOpener");
static_assert(sizeof(bp_wi_Puzzle_C_GetOpener) == 0x000028, "Wrong size on bp_wi_Puzzle_C_GetOpener");
static_assert(offsetof(bp_wi_Puzzle_C_GetOpener, ReturnValue) == 0x000000, "Member 'bp_wi_Puzzle_C_GetOpener::ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_GetOpener, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'bp_wi_Puzzle_C_GetOpener::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Puzzle_C_GetOpener, K2Node_DynamicCast_AsActor) == 0x000010, "Member 'bp_wi_Puzzle_C_GetOpener::K2Node_DynamicCast_AsActor' has a wrong offset!");
