#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_DiscordButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_DiscordButton.bp_wi_DiscordButton_C.ExecuteUbergraph_bp_wi_DiscordButton
// 0x0068 (0x0068 - 0x0000)
struct bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton) == 0x000008, "Wrong alignment on bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton");
static_assert(sizeof(bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton) == 0x000068, "Wrong size on bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton");
static_assert(offsetof(bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton, EntryPoint) == 0x000000, "Member 'bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000058, "Member 'bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton, CallFunc_SpawnAkComponentAtLocation_ReturnValue_1) == 0x000060, "Member 'bp_wi_DiscordButton_C_ExecuteUbergraph_bp_wi_DiscordButton::CallFunc_SpawnAkComponentAtLocation_ReturnValue_1' has a wrong offset!");

}

