#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_HomeGuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_HomeGuest.bp_wi_HomeGuest_C
// 0x0090 (0x02F0 - 0x0260)
class Ubp_wi_HomeGuest_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UMenuButton*                            MenuButton_Customization;                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_HowToWin;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Options;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Quit;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Tutorial;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFindGameClicked;                                 // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnQuitGameClicked;                                 // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPlayTutorialClicked;                             // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnOptionsClicked;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCostomizationClicked;                            // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnRulesClicked;                                    // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnFindGameClicked__DelegateSignature();
	void OnQuitGameClicked__DelegateSignature();
	void OnPlayTutorialClicked__DelegateSignature();
	void OnOptionsClicked__DelegateSignature();
	void OnCostomizationClicked__DelegateSignature();
	void OnRulesClicked__DelegateSignature();
	void ExecuteUbergraph_bp_wi_HomeGuest(int32 EntryPoint);
	void BndEvt__MenuButton_HowToWin_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MenuButton_Tutorial_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MenuButton_Quit_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MenuButton_Options_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MenuButton_Customization_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_HomeGuest_C">();
	}
	static class Ubp_wi_HomeGuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_HomeGuest_C>();
	}
};
static_assert(alignof(Ubp_wi_HomeGuest_C) == 0x000008, "Wrong alignment on Ubp_wi_HomeGuest_C");
static_assert(sizeof(Ubp_wi_HomeGuest_C) == 0x0002F0, "Wrong size on Ubp_wi_HomeGuest_C");
static_assert(offsetof(Ubp_wi_HomeGuest_C, UberGraphFrame) == 0x000260, "Member 'Ubp_wi_HomeGuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, MenuButton_Customization) == 0x000268, "Member 'Ubp_wi_HomeGuest_C::MenuButton_Customization' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, MenuButton_HowToWin) == 0x000270, "Member 'Ubp_wi_HomeGuest_C::MenuButton_HowToWin' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, MenuButton_Options) == 0x000278, "Member 'Ubp_wi_HomeGuest_C::MenuButton_Options' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, MenuButton_Quit) == 0x000280, "Member 'Ubp_wi_HomeGuest_C::MenuButton_Quit' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, MenuButton_Tutorial) == 0x000288, "Member 'Ubp_wi_HomeGuest_C::MenuButton_Tutorial' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, OnFindGameClicked) == 0x000290, "Member 'Ubp_wi_HomeGuest_C::OnFindGameClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, OnQuitGameClicked) == 0x0002A0, "Member 'Ubp_wi_HomeGuest_C::OnQuitGameClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, OnPlayTutorialClicked) == 0x0002B0, "Member 'Ubp_wi_HomeGuest_C::OnPlayTutorialClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, OnOptionsClicked) == 0x0002C0, "Member 'Ubp_wi_HomeGuest_C::OnOptionsClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, OnCostomizationClicked) == 0x0002D0, "Member 'Ubp_wi_HomeGuest_C::OnCostomizationClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_HomeGuest_C, OnRulesClicked) == 0x0002E0, "Member 'Ubp_wi_HomeGuest_C::OnRulesClicked' has a wrong offset!");

}

