#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_AccelByte_ProtoMinusFriendCard

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.ExecuteUbergraph_bp_wi_AccelByte_Proto-FriendCard
// 0x0368 (0x0368 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_FriendId_4;                     // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_8;                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& FriendId, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_7;                      // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_FriendId_3;                     // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_6;                      // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& FriendId, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_2;                            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_5;                      // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_FriendId_2;                     // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_4;                      // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& FriendId, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_4;                            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_FriendId_1;                     // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& FriendId, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_6;                            // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_7;                            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_FriendId;                       // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message;                        // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& FriendId, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_8;                            // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_9;                            // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_PlayerId_1;                     // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& PlayerId)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0228(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_PlayerId;                       // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& PlayerId)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_10;                           // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_9;                      // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTFriendManagementAsyncProxy*         CallFunc_InviteFriend_ReturnValue;                 // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTFriendManagementAsyncProxy*         CallFunc_RemoveFriend_ReturnValue;                 // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x02B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTFriendManagementAsyncProxy*         CallFunc_CancelInviteFriend_ReturnValue;           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTFriendManagementAsyncProxy*         CallFunc_AcceptInviteFriend_ReturnValue;           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTFriendManagementAsyncProxy*         CallFunc_RejectInviteFriend_ReturnValue;           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_wi_AccelByte_ProtoMinusFriends_C*   K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends; // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_wi_AccelByte_ProtoMinusFriends_C*   K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_1; // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_wi_AccelByte_ProtoMinusFriends_C*   K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_2; // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_wi_AccelByte_ProtoMinusFriends_C*   K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_3; // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_wi_AccelByte_ProtoMinusFriends_C*   K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_4; // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFriendCardWidget*                      K2Node_DynamicCast_AsFriend_Card_Widget;           // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyManagementCallbackProxy*       CallFunc_InviteUserToParty_ReturnValue;            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard) == 0x000368, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, EntryPoint) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_FriendId_4) == 0x000008, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_FriendId_4' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_Message_8) == 0x000018, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_Message_8' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable) == 0x000038, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable_1) == 0x000048, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_Message_7) == 0x000058, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_Message_7' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_FriendId_3) == 0x000078, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_FriendId_3' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_Message_6) == 0x000088, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_Message_6' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable_2) == 0x0000A8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable_3) == 0x0000B8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_Message_5) == 0x0000C8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_Message_5' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_FriendId_2) == 0x0000E8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_FriendId_2' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_Message_4) == 0x0000F8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_Message_4' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_4) == 0x000108, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable_4) == 0x000118, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable_5) == 0x000128, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_Message_3) == 0x000138, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_Message_3' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_5) == 0x000148, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_FriendId_1) == 0x000158, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_FriendId_1' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_Message_2) == 0x000168, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_6) == 0x000178, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable_6) == 0x000188, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable_6' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable_7) == 0x000198, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable_7' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_Message_1) == 0x0001A8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001B8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_FriendId) == 0x0001C8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_FriendId' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_Message) == 0x0001D8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001E8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable_8) == 0x0001F8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable_8' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable_9) == 0x000208, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable_9' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_PlayerId_1) == 0x000218, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_PlayerId_1' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_9) == 0x000228, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_PlayerId) == 0x000238, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_PlayerId' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_10) == 0x000248, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, Temp_string_Variable_10) == 0x000258, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::Temp_string_Variable_10' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_Concat_StrStr_ReturnValue) == 0x000268, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000278, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CustomEvent_Message_9) == 0x000288, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CustomEvent_Message_9' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_InviteFriend_ReturnValue) == 0x000298, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_InviteFriend_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_IsValid_ReturnValue) == 0x0002A0, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_RemoveFriend_ReturnValue) == 0x0002A8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_RemoveFriend_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_IsValid_ReturnValue_1) == 0x0002B0, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_CreateDelegate_OutputDelegate_11) == 0x0002B4, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_CancelInviteFriend_ReturnValue) == 0x0002C8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_CancelInviteFriend_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_IsValid_ReturnValue_2) == 0x0002D0, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_AcceptInviteFriend_ReturnValue) == 0x0002D8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_AcceptInviteFriend_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_RejectInviteFriend_ReturnValue) == 0x0002E0, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_RejectInviteFriend_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_IsValid_ReturnValue_3) == 0x0002E8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_IsValid_ReturnValue_4) == 0x0002E9, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends) == 0x0002F0, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_bSuccess) == 0x0002F8, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_1) == 0x000300, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_1' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_bSuccess_1) == 0x000308, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_2) == 0x000310, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_2' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_bSuccess_2) == 0x000318, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_3) == 0x000320, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_3' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_bSuccess_3) == 0x000328, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_Event_ListItemObject) == 0x000330, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_4) == 0x000338, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends_4' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_bSuccess_4) == 0x000340, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_AsFriend_Card_Widget) == 0x000348, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_AsFriend_Card_Widget' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, K2Node_DynamicCast_bSuccess_5) == 0x000350, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000351, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_InviteUserToParty_ReturnValue) == 0x000358, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_InviteUserToParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard, CallFunc_IsValid_ReturnValue_5) == 0x000360, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnListItemObjectSet");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnListItemObjectSet) == 0x000008, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnListItemObjectSet");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnSuccess_1DFA34E146B2B77F2AFDECB341F959EE
// 0x0010 (0x0010 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFA34E146B2B77F2AFDECB341F959EE final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFA34E146B2B77F2AFDECB341F959EE) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFA34E146B2B77F2AFDECB341F959EE");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFA34E146B2B77F2AFDECB341F959EE) == 0x000010, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFA34E146B2B77F2AFDECB341F959EE");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFA34E146B2B77F2AFDECB341F959EE, PlayerId) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFA34E146B2B77F2AFDECB341F959EE::PlayerId' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnFail_1DFA34E146B2B77F2AFDECB341F959EE
// 0x0010 (0x0010 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnFail_1DFA34E146B2B77F2AFDECB341F959EE final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnFail_1DFA34E146B2B77F2AFDECB341F959EE) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnFail_1DFA34E146B2B77F2AFDECB341F959EE");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnFail_1DFA34E146B2B77F2AFDECB341F959EE) == 0x000010, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnFail_1DFA34E146B2B77F2AFDECB341F959EE");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnFail_1DFA34E146B2B77F2AFDECB341F959EE, PlayerId) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnFail_1DFA34E146B2B77F2AFDECB341F959EE::PlayerId' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnSuccess_45BCFC1742304A757FB20697B60D9BB2
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_45BCFC1742304A757FB20697B60D9BB2 final
{
public:
	class FString                                 FriendId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_45BCFC1742304A757FB20697B60D9BB2) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_45BCFC1742304A757FB20697B60D9BB2");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_45BCFC1742304A757FB20697B60D9BB2) == 0x000020, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_45BCFC1742304A757FB20697B60D9BB2");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_45BCFC1742304A757FB20697B60D9BB2, FriendId) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_45BCFC1742304A757FB20697B60D9BB2::FriendId' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_45BCFC1742304A757FB20697B60D9BB2, Message) == 0x000010, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_45BCFC1742304A757FB20697B60D9BB2::Message' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnError_45BCFC1742304A757FB20697B60D9BB2
// 0x0010 (0x0010 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_45BCFC1742304A757FB20697B60D9BB2 final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_45BCFC1742304A757FB20697B60D9BB2) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_45BCFC1742304A757FB20697B60D9BB2");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_45BCFC1742304A757FB20697B60D9BB2) == 0x000010, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_45BCFC1742304A757FB20697B60D9BB2");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_45BCFC1742304A757FB20697B60D9BB2, Message) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_45BCFC1742304A757FB20697B60D9BB2::Message' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnSuccess_322255044CCBD8E40AD2DBA147711004
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_322255044CCBD8E40AD2DBA147711004 final
{
public:
	class FString                                 FriendId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_322255044CCBD8E40AD2DBA147711004) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_322255044CCBD8E40AD2DBA147711004");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_322255044CCBD8E40AD2DBA147711004) == 0x000020, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_322255044CCBD8E40AD2DBA147711004");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_322255044CCBD8E40AD2DBA147711004, FriendId) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_322255044CCBD8E40AD2DBA147711004::FriendId' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_322255044CCBD8E40AD2DBA147711004, Message) == 0x000010, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_322255044CCBD8E40AD2DBA147711004::Message' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnError_322255044CCBD8E40AD2DBA147711004
// 0x0010 (0x0010 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_322255044CCBD8E40AD2DBA147711004 final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_322255044CCBD8E40AD2DBA147711004) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_322255044CCBD8E40AD2DBA147711004");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_322255044CCBD8E40AD2DBA147711004) == 0x000010, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_322255044CCBD8E40AD2DBA147711004");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_322255044CCBD8E40AD2DBA147711004, Message) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_322255044CCBD8E40AD2DBA147711004::Message' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnSuccess_1DFD265E48D7D3352C811590D78BBAB4
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFD265E48D7D3352C811590D78BBAB4 final
{
public:
	class FString                                 FriendId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFD265E48D7D3352C811590D78BBAB4) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFD265E48D7D3352C811590D78BBAB4");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFD265E48D7D3352C811590D78BBAB4) == 0x000020, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFD265E48D7D3352C811590D78BBAB4");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFD265E48D7D3352C811590D78BBAB4, FriendId) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFD265E48D7D3352C811590D78BBAB4::FriendId' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFD265E48D7D3352C811590D78BBAB4, Message) == 0x000010, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_1DFD265E48D7D3352C811590D78BBAB4::Message' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnError_1DFD265E48D7D3352C811590D78BBAB4
// 0x0010 (0x0010 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_1DFD265E48D7D3352C811590D78BBAB4 final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_1DFD265E48D7D3352C811590D78BBAB4) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_1DFD265E48D7D3352C811590D78BBAB4");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_1DFD265E48D7D3352C811590D78BBAB4) == 0x000010, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_1DFD265E48D7D3352C811590D78BBAB4");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_1DFD265E48D7D3352C811590D78BBAB4, Message) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_1DFD265E48D7D3352C811590D78BBAB4::Message' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnSuccess_6C6870594DFCF1D4AD5173BEE981C927
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_6C6870594DFCF1D4AD5173BEE981C927 final
{
public:
	class FString                                 FriendId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_6C6870594DFCF1D4AD5173BEE981C927) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_6C6870594DFCF1D4AD5173BEE981C927");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_6C6870594DFCF1D4AD5173BEE981C927) == 0x000020, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_6C6870594DFCF1D4AD5173BEE981C927");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_6C6870594DFCF1D4AD5173BEE981C927, FriendId) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_6C6870594DFCF1D4AD5173BEE981C927::FriendId' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_6C6870594DFCF1D4AD5173BEE981C927, Message) == 0x000010, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_6C6870594DFCF1D4AD5173BEE981C927::Message' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnError_6C6870594DFCF1D4AD5173BEE981C927
// 0x0010 (0x0010 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_6C6870594DFCF1D4AD5173BEE981C927 final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_6C6870594DFCF1D4AD5173BEE981C927) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_6C6870594DFCF1D4AD5173BEE981C927");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_6C6870594DFCF1D4AD5173BEE981C927) == 0x000010, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_6C6870594DFCF1D4AD5173BEE981C927");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_6C6870594DFCF1D4AD5173BEE981C927, Message) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_6C6870594DFCF1D4AD5173BEE981C927::Message' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnSuccess_582972C449865D99531660A0E33CA6A8
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_582972C449865D99531660A0E33CA6A8 final
{
public:
	class FString                                 FriendId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_582972C449865D99531660A0E33CA6A8) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_582972C449865D99531660A0E33CA6A8");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_582972C449865D99531660A0E33CA6A8) == 0x000020, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_582972C449865D99531660A0E33CA6A8");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_582972C449865D99531660A0E33CA6A8, FriendId) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_582972C449865D99531660A0E33CA6A8::FriendId' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_582972C449865D99531660A0E33CA6A8, Message) == 0x000010, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnSuccess_582972C449865D99531660A0E33CA6A8::Message' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.OnError_582972C449865D99531660A0E33CA6A8
// 0x0010 (0x0010 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_582972C449865D99531660A0E33CA6A8 final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_582972C449865D99531660A0E33CA6A8) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_582972C449865D99531660A0E33CA6A8");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_582972C449865D99531660A0E33CA6A8) == 0x000010, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_582972C449865D99531660A0E33CA6A8");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_582972C449865D99531660A0E33CA6A8, Message) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_OnError_582972C449865D99531660A0E33CA6A8::Message' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.Set Header
// 0x0002 (0x0002 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Header final
{
public:
	EFFCTFriendListType                           ListType_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Header) == 0x000001, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Header");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Header) == 0x000002, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Header");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Header, ListType_0) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Header::ListType_0' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Header, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Header::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.Set Profile
// 0x0048 (0x0048 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile final
{
public:
	class FString                                 DisplayName_0;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 UserId_0;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EFFCTFriendListType                           ListType_0;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Online_status;                                     // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile");
static_assert(sizeof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile) == 0x000048, "Wrong size on bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile, DisplayName_0) == 0x000000, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile::DisplayName_0' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile, UserId_0) == 0x000010, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile::UserId_0' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile, ListType_0) == 0x000020, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile::ListType_0' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile, Online_status) == 0x000021, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile::Online_status' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile, CallFunc_GetValidValue_ReturnValue) == 0x000022, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile, K2Node_SwitchEnum_CmpSuccess_1) == 0x000041, "Member 'bp_wi_AccelByte_ProtoMinusFriendCard_C_Set_Profile::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C.WriteLog
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_AccelByte_ProtoMinusFriendCard_C_WriteLog final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class Ubp_wi_AccelByte_ProtoMinusFriends_C*   K2Node_DynamicCast_AsBp_Wi_Accel_Byte_Proto__Friends; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_AccelByte_ProtoMinusFriendCard_C_WriteLog) == 0x000008, "Wrong alignment on bp_wi_AccelByte_ProtoMinusFriendCard_C_WriteLog");
