#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_VoiceSettingWelcomeMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_VoiceSettingWelcomeMenu.bp_wi_VoiceSettingWelcomeMenu_C
// 0x0088 (0x02E8 - 0x0260)
class Ubp_wi_VoiceSettingWelcomeMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Background;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C* bp_wi_DoNotShowWelcomeVoiceOptionsAgain;           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Ubp_wi_OptionsVoice_C*                  bp_wi_OptionsVoice;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_146;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_200;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_201;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_267;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_327;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_513;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Headphones;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Microphone;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULanguageWI_C*                          LanguageWI;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Continue;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_WelcomeScreen;                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bp_wi_VoiceSettingWelcomeMenu(int32 EntryPoint);
	void Construct();
	void BndEvt__MenuButton_3_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_VoiceSettingWelcomeMenu_C">();
	}
	static class Ubp_wi_VoiceSettingWelcomeMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_VoiceSettingWelcomeMenu_C>();
	}
};
static_assert(alignof(Ubp_wi_VoiceSettingWelcomeMenu_C) == 0x000008, "Wrong alignment on Ubp_wi_VoiceSettingWelcomeMenu_C");
static_assert(sizeof(Ubp_wi_VoiceSettingWelcomeMenu_C) == 0x0002E8, "Wrong size on Ubp_wi_VoiceSettingWelcomeMenu_C");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, UberGraphFrame) == 0x000260, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Background) == 0x000268, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Background' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, bp_wi_DoNotShowWelcomeVoiceOptionsAgain) == 0x000270, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::bp_wi_DoNotShowWelcomeVoiceOptionsAgain' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, bp_wi_OptionsVoice) == 0x000278, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::bp_wi_OptionsVoice' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Image) == 0x000280, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Image' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Image_1) == 0x000288, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Image_1' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Image_146) == 0x000290, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Image_146' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Image_200) == 0x000298, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Image_200' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Image_201) == 0x0002A0, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Image_201' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Image_267) == 0x0002A8, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Image_267' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Image_327) == 0x0002B0, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Image_327' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Image_513) == 0x0002B8, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Image_513' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Img_Headphones) == 0x0002C0, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Img_Headphones' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, Img_Microphone) == 0x0002C8, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::Img_Microphone' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, LanguageWI) == 0x0002D0, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::LanguageWI' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, MenuButton_Continue) == 0x0002D8, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::MenuButton_Continue' has a wrong offset!");
static_assert(offsetof(Ubp_wi_VoiceSettingWelcomeMenu_C, VerticalBox_WelcomeScreen) == 0x0002E0, "Member 'Ubp_wi_VoiceSettingWelcomeMenu_C::VerticalBox_WelcomeScreen' has a wrong offset!");

}

