#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_StartScreenGuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_StartScreenTabs_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_StartScreenGuest.bp_wi_StartScreenGuest_C
// 0x0138 (0x0398 - 0x0260)
class Ubp_wi_StartScreenGuest_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       FadeInPlayImage;                                   // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInVideoCanvas;                                 // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AlphaBuildImage;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg_side;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg_vignette;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Ubp_wi_EnterAvatarName_C*               bp_wi_EnterAvatarName_115;                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                But_CloseVideo;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                But_PlayVideo;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            FeedbackButton;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Ubp_wi_HomeGuest_C*                     GuestHomeTAB;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_61;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_633;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_PlayPause;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MainSwitcher;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Ubp_wi_Options_C*                       OptionsTAB;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            PatchNotesButton;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerProfileMainMenu_BP_C*            PlayerProfileMainMenu_BP;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Ubp_wi_PlayTutorial_C*                  PlayTutorialTAB;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ReadVersionID;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Throbber_MatchmakerSearching;                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Title;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           VideoPlayerCanvas;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_StartMenuTabs;                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UObject*>                        SessionBUttonList;                                 // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AAudioMenu_C*                           AudioPlayer;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           MenuSound;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RulesButtonClicked;                                // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            NewVar_0;                                          // 0x0358(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShowPatchNotes;                                    // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnChangeTab;                                       // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnChangeTab__DelegateSignature(E_StartScreenTabs Tab);
	void ExecuteUbergraph_bp_wi_StartScreenGuest(int32 EntryPoint);
	void Construct();
	void SetVersionIDField();
	void BndEvt__PatchNotesButton_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_213_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void Set_Video_Play_Img_Invisible();
	void Set_Video_Play_Img_Visible();
	void BndEvt__But_PlayVideo_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__But_PlayVideo_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature();
	void Play_Video();
	void Pause_Video();
	void BndEvt__HomeTAB_K2Node_ComponentBoundEvent_8_OnRulesClicked__DelegateSignature();
	void BndEvt__FeedbackButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__bp_wi_PlayTutorial_K2Node_ComponentBoundEvent_5_OnBackClicked__DelegateSignature();
	void VideoFinished();
	void BndEvt__PlayVideo_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__OptionsTAB_K2Node_ComponentBoundEvent_1_OnBackClicked__DelegateSignature();
	void BndEvt__HomeUC_K2Node_ComponentBoundEvent_0_OnPlayTutorialClicked__DelegateSignature();
	void BndEvt__bp_wi_Home_K2Node_ComponentBoundEvent_6_OnFindGameClicked__DelegateSignature();
	void BndEvt__bp_wi_Home_K2Node_ComponentBoundEvent_7_OnQuitGameClicked__DelegateSignature();
	void BndEvt__bp_wi_Home_K2Node_ComponentBoundEvent_9_OnOptionsClicked__DelegateSignature();
	void ChangeTAB(E_StartScreenTabs Start_Screen_Tab_State);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_StartScreenGuest_C">();
	}
	static class Ubp_wi_StartScreenGuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_StartScreenGuest_C>();
	}
};
static_assert(alignof(Ubp_wi_StartScreenGuest_C) == 0x000008, "Wrong alignment on Ubp_wi_StartScreenGuest_C");
static_assert(sizeof(Ubp_wi_StartScreenGuest_C) == 0x000398, "Wrong size on Ubp_wi_StartScreenGuest_C");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, UberGraphFrame) == 0x000260, "Member 'Ubp_wi_StartScreenGuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, FadeInPlayImage) == 0x000268, "Member 'Ubp_wi_StartScreenGuest_C::FadeInPlayImage' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, FadeInVideoCanvas) == 0x000270, "Member 'Ubp_wi_StartScreenGuest_C::FadeInVideoCanvas' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, AlphaBuildImage) == 0x000278, "Member 'Ubp_wi_StartScreenGuest_C::AlphaBuildImage' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, Background) == 0x000280, "Member 'Ubp_wi_StartScreenGuest_C::Background' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, bg_side) == 0x000288, "Member 'Ubp_wi_StartScreenGuest_C::bg_side' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, bg_vignette) == 0x000290, "Member 'Ubp_wi_StartScreenGuest_C::bg_vignette' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, bp_wi_EnterAvatarName_115) == 0x000298, "Member 'Ubp_wi_StartScreenGuest_C::bp_wi_EnterAvatarName_115' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, But_CloseVideo) == 0x0002A0, "Member 'Ubp_wi_StartScreenGuest_C::But_CloseVideo' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, But_PlayVideo) == 0x0002A8, "Member 'Ubp_wi_StartScreenGuest_C::But_PlayVideo' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, FeedbackButton) == 0x0002B0, "Member 'Ubp_wi_StartScreenGuest_C::FeedbackButton' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, GuestHomeTAB) == 0x0002B8, "Member 'Ubp_wi_StartScreenGuest_C::GuestHomeTAB' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, Image_61) == 0x0002C0, "Member 'Ubp_wi_StartScreenGuest_C::Image_61' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, Image_633) == 0x0002C8, "Member 'Ubp_wi_StartScreenGuest_C::Image_633' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, Img_PlayPause) == 0x0002D0, "Member 'Ubp_wi_StartScreenGuest_C::Img_PlayPause' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, MainSwitcher) == 0x0002D8, "Member 'Ubp_wi_StartScreenGuest_C::MainSwitcher' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, OptionsTAB) == 0x0002E0, "Member 'Ubp_wi_StartScreenGuest_C::OptionsTAB' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, PatchNotesButton) == 0x0002E8, "Member 'Ubp_wi_StartScreenGuest_C::PatchNotesButton' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, PlayerProfileMainMenu_BP) == 0x0002F0, "Member 'Ubp_wi_StartScreenGuest_C::PlayerProfileMainMenu_BP' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, PlayTutorialTAB) == 0x0002F8, "Member 'Ubp_wi_StartScreenGuest_C::PlayTutorialTAB' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, Text_ReadVersionID) == 0x000300, "Member 'Ubp_wi_StartScreenGuest_C::Text_ReadVersionID' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, Throbber_MatchmakerSearching) == 0x000308, "Member 'Ubp_wi_StartScreenGuest_C::Throbber_MatchmakerSearching' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, Title) == 0x000310, "Member 'Ubp_wi_StartScreenGuest_C::Title' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, VideoPlayerCanvas) == 0x000318, "Member 'Ubp_wi_StartScreenGuest_C::VideoPlayerCanvas' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, WidgetSwitcher_StartMenuTabs) == 0x000320, "Member 'Ubp_wi_StartScreenGuest_C::WidgetSwitcher_StartMenuTabs' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, SessionBUttonList) == 0x000328, "Member 'Ubp_wi_StartScreenGuest_C::SessionBUttonList' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, AudioPlayer) == 0x000338, "Member 'Ubp_wi_StartScreenGuest_C::AudioPlayer' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, MediaPlayer) == 0x000340, "Member 'Ubp_wi_StartScreenGuest_C::MediaPlayer' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, MenuSound) == 0x000348, "Member 'Ubp_wi_StartScreenGuest_C::MenuSound' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, RulesButtonClicked) == 0x000350, "Member 'Ubp_wi_StartScreenGuest_C::RulesButtonClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, NewVar_0) == 0x000358, "Member 'Ubp_wi_StartScreenGuest_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, ShowPatchNotes) == 0x000380, "Member 'Ubp_wi_StartScreenGuest_C::ShowPatchNotes' has a wrong offset!");
static_assert(offsetof(Ubp_wi_StartScreenGuest_C, OnChangeTab) == 0x000388, "Member 'Ubp_wi_StartScreenGuest_C::OnChangeTab' has a wrong offset!");

}

