#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_Home

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_Home.bp_wi_Home_C.OnAchievementsClicked__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct bp_wi_Home_C_OnAchievementsClicked__DelegateSignature final
{
public:
	struct FFCTAchievementList                    AchievementList;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(bp_wi_Home_C_OnAchievementsClicked__DelegateSignature) == 0x000008, "Wrong alignment on bp_wi_Home_C_OnAchievementsClicked__DelegateSignature");
static_assert(sizeof(bp_wi_Home_C_OnAchievementsClicked__DelegateSignature) == 0x000028, "Wrong size on bp_wi_Home_C_OnAchievementsClicked__DelegateSignature");
static_assert(offsetof(bp_wi_Home_C_OnAchievementsClicked__DelegateSignature, AchievementList) == 0x000000, "Member 'bp_wi_Home_C_OnAchievementsClicked__DelegateSignature::AchievementList' has a wrong offset!");

// Function bp_wi_Home.bp_wi_Home_C.RemoveLoadingSpinners
// 0x0038 (0x0038 - 0x0000)
struct bp_wi_Home_C_RemoveLoadingSpinners final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULoadingSpinnerWI_C*>            CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadingSpinnerWI_C*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_Home_C_RemoveLoadingSpinners) == 0x000008, "Wrong alignment on bp_wi_Home_C_RemoveLoadingSpinners");
static_assert(sizeof(bp_wi_Home_C_RemoveLoadingSpinners) == 0x000038, "Wrong size on bp_wi_Home_C_RemoveLoadingSpinners");
static_assert(offsetof(bp_wi_Home_C_RemoveLoadingSpinners, Temp_int_Array_Index_Variable) == 0x000000, "Member 'bp_wi_Home_C_RemoveLoadingSpinners::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Home_C_RemoveLoadingSpinners, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'bp_wi_Home_C_RemoveLoadingSpinners::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_Home_C_RemoveLoadingSpinners, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'bp_wi_Home_C_RemoveLoadingSpinners::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Home_C_RemoveLoadingSpinners, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'bp_wi_Home_C_RemoveLoadingSpinners::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(bp_wi_Home_C_RemoveLoadingSpinners, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'bp_wi_Home_C_RemoveLoadingSpinners::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_Home_C_RemoveLoadingSpinners, CallFunc_Array_Get_Item) == 0x000028, "Member 'bp_wi_Home_C_RemoveLoadingSpinners::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(bp_wi_Home_C_RemoveLoadingSpinners, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'bp_wi_Home_C_RemoveLoadingSpinners::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

