#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bpc_ac_ModalWindowManager

#include "Basic.hpp"

#include "InGameModalWidgets_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bpc_ac_ModalWindowManager.bpc_ac_ModalWindowManager_C
// 0x0038 (0x00E8 - 0x00B0)
class Ubpc_ac_ModalWindowManager_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	EInGameModalWidgets                           Previous_Active_Modal_Window;                      // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInGameModalWidgets                           Current_Active_Modal_Window;                       // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Active_Modal_Window;                               // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            InGameMenu;                                        // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 InGameClass;                                       // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            AirlockVote;                                       // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AirlockVoteClass;                                  // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bpc_ac_ModalWindowManager(int32 EntryPoint);
	void Hide_Active_Modal_Window();
	void Internal_SetInputMode(bool Active_Modal_Window_0);
	void Try_Close_Modal_Window();
	void Internal_Prioritize_Modal_Window(EInGameModalWidgets Desired_Modal_Window_to_Toggle, class UUserWidget* WidgetCandidate, class UUserWidget** VisibleWidget);
	void Internal_Set_New_Active_Window(EInGameModalWidgets New_Active_modal_window);
	void GetInGameWidget(class UUserWidget** Return_Value);
	void GetAirlockVotingBoxWidget(class UUserWidget** Return_Value);
	void Toggle_Airlock_Voting_box(class Ubp_wi_VotingBox_C** Visible_Voting_Box);
	void Toggle_Thumb_Vote(class UUserWidget* Thumb_vote_Widget, class Ubp_wi_ThumbsVoteMenu_C** Visible_thumb_vote_Widget);
	void Toggle_Puzzle_Widget(class Ubp_wi_Puzzle_C* Puzzle_Puzzle_Widget, class UUserWidget** Visible_Puzzle_Widget);
	void Toggle_Ingame_Menu(class UUserWidget** Visible_Ingame_Widget);
	void SetActiveWidget(class UUserWidget* New_User_Widget);
	void ClearActiveWidget();
	void SetPreviousModalWindow();

	bool IsModalVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bpc_ac_ModalWindowManager_C">();
	}
	static class Ubpc_ac_ModalWindowManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubpc_ac_ModalWindowManager_C>();
	}
};
static_assert(alignof(Ubpc_ac_ModalWindowManager_C) == 0x000008, "Wrong alignment on Ubpc_ac_ModalWindowManager_C");
static_assert(sizeof(Ubpc_ac_ModalWindowManager_C) == 0x0000E8, "Wrong size on Ubpc_ac_ModalWindowManager_C");
static_assert(offsetof(Ubpc_ac_ModalWindowManager_C, UberGraphFrame) == 0x0000B0, "Member 'Ubpc_ac_ModalWindowManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_ModalWindowManager_C, Previous_Active_Modal_Window) == 0x0000B8, "Member 'Ubpc_ac_ModalWindowManager_C::Previous_Active_Modal_Window' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_ModalWindowManager_C, Current_Active_Modal_Window) == 0x0000B9, "Member 'Ubpc_ac_ModalWindowManager_C::Current_Active_Modal_Window' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_ModalWindowManager_C, Active_Modal_Window) == 0x0000C0, "Member 'Ubpc_ac_ModalWindowManager_C::Active_Modal_Window' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_ModalWindowManager_C, InGameMenu) == 0x0000C8, "Member 'Ubpc_ac_ModalWindowManager_C::InGameMenu' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_ModalWindowManager_C, InGameClass) == 0x0000D0, "Member 'Ubpc_ac_ModalWindowManager_C::InGameClass' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_ModalWindowManager_C, AirlockVote) == 0x0000D8, "Member 'Ubpc_ac_ModalWindowManager_C::AirlockVote' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_ModalWindowManager_C, AirlockVoteClass) == 0x0000E0, "Member 'Ubpc_ac_ModalWindowManager_C::AirlockVoteClass' has a wrong offset!");

}

