#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bpc_ac_Lock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bpc_ac_Lock.bpc_ac_Lock_C
// 0x0048 (0x00F8 - 0x00B0)
class Ubpc_ac_Lock_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	bool                                          IsLocked;                                          // 0x00B8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnLockedStateChanged;                              // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsOnCooldown;                                      // 0x00D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CoolDownBeginTimeStamp;                            // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         FailToUnlockCooldown;                              // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CooldownTickRate;                                  // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFailCooldownUpdate;                              // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Debugging;                                         // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnLockedStateChanged__DelegateSignature(bool IsLocked_0, bool IsOnCooldown_0);
	void OnFailCooldownUpdate__DelegateSignature(float CooldownLeft);
	void ExecuteUbergraph_bpc_ac_Lock(int32 EntryPoint);
	void CooldownUpdate();
	void ReceiveBeginPlay();
	void LockServer();
	void UnlockServer();
	void OnRep_IsLocked();
	void OnRep_IsOnCooldown();
	void CooldownStartServer();
	void CooldownEndServer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bpc_ac_Lock_C">();
	}
	static class Ubpc_ac_Lock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubpc_ac_Lock_C>();
	}
};
static_assert(alignof(Ubpc_ac_Lock_C) == 0x000008, "Wrong alignment on Ubpc_ac_Lock_C");
static_assert(sizeof(Ubpc_ac_Lock_C) == 0x0000F8, "Wrong size on Ubpc_ac_Lock_C");
static_assert(offsetof(Ubpc_ac_Lock_C, UberGraphFrame) == 0x0000B0, "Member 'Ubpc_ac_Lock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_Lock_C, IsLocked) == 0x0000B8, "Member 'Ubpc_ac_Lock_C::IsLocked' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_Lock_C, OnLockedStateChanged) == 0x0000C0, "Member 'Ubpc_ac_Lock_C::OnLockedStateChanged' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_Lock_C, IsOnCooldown) == 0x0000D0, "Member 'Ubpc_ac_Lock_C::IsOnCooldown' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_Lock_C, CoolDownBeginTimeStamp) == 0x0000D4, "Member 'Ubpc_ac_Lock_C::CoolDownBeginTimeStamp' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_Lock_C, FailToUnlockCooldown) == 0x0000D8, "Member 'Ubpc_ac_Lock_C::FailToUnlockCooldown' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_Lock_C, CooldownTickRate) == 0x0000DC, "Member 'Ubpc_ac_Lock_C::CooldownTickRate' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_Lock_C, OnFailCooldownUpdate) == 0x0000E0, "Member 'Ubpc_ac_Lock_C::OnFailCooldownUpdate' has a wrong offset!");
static_assert(offsetof(Ubpc_ac_Lock_C, Debugging) == 0x0000F0, "Member 'Ubpc_ac_Lock_C::Debugging' has a wrong offset!");

}

