#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bpc_ac_Sabotage

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function bpc_ac_Sabotage.bpc_ac_Sabotage_C.OnSabotageStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct bpc_ac_Sabotage_C_OnSabotageStateChange__DelegateSignature final
{
public:
	bool                                          IsSabotaged_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bpc_ac_Sabotage_C_OnSabotageStateChange__DelegateSignature) == 0x000001, "Wrong alignment on bpc_ac_Sabotage_C_OnSabotageStateChange__DelegateSignature");
static_assert(sizeof(bpc_ac_Sabotage_C_OnSabotageStateChange__DelegateSignature) == 0x000001, "Wrong size on bpc_ac_Sabotage_C_OnSabotageStateChange__DelegateSignature");
static_assert(offsetof(bpc_ac_Sabotage_C_OnSabotageStateChange__DelegateSignature, IsSabotaged_0) == 0x000000, "Member 'bpc_ac_Sabotage_C_OnSabotageStateChange__DelegateSignature::IsSabotaged_0' has a wrong offset!");

// Function bpc_ac_Sabotage.bpc_ac_Sabotage_C.OnSabotageCooldownUpdate__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct bpc_ac_Sabotage_C_OnSabotageCooldownUpdate__DelegateSignature final
{
public:
	float                                         CooldownLeft;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bpc_ac_Sabotage_C_OnSabotageCooldownUpdate__DelegateSignature) == 0x000004, "Wrong alignment on bpc_ac_Sabotage_C_OnSabotageCooldownUpdate__DelegateSignature");
static_assert(sizeof(bpc_ac_Sabotage_C_OnSabotageCooldownUpdate__DelegateSignature) == 0x000004, "Wrong size on bpc_ac_Sabotage_C_OnSabotageCooldownUpdate__DelegateSignature");
static_assert(offsetof(bpc_ac_Sabotage_C_OnSabotageCooldownUpdate__DelegateSignature, CooldownLeft) == 0x000000, "Member 'bpc_ac_Sabotage_C_OnSabotageCooldownUpdate__DelegateSignature::CooldownLeft' has a wrong offset!");

// Function bpc_ac_Sabotage.bpc_ac_Sabotage_C.ExecuteUbergraph_bpc_ac_Sabotage
// 0x0040 (0x0040 - 0x0000)
struct bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue_1;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage) == 0x000008, "Wrong alignment on bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage");
static_assert(sizeof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage) == 0x000040, "Wrong size on bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage");
static_assert(offsetof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage, EntryPoint) == 0x000000, "Member 'bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage::EntryPoint' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage, CallFunc_GetGameState_ReturnValue) == 0x000020, "Member 'bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage, CallFunc_GetGameState_ReturnValue_1) == 0x000028, "Member 'bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000030, "Member 'bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage, CallFunc_GetServerWorldTimeSeconds_ReturnValue_1) == 0x000034, "Member 'bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage::CallFunc_GetServerWorldTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage, K2Node_MathExpression_ReturnValue) == 0x000038, "Member 'bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage, CallFunc_IsServer_ReturnValue) == 0x00003C, "Member 'bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage, CallFunc_IsServer_ReturnValue_1) == 0x00003D, "Member 'bpc_ac_Sabotage_C_ExecuteUbergraph_bpc_ac_Sabotage::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");

// Function bpc_ac_Sabotage.bpc_ac_Sabotage_C.OnRep_IsSabotaged
// 0x0028 (0x0028 - 0x0000)
struct bpc_ac_Sabotage_C_OnRep_IsSabotaged final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bpc_ac_Sabotage_C_OnRep_IsSabotaged) == 0x000008, "Wrong alignment on bpc_ac_Sabotage_C_OnRep_IsSabotaged");
static_assert(sizeof(bpc_ac_Sabotage_C_OnRep_IsSabotaged) == 0x000028, "Wrong size on bpc_ac_Sabotage_C_OnRep_IsSabotaged");
static_assert(offsetof(bpc_ac_Sabotage_C_OnRep_IsSabotaged, Temp_bool_Variable) == 0x000000, "Member 'bpc_ac_Sabotage_C_OnRep_IsSabotaged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_OnRep_IsSabotaged, Temp_float_Variable) == 0x000004, "Member 'bpc_ac_Sabotage_C_OnRep_IsSabotaged::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_OnRep_IsSabotaged, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'bpc_ac_Sabotage_C_OnRep_IsSabotaged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_OnRep_IsSabotaged, K2Node_Select_Default) == 0x000018, "Member 'bpc_ac_Sabotage_C_OnRep_IsSabotaged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(bpc_ac_Sabotage_C_OnRep_IsSabotaged, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'bpc_ac_Sabotage_C_OnRep_IsSabotaged::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

