#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button_General

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Button_General.Button_General_C
// 0x0168 (0x0388 - 0x0220)
class AButton_General_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UStaticMeshComponent*                   OutlineMesh;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent*                  Interaction;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRenderComplete;                                // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneTexts;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OutlineArea1;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UContextStaticMeshComponent*            ContextStaticMesh;                                 // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Button;                                            // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Pulse_Intensity_B0E04718465A6390F6E9EC8DB4C3A99F;  // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Pulse__Direction_B0E04718465A6390F6E9EC8DB4C3A99F; // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Pulse;                                             // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TextMaterial;                                      // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsToControl;                                   // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          StartSkillcheck;                                   // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFinalFantSkillcheckWI_C*               WI_Skillcheck;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Failed;                                            // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OnCooldown;                                        // 0x02B1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CooldownTimeHandle;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          OneTimePresser;                                    // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OneShotShillcheck;                                 // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ImmidiateActivationOfActors;                       // 0x02C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C3[0x1];                                      // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CooldownTimeAfterRelease;                          // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Completed;                                         // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCooldownBegin;                                   // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnButtonPressed;                                   // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnButtonReleased;                                  // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Activated;                                         // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnProxySkillCheckFail;                             // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          EnabledInteraction;                                // 0x0318(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          DefaultEnabledInteraction;                         // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSabotaged;                                       // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FColor                                 CooldownColor;                                     // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 ReadyColor;                                        // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AudioPress;                                        // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AudioCooldown;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AudioRelease;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 DisabledColor;                                     // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCooledDown;                                      // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FActiveGameplayEffectHandle            ImmovableGE;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AudioHackingLoop;                                  // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      ActivatingCharacter;                               // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Server;                                            // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnCooldownBegin__DelegateSignature();
	void OnButtonPressed__DelegateSignature(class ACharacterSCTBP_C* PressingCharacter);
	void OnButtonReleased__DelegateSignature(class ACharacterSCTBP_C* ReleasingCharacter);
	void OnProxySkillCheckFail__DelegateSignature();
	void OnSabotaged__DelegateSignature();
	void OnCooledDown__DelegateSignature();
	void ExecuteUbergraph_Button_General(int32 EntryPoint);
	void CooledDown();
	void Start_Cooldown();
	void Start_text_Cooldown();
	void Set_Cooldown_Text();
	void BndEvt__ContextStaticMesh_K2Node_ComponentBoundEvent_3_ToggleHighlightEffect__DelegateSignature(bool ShouldShow);
	void Disengage_Interaction();
	void Audio_Cooled_Down();
	void Audio_Cooldown();
	void Audio_Release();
	void Cosmetic_Release();
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void Make_Button_Unavailable(const class FText& Description);
	void Enable_Interaction(bool EnabledInteraction_0);
	void ReceiveBeginPlay();
	void Owner_Remove_All_Skillchecks();
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_5_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload, bool WasCancelled);
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void Server_Interact_Released(class AActor* Actor);
	void Server_Interact_Pressed(class AActor* Actor);
	void One_Shot_Complete();
	void On_Failed_Skillcheck();
	void Audio_Press();
	void Cosmetic_Press();
	void Pulse__UpdateFunc();
	void Pulse__FinishedFunc();
	void UserConstructionScript();
	void SetCooldownText(const class FText& Value);
	void InteractPressed(class AActor* Actor);
	void InteractReleased(class AActor* Actor);
	void ShowAsCompleted();
	void OnRep_EnabledInteraction();
	void MakeTextDisabled();
	void MakeTextEnabled();
	void OnRep_SetIsReadyColor();
	void OnRep_OnCooldown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Button_General_C">();
	}
	static class AButton_General_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AButton_General_C>();
	}
};
static_assert(alignof(AButton_General_C) == 0x000008, "Wrong alignment on AButton_General_C");
static_assert(sizeof(AButton_General_C) == 0x000388, "Wrong size on AButton_General_C");
static_assert(offsetof(AButton_General_C, UberGraphFrame) == 0x000220, "Member 'AButton_General_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OutlineMesh) == 0x000228, "Member 'AButton_General_C::OutlineMesh' has a wrong offset!");
static_assert(offsetof(AButton_General_C, Interaction) == 0x000230, "Member 'AButton_General_C::Interaction' has a wrong offset!");
static_assert(offsetof(AButton_General_C, TextRenderComplete) == 0x000238, "Member 'AButton_General_C::TextRenderComplete' has a wrong offset!");
static_assert(offsetof(AButton_General_C, TextRender) == 0x000240, "Member 'AButton_General_C::TextRender' has a wrong offset!");
static_assert(offsetof(AButton_General_C, SceneTexts) == 0x000248, "Member 'AButton_General_C::SceneTexts' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OutlineArea1) == 0x000250, "Member 'AButton_General_C::OutlineArea1' has a wrong offset!");
static_assert(offsetof(AButton_General_C, ContextStaticMesh) == 0x000258, "Member 'AButton_General_C::ContextStaticMesh' has a wrong offset!");
static_assert(offsetof(AButton_General_C, Ak) == 0x000260, "Member 'AButton_General_C::Ak' has a wrong offset!");
static_assert(offsetof(AButton_General_C, Button) == 0x000268, "Member 'AButton_General_C::Button' has a wrong offset!");
static_assert(offsetof(AButton_General_C, DefaultSceneRoot) == 0x000270, "Member 'AButton_General_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AButton_General_C, Pulse_Intensity_B0E04718465A6390F6E9EC8DB4C3A99F) == 0x000278, "Member 'AButton_General_C::Pulse_Intensity_B0E04718465A6390F6E9EC8DB4C3A99F' has a wrong offset!");
static_assert(offsetof(AButton_General_C, Pulse__Direction_B0E04718465A6390F6E9EC8DB4C3A99F) == 0x00027C, "Member 'AButton_General_C::Pulse__Direction_B0E04718465A6390F6E9EC8DB4C3A99F' has a wrong offset!");
static_assert(offsetof(AButton_General_C, Pulse) == 0x000280, "Member 'AButton_General_C::Pulse' has a wrong offset!");
static_assert(offsetof(AButton_General_C, TextMaterial) == 0x000288, "Member 'AButton_General_C::TextMaterial' has a wrong offset!");
static_assert(offsetof(AButton_General_C, ActorsToControl) == 0x000290, "Member 'AButton_General_C::ActorsToControl' has a wrong offset!");
static_assert(offsetof(AButton_General_C, StartSkillcheck) == 0x0002A0, "Member 'AButton_General_C::StartSkillcheck' has a wrong offset!");
static_assert(offsetof(AButton_General_C, WI_Skillcheck) == 0x0002A8, "Member 'AButton_General_C::WI_Skillcheck' has a wrong offset!");
static_assert(offsetof(AButton_General_C, Failed) == 0x0002B0, "Member 'AButton_General_C::Failed' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OnCooldown) == 0x0002B1, "Member 'AButton_General_C::OnCooldown' has a wrong offset!");
static_assert(offsetof(AButton_General_C, CooldownTimeHandle) == 0x0002B8, "Member 'AButton_General_C::CooldownTimeHandle' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OneTimePresser) == 0x0002C0, "Member 'AButton_General_C::OneTimePresser' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OneShotShillcheck) == 0x0002C1, "Member 'AButton_General_C::OneShotShillcheck' has a wrong offset!");
static_assert(offsetof(AButton_General_C, ImmidiateActivationOfActors) == 0x0002C2, "Member 'AButton_General_C::ImmidiateActivationOfActors' has a wrong offset!");
static_assert(offsetof(AButton_General_C, CooldownTimeAfterRelease) == 0x0002C4, "Member 'AButton_General_C::CooldownTimeAfterRelease' has a wrong offset!");
static_assert(offsetof(AButton_General_C, Completed) == 0x0002C8, "Member 'AButton_General_C::Completed' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OnCooldownBegin) == 0x0002D0, "Member 'AButton_General_C::OnCooldownBegin' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OnButtonPressed) == 0x0002E0, "Member 'AButton_General_C::OnButtonPressed' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OnButtonReleased) == 0x0002F0, "Member 'AButton_General_C::OnButtonReleased' has a wrong offset!");
static_assert(offsetof(AButton_General_C, Activated) == 0x000300, "Member 'AButton_General_C::Activated' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OnProxySkillCheckFail) == 0x000308, "Member 'AButton_General_C::OnProxySkillCheckFail' has a wrong offset!");
static_assert(offsetof(AButton_General_C, EnabledInteraction) == 0x000318, "Member 'AButton_General_C::EnabledInteraction' has a wrong offset!");
static_assert(offsetof(AButton_General_C, DefaultEnabledInteraction) == 0x000319, "Member 'AButton_General_C::DefaultEnabledInteraction' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OnSabotaged) == 0x000320, "Member 'AButton_General_C::OnSabotaged' has a wrong offset!");
static_assert(offsetof(AButton_General_C, CooldownColor) == 0x000330, "Member 'AButton_General_C::CooldownColor' has a wrong offset!");
static_assert(offsetof(AButton_General_C, ReadyColor) == 0x000334, "Member 'AButton_General_C::ReadyColor' has a wrong offset!");
static_assert(offsetof(AButton_General_C, AudioPress) == 0x000338, "Member 'AButton_General_C::AudioPress' has a wrong offset!");
static_assert(offsetof(AButton_General_C, AudioCooldown) == 0x000340, "Member 'AButton_General_C::AudioCooldown' has a wrong offset!");
static_assert(offsetof(AButton_General_C, AudioRelease) == 0x000348, "Member 'AButton_General_C::AudioRelease' has a wrong offset!");
static_assert(offsetof(AButton_General_C, DisabledColor) == 0x000350, "Member 'AButton_General_C::DisabledColor' has a wrong offset!");
static_assert(offsetof(AButton_General_C, OnCooledDown) == 0x000358, "Member 'AButton_General_C::OnCooledDown' has a wrong offset!");
static_assert(offsetof(AButton_General_C, ImmovableGE) == 0x000368, "Member 'AButton_General_C::ImmovableGE' has a wrong offset!");
static_assert(offsetof(AButton_General_C, AudioHackingLoop) == 0x000370, "Member 'AButton_General_C::AudioHackingLoop' has a wrong offset!");
static_assert(offsetof(AButton_General_C, ActivatingCharacter) == 0x000378, "Member 'AButton_General_C::ActivatingCharacter' has a wrong offset!");
static_assert(offsetof(AButton_General_C, Server) == 0x000380, "Member 'AButton_General_C::Server' has a wrong offset!");

}

