#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ButtonForLinkWI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ButtonForLinkWI.ButtonForLinkWI_C
// 0x0060 (0x02C0 - 0x0260)
class UButtonForLinkWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UButton*                                Button;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GamepadButton;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Button;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TextForButton;                                     // 0x0280(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             Clicked;                                           // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 URL;                                               // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              ButtonVisibility;                                  // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Clicked__DelegateSignature();
	void ExecuteUbergraph_ButtonForLinkWI(int32 EntryPoint);
	void BndEvt__ButtonForLinkWI_GamepadButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void GetNavigationWidget(class UWidget** NavigationWidget);
	void SetNavigationForDirection(EUINavigation Direction, class UWidget* WidgetTarget);
	void SetIsFocusable(bool IsFocusable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ButtonForLinkWI_C">();
	}
	static class UButtonForLinkWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UButtonForLinkWI_C>();
	}
};
static_assert(alignof(UButtonForLinkWI_C) == 0x000008, "Wrong alignment on UButtonForLinkWI_C");
static_assert(sizeof(UButtonForLinkWI_C) == 0x0002C0, "Wrong size on UButtonForLinkWI_C");
static_assert(offsetof(UButtonForLinkWI_C, UberGraphFrame) == 0x000260, "Member 'UButtonForLinkWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UButtonForLinkWI_C, Button) == 0x000268, "Member 'UButtonForLinkWI_C::Button' has a wrong offset!");
static_assert(offsetof(UButtonForLinkWI_C, GamepadButton) == 0x000270, "Member 'UButtonForLinkWI_C::GamepadButton' has a wrong offset!");
static_assert(offsetof(UButtonForLinkWI_C, Text_Button) == 0x000278, "Member 'UButtonForLinkWI_C::Text_Button' has a wrong offset!");
static_assert(offsetof(UButtonForLinkWI_C, TextForButton) == 0x000280, "Member 'UButtonForLinkWI_C::TextForButton' has a wrong offset!");
static_assert(offsetof(UButtonForLinkWI_C, Clicked) == 0x000298, "Member 'UButtonForLinkWI_C::Clicked' has a wrong offset!");
static_assert(offsetof(UButtonForLinkWI_C, URL) == 0x0002A8, "Member 'UButtonForLinkWI_C::URL' has a wrong offset!");
static_assert(offsetof(UButtonForLinkWI_C, ButtonVisibility) == 0x0002B8, "Member 'UButtonForLinkWI_C::ButtonVisibility' has a wrong offset!");

}

