#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CAINServer

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "SCT_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CAINServer.CAINServer_C.ExecuteUbergraph_CAINServer
// 0x0450 (0x0450 - 0x0000)
struct CAINServer_C_ExecuteUbergraph_CAINServer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0078(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_4;                            // 0x0088(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x0098(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_5;                            // 0x00B0(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x00C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_6;                            // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6;                          // 0x00E0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_7;                            // 0x00F0(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_7;                          // 0x0100(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_5;              // 0x0140(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFinalFantSkillcheckWI_C*               CallFunc_Create_ReturnValue;                       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_4;              // 0x01B8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled_1;         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB[0x5];                                      // 0x01EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AServerRoomManagerSCT_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x01F0(0x0010)(ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_8;                          // 0x0200(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class AServerRoomManagerSCT_C*                CallFunc_Array_Get_Item;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x021C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C6[0x2];                                      // 0x02C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_3;              // 0x02C8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_2;              // 0x02F8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_1;              // 0x0328(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_2;            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0368(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0380(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0398(0x0018)(ConstParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_8;                            // 0x03B8(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_9;                          // 0x03C8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_6;                // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController;               // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerController*                   CallFunc_GetPlayerController_ReturnValue_1;        // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_9;                            // 0x03F0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_7;                // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_8;                // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload;                // 0x0408(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled;           // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_9;                // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP;     // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CAINServer_C_ExecuteUbergraph_CAINServer) == 0x000008, "Wrong alignment on CAINServer_C_ExecuteUbergraph_CAINServer");
static_assert(sizeof(CAINServer_C_ExecuteUbergraph_CAINServer) == 0x000450, "Wrong size on CAINServer_C_ExecuteUbergraph_CAINServer");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, EntryPoint) == 0x000000, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::EntryPoint' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_struct_Variable) == 0x000008, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_delegate_Variable) == 0x000018, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_struct_Variable_1) == 0x000028, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_delegate_Variable_1) == 0x000038, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_struct_Variable_2) == 0x000048, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_delegate_Variable_2) == 0x000058, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_struct_Variable_3) == 0x000068, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_delegate_Variable_3) == 0x000078, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_struct_Variable_4) == 0x000088, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_delegate_Variable_4) == 0x000098, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_bool_Variable) == 0x0000A8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_struct_Variable_5) == 0x0000B0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_delegate_Variable_5) == 0x0000C0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_struct_Variable_6) == 0x0000D0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_delegate_Variable_6) == 0x0000E0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_struct_Variable_7) == 0x0000F0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_delegate_Variable_7) == 0x000100, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_delegate_Variable_7' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_IsDedicatedServer_ReturnValue) == 0x000110, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_MapRangeClamped_ReturnValue) == 0x000114, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_MakeVector_ReturnValue) == 0x000118, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_bool_IsClosed_Variable) == 0x000124, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_CreateDelegate_OutputDelegate) == 0x000128, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_bool_Has_Been_Initd_Variable) == 0x000138, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_bool_Has_Been_Initd_Variable_1) == 0x000139, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00013A, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_HasAuthority_ReturnValue) == 0x00013B, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_ComponentBoundEvent_payload_5) == 0x000140, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_ComponentBoundEvent_payload_5' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000170, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000180, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000190, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_GetPlayerController_ReturnValue) == 0x0001A0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_Create_ReturnValue) == 0x0001A8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_IsValid_ReturnValue) == 0x0001B0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_ComponentBoundEvent_payload_4) == 0x0001B8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_ComponentBoundEvent_payload_4' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_ComponentBoundEvent_wasCancelled_1) == 0x0001E8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_ComponentBoundEvent_wasCancelled_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_bool_IsClosed_Variable_1) == 0x0001E9, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_HasAuthority_ReturnValue_1) == 0x0001EA, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_GetAllActorsOfClass_OutActors) == 0x0001F0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_delegate_Variable_8) == 0x000200, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_delegate_Variable_8' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_Array_Get_Item) == 0x000210, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_HasAuthority_ReturnValue_2) == 0x000218, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00021C, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0002A8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_PostAkEvent_ReturnValue) == 0x0002AC, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_PostAkEvent_ReturnValue_1) == 0x0002B0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0002B4, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_PostAkEvent_ReturnValue_2) == 0x0002B8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_PostAkEvent_ReturnValue_3) == 0x0002BC, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_PostAkEvent_ReturnValue_4) == 0x0002C0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_HasAuthority_ReturnValue_3) == 0x0002C4, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x0002C5, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_ComponentBoundEvent_payload_3) == 0x0002C8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_ComponentBoundEvent_payload_3' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_ComponentBoundEvent_payload_2) == 0x0002F8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_ComponentBoundEvent_payload_2' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_ComponentBoundEvent_payload_1) == 0x000328, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_ComponentBoundEvent_payload_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_DynamicCast_AsCharacter_SCTBP_2) == 0x000358, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_DynamicCast_AsCharacter_SCTBP_2' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_DynamicCast_bSuccess_2) == 0x000360, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_MakeLiteralText_ReturnValue) == 0x000368, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000380, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_Select_Default) == 0x000398, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_PostAkEvent_ReturnValue_5) == 0x0003B0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_PostAkEvent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_struct_Variable_8) == 0x0003B8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_delegate_Variable_9) == 0x0003C8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_delegate_Variable_9' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_PostAkEvent_ReturnValue_6) == 0x0003D8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_PostAkEvent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_CustomEvent_PlayerController) == 0x0003E0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_GetPlayerController_ReturnValue_1) == 0x0003E8, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, Temp_struct_Variable_9) == 0x0003F0, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_PostAkEvent_ReturnValue_7) == 0x000400, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_PostAkEvent_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_PostAkEvent_ReturnValue_8) == 0x000404, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_PostAkEvent_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_ComponentBoundEvent_payload) == 0x000408, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_ComponentBoundEvent_payload' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_ComponentBoundEvent_wasCancelled) == 0x000438, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_ComponentBoundEvent_wasCancelled' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, CallFunc_PostAkEvent_ReturnValue_9) == 0x00043C, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::CallFunc_PostAkEvent_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP) == 0x000440, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ExecuteUbergraph_CAINServer, K2Node_DynamicCast_bSuccess_3) == 0x000448, "Member 'CAINServer_C_ExecuteUbergraph_CAINServer::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function CAINServer.CAINServer_C.BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct CAINServer_C_BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CAINServer_C_BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on CAINServer_C_BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature");
static_assert(sizeof(CAINServer_C_BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature) == 0x000038, "Wrong size on CAINServer_C_BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature");
static_assert(offsetof(CAINServer_C_BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature, Payload) == 0x000000, "Member 'CAINServer_C_BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature::Payload' has a wrong offset!");
static_assert(offsetof(CAINServer_C_BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature, WasCancelled) == 0x000030, "Member 'CAINServer_C_BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature::WasCancelled' has a wrong offset!");

// Function CAINServer.CAINServer_C.Show Failed Skillcheck
// 0x0008 (0x0008 - 0x0000)
struct CAINServer_C_Show_Failed_Skillcheck final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CAINServer_C_Show_Failed_Skillcheck) == 0x000008, "Wrong alignment on CAINServer_C_Show_Failed_Skillcheck");
static_assert(sizeof(CAINServer_C_Show_Failed_Skillcheck) == 0x000008, "Wrong size on CAINServer_C_Show_Failed_Skillcheck");
static_assert(offsetof(CAINServer_C_Show_Failed_Skillcheck, PlayerController) == 0x000000, "Member 'CAINServer_C_Show_Failed_Skillcheck::PlayerController' has a wrong offset!");

// Function CAINServer.CAINServer_C.BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_6_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_6_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_6_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_6_InteractionDelegate__DelegateSignature");
static_assert(sizeof(CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_6_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_6_InteractionDelegate__DelegateSignature");
static_assert(offsetof(CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_6_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_6_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function CAINServer.CAINServer_C.BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_5_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_5_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_5_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_5_InteractionDelegate__DelegateSignature");
static_assert(sizeof(CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_5_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_5_InteractionDelegate__DelegateSignature");
static_assert(offsetof(CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_5_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'CAINServer_C_BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_5_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function CAINServer.CAINServer_C.BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature");
static_assert(sizeof(CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature");
static_assert(offsetof(CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function CAINServer.CAINServer_C.BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature");
static_assert(sizeof(CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature) == 0x000038, "Wrong size on CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature");
static_assert(offsetof(CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature, Payload) == 0x000000, "Member 'CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature::Payload' has a wrong offset!");
static_assert(offsetof(CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature, WasCancelled) == 0x000030, "Member 'CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature::WasCancelled' has a wrong offset!");

// Function CAINServer.CAINServer_C.OnRep_Sabotaged
// 0x0048 (0x0048 - 0x0000)
struct CAINServer_C_OnRep_Sabotaged final
{
public:
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CAINServer_C_OnRep_Sabotaged) == 0x000008, "Wrong alignment on CAINServer_C_OnRep_Sabotaged");
static_assert(sizeof(CAINServer_C_OnRep_Sabotaged) == 0x000048, "Wrong size on CAINServer_C_OnRep_Sabotaged");
static_assert(offsetof(CAINServer_C_OnRep_Sabotaged, Temp_struct_Variable) == 0x000000, "Member 'CAINServer_C_OnRep_Sabotaged::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CAINServer_C_OnRep_Sabotaged, Temp_delegate_Variable) == 0x000010, "Member 'CAINServer_C_OnRep_Sabotaged::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CAINServer_C_OnRep_Sabotaged, Temp_struct_Variable_1) == 0x000020, "Member 'CAINServer_C_OnRep_Sabotaged::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_OnRep_Sabotaged, Temp_delegate_Variable_1) == 0x000030, "Member 'CAINServer_C_OnRep_Sabotaged::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_OnRep_Sabotaged, CallFunc_PostAkEvent_ReturnValue) == 0x000040, "Member 'CAINServer_C_OnRep_Sabotaged::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_OnRep_Sabotaged, CallFunc_PostAkEvent_ReturnValue_1) == 0x000044, "Member 'CAINServer_C_OnRep_Sabotaged::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

// Function CAINServer.CAINServer_C.OnRep_PermaRepaired
// 0x0030 (0x0030 - 0x0000)
struct CAINServer_C_OnRep_PermaRepaired final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CAINServer_C_OnRep_PermaRepaired) == 0x000008, "Wrong alignment on CAINServer_C_OnRep_PermaRepaired");
static_assert(sizeof(CAINServer_C_OnRep_PermaRepaired) == 0x000030, "Wrong size on CAINServer_C_OnRep_PermaRepaired");
static_assert(offsetof(CAINServer_C_OnRep_PermaRepaired, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CAINServer_C_OnRep_PermaRepaired::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_OnRep_PermaRepaired, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'CAINServer_C_OnRep_PermaRepaired::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_OnRep_PermaRepaired, Temp_delegate_Variable) == 0x000004, "Member 'CAINServer_C_OnRep_PermaRepaired::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CAINServer_C_OnRep_PermaRepaired, Temp_struct_Variable) == 0x000018, "Member 'CAINServer_C_OnRep_PermaRepaired::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CAINServer_C_OnRep_PermaRepaired, CallFunc_PostAkEvent_ReturnValue) == 0x000028, "Member 'CAINServer_C_OnRep_PermaRepaired::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function CAINServer.CAINServer_C.ScoreForServerRepair
// 0x0010 (0x0010 - 0x0000)
struct CAINServer_C_ScoreForServerRepair final
{
public:
	bool                                          Repair;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CAINServer_C_ScoreForServerRepair) == 0x000004, "Wrong alignment on CAINServer_C_ScoreForServerRepair");
static_assert(sizeof(CAINServer_C_ScoreForServerRepair) == 0x000010, "Wrong size on CAINServer_C_ScoreForServerRepair");
static_assert(offsetof(CAINServer_C_ScoreForServerRepair, Repair) == 0x000000, "Member 'CAINServer_C_ScoreForServerRepair::Repair' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ScoreForServerRepair, CallFunc_Array_Contains_ReturnValue) == 0x000001, "Member 'CAINServer_C_ScoreForServerRepair::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ScoreForServerRepair, CallFunc_Array_AddUnique_ReturnValue) == 0x000004, "Member 'CAINServer_C_ScoreForServerRepair::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ScoreForServerRepair, CallFunc_Array_Contains_ReturnValue_1) == 0x000008, "Member 'CAINServer_C_ScoreForServerRepair::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAINServer_C_ScoreForServerRepair, CallFunc_Array_AddUnique_ReturnValue_1) == 0x00000C, "Member 'CAINServer_C_ScoreForServerRepair::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function CAINServer.CAINServer_C.BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature");
static_assert(sizeof(CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature");
static_assert(offsetof(CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'CAINServer_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function CAINServer.CAINServer_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct CAINServer_C_UserConstructionScript final
{
public:
	TScriptInterface<class IInteractionSubComponentInterface> CallFunc_AddSubComponent_component_CastInput;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(CAINServer_C_UserConstructionScript) == 0x000008, "Wrong alignment on CAINServer_C_UserConstructionScript");
static_assert(sizeof(CAINServer_C_UserConstructionScript) == 0x000010, "Wrong size on CAINServer_C_UserConstructionScript");
static_assert(offsetof(CAINServer_C_UserConstructionScript, CallFunc_AddSubComponent_component_CastInput) == 0x000000, "Member 'CAINServer_C_UserConstructionScript::CallFunc_AddSubComponent_component_CastInput' has a wrong offset!");

}

