#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CAIN_Collider

#include "Basic.hpp"


namespace SDK::Params
{

// Function CAIN_Collider.CAIN_Collider_C.GetOverlappingCharacters
// 0x0068 (0x0068 - 0x0000)
struct CAIN_Collider_C_GetOverlappingCharacters final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacterSCT*>                  L_Count;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCT*                          K2Node_DynamicCast_AsCharacter_SCT;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CAIN_Collider_C_GetOverlappingCharacters) == 0x000008, "Wrong alignment on CAIN_Collider_C_GetOverlappingCharacters");
static_assert(sizeof(CAIN_Collider_C_GetOverlappingCharacters) == 0x000068, "Wrong size on CAIN_Collider_C_GetOverlappingCharacters");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, Amount) == 0x000000, "Member 'CAIN_Collider_C_GetOverlappingCharacters::Amount' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, L_Count) == 0x000008, "Member 'CAIN_Collider_C_GetOverlappingCharacters::L_Count' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, Temp_int_Array_Index_Variable) == 0x000018, "Member 'CAIN_Collider_C_GetOverlappingCharacters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'CAIN_Collider_C_GetOverlappingCharacters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'CAIN_Collider_C_GetOverlappingCharacters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'CAIN_Collider_C_GetOverlappingCharacters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000028, "Member 'CAIN_Collider_C_GetOverlappingCharacters::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'CAIN_Collider_C_GetOverlappingCharacters::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, CallFunc_Array_Get_Item) == 0x000040, "Member 'CAIN_Collider_C_GetOverlappingCharacters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'CAIN_Collider_C_GetOverlappingCharacters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, K2Node_DynamicCast_AsCharacter_SCT) == 0x000050, "Member 'CAIN_Collider_C_GetOverlappingCharacters::K2Node_DynamicCast_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'CAIN_Collider_C_GetOverlappingCharacters::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'CAIN_Collider_C_GetOverlappingCharacters::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_Collider_C_GetOverlappingCharacters, CallFunc_IsAlive_ReturnValue) == 0x000060, "Member 'CAIN_Collider_C_GetOverlappingCharacters::CallFunc_IsAlive_ReturnValue' has a wrong offset!");

}

