#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChampagneBottleProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function ChampagneBottleProjectile.ChampagneBottleProjectile_C.ExecuteUbergraph_ChampagneBottleProjectile
// 0x02B8 (0x02B8 - 0x0000)
struct ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0008(0x0020)()
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0084(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x01F0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0220(0x0020)()
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0280(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_Target;                         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile) == 0x000008, "Wrong alignment on ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile");
static_assert(sizeof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile) == 0x0002B8, "Wrong size on ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, EntryPoint) == 0x000000, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000008, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, Temp_struct_Variable) == 0x000028, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, Temp_delegate_Variable) == 0x000038, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, Temp_delegate_Variable_1) == 0x000048, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_IsDedicatedServer_ReturnValue) == 0x000058, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, Temp_struct_Variable_1) == 0x000060, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000070, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000071, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_HasAuthority_ReturnValue) == 0x000072, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_GetOwner_ReturnValue) == 0x000078, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_Lerp_ReturnValue) == 0x000080, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, K2Node_ComponentBoundEvent_ImpactResult) == 0x000084, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_bBlockingHit) == 0x000110, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_bInitialOverlap) == 0x000111, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_Time) == 0x000114, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_Distance) == 0x000118, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_Location) == 0x00011C, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_ImpactPoint) == 0x000128, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_Normal) == 0x000134, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_ImpactNormal) == 0x000140, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_PhysMat) == 0x000150, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_HitActor) == 0x000158, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_HitComponent) == 0x000160, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_HitBoneName) == 0x000168, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_HitItem) == 0x000170, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_FaceIndex) == 0x000174, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_TraceStart) == 0x000178, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_BreakHitResult_TraceEnd) == 0x000184, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, K2Node_DynamicCast_AsICharacter_SCT) == 0x000190, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x0001A8, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_IsValid_ReturnValue) == 0x0001B1, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0001B8, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001C0, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_IsValid_ReturnValue_1) == 0x0001CC, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0001D0, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0001E0, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001E4, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, Temp_delegate_Variable_2) == 0x0001F0, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000200, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000208, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000214, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000220, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_Normal_ReturnValue) == 0x000240, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000250, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000260, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000264, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_HasAuthority_ReturnValue_1) == 0x000270, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, Temp_bool_Has_Been_Initd_Variable) == 0x000271, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_PostAkEvent_ReturnValue) == 0x000274, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, Temp_bool_IsClosed_Variable) == 0x000278, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_PostAkEvent_ReturnValue_1) == 0x00027C, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, Temp_struct_Variable_2) == 0x000280, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_GetOwner_ReturnValue_1) == 0x000290, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, CallFunc_PostAkEvent_ReturnValue_2) == 0x000298, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x0002A0, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, K2Node_DynamicCast_bSuccess_2) == 0x0002A8, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile, K2Node_CustomEvent_Target) == 0x0002B0, "Member 'ChampagneBottleProjectile_C_ExecuteUbergraph_ChampagneBottleProjectile::K2Node_CustomEvent_Target' has a wrong offset!");

// Function ChampagneBottleProjectile.ChampagneBottleProjectile_C.Mutation Effect
// 0x0008 (0x0008 - 0x0000)
struct ChampagneBottleProjectile_C_Mutation_Effect final
{
public:
	class ACharacterSCTBP_C*                      Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChampagneBottleProjectile_C_Mutation_Effect) == 0x000008, "Wrong alignment on ChampagneBottleProjectile_C_Mutation_Effect");
static_assert(sizeof(ChampagneBottleProjectile_C_Mutation_Effect) == 0x000008, "Wrong size on ChampagneBottleProjectile_C_Mutation_Effect");
static_assert(offsetof(ChampagneBottleProjectile_C_Mutation_Effect, Target) == 0x000000, "Member 'ChampagneBottleProjectile_C_Mutation_Effect::Target' has a wrong offset!");

// Function ChampagneBottleProjectile.ChampagneBottleProjectile_C.BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature
// 0x008C (0x008C - 0x0000)
struct ChampagneBottleProjectile_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ChampagneBottleProjectile_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature) == 0x000004, "Wrong alignment on ChampagneBottleProjectile_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature");
static_assert(sizeof(ChampagneBottleProjectile_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature) == 0x00008C, "Wrong size on ChampagneBottleProjectile_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature");
static_assert(offsetof(ChampagneBottleProjectile_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'ChampagneBottleProjectile_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature::ImpactResult' has a wrong offset!");

// Function ChampagneBottleProjectile.ChampagneBottleProjectile_C.UpdateProjectileMovement
// 0x0001 (0x0001 - 0x0000)
struct ChampagneBottleProjectile_C_UpdateProjectileMovement final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleProjectile_C_UpdateProjectileMovement) == 0x000001, "Wrong alignment on ChampagneBottleProjectile_C_UpdateProjectileMovement");
static_assert(sizeof(ChampagneBottleProjectile_C_UpdateProjectileMovement) == 0x000001, "Wrong size on ChampagneBottleProjectile_C_UpdateProjectileMovement");
static_assert(offsetof(ChampagneBottleProjectile_C_UpdateProjectileMovement, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ChampagneBottleProjectile_C_UpdateProjectileMovement::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ChampagneBottleProjectile.ChampagneBottleProjectile_C.RaiseHitEvent
// 0x0090 (0x0090 - 0x0000)
struct ChampagneBottleProjectile_C_RaiseHitEvent final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Did_Hit_Target_ReturnValue;               // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleProjectile_C_RaiseHitEvent) == 0x000004, "Wrong alignment on ChampagneBottleProjectile_C_RaiseHitEvent");
static_assert(sizeof(ChampagneBottleProjectile_C_RaiseHitEvent) == 0x000090, "Wrong size on ChampagneBottleProjectile_C_RaiseHitEvent");
static_assert(offsetof(ChampagneBottleProjectile_C_RaiseHitEvent, Hit) == 0x000000, "Member 'ChampagneBottleProjectile_C_RaiseHitEvent::Hit' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_RaiseHitEvent, CallFunc_IsServer_ReturnValue) == 0x00008C, "Member 'ChampagneBottleProjectile_C_RaiseHitEvent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_RaiseHitEvent, CallFunc_Did_Hit_Target_ReturnValue) == 0x00008D, "Member 'ChampagneBottleProjectile_C_RaiseHitEvent::CallFunc_Did_Hit_Target_ReturnValue' has a wrong offset!");

// Function ChampagneBottleProjectile.ChampagneBottleProjectile_C.CallHitTargetEvent
// 0x0010 (0x0010 - 0x0000)
struct ChampagneBottleProjectile_C_CallHitTargetEvent final
{
public:
	class APlayerController*                      CallFunc_GetOwnerController_Controller;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwnerController_Controller_1;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChampagneBottleProjectile_C_CallHitTargetEvent) == 0x000008, "Wrong alignment on ChampagneBottleProjectile_C_CallHitTargetEvent");
static_assert(sizeof(ChampagneBottleProjectile_C_CallHitTargetEvent) == 0x000010, "Wrong size on ChampagneBottleProjectile_C_CallHitTargetEvent");
static_assert(offsetof(ChampagneBottleProjectile_C_CallHitTargetEvent, CallFunc_GetOwnerController_Controller) == 0x000000, "Member 'ChampagneBottleProjectile_C_CallHitTargetEvent::CallFunc_GetOwnerController_Controller' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_CallHitTargetEvent, CallFunc_GetOwnerController_Controller_1) == 0x000008, "Member 'ChampagneBottleProjectile_C_CallHitTargetEvent::CallFunc_GetOwnerController_Controller_1' has a wrong offset!");

// Function ChampagneBottleProjectile.ChampagneBottleProjectile_C.GetOwnerController
// 0x0038 (0x0038 - 0x0000)
struct ChampagneBottleProjectile_C_GetOwnerController final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleProjectile_C_GetOwnerController) == 0x000008, "Wrong alignment on ChampagneBottleProjectile_C_GetOwnerController");
static_assert(sizeof(ChampagneBottleProjectile_C_GetOwnerController) == 0x000038, "Wrong size on ChampagneBottleProjectile_C_GetOwnerController");
static_assert(offsetof(ChampagneBottleProjectile_C_GetOwnerController, Controller) == 0x000000, "Member 'ChampagneBottleProjectile_C_GetOwnerController::Controller' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetOwnerController, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'ChampagneBottleProjectile_C_GetOwnerController::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetOwnerController, K2Node_DynamicCast_AsPawn) == 0x000010, "Member 'ChampagneBottleProjectile_C_GetOwnerController::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetOwnerController, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ChampagneBottleProjectile_C_GetOwnerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetOwnerController, CallFunc_GetController_ReturnValue) == 0x000020, "Member 'ChampagneBottleProjectile_C_GetOwnerController::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetOwnerController, K2Node_DynamicCast_AsPlayer_Controller) == 0x000028, "Member 'ChampagneBottleProjectile_C_GetOwnerController::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetOwnerController, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'ChampagneBottleProjectile_C_GetOwnerController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function ChampagneBottleProjectile.ChampagneBottleProjectile_C.GetTargetController
// 0x0038 (0x0038 - 0x0000)
struct ChampagneBottleProjectile_C_GetTargetController final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleProjectile_C_GetTargetController) == 0x000008, "Wrong alignment on ChampagneBottleProjectile_C_GetTargetController");
static_assert(sizeof(ChampagneBottleProjectile_C_GetTargetController) == 0x000038, "Wrong size on ChampagneBottleProjectile_C_GetTargetController");
static_assert(offsetof(ChampagneBottleProjectile_C_GetTargetController, Controller) == 0x000000, "Member 'ChampagneBottleProjectile_C_GetTargetController::Controller' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetTargetController, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'ChampagneBottleProjectile_C_GetTargetController::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetTargetController, K2Node_DynamicCast_AsPawn) == 0x000010, "Member 'ChampagneBottleProjectile_C_GetTargetController::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetTargetController, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ChampagneBottleProjectile_C_GetTargetController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetTargetController, CallFunc_GetController_ReturnValue) == 0x000020, "Member 'ChampagneBottleProjectile_C_GetTargetController::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetTargetController, K2Node_DynamicCast_AsPlayer_Controller) == 0x000028, "Member 'ChampagneBottleProjectile_C_GetTargetController::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_GetTargetController, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'ChampagneBottleProjectile_C_GetTargetController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function ChampagneBottleProjectile.ChampagneBottleProjectile_C.Did Hit Target
// 0x0118 (0x0118 - 0x0000)
struct ChampagneBottleProjectile_C_Did_Hit_Target final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleProjectile_C_Did_Hit_Target) == 0x000008, "Wrong alignment on ChampagneBottleProjectile_C_Did_Hit_Target");
static_assert(sizeof(ChampagneBottleProjectile_C_Did_Hit_Target) == 0x000118, "Wrong size on ChampagneBottleProjectile_C_Did_Hit_Target");
static_assert(offsetof(ChampagneBottleProjectile_C_Did_Hit_Target, Hit) == 0x000000, "Member 'ChampagneBottleProjectile_C_Did_Hit_Target::Hit' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_Did_Hit_Target, ReturnValue) == 0x00008C, "Member 'ChampagneBottleProjectile_C_Did_Hit_Target::ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleProjectile_C_Did_Hit_Target, CallFunc_BreakHitResult_bBlockingHit) == 0x00008D, "Member 'ChampagneBottleProjectile_C_Did_Hit_Target::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
