#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChampagneBottleGA

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function ChampagneBottleGA.ChampagneBottleGA_C.ExecuteUbergraph_ChampagneBottleGA
// 0x01E0 (0x01E0 - 0x0000)
struct ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_Owner;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue_1;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x00B4(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x00D8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x00F8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasContextStaticMesh_ReturnValue;         // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue_1;           // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class AEquipablePower_ChampagneBottle_C*      K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEquipablePower_ChampagneBottle_C*      K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle_1; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AEquipablePower_ChampagneBottle_C*      K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle_2; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNetAuthority_ReturnValue;               // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_2;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_3;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNetAuthority_ReturnValue_1;             // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA) == 0x000008, "Wrong alignment on ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA");
static_assert(sizeof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA) == 0x0001E0, "Wrong size on ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, EntryPoint) == 0x000000, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_CustomEvent_Owner) == 0x000008, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_CustomEvent_Owner' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP) == 0x000010, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000030, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_CustomEvent_TimeHeld) == 0x00004C, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, Temp_float_Variable) == 0x000050, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_WaitInputRelease_ReturnValue) == 0x000058, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_CreateDelegate_OutputDelegate_2) == 0x000064, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_WaitDelay_ReturnValue) == 0x000078, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_WaitDelay_ReturnValue_1) == 0x000098, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_WaitDelay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, Temp_struct_Variable) == 0x0000A0, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_IsValid_ReturnValue_3) == 0x0000B0, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, Temp_delegate_Variable) == 0x0000B4, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, Temp_struct_Variable_1) == 0x0000C8, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, Temp_delegate_Variable_1) == 0x0000D8, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, Temp_struct_Variable_2) == 0x0000E8, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, Temp_delegate_Variable_2) == 0x0000F8, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_IsDedicatedServer_ReturnValue) == 0x000108, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_CreateDelegate_OutputDelegate_4) == 0x00010C, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_K2_CommitAbility_ReturnValue) == 0x00011C, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_HasContextStaticMesh_ReturnValue) == 0x00011D, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_HasContextStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00011E, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_K2_CommitAbility_ReturnValue_1) == 0x00011F, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_K2_CommitAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_CreateDelegate_OutputDelegate_5) == 0x000120, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle) == 0x000130, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle_1) == 0x000140, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_PostAkEvent_ReturnValue) == 0x00014C, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_PostAkEvent_ReturnValue_1) == 0x000150, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000154, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle_2) == 0x000158, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_bSuccess_3) == 0x000160, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_IsNetAuthority_ReturnValue) == 0x000161, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_IsNetAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_PostAkEvent_ReturnValue_2) == 0x000164, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000168, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_Event_bWasCancelled) == 0x000170, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000178, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_bSuccess_4) == 0x000180, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000188, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000190, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_bSuccess_5) == 0x000198, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue_2) == 0x0001A0, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_AsCharacter_SCTBP_2) == 0x0001A8, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_AsCharacter_SCTBP_2' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_bSuccess_6) == 0x0001B0, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001B4, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_GetOwner_ReturnValue) == 0x0001C8, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_AsCharacter_SCTBP_3) == 0x0001D0, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_AsCharacter_SCTBP_3' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, K2Node_DynamicCast_bSuccess_7) == 0x0001D8, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA, CallFunc_IsNetAuthority_ReturnValue_1) == 0x0001D9, "Member 'ChampagneBottleGA_C_ExecuteUbergraph_ChampagneBottleGA::CallFunc_IsNetAuthority_ReturnValue_1' has a wrong offset!");

// Function ChampagneBottleGA.ChampagneBottleGA_C.OnBottleThrown
// 0x0008 (0x0008 - 0x0000)
struct ChampagneBottleGA_C_OnBottleThrown final
{
public:
	class ACharacterSCTBP_C*                      Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChampagneBottleGA_C_OnBottleThrown) == 0x000008, "Wrong alignment on ChampagneBottleGA_C_OnBottleThrown");
static_assert(sizeof(ChampagneBottleGA_C_OnBottleThrown) == 0x000008, "Wrong size on ChampagneBottleGA_C_OnBottleThrown");
static_assert(offsetof(ChampagneBottleGA_C_OnBottleThrown, Owner) == 0x000000, "Member 'ChampagneBottleGA_C_OnBottleThrown::Owner' has a wrong offset!");

// Function ChampagneBottleGA.ChampagneBottleGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct ChampagneBottleGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on ChampagneBottleGA_C_K2_OnEndAbility");
static_assert(sizeof(ChampagneBottleGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on ChampagneBottleGA_C_K2_OnEndAbility");
static_assert(offsetof(ChampagneBottleGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'ChampagneBottleGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function ChampagneBottleGA.ChampagneBottleGA_C.OnRelease_03099AE94382C845B77D16881AAEF69C
// 0x0004 (0x0004 - 0x0000)
struct ChampagneBottleGA_C_OnRelease_03099AE94382C845B77D16881AAEF69C final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChampagneBottleGA_C_OnRelease_03099AE94382C845B77D16881AAEF69C) == 0x000004, "Wrong alignment on ChampagneBottleGA_C_OnRelease_03099AE94382C845B77D16881AAEF69C");
static_assert(sizeof(ChampagneBottleGA_C_OnRelease_03099AE94382C845B77D16881AAEF69C) == 0x000004, "Wrong size on ChampagneBottleGA_C_OnRelease_03099AE94382C845B77D16881AAEF69C");
static_assert(offsetof(ChampagneBottleGA_C_OnRelease_03099AE94382C845B77D16881AAEF69C, TimeHeld) == 0x000000, "Member 'ChampagneBottleGA_C_OnRelease_03099AE94382C845B77D16881AAEF69C::TimeHeld' has a wrong offset!");

// Function ChampagneBottleGA.ChampagneBottleGA_C.RagdollTarget
// 0x0030 (0x0030 - 0x0000)
struct ChampagneBottleGA_C_RagdollTarget final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetRagdollImpulse_Impulse;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleGA_C_RagdollTarget) == 0x000008, "Wrong alignment on ChampagneBottleGA_C_RagdollTarget");
static_assert(sizeof(ChampagneBottleGA_C_RagdollTarget) == 0x000030, "Wrong size on ChampagneBottleGA_C_RagdollTarget");
static_assert(offsetof(ChampagneBottleGA_C_RagdollTarget, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'ChampagneBottleGA_C_RagdollTarget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_RagdollTarget, CallFunc_GetTargetRagdollImpulse_Impulse) == 0x000008, "Member 'ChampagneBottleGA_C_RagdollTarget::CallFunc_GetTargetRagdollImpulse_Impulse' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_RagdollTarget, K2Node_DynamicCast_AsICharacter_SCT) == 0x000018, "Member 'ChampagneBottleGA_C_RagdollTarget::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_RagdollTarget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ChampagneBottleGA_C_RagdollTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ChampagneBottleGA.ChampagneBottleGA_C.BreakEquipablePower
// 0x0010 (0x0010 - 0x0000)
struct ChampagneBottleGA_C_BreakEquipablePower final
{
public:
	class AEquipablePower_ChampagneBottle_C*      K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleGA_C_BreakEquipablePower) == 0x000008, "Wrong alignment on ChampagneBottleGA_C_BreakEquipablePower");
static_assert(sizeof(ChampagneBottleGA_C_BreakEquipablePower) == 0x000010, "Wrong size on ChampagneBottleGA_C_BreakEquipablePower");
static_assert(offsetof(ChampagneBottleGA_C_BreakEquipablePower, K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle) == 0x000000, "Member 'ChampagneBottleGA_C_BreakEquipablePower::K2Node_DynamicCast_AsEquipable_Power_Champagne_Bottle' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_BreakEquipablePower, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'ChampagneBottleGA_C_BreakEquipablePower::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ChampagneBottleGA.ChampagneBottleGA_C.CallHitEvent
// 0x0018 (0x0018 - 0x0000)
struct ChampagneBottleGA_C_CallHitEvent final
{
public:
	class APlayerController*                      CallFunc_GetTargetController_AsPlayer_Controller;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwnerController_AsPlayer_Controller;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleGA_C_CallHitEvent) == 0x000008, "Wrong alignment on ChampagneBottleGA_C_CallHitEvent");
static_assert(sizeof(ChampagneBottleGA_C_CallHitEvent) == 0x000018, "Wrong size on ChampagneBottleGA_C_CallHitEvent");
static_assert(offsetof(ChampagneBottleGA_C_CallHitEvent, CallFunc_GetTargetController_AsPlayer_Controller) == 0x000000, "Member 'ChampagneBottleGA_C_CallHitEvent::CallFunc_GetTargetController_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_CallHitEvent, CallFunc_GetOwnerController_AsPlayer_Controller) == 0x000008, "Member 'ChampagneBottleGA_C_CallHitEvent::CallFunc_GetOwnerController_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_CallHitEvent, CallFunc_IsServer_ReturnValue) == 0x000010, "Member 'ChampagneBottleGA_C_CallHitEvent::CallFunc_IsServer_ReturnValue' has a wrong offset!");

// Function ChampagneBottleGA.ChampagneBottleGA_C.GetTargetRagdollImpulse
// 0x0078 (0x0078 - 0x0000)
struct ChampagneBottleGA_C_GetTargetRagdollImpulse final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impulse;                                           // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChampagneBottleGA_C_GetTargetRagdollImpulse) == 0x000008, "Wrong alignment on ChampagneBottleGA_C_GetTargetRagdollImpulse");
static_assert(sizeof(ChampagneBottleGA_C_GetTargetRagdollImpulse) == 0x000078, "Wrong size on ChampagneBottleGA_C_GetTargetRagdollImpulse");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetRagdollImpulse, Target) == 0x000000, "Member 'ChampagneBottleGA_C_GetTargetRagdollImpulse::Target' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetRagdollImpulse, Impulse) == 0x000008, "Member 'ChampagneBottleGA_C_GetTargetRagdollImpulse::Impulse' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetRagdollImpulse, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000018, "Member 'ChampagneBottleGA_C_GetTargetRagdollImpulse::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetRagdollImpulse, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'ChampagneBottleGA_C_GetTargetRagdollImpulse::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetRagdollImpulse, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00002C, "Member 'ChampagneBottleGA_C_GetTargetRagdollImpulse::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetRagdollImpulse, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'ChampagneBottleGA_C_GetTargetRagdollImpulse::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetRagdollImpulse, CallFunc_Normal_ReturnValue) == 0x000044, "Member 'ChampagneBottleGA_C_GetTargetRagdollImpulse::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetRagdollImpulse, CallFunc_Add_VectorVector_ReturnValue) == 0x000050, "Member 'ChampagneBottleGA_C_GetTargetRagdollImpulse::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetRagdollImpulse, CallFunc_Normal_ReturnValue_1) == 0x00005C, "Member 'ChampagneBottleGA_C_GetTargetRagdollImpulse::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetRagdollImpulse, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000068, "Member 'ChampagneBottleGA_C_GetTargetRagdollImpulse::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function ChampagneBottleGA.ChampagneBottleGA_C.GetOwnerController
// 0x0038 (0x0038 - 0x0000)
struct ChampagneBottleGA_C_GetOwnerController final
{
public:
	class APlayerController*                      AsPlayer_Controller;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleGA_C_GetOwnerController) == 0x000008, "Wrong alignment on ChampagneBottleGA_C_GetOwnerController");
static_assert(sizeof(ChampagneBottleGA_C_GetOwnerController) == 0x000038, "Wrong size on ChampagneBottleGA_C_GetOwnerController");
static_assert(offsetof(ChampagneBottleGA_C_GetOwnerController, AsPlayer_Controller) == 0x000000, "Member 'ChampagneBottleGA_C_GetOwnerController::AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetOwnerController, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'ChampagneBottleGA_C_GetOwnerController::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetOwnerController, K2Node_DynamicCast_AsPawn) == 0x000010, "Member 'ChampagneBottleGA_C_GetOwnerController::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetOwnerController, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ChampagneBottleGA_C_GetOwnerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetOwnerController, CallFunc_GetController_ReturnValue) == 0x000020, "Member 'ChampagneBottleGA_C_GetOwnerController::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetOwnerController, K2Node_DynamicCast_AsPlayer_Controller) == 0x000028, "Member 'ChampagneBottleGA_C_GetOwnerController::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetOwnerController, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'ChampagneBottleGA_C_GetOwnerController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function ChampagneBottleGA.ChampagneBottleGA_C.GetTargetController
// 0x0038 (0x0038 - 0x0000)
struct ChampagneBottleGA_C_GetTargetController final
{
public:
	class APlayerController*                      AsPlayer_Controller;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChampagneBottleGA_C_GetTargetController) == 0x000008, "Wrong alignment on ChampagneBottleGA_C_GetTargetController");
static_assert(sizeof(ChampagneBottleGA_C_GetTargetController) == 0x000038, "Wrong size on ChampagneBottleGA_C_GetTargetController");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetController, AsPlayer_Controller) == 0x000000, "Member 'ChampagneBottleGA_C_GetTargetController::AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetController, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'ChampagneBottleGA_C_GetTargetController::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChampagneBottleGA_C_GetTargetController, K2Node_DynamicCast_AsPawn) == 0x000010, "Member 'ChampagneBottleGA_C_GetTargetController::K2Node_DynamicCast_AsPawn' has a wrong offset!");
