#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterPoseSCTBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PoseAssetCustomization_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CharacterPoseSCTBP.CharacterPoseSCTBP_C
// 0x0138 (0x03E0 - 0x02A8)
class ACharacterPoseSCTBP_C final : public ASkeletalMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Eyewear;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Beard;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Accessory01;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 UpperBody;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Feet;                                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 LowerBody;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HeadDynamicMaterial;                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCurveFloat*>                    BlinkCurve;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPoseAssetCustomization                Customization;                                     // 0x0300(0x00E0)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharacterPoseSCTBP(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Set_Masks();
	void Set_Appearance();
	void Set_Facial();
	void Set_Hair_Color();
	void Set_Customization();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterPoseSCTBP_C">();
	}
	static class ACharacterPoseSCTBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACharacterPoseSCTBP_C>();
	}
};
static_assert(alignof(ACharacterPoseSCTBP_C) == 0x000008, "Wrong alignment on ACharacterPoseSCTBP_C");
static_assert(sizeof(ACharacterPoseSCTBP_C) == 0x0003E0, "Wrong size on ACharacterPoseSCTBP_C");
static_assert(offsetof(ACharacterPoseSCTBP_C, UberGraphFrame) == 0x0002A8, "Member 'ACharacterPoseSCTBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACharacterPoseSCTBP_C, Eyewear) == 0x0002B0, "Member 'ACharacterPoseSCTBP_C::Eyewear' has a wrong offset!");
static_assert(offsetof(ACharacterPoseSCTBP_C, Beard) == 0x0002B8, "Member 'ACharacterPoseSCTBP_C::Beard' has a wrong offset!");
static_assert(offsetof(ACharacterPoseSCTBP_C, Accessory01) == 0x0002C0, "Member 'ACharacterPoseSCTBP_C::Accessory01' has a wrong offset!");
static_assert(offsetof(ACharacterPoseSCTBP_C, Head) == 0x0002C8, "Member 'ACharacterPoseSCTBP_C::Head' has a wrong offset!");
static_assert(offsetof(ACharacterPoseSCTBP_C, UpperBody) == 0x0002D0, "Member 'ACharacterPoseSCTBP_C::UpperBody' has a wrong offset!");
static_assert(offsetof(ACharacterPoseSCTBP_C, Feet) == 0x0002D8, "Member 'ACharacterPoseSCTBP_C::Feet' has a wrong offset!");
static_assert(offsetof(ACharacterPoseSCTBP_C, LowerBody) == 0x0002E0, "Member 'ACharacterPoseSCTBP_C::LowerBody' has a wrong offset!");
static_assert(offsetof(ACharacterPoseSCTBP_C, HeadDynamicMaterial) == 0x0002E8, "Member 'ACharacterPoseSCTBP_C::HeadDynamicMaterial' has a wrong offset!");
static_assert(offsetof(ACharacterPoseSCTBP_C, BlinkCurve) == 0x0002F0, "Member 'ACharacterPoseSCTBP_C::BlinkCurve' has a wrong offset!");
static_assert(offsetof(ACharacterPoseSCTBP_C, Customization) == 0x000300, "Member 'ACharacterPoseSCTBP_C::Customization' has a wrong offset!");

}

