#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterColliderBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CharacterColliderBP.CharacterColliderBP_C.On_CharacterEntered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CharacterColliderBP_C_On_CharacterEntered__DelegateSignature final
{
public:
	class ACharacterSCTBP_C*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterColliderBP_C_On_CharacterEntered__DelegateSignature) == 0x000008, "Wrong alignment on CharacterColliderBP_C_On_CharacterEntered__DelegateSignature");
static_assert(sizeof(CharacterColliderBP_C_On_CharacterEntered__DelegateSignature) == 0x000008, "Wrong size on CharacterColliderBP_C_On_CharacterEntered__DelegateSignature");
static_assert(offsetof(CharacterColliderBP_C_On_CharacterEntered__DelegateSignature, Character) == 0x000000, "Member 'CharacterColliderBP_C_On_CharacterEntered__DelegateSignature::Character' has a wrong offset!");

// Function CharacterColliderBP.CharacterColliderBP_C.On_CharacterExit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CharacterColliderBP_C_On_CharacterExit__DelegateSignature final
{
public:
	class ACharacterSCTBP_C*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterColliderBP_C_On_CharacterExit__DelegateSignature) == 0x000008, "Wrong alignment on CharacterColliderBP_C_On_CharacterExit__DelegateSignature");
static_assert(sizeof(CharacterColliderBP_C_On_CharacterExit__DelegateSignature) == 0x000008, "Wrong size on CharacterColliderBP_C_On_CharacterExit__DelegateSignature");
static_assert(offsetof(CharacterColliderBP_C_On_CharacterExit__DelegateSignature, Character) == 0x000000, "Member 'CharacterColliderBP_C_On_CharacterExit__DelegateSignature::Character' has a wrong offset!");

// Function CharacterColliderBP.CharacterColliderBP_C.ExecuteUbergraph_CharacterColliderBP
// 0x0198 (0x0198 - 0x0000)
struct CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      Temp_wildcard_Variable;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacterSCTBP_C*>              Temp_wildcard_Variable_1;                          // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class ACharacterSCTBP_C*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0050(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_Character_1;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       K2Node_DynamicCast_AsSphere_Collision;             // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_Character;                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       K2Node_DynamicCast_AsSphere_Collision_1;           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Temp_float_Variable;                               // 0x0170(0x0010)(ReferenceParm)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP) == 0x000008, "Wrong alignment on CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP");
static_assert(sizeof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP) == 0x000198, "Wrong size on CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, EntryPoint) == 0x000000, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, Temp_wildcard_Variable) == 0x000008, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, Temp_wildcard_Variable_1) == 0x000010, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Array_Get_Item) == 0x000020, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000030, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000038, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000040, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000048, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_ComponentBoundEvent_bFromSweep) == 0x00004C, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_ComponentBoundEvent_SweepResult) == 0x000050, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_CustomEvent_Character_1) == 0x0000E0, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_DynamicCast_AsSphere_Collision) == 0x0000E8, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_DynamicCast_AsSphere_Collision' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_CustomEvent_Character) == 0x0000F8, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_GetOwner_ReturnValue) == 0x000100, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000108, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_ComponentBoundEvent_OtherActor) == 0x000110, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_ComponentBoundEvent_OtherComp) == 0x000118, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000120, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000128, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_DynamicCast_AsSphere_Collision_1) == 0x000138, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_DynamicCast_AsSphere_Collision_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_GetOwner_ReturnValue_1) == 0x000148, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000150, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, K2Node_DynamicCast_bSuccess_3) == 0x000158, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Array_Add_ReturnValue) == 0x00015C, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_GetTimeSeconds_ReturnValue) == 0x000160, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000164, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000168, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00016C, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, Temp_float_Variable) == 0x000170, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000184, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Greater_IntInt_ReturnValue) == 0x00018C, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP, CallFunc_Array_Add_ReturnValue_1) == 0x000190, "Member 'CharacterColliderBP_C_ExecuteUbergraph_CharacterColliderBP::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function CharacterColliderBP.CharacterColliderBP_C.BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function CharacterColliderBP.CharacterColliderBP_C.Character Exit
// 0x0008 (0x0008 - 0x0000)
struct CharacterColliderBP_C_Character_Exit final
{
public:
	class ACharacterSCTBP_C*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterColliderBP_C_Character_Exit) == 0x000008, "Wrong alignment on CharacterColliderBP_C_Character_Exit");
static_assert(sizeof(CharacterColliderBP_C_Character_Exit) == 0x000008, "Wrong size on CharacterColliderBP_C_Character_Exit");
static_assert(offsetof(CharacterColliderBP_C_Character_Exit, Character) == 0x000000, "Member 'CharacterColliderBP_C_Character_Exit::Character' has a wrong offset!");

// Function CharacterColliderBP.CharacterColliderBP_C.Character Entered
// 0x0008 (0x0008 - 0x0000)
struct CharacterColliderBP_C_Character_Entered final
{
public:
	class ACharacterSCTBP_C*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterColliderBP_C_Character_Entered) == 0x000008, "Wrong alignment on CharacterColliderBP_C_Character_Entered");
static_assert(sizeof(CharacterColliderBP_C_Character_Entered) == 0x000008, "Wrong size on CharacterColliderBP_C_Character_Entered");
static_assert(offsetof(CharacterColliderBP_C_Character_Entered, Character) == 0x000000, "Member 'CharacterColliderBP_C_Character_Entered::Character' has a wrong offset!");

// Function CharacterColliderBP.CharacterColliderBP_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'CharacterColliderBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function CharacterColliderBP.CharacterColliderBP_C.Unragdoll
// 0x0030 (0x0030 - 0x0000)
struct CharacterColliderBP_C_Unragdoll final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalculateRagdollLocationRotation_OutLocation; // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_CalculateRagdollLocationRotation_OutRotation; // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterColliderBP_C_Unragdoll) == 0x000008, "Wrong alignment on CharacterColliderBP_C_Unragdoll");
static_assert(sizeof(CharacterColliderBP_C_Unragdoll) == 0x000030, "Wrong size on CharacterColliderBP_C_Unragdoll");
static_assert(offsetof(CharacterColliderBP_C_Unragdoll, Character) == 0x000000, "Member 'CharacterColliderBP_C_Unragdoll::Character' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_Unragdoll, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000008, "Member 'CharacterColliderBP_C_Unragdoll::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(CharacterColliderBP_C_Unragdoll, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'CharacterColliderBP_C_Unragdoll::K2Node_DynamicCast_bSuccess' has a wrong offset!");
