#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterPoseSCTBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function CharacterPoseSCTBP.CharacterPoseSCTBP_C.ExecuteUbergraph_CharacterPoseSCTBP
// 0x0008 (0x0008 - 0x0000)
struct CharacterPoseSCTBP_C_ExecuteUbergraph_CharacterPoseSCTBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPoseSCTBP_C_ExecuteUbergraph_CharacterPoseSCTBP) == 0x000004, "Wrong alignment on CharacterPoseSCTBP_C_ExecuteUbergraph_CharacterPoseSCTBP");
static_assert(sizeof(CharacterPoseSCTBP_C_ExecuteUbergraph_CharacterPoseSCTBP) == 0x000008, "Wrong size on CharacterPoseSCTBP_C_ExecuteUbergraph_CharacterPoseSCTBP");
static_assert(offsetof(CharacterPoseSCTBP_C_ExecuteUbergraph_CharacterPoseSCTBP, EntryPoint) == 0x000000, "Member 'CharacterPoseSCTBP_C_ExecuteUbergraph_CharacterPoseSCTBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_ExecuteUbergraph_CharacterPoseSCTBP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'CharacterPoseSCTBP_C_ExecuteUbergraph_CharacterPoseSCTBP::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function CharacterPoseSCTBP.CharacterPoseSCTBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CharacterPoseSCTBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPoseSCTBP_C_ReceiveTick) == 0x000004, "Wrong alignment on CharacterPoseSCTBP_C_ReceiveTick");
static_assert(sizeof(CharacterPoseSCTBP_C_ReceiveTick) == 0x000004, "Wrong size on CharacterPoseSCTBP_C_ReceiveTick");
static_assert(offsetof(CharacterPoseSCTBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CharacterPoseSCTBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CharacterPoseSCTBP.CharacterPoseSCTBP_C.Set Masks
// 0x0040 (0x0040 - 0x0000)
struct CharacterPoseSCTBP_C_Set_Masks final
{
public:
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0000(0x0010)(ReferenceParm)
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Array_Get_Item_2;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Array_Get_Item_3;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Array_Get_Item_4;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPoseSCTBP_C_Set_Masks) == 0x000008, "Wrong alignment on CharacterPoseSCTBP_C_Set_Masks");
static_assert(sizeof(CharacterPoseSCTBP_C_Set_Masks) == 0x000040, "Wrong size on CharacterPoseSCTBP_C_Set_Masks");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Masks, CallFunc_GetMaterials_ReturnValue) == 0x000000, "Member 'CharacterPoseSCTBP_C_Set_Masks::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Masks, CallFunc_Array_Get_Item) == 0x000010, "Member 'CharacterPoseSCTBP_C_Set_Masks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Masks, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'CharacterPoseSCTBP_C_Set_Masks::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Masks, CallFunc_Array_Get_Item_2) == 0x000020, "Member 'CharacterPoseSCTBP_C_Set_Masks::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Masks, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'CharacterPoseSCTBP_C_Set_Masks::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Masks, CallFunc_Array_Get_Item_3) == 0x000030, "Member 'CharacterPoseSCTBP_C_Set_Masks::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Masks, CallFunc_Array_Get_Item_4) == 0x000038, "Member 'CharacterPoseSCTBP_C_Set_Masks::CallFunc_Array_Get_Item_4' has a wrong offset!");

// Function CharacterPoseSCTBP.CharacterPoseSCTBP_C.Set Appearance
// 0x0050 (0x0050 - 0x0000)
struct CharacterPoseSCTBP_C_Set_Appearance final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPoseSCTBP_C_Set_Appearance) == 0x000008, "Wrong alignment on CharacterPoseSCTBP_C_Set_Appearance");
static_assert(sizeof(CharacterPoseSCTBP_C_Set_Appearance) == 0x000050, "Wrong size on CharacterPoseSCTBP_C_Set_Appearance");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, Temp_int_Array_Index_Variable) == 0x000000, "Member 'CharacterPoseSCTBP_C_Set_Appearance::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CharacterPoseSCTBP_C_Set_Appearance::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CharacterPoseSCTBP_C_Set_Appearance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'CharacterPoseSCTBP_C_Set_Appearance::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'CharacterPoseSCTBP_C_Set_Appearance::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, CallFunc_Array_Get_Item) == 0x000028, "Member 'CharacterPoseSCTBP_C_Set_Appearance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'CharacterPoseSCTBP_C_Set_Appearance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, CallFunc_Map_Find_Value) == 0x00003C, "Member 'CharacterPoseSCTBP_C_Set_Appearance::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'CharacterPoseSCTBP_C_Set_Appearance::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'CharacterPoseSCTBP_C_Set_Appearance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Appearance, CallFunc_Conv_StringToName_ReturnValue) == 0x000044, "Member 'CharacterPoseSCTBP_C_Set_Appearance::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function CharacterPoseSCTBP.CharacterPoseSCTBP_C.Set Facial
// 0x0088 (0x0088 - 0x0000)
struct CharacterPoseSCTBP_C_Set_Facial final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_Map_Keys_Keys_1;                          // 0x0028(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Map_Find_Value_1;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterPoseSCTBP_C_Set_Facial) == 0x000008, "Wrong alignment on CharacterPoseSCTBP_C_Set_Facial");
static_assert(sizeof(CharacterPoseSCTBP_C_Set_Facial) == 0x000088, "Wrong size on CharacterPoseSCTBP_C_Set_Facial");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'CharacterPoseSCTBP_C_Set_Facial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, Temp_int_Array_Index_Variable) == 0x000008, "Member 'CharacterPoseSCTBP_C_Set_Facial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'CharacterPoseSCTBP_C_Set_Facial::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'CharacterPoseSCTBP_C_Set_Facial::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Map_Keys_Keys_1) == 0x000028, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Array_Get_Item) == 0x000038, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Map_Find_Value) == 0x000058, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Map_Find_ReturnValue) == 0x00005C, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Map_Find_Value_1) == 0x000060, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Map_Find_ReturnValue_1) == 0x000064, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Conv_StringToName_ReturnValue) == 0x000068, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000070, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Array_Length_ReturnValue_1) == 0x00007C, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Facial, CallFunc_Less_IntInt_ReturnValue_1) == 0x000081, "Member 'CharacterPoseSCTBP_C_Set_Facial::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function CharacterPoseSCTBP.CharacterPoseSCTBP_C.Set Hair Color
// 0x0048 (0x0048 - 0x0000)
struct CharacterPoseSCTBP_C_Set_Hair_Color final
{
public:
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0000(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue_1;               // 0x0028(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPoseSCTBP_C_Set_Hair_Color) == 0x000008, "Wrong alignment on CharacterPoseSCTBP_C_Set_Hair_Color");
static_assert(sizeof(CharacterPoseSCTBP_C_Set_Hair_Color) == 0x000048, "Wrong size on CharacterPoseSCTBP_C_Set_Hair_Color");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Hair_Color, CallFunc_GetMaterials_ReturnValue) == 0x000000, "Member 'CharacterPoseSCTBP_C_Set_Hair_Color::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Hair_Color, CallFunc_Array_Get_Item) == 0x000010, "Member 'CharacterPoseSCTBP_C_Set_Hair_Color::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Hair_Color, CallFunc_IsActive_ReturnValue) == 0x000018, "Member 'CharacterPoseSCTBP_C_Set_Hair_Color::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Hair_Color, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'CharacterPoseSCTBP_C_Set_Hair_Color::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Hair_Color, CallFunc_GetMaterials_ReturnValue_1) == 0x000028, "Member 'CharacterPoseSCTBP_C_Set_Hair_Color::CallFunc_GetMaterials_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Hair_Color, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'CharacterPoseSCTBP_C_Set_Hair_Color::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Hair_Color, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000040, "Member 'CharacterPoseSCTBP_C_Set_Hair_Color::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function CharacterPoseSCTBP.CharacterPoseSCTBP_C.Set Customization
// 0x0020 (0x0020 - 0x0000)
struct CharacterPoseSCTBP_C_Set_Customization final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterPoseSCTBP_C_Set_Customization) == 0x000008, "Wrong alignment on CharacterPoseSCTBP_C_Set_Customization");
static_assert(sizeof(CharacterPoseSCTBP_C_Set_Customization) == 0x000020, "Wrong size on CharacterPoseSCTBP_C_Set_Customization");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Customization, Temp_int_Array_Index_Variable) == 0x000000, "Member 'CharacterPoseSCTBP_C_Set_Customization::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Customization, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CharacterPoseSCTBP_C_Set_Customization::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Customization, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CharacterPoseSCTBP_C_Set_Customization::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Customization, CallFunc_Array_Get_Item) == 0x000010, "Member 'CharacterPoseSCTBP_C_Set_Customization::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Customization, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'CharacterPoseSCTBP_C_Set_Customization::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPoseSCTBP_C_Set_Customization, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'CharacterPoseSCTBP_C_Set_Customization::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

