#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CigaretteRigAnim_AnimBp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function cigaretteRigAnim_AnimBp.cigaretteRigAnim_AnimBp_C.ExecuteUbergraph_cigaretteRigAnim_AnimBp
// 0x0028 (0x0028 - 0x0000)
struct CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp) == 0x000008, "Wrong alignment on CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp");
static_assert(sizeof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp) == 0x000028, "Wrong size on CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp");
static_assert(offsetof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp, EntryPoint) == 0x000000, "Member 'CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp::EntryPoint' has a wrong offset!");
static_assert(offsetof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000019, "Member 'CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00001A, "Member 'CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue) == 0x00001C, "Member 'CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp, CallFunc_Less_FloatFloat_ReturnValue) == 0x000020, "Member 'CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000021, "Member 'CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000022, "Member 'CigaretteRigAnim_AnimBp_C_ExecuteUbergraph_cigaretteRigAnim_AnimBp::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");

// Function cigaretteRigAnim_AnimBp.cigaretteRigAnim_AnimBp_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct CigaretteRigAnim_AnimBp_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(CigaretteRigAnim_AnimBp_C_AnimGraph) == 0x000008, "Wrong alignment on CigaretteRigAnim_AnimBp_C_AnimGraph");
static_assert(sizeof(CigaretteRigAnim_AnimBp_C_AnimGraph) == 0x000010, "Wrong size on CigaretteRigAnim_AnimBp_C_AnimGraph");
static_assert(offsetof(CigaretteRigAnim_AnimBp_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'CigaretteRigAnim_AnimBp_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

