#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClientEntryPCBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "E_StartScreenTabs_structs.hpp"


namespace SDK::Params
{

// Function ClientEntryPCBP.ClientEntryPCBP_C.ExecuteUbergraph_ClientEntryPCBP
// 0x05B0 (0x05B0 - 0x0000)
struct ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasPendingConsoleLaunchIntent_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingConsoleSessionInvite_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue_1; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPendingConsoleLaunchIntent_ReturnValue_1; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_Code;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTSyncPlatformPurchases*              CallFunc_SyncPlatformPurchases_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSyncPlatformPurchasesRateLimited_ReturnValue; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCM_XboxLoginWidget_C*                  CallFunc_Create_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveControllerGIS*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ResetSaveController_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Result, int32 Code)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue_2; // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Result_1;                       // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_3;                         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxUserLoggedIn_ReturnValue;           // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPendingXboxLogin_ReturnValue;          // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoPendingXboxLogin_ReturnValue;           // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17F[0x1];                                      // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetSaveSlotsToLoad_SaveSlots;             // 0x0180(0x0010)(ReferenceParm)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0190(0x0018)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x01B8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsConnected_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Result, int32 Code)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x01E8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable;                              // 0x0208(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x0220(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x0248(0x0018)(HasGetValueTypeHash)
	class Ubp_wi_StartScreenGuest_C*              CallFunc_Create_ReturnValue_1;                     // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(E_StartScreenTabs Tab)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x0280(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_6;                        // 0x0298(0x0018)(HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAvatarName_ReturnValue;                // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_7;                        // 0x02D0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_1;                            // 0x02E8(0x0018)(HasGetValueTypeHash)
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue;                   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_8;                        // 0x0310(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitialLoadComplete_ReturnValue;          // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32E[0x2];                                      // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCM_MainMenuWI_C*                       CallFunc_Create_ReturnValue_2;                     // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue_1;            // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0363(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_9;                        // 0x0368(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_10;                       // 0x0380(0x0018)(HasGetValueTypeHash)
	TArray<class UFCT_IntroWI_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0398(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FKey                                   K2Node_InputKeyEvent_Key_11;                       // 0x03A8(0x0018)(HasGetValueTypeHash)
	class UFCT_IntroWI_C*                         CallFunc_Array_Get_Item;                           // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class Ubp_wi_VoiceSettingWelcomeMenu_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x03D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class Ubp_wi_VoiceSettingWelcomeMenu_C*       CallFunc_Array_Get_Item_1;                         // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x03F0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingConsoleSessionInvite_ReturnValue_1; // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0424(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_1; // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingConsoleSessionInvite_ReturnValue_2; // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x044C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitialLoadWI_C*                       CallFunc_Create_ReturnValue_3;                     // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveControllerGIS*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_11;  // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoInitialLoad_ReturnValue;                // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFCT_IntroWI_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets_2;      // 0x0478(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_12;  // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCT_IntroWI_C*                         CallFunc_Array_Get_Item_2;                         // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x04A0(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class Ubp_wi_VoiceSettingWelcomeMenu_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets_3;      // 0x04B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class Ubp_wi_VoiceSettingWelcomeMenu_C*       CallFunc_Array_Get_Item_3;                         // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CD[0x3];                                      // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_2; // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitialLoadWI_C*                       CallFunc_Create_ReturnValue_4;                     // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x04E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConnected_ReturnValue_1;                // 0x04FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x04FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x04FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FE[0x2];                                      // 0x04FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_12;                       // 0x0500(0x0018)(HasGetValueTypeHash)
	TArray<class UFCT_IntroWI_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets_4;      // 0x0518(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_13;  // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCT_IntroWI_C*                         CallFunc_Array_Get_Item_4;                         // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Ubp_wi_VoiceSettingWelcomeMenu_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets_5;      // 0x0540(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_wi_VoiceSettingWelcomeMenu_C*       CallFunc_Array_Get_Item_5;                         // 0x0558(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTAuthLogoutCallbackProxy*            CallFunc_Logout_ReturnValue;                       // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_572[0x6];                                      // 0x0572(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_3; // 0x0578(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0580(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue_1;             // 0x0594(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_595[0x3];                                      // 0x0595(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Result;                         // 0x0598(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_2;                         // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxUserLoggedIn_ReturnValue_1;         // 0x05AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP) == 0x000008, "Wrong alignment on ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP");
static_assert(sizeof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP) == 0x0005B0, "Wrong size on ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, EntryPoint) == 0x000000, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_HasPendingConsoleLaunchIntent_ReturnValue) == 0x000020, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_HasPendingConsoleLaunchIntent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000028, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue) == 0x000030, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000038, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_HasPendingConsoleSessionInvite_ReturnValue) == 0x000040, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_HasPendingConsoleSessionInvite_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue_1) == 0x000041, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000048, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_BooleanOR_ReturnValue) == 0x000050, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_HasPendingConsoleLaunchIntent_ReturnValue_1) == 0x000051, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_HasPendingConsoleLaunchIntent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CustomEvent_Code_1) == 0x000054, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CustomEvent_Message_1) == 0x000058, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CustomEvent_Code) == 0x000078, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CustomEvent_Message) == 0x000080, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_string_Variable) == 0x0000A0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Variable) == 0x0000B0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_SyncPlatformPurchases_ReturnValue) == 0x0000B8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_SyncPlatformPurchases_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0000C0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetSyncPlatformPurchasesRateLimited_ReturnValue) == 0x0000C8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetSyncPlatformPurchasesRateLimited_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C9, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_IsValid_ReturnValue_1) == 0x0000CA, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Create_ReturnValue) == 0x0000D0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x0000D8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_ResetSaveController_ReturnValue) == 0x0000F0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_ResetSaveController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F4, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate_5) == 0x000104, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Loop_Counter_Variable) == 0x000114, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Add_IntInt_ReturnValue) == 0x000118, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Array_Index_Variable) == 0x00011C, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Array_Index_Variable_1) == 0x000120, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Loop_Counter_Variable_1) == 0x000124, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000128, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Array_Index_Variable_2) == 0x00012C, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000130, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue_2) == 0x000138, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Loop_Counter_Variable_2) == 0x00013C, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Array_Index_Variable_3) == 0x000140, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Add_IntInt_ReturnValue_2) == 0x000144, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Loop_Counter_Variable_3) == 0x000148, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Add_IntInt_ReturnValue_3) == 0x00014C, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Array_Index_Variable_4) == 0x000150, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate_6) == 0x000154, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CustomEvent_Result_1) == 0x000168, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CustomEvent_Code_3) == 0x000178, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CustomEvent_Code_3' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_IsXboxUserLoggedIn_ReturnValue) == 0x00017C, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_IsXboxUserLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_HasPendingXboxLogin_ReturnValue) == 0x00017D, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_HasPendingXboxLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_DoPendingXboxLogin_ReturnValue) == 0x00017E, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_DoPendingXboxLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetSaveSlotsToLoad_SaveSlots) == 0x000180, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetSaveSlotsToLoad_SaveSlots' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key) == 0x000190, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001A8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_1) == 0x0001B8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_IsConnected_ReturnValue) == 0x0001D0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_IsConnected_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001D4, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_2) == 0x0001E8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_IsValid_ReturnValue_2) == 0x000200, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_struct_Variable) == 0x000208, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_3) == 0x000220, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Loop_Counter_Variable_4) == 0x000238, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Array_Index_Variable_5) == 0x00023C, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Add_IntInt_ReturnValue_4) == 0x000240, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_4) == 0x000248, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_4' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Create_ReturnValue_1) == 0x000260, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_IsValid_ReturnValue_3) == 0x000268, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate_9) == 0x00026C, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_5) == 0x000280, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_5' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_6) == 0x000298, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_6' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x0002B0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetAvatarName_ReturnValue) == 0x0002B8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetAvatarName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetGameUserSettings_ReturnValue) == 0x0002C8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_7) == 0x0002D0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_7' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_struct_Variable_1) == 0x0002E8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_LeaveParty_ReturnValue) == 0x000300, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_LeaveParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_IsValid_ReturnValue_4) == 0x000308, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, Temp_int_Loop_Counter_Variable_5) == 0x00030C, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_8) == 0x000310, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_8' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Add_IntInt_ReturnValue_5) == 0x000328, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_InitialLoadComplete_ReturnValue) == 0x00032C, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_InitialLoadComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_IsValid_ReturnValue_5) == 0x00032D, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Create_ReturnValue_2) == 0x000330, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetPlatformName_ReturnValue) == 0x000338, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000348, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000349, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetPlatformName_ReturnValue_1) == 0x000350, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetPlatformName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_BooleanOR_ReturnValue_1) == 0x000360, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000361, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000362, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_BooleanOR_ReturnValue_2) == 0x000363, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_9) == 0x000368, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_9' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_10) == 0x000380, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_10' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000398, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_InputKeyEvent_Key_11) == 0x0003A8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_InputKeyEvent_Key_11' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Array_Get_Item) == 0x0003C0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Array_Length_ReturnValue) == 0x0003C8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Less_IntInt_ReturnValue) == 0x0003CC, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x0003D0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x0003D8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Array_Get_Item_1) == 0x0003E8, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, K2Node_CreateDelegate_OutputDelegate_10) == 0x0003F0, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_Array_Length_ReturnValue_1) == 0x000400, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_8) == 0x000408, "Member 'ClientEntryPCBP_C_ExecuteUbergraph_ClientEntryPCBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_8' has a wrong offset!");
