#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_AudioTabWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function CM_AudioTabWI.CM_AudioTabWI_C.ExecuteUbergraph_CM_AudioTabWI
// 0x0068 (0x0068 - 0x0000)
struct CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0010(0x0018)()
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_1;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_2;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0048(0x0018)()
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_3;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI) == 0x000008, "Wrong alignment on CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI");
static_assert(sizeof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI) == 0x000068, "Wrong size on CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, EntryPoint) == 0x000000, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, CallFunc_GetSpecialOptions_SpecialOptions) == 0x000008, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::CallFunc_GetSpecialOptions_SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, CallFunc_Conv_FloatToText_ReturnValue) == 0x000010, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, CallFunc_GetValue_ReturnValue) == 0x000028, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, CallFunc_GetValue_ReturnValue_1) == 0x00002C, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, K2Node_ComponentBoundEvent_Value_1) == 0x000030, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, K2Node_ComponentBoundEvent_Value) == 0x000034, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, CallFunc_GetSpecialOptions_SpecialOptions_1) == 0x000038, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::CallFunc_GetSpecialOptions_SpecialOptions_1' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, CallFunc_GetSpecialOptions_SpecialOptions_2) == 0x000040, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::CallFunc_GetSpecialOptions_SpecialOptions_2' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000048, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI, CallFunc_GetSpecialOptions_SpecialOptions_3) == 0x000060, "Member 'CM_AudioTabWI_C_ExecuteUbergraph_CM_AudioTabWI::CallFunc_GetSpecialOptions_SpecialOptions_3' has a wrong offset!");

// Function CM_AudioTabWI.CM_AudioTabWI_C.BndEvt__CM_AudioTabWI_MusicVolumeSlider_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MusicVolumeSlider_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MusicVolumeSlider_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MusicVolumeSlider_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MusicVolumeSlider_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MusicVolumeSlider_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MusicVolumeSlider_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MusicVolumeSlider_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_AudioTabWI.CM_AudioTabWI_C.BndEvt__CM_AudioTabWI_MasterVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MasterVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MasterVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MasterVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MasterVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MasterVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MasterVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_AudioTabWI_C_BndEvt__CM_AudioTabWI_MasterVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_AudioTabWI.CM_AudioTabWI_C.UpdateAndSaveMasterRTPC
// 0x0018 (0x0018 - 0x0000)
struct CM_AudioTabWI_C_UpdateAndSaveMasterRTPC final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_SpecialOptionsSave_C*               SpecialOptions;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_AudioTabWI_C_UpdateAndSaveMasterRTPC) == 0x000008, "Wrong alignment on CM_AudioTabWI_C_UpdateAndSaveMasterRTPC");
static_assert(sizeof(CM_AudioTabWI_C_UpdateAndSaveMasterRTPC) == 0x000018, "Wrong size on CM_AudioTabWI_C_UpdateAndSaveMasterRTPC");
static_assert(offsetof(CM_AudioTabWI_C_UpdateAndSaveMasterRTPC, Value) == 0x000000, "Member 'CM_AudioTabWI_C_UpdateAndSaveMasterRTPC::Value' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_UpdateAndSaveMasterRTPC, SpecialOptions) == 0x000008, "Member 'CM_AudioTabWI_C_UpdateAndSaveMasterRTPC::SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_UpdateAndSaveMasterRTPC, CallFunc_SaveGame_ReturnValue) == 0x000010, "Member 'CM_AudioTabWI_C_UpdateAndSaveMasterRTPC::CallFunc_SaveGame_ReturnValue' has a wrong offset!");

// Function CM_AudioTabWI.CM_AudioTabWI_C.UpdateAndSaveMusicRTPC
// 0x0018 (0x0018 - 0x0000)
struct CM_AudioTabWI_C_UpdateAndSaveMusicRTPC final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_SpecialOptionsSave_C*               SpecialOptions;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_AudioTabWI_C_UpdateAndSaveMusicRTPC) == 0x000008, "Wrong alignment on CM_AudioTabWI_C_UpdateAndSaveMusicRTPC");
static_assert(sizeof(CM_AudioTabWI_C_UpdateAndSaveMusicRTPC) == 0x000018, "Wrong size on CM_AudioTabWI_C_UpdateAndSaveMusicRTPC");
static_assert(offsetof(CM_AudioTabWI_C_UpdateAndSaveMusicRTPC, Value) == 0x000000, "Member 'CM_AudioTabWI_C_UpdateAndSaveMusicRTPC::Value' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_UpdateAndSaveMusicRTPC, SpecialOptions) == 0x000008, "Member 'CM_AudioTabWI_C_UpdateAndSaveMusicRTPC::SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_AudioTabWI_C_UpdateAndSaveMusicRTPC, CallFunc_SaveGame_ReturnValue) == 0x000010, "Member 'CM_AudioTabWI_C_UpdateAndSaveMusicRTPC::CallFunc_SaveGame_ReturnValue' has a wrong offset!");

}

