#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_ComboBoxWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_ComboBoxWI.CM_ComboBoxWI_C
// 0x0068 (0x05E0 - 0x0578)
class UCM_ComboBoxWI_C final : public UControllerSelectionStateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBorder*                                Border_0;                                          // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_SubMenuItemContainer_C*             CM_SubMenuItemContainer;                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBox;                                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectionChanged;                                // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnOpening;                                         // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   SettingTitleText;                                  // 0x05C0(0x0018)(Edit, BlueprintVisible)
	bool                                          bRoundedStyle;                                     // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void OnOpening__DelegateSignature();
	void ExecuteUbergraph_CM_ComboBoxWI(int32 EntryPoint);
	void K2_EventOnSetNormalCosmetics();
	void PreConstruct(bool IsDesignTime);
	void K2_EventOnSetHoveredCosmetics();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__CM_ComboBoxWI_ComboBox_K2Node_ComponentBoundEvent_1_OnOpeningEvent__DelegateSignature();
	void BndEvt__CM_ComboBoxWI_ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetDefaultValues(TArray<class FString>& Entries, const class FString& DefaultValue);
	struct FEventReply OnMouseOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void GetNavigationWidget(class UWidget** Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_ComboBoxWI_C">();
	}
	static class UCM_ComboBoxWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_ComboBoxWI_C>();
	}
};
static_assert(alignof(UCM_ComboBoxWI_C) == 0x000008, "Wrong alignment on UCM_ComboBoxWI_C");
static_assert(sizeof(UCM_ComboBoxWI_C) == 0x0005E0, "Wrong size on UCM_ComboBoxWI_C");
static_assert(offsetof(UCM_ComboBoxWI_C, UberGraphFrame) == 0x000578, "Member 'UCM_ComboBoxWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_ComboBoxWI_C, Border_0) == 0x000580, "Member 'UCM_ComboBoxWI_C::Border_0' has a wrong offset!");
static_assert(offsetof(UCM_ComboBoxWI_C, CM_SubMenuItemContainer) == 0x000588, "Member 'UCM_ComboBoxWI_C::CM_SubMenuItemContainer' has a wrong offset!");
static_assert(offsetof(UCM_ComboBoxWI_C, ComboBox) == 0x000590, "Member 'UCM_ComboBoxWI_C::ComboBox' has a wrong offset!");
static_assert(offsetof(UCM_ComboBoxWI_C, TitleText) == 0x000598, "Member 'UCM_ComboBoxWI_C::TitleText' has a wrong offset!");
static_assert(offsetof(UCM_ComboBoxWI_C, OnSelectionChanged) == 0x0005A0, "Member 'UCM_ComboBoxWI_C::OnSelectionChanged' has a wrong offset!");
static_assert(offsetof(UCM_ComboBoxWI_C, OnOpening) == 0x0005B0, "Member 'UCM_ComboBoxWI_C::OnOpening' has a wrong offset!");
static_assert(offsetof(UCM_ComboBoxWI_C, SettingTitleText) == 0x0005C0, "Member 'UCM_ComboBoxWI_C::SettingTitleText' has a wrong offset!");
static_assert(offsetof(UCM_ComboBoxWI_C, bRoundedStyle) == 0x0005D8, "Member 'UCM_ComboBoxWI_C::bRoundedStyle' has a wrong offset!");

}

