#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_ContentDialogWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_ContentDialogWrapper.CM_ContentDialogWrapper_C
// 0x00D8 (0x0338 - 0x0260)
class UCM_ContentDialogWrapper_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Background;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        Blur;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Content;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Header;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                HeaderSpace;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleTextBlock;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 ContentDialogClass;                                // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCM_QuitGameContentDialog_C*            ContentDialog;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x02B8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMap<class FString, class FString>            Params_0;                                          // 0x02D0(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bHasBackground;                                    // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bIncludeHeader;                                    // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_322[0x2];                                      // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTimer;                                         // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FadeTimerHandle;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_ContentDialogWrapper(int32 EntryPoint);
	void OnFadeOut();
	void OnFadeIn();
	void OnStartFadeTransition(float Timer);
	void CloseDialog();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Add_Content(class UUserWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_ContentDialogWrapper_C">();
	}
	static class UCM_ContentDialogWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_ContentDialogWrapper_C>();
	}
};
static_assert(alignof(UCM_ContentDialogWrapper_C) == 0x000008, "Wrong alignment on UCM_ContentDialogWrapper_C");
static_assert(sizeof(UCM_ContentDialogWrapper_C) == 0x000338, "Wrong size on UCM_ContentDialogWrapper_C");
static_assert(offsetof(UCM_ContentDialogWrapper_C, UberGraphFrame) == 0x000260, "Member 'UCM_ContentDialogWrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, Background) == 0x000268, "Member 'UCM_ContentDialogWrapper_C::Background' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, Blur) == 0x000270, "Member 'UCM_ContentDialogWrapper_C::Blur' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, Content) == 0x000278, "Member 'UCM_ContentDialogWrapper_C::Content' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, Header) == 0x000280, "Member 'UCM_ContentDialogWrapper_C::Header' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, HeaderSpace) == 0x000288, "Member 'UCM_ContentDialogWrapper_C::HeaderSpace' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, Image) == 0x000290, "Member 'UCM_ContentDialogWrapper_C::Image' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, Image_1) == 0x000298, "Member 'UCM_ContentDialogWrapper_C::Image_1' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, TitleTextBlock) == 0x0002A0, "Member 'UCM_ContentDialogWrapper_C::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, ContentDialogClass) == 0x0002A8, "Member 'UCM_ContentDialogWrapper_C::ContentDialogClass' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, ContentDialog) == 0x0002B0, "Member 'UCM_ContentDialogWrapper_C::ContentDialog' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, TitleText) == 0x0002B8, "Member 'UCM_ContentDialogWrapper_C::TitleText' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, Params_0) == 0x0002D0, "Member 'UCM_ContentDialogWrapper_C::Params_0' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, bHasBackground) == 0x000320, "Member 'UCM_ContentDialogWrapper_C::bHasBackground' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, bIncludeHeader) == 0x000321, "Member 'UCM_ContentDialogWrapper_C::bIncludeHeader' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, FadeTimer) == 0x000324, "Member 'UCM_ContentDialogWrapper_C::FadeTimer' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, CurrentTime) == 0x000328, "Member 'UCM_ContentDialogWrapper_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(UCM_ContentDialogWrapper_C, FadeTimerHandle) == 0x000330, "Member 'UCM_ContentDialogWrapper_C::FadeTimerHandle' has a wrong offset!");

}

