#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_CustomizationCategoryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_CustomizationCategoryButton.CM_CustomizationCategoryButton_C
// 0x02E0 (0x0898 - 0x05B8)
class UCM_CustomizationCategoryButton_C final : public UItemCardUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 IconImage;                                         // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCategorySelected;                                // 0x05C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FButtonStyle                           Style;                                             // 0x05D8(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              IconScale;                                         // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture;                                       // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           SelectedIconColor;                                 // 0x0860(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           UnselectedColor;                                   // 0x0870(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected_0;                                     // 0x0880(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_881[0x3];                                      // 0x0881(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                IconPadding;                                       // 0x0884(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnCategorySelected__DelegateSignature();
	void ExecuteUbergraph_CM_CustomizationCategoryButton(int32 EntryPoint);
	void K2_EventOnSetNormalCosmetics();
	void K2_EventOnSetSelectedCosmetics();
	void K2_EventOnSetPressedCosmetics();
	void K2_EventOnSetHoveredCosmetics();
	void K2_EventOnSelectionPressed();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void Set_Normal_Cosmetics1(class UButton** OutButton);
	void Set_Hovered_Cosmetics1(class UButton** OutButton);
	void Set_Pressed_Cosmetics_1(class UButton** OutButton);
	void SetSelectedCosmetics1(class UButton** OutButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_CustomizationCategoryButton_C">();
	}
	static class UCM_CustomizationCategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_CustomizationCategoryButton_C>();
	}
};
static_assert(alignof(UCM_CustomizationCategoryButton_C) == 0x000008, "Wrong alignment on UCM_CustomizationCategoryButton_C");
static_assert(sizeof(UCM_CustomizationCategoryButton_C) == 0x000898, "Wrong size on UCM_CustomizationCategoryButton_C");
static_assert(offsetof(UCM_CustomizationCategoryButton_C, UberGraphFrame) == 0x0005B8, "Member 'UCM_CustomizationCategoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_CustomizationCategoryButton_C, IconImage) == 0x0005C0, "Member 'UCM_CustomizationCategoryButton_C::IconImage' has a wrong offset!");
static_assert(offsetof(UCM_CustomizationCategoryButton_C, OnCategorySelected) == 0x0005C8, "Member 'UCM_CustomizationCategoryButton_C::OnCategorySelected' has a wrong offset!");
static_assert(offsetof(UCM_CustomizationCategoryButton_C, Style) == 0x0005D8, "Member 'UCM_CustomizationCategoryButton_C::Style' has a wrong offset!");
static_assert(offsetof(UCM_CustomizationCategoryButton_C, IconScale) == 0x000850, "Member 'UCM_CustomizationCategoryButton_C::IconScale' has a wrong offset!");
static_assert(offsetof(UCM_CustomizationCategoryButton_C, IconTexture) == 0x000858, "Member 'UCM_CustomizationCategoryButton_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UCM_CustomizationCategoryButton_C, SelectedIconColor) == 0x000860, "Member 'UCM_CustomizationCategoryButton_C::SelectedIconColor' has a wrong offset!");
static_assert(offsetof(UCM_CustomizationCategoryButton_C, UnselectedColor) == 0x000870, "Member 'UCM_CustomizationCategoryButton_C::UnselectedColor' has a wrong offset!");
static_assert(offsetof(UCM_CustomizationCategoryButton_C, bIsSelected_0) == 0x000880, "Member 'UCM_CustomizationCategoryButton_C::bIsSelected_0' has a wrong offset!");
static_assert(offsetof(UCM_CustomizationCategoryButton_C, IconPadding) == 0x000884, "Member 'UCM_CustomizationCategoryButton_C::IconPadding' has a wrong offset!");

}

