#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_ClickableSquareSelectionButtonBasicWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_ClickableSquareSelectionButtonBasicWI.CM_ClickableSquareSelectionButtonBasicWI_C
// 0x00B8 (0x0630 - 0x0578)
class UCM_ClickableSquareSelectionButtonBasicWI_C final : public UControllerSelectionStateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Bottom;                                            // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomFlourish;                                    // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left;                                              // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right;                                             // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top;                                               // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopFlourish;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            TextNormalColor;                                   // 0x05B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextFocusedColor;                                  // 0x05E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnPressedButton;                                   // 0x0608(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   LabelText;                                         // 0x0618(0x0018)(Edit, BlueprintVisible)

public:
	void OnPressedButton__DelegateSignature();
	void ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void DisableSelectedFlourish();
	void K2_EventOnSetSelectedCosmetics();
	void EnableSelectedFlourish();
	void K2_EventOnSetNormalCosmetics();
	void K2_EventOnSetHoveredCosmetics();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_ClickableSquareSelectionButtonBasicWI_C">();
	}
	static class UCM_ClickableSquareSelectionButtonBasicWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_ClickableSquareSelectionButtonBasicWI_C>();
	}
};
static_assert(alignof(UCM_ClickableSquareSelectionButtonBasicWI_C) == 0x000008, "Wrong alignment on UCM_ClickableSquareSelectionButtonBasicWI_C");
static_assert(sizeof(UCM_ClickableSquareSelectionButtonBasicWI_C) == 0x000630, "Wrong size on UCM_ClickableSquareSelectionButtonBasicWI_C");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, UberGraphFrame) == 0x000578, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, Bottom) == 0x000580, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::Bottom' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, BottomFlourish) == 0x000588, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::BottomFlourish' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, Left) == 0x000590, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::Left' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, Right) == 0x000598, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::Right' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, TitleText) == 0x0005A0, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::TitleText' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, Top) == 0x0005A8, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::Top' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, TopFlourish) == 0x0005B0, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::TopFlourish' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, TextNormalColor) == 0x0005B8, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::TextNormalColor' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, TextFocusedColor) == 0x0005E0, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::TextFocusedColor' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, OnPressedButton) == 0x000608, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::OnPressedButton' has a wrong offset!");
static_assert(offsetof(UCM_ClickableSquareSelectionButtonBasicWI_C, LabelText) == 0x000618, "Member 'UCM_ClickableSquareSelectionButtonBasicWI_C::LabelText' has a wrong offset!");

}

