#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_CheckboxWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_CheckboxWI.CM_CheckboxWI_C
// 0x0050 (0x05C8 - 0x0578)
class UCM_CheckboxWI_C final : public UControllerSelectionStateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBorder*                                Border_0;                                          // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_35;                                       // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_SubMenuItemContainer_C*             CM_SubMenuItemContainer;                           // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             StateChanged;                                      // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   SettingTitleText;                                  // 0x05B0(0x0018)(Edit, BlueprintVisible)

public:
	void StateChanged__DelegateSignature(bool IsChecked);
	void ExecuteUbergraph_CM_CheckboxWI(int32 EntryPoint);
	void K2_EventOnSetNormalCosmetics();
	void K2_EventOnSetHoveredCosmetics();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__CM_CheckboxWI_CheckBox_35_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnMouseOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_CheckboxWI_C">();
	}
	static class UCM_CheckboxWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_CheckboxWI_C>();
	}
};
static_assert(alignof(UCM_CheckboxWI_C) == 0x000008, "Wrong alignment on UCM_CheckboxWI_C");
static_assert(sizeof(UCM_CheckboxWI_C) == 0x0005C8, "Wrong size on UCM_CheckboxWI_C");
static_assert(offsetof(UCM_CheckboxWI_C, UberGraphFrame) == 0x000578, "Member 'UCM_CheckboxWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_CheckboxWI_C, Border_0) == 0x000580, "Member 'UCM_CheckboxWI_C::Border_0' has a wrong offset!");
static_assert(offsetof(UCM_CheckboxWI_C, CheckBox_35) == 0x000588, "Member 'UCM_CheckboxWI_C::CheckBox_35' has a wrong offset!");
static_assert(offsetof(UCM_CheckboxWI_C, CM_SubMenuItemContainer) == 0x000590, "Member 'UCM_CheckboxWI_C::CM_SubMenuItemContainer' has a wrong offset!");
static_assert(offsetof(UCM_CheckboxWI_C, TitleText) == 0x000598, "Member 'UCM_CheckboxWI_C::TitleText' has a wrong offset!");
static_assert(offsetof(UCM_CheckboxWI_C, StateChanged) == 0x0005A0, "Member 'UCM_CheckboxWI_C::StateChanged' has a wrong offset!");
static_assert(offsetof(UCM_CheckboxWI_C, SettingTitleText) == 0x0005B0, "Member 'UCM_CheckboxWI_C::SettingTitleText' has a wrong offset!");

}

