#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_EmoteCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_Emote_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_EmoteCustomization.CM_EmoteCustomization_C
// 0x0098 (0x02F8 - 0x0260)
class UCM_EmoteCustomization_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UButton*                                Button_369;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_EmoteSelectionMenu_C*               CM_EmoteSelectionMenu;                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EmoteWheelContainer;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEmoteWheelWI_C*                        EmoteWheelWI;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FS_Emote>                       EmoteArray;                                        // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class FName>                      EmoteNameLocations;                                // 0x0298(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           EmoteNames;                                        // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CM_EmoteCustomization(int32 EntryPoint);
	void ActivateWidget();
	void DeactivateWidget();
	void BndEvt__CM_EmoteCustomization_Button_369_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnEmoteCardSelected();
	void PreConstruct(bool IsDesignTime);
	void GetEmoteStructsFromNames(TArray<class FName>& Array, TArray<struct FS_Emote>* Emotes);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_EmoteCustomization_C">();
	}
	static class UCM_EmoteCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_EmoteCustomization_C>();
	}
};
static_assert(alignof(UCM_EmoteCustomization_C) == 0x000008, "Wrong alignment on UCM_EmoteCustomization_C");
static_assert(sizeof(UCM_EmoteCustomization_C) == 0x0002F8, "Wrong size on UCM_EmoteCustomization_C");
static_assert(offsetof(UCM_EmoteCustomization_C, UberGraphFrame) == 0x000260, "Member 'UCM_EmoteCustomization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_EmoteCustomization_C, Button_369) == 0x000268, "Member 'UCM_EmoteCustomization_C::Button_369' has a wrong offset!");
static_assert(offsetof(UCM_EmoteCustomization_C, CM_EmoteSelectionMenu) == 0x000270, "Member 'UCM_EmoteCustomization_C::CM_EmoteSelectionMenu' has a wrong offset!");
static_assert(offsetof(UCM_EmoteCustomization_C, EmoteWheelContainer) == 0x000278, "Member 'UCM_EmoteCustomization_C::EmoteWheelContainer' has a wrong offset!");
static_assert(offsetof(UCM_EmoteCustomization_C, EmoteWheelWI) == 0x000280, "Member 'UCM_EmoteCustomization_C::EmoteWheelWI' has a wrong offset!");
static_assert(offsetof(UCM_EmoteCustomization_C, EmoteArray) == 0x000288, "Member 'UCM_EmoteCustomization_C::EmoteArray' has a wrong offset!");
static_assert(offsetof(UCM_EmoteCustomization_C, EmoteNameLocations) == 0x000298, "Member 'UCM_EmoteCustomization_C::EmoteNameLocations' has a wrong offset!");
static_assert(offsetof(UCM_EmoteCustomization_C, EmoteNames) == 0x0002E8, "Member 'UCM_EmoteCustomization_C::EmoteNames' has a wrong offset!");

}

