#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_EmoteSelectionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_Emote_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_EmoteSelectionButton.CM_EmoteSelectionButton_C
// 0x00F0 (0x0350 - 0x0260)
class UCM_EmoteSelectionButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UOverlay*                               AchievementOverlay;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CheckBox;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_101;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_523;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelText;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LockedOverlay;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QualityLockedOverlay;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SelectButton;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThumbnailIcon;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPressed;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FS_Emote                               EmotePayload;                                      // 0x02E0(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 RowName;                                           // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void OnPressed__DelegateSignature();
	void ExecuteUbergraph_CM_EmoteSelectionButton(int32 EntryPoint);
	void BndEvt__CM_EmoteSelectionButton_SelectButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void InitSlot(class UCM_EmoteCustomization_C* Parent, const class FString& RowName_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_EmoteSelectionButton_C">();
	}
	static class UCM_EmoteSelectionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_EmoteSelectionButton_C>();
	}
};
static_assert(alignof(UCM_EmoteSelectionButton_C) == 0x000008, "Wrong alignment on UCM_EmoteSelectionButton_C");
static_assert(sizeof(UCM_EmoteSelectionButton_C) == 0x000350, "Wrong size on UCM_EmoteSelectionButton_C");
static_assert(offsetof(UCM_EmoteSelectionButton_C, UberGraphFrame) == 0x000260, "Member 'UCM_EmoteSelectionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, AchievementOverlay) == 0x000268, "Member 'UCM_EmoteSelectionButton_C::AchievementOverlay' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, CheckBox) == 0x000270, "Member 'UCM_EmoteSelectionButton_C::CheckBox' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, Image) == 0x000278, "Member 'UCM_EmoteSelectionButton_C::Image' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, Image_1) == 0x000280, "Member 'UCM_EmoteSelectionButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, Image_2) == 0x000288, "Member 'UCM_EmoteSelectionButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, Image_3) == 0x000290, "Member 'UCM_EmoteSelectionButton_C::Image_3' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, Image_101) == 0x000298, "Member 'UCM_EmoteSelectionButton_C::Image_101' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, Image_523) == 0x0002A0, "Member 'UCM_EmoteSelectionButton_C::Image_523' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, LevelText) == 0x0002A8, "Member 'UCM_EmoteSelectionButton_C::LevelText' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, LockedOverlay) == 0x0002B0, "Member 'UCM_EmoteSelectionButton_C::LockedOverlay' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, QualityLockedOverlay) == 0x0002B8, "Member 'UCM_EmoteSelectionButton_C::QualityLockedOverlay' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, SelectButton) == 0x0002C0, "Member 'UCM_EmoteSelectionButton_C::SelectButton' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, ThumbnailIcon) == 0x0002C8, "Member 'UCM_EmoteSelectionButton_C::ThumbnailIcon' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, OnPressed) == 0x0002D0, "Member 'UCM_EmoteSelectionButton_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, EmotePayload) == 0x0002E0, "Member 'UCM_EmoteSelectionButton_C::EmotePayload' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionButton_C, RowName) == 0x000340, "Member 'UCM_EmoteSelectionButton_C::RowName' has a wrong offset!");

}

