#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_EmoteSelectionMenu

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_EmoteSelectionMenu.CM_EmoteSelectionMenu_C
// 0x0040 (0x02A0 - 0x0260)
class UCM_EmoteSelectionMenu_C final : public UUserWidget
{
public:
	class UCM_EmoteSelectionButton_C*             CM_EmoteSelectionButton;                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_EmoteSelectionButton_C*             CM_EmoteSelectionButton_1;                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_EmoteSelectionButton_C*             CM_EmoteSelectionButton_2;                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_EmoteSelectionButton_C*             CM_EmoteSelectionButton_3;                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_98;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_EmoteSelectionMenu_C">();
	}
	static class UCM_EmoteSelectionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_EmoteSelectionMenu_C>();
	}
};
static_assert(alignof(UCM_EmoteSelectionMenu_C) == 0x000008, "Wrong alignment on UCM_EmoteSelectionMenu_C");
static_assert(sizeof(UCM_EmoteSelectionMenu_C) == 0x0002A0, "Wrong size on UCM_EmoteSelectionMenu_C");
static_assert(offsetof(UCM_EmoteSelectionMenu_C, CM_EmoteSelectionButton) == 0x000260, "Member 'UCM_EmoteSelectionMenu_C::CM_EmoteSelectionButton' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionMenu_C, CM_EmoteSelectionButton_1) == 0x000268, "Member 'UCM_EmoteSelectionMenu_C::CM_EmoteSelectionButton_1' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionMenu_C, CM_EmoteSelectionButton_2) == 0x000270, "Member 'UCM_EmoteSelectionMenu_C::CM_EmoteSelectionButton_2' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionMenu_C, CM_EmoteSelectionButton_3) == 0x000278, "Member 'UCM_EmoteSelectionMenu_C::CM_EmoteSelectionButton_3' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionMenu_C, Image) == 0x000280, "Member 'UCM_EmoteSelectionMenu_C::Image' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionMenu_C, Image_1) == 0x000288, "Member 'UCM_EmoteSelectionMenu_C::Image_1' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionMenu_C, Image_2) == 0x000290, "Member 'UCM_EmoteSelectionMenu_C::Image_2' has a wrong offset!");
static_assert(offsetof(UCM_EmoteSelectionMenu_C, Image_98) == 0x000298, "Member 'UCM_EmoteSelectionMenu_C::Image_98' has a wrong offset!");

}

