#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_FSMenuBackground

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_FSMenuBackground.CM_FSMenuBackground_C
// 0x0038 (0x0298 - 0x0260)
class UCM_FSMenuBackground_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 BackgroundImage;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_160;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor;                                   // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             BackgroundTexture;                                 // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_FSMenuBackground(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_FSMenuBackground_C">();
	}
	static class UCM_FSMenuBackground_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_FSMenuBackground_C>();
	}
};
static_assert(alignof(UCM_FSMenuBackground_C) == 0x000008, "Wrong alignment on UCM_FSMenuBackground_C");
static_assert(sizeof(UCM_FSMenuBackground_C) == 0x000298, "Wrong size on UCM_FSMenuBackground_C");
static_assert(offsetof(UCM_FSMenuBackground_C, UberGraphFrame) == 0x000260, "Member 'UCM_FSMenuBackground_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_FSMenuBackground_C, BackgroundImage) == 0x000268, "Member 'UCM_FSMenuBackground_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UCM_FSMenuBackground_C, Image) == 0x000270, "Member 'UCM_FSMenuBackground_C::Image' has a wrong offset!");
static_assert(offsetof(UCM_FSMenuBackground_C, Image_160) == 0x000278, "Member 'UCM_FSMenuBackground_C::Image_160' has a wrong offset!");
static_assert(offsetof(UCM_FSMenuBackground_C, BackgroundColor) == 0x000280, "Member 'UCM_FSMenuBackground_C::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UCM_FSMenuBackground_C, BackgroundTexture) == 0x000290, "Member 'UCM_FSMenuBackground_C::BackgroundTexture' has a wrong offset!");

}

