#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_GamepadOverviewEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_GamepadOverviewEntry.CM_GamepadOverviewEntry_C
// 0x0058 (0x02B8 - 0x0260)
class UCM_GamepadOverviewEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UTextBlock*                             Text_Action_Large;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Action_Small;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_30;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TextLarge;                                         // 0x0280(0x0018)(Edit, BlueprintVisible)
	class FText                                   TextSmall;                                         // 0x0298(0x0018)(Edit, BlueprintVisible)
	ETextJustify                                  Justification_Large;                               // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justification_Small;                               // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_GamepadOverviewEntry(int32 EntryPoint);
	void Update_Justification(ETextJustify Justification);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_GamepadOverviewEntry_C">();
	}
	static class UCM_GamepadOverviewEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_GamepadOverviewEntry_C>();
	}
};
static_assert(alignof(UCM_GamepadOverviewEntry_C) == 0x000008, "Wrong alignment on UCM_GamepadOverviewEntry_C");
static_assert(sizeof(UCM_GamepadOverviewEntry_C) == 0x0002B8, "Wrong size on UCM_GamepadOverviewEntry_C");
static_assert(offsetof(UCM_GamepadOverviewEntry_C, UberGraphFrame) == 0x000260, "Member 'UCM_GamepadOverviewEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_GamepadOverviewEntry_C, Text_Action_Large) == 0x000268, "Member 'UCM_GamepadOverviewEntry_C::Text_Action_Large' has a wrong offset!");
static_assert(offsetof(UCM_GamepadOverviewEntry_C, Text_Action_Small) == 0x000270, "Member 'UCM_GamepadOverviewEntry_C::Text_Action_Small' has a wrong offset!");
static_assert(offsetof(UCM_GamepadOverviewEntry_C, VerticalBox_30) == 0x000278, "Member 'UCM_GamepadOverviewEntry_C::VerticalBox_30' has a wrong offset!");
static_assert(offsetof(UCM_GamepadOverviewEntry_C, TextLarge) == 0x000280, "Member 'UCM_GamepadOverviewEntry_C::TextLarge' has a wrong offset!");
static_assert(offsetof(UCM_GamepadOverviewEntry_C, TextSmall) == 0x000298, "Member 'UCM_GamepadOverviewEntry_C::TextSmall' has a wrong offset!");
static_assert(offsetof(UCM_GamepadOverviewEntry_C, Justification_Large) == 0x0002B0, "Member 'UCM_GamepadOverviewEntry_C::Justification_Large' has a wrong offset!");
static_assert(offsetof(UCM_GamepadOverviewEntry_C, Justification_Small) == 0x0002B1, "Member 'UCM_GamepadOverviewEntry_C::Justification_Small' has a wrong offset!");

}

