#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_GamepadOverviewWI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function CM_GamepadOverviewWI.CM_GamepadOverviewWI_C.ExecuteUbergraph_CM_GamepadOverviewWI
// 0x00B0 (0x00B0 - 0x0000)
struct CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETextJustify                                  Temp_byte_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_3;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETextJustify                                  Temp_byte_Variable_4;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_5;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0060(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0078(0x0018)()
	ETextJustify                                  K2Node_Select_Default_2;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue_1;         // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETextJustify                                  K2Node_Select_Default_3;                           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI) == 0x000008, "Wrong alignment on CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI");
static_assert(sizeof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI) == 0x0000B0, "Wrong size on CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, EntryPoint) == 0x000000, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_bool_Variable) == 0x000004, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_byte_Variable) == 0x000005, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_byte_Variable_1) == 0x000006, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_bool_Variable_1) == 0x000007, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_text_Variable) == 0x000008, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_text_Variable_1) == 0x000020, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_bool_Variable_2) == 0x000038, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_byte_Variable_2) == 0x000039, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_byte_Variable_3) == 0x00003A, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_bool_Variable_3) == 0x00003B, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_byte_Variable_4) == 0x00003C, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, Temp_byte_Variable_5) == 0x00003D, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, CallFunc_IsPS5Platform_ReturnValue) == 0x00003E, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::CallFunc_IsPS5Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, K2Node_Select_Default) == 0x00003F, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, CallFunc_IsPS4Platform_ReturnValue) == 0x000040, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, CallFunc_GetCurrentLanguage_ReturnValue) == 0x000048, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000058, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, K2Node_Select_Default_1) == 0x000060, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, CallFunc_TextToUpper_ReturnValue) == 0x000078, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, K2Node_Select_Default_2) == 0x000090, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, CallFunc_GetCurrentLanguage_ReturnValue_1) == 0x000098, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::CallFunc_GetCurrentLanguage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0000A8, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI, K2Node_Select_Default_3) == 0x0000A9, "Member 'CM_GamepadOverviewWI_C_ExecuteUbergraph_CM_GamepadOverviewWI::K2Node_Select_Default_3' has a wrong offset!");

}

