#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_HorizontalSelectionWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_HorizontalSelectionWI.CM_HorizontalSelectionWI_C
// 0x0110 (0x03C0 - 0x02B0)
class UCM_HorizontalSelectionWI_C final : public UControllerIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_MainMenuSelectionButtonWI_C*        CM_TheBarHorizontalSelectionButtonWI;              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_MainMenuSelectionButtonWI_C*        CM_TheBarHorizontalSelectionButtonWI_1;            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_MainMenuSelectionButtonWI_C*        CM_TheBarHorizontalSelectionButtonWI_2;            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_MainMenuSelectionButtonWI_C*        CM_TheBarHorizontalSelectionButtonWI_4;            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_MainMenuSelectionButtonWI_C*        CM_TheBarHorizontalSelectionButtonWI_5;            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_1;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_194;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L1button;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftCap;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MenubarHzBox;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                MiddleSpacer;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R1button;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightCap;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_1;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCM_HorizontalSelectionButtonWI_C*> Buttons;                                           // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UTexture2D*, class UTexture2D*>    ButtonTextureConversionMap;                        // 0x0370(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CM_HorizontalSelectionWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ResetDisplay();
	void Construct();
	void SetNavigationButtonTextures();
	void SetXboxTexture(class UImage* Target);
	void SetVisibilityOfNavigationButtons();
	void SetSpaceBetweenEndcaps();

	void GetXboxTexture(class UImage* Target, class UTexture2D** Value, bool* Success) const;
	void IsUsingControllerOnPC(bool* Value) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_HorizontalSelectionWI_C">();
	}
	static class UCM_HorizontalSelectionWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_HorizontalSelectionWI_C>();
	}
};
static_assert(alignof(UCM_HorizontalSelectionWI_C) == 0x000008, "Wrong alignment on UCM_HorizontalSelectionWI_C");
static_assert(sizeof(UCM_HorizontalSelectionWI_C) == 0x0003C0, "Wrong size on UCM_HorizontalSelectionWI_C");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, UberGraphFrame) == 0x0002B0, "Member 'UCM_HorizontalSelectionWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, CM_TheBarHorizontalSelectionButtonWI) == 0x0002B8, "Member 'UCM_HorizontalSelectionWI_C::CM_TheBarHorizontalSelectionButtonWI' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, CM_TheBarHorizontalSelectionButtonWI_1) == 0x0002C0, "Member 'UCM_HorizontalSelectionWI_C::CM_TheBarHorizontalSelectionButtonWI_1' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, CM_TheBarHorizontalSelectionButtonWI_2) == 0x0002C8, "Member 'UCM_HorizontalSelectionWI_C::CM_TheBarHorizontalSelectionButtonWI_2' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, CM_TheBarHorizontalSelectionButtonWI_4) == 0x0002D0, "Member 'UCM_HorizontalSelectionWI_C::CM_TheBarHorizontalSelectionButtonWI_4' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, CM_TheBarHorizontalSelectionButtonWI_5) == 0x0002D8, "Member 'UCM_HorizontalSelectionWI_C::CM_TheBarHorizontalSelectionButtonWI_5' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, HorizontalBox_1) == 0x0002E0, "Member 'UCM_HorizontalSelectionWI_C::HorizontalBox_1' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, Image) == 0x0002E8, "Member 'UCM_HorizontalSelectionWI_C::Image' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, Image_1) == 0x0002F0, "Member 'UCM_HorizontalSelectionWI_C::Image_1' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, Image_3) == 0x0002F8, "Member 'UCM_HorizontalSelectionWI_C::Image_3' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, Image_4) == 0x000300, "Member 'UCM_HorizontalSelectionWI_C::Image_4' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, Image_5) == 0x000308, "Member 'UCM_HorizontalSelectionWI_C::Image_5' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, Image_7) == 0x000310, "Member 'UCM_HorizontalSelectionWI_C::Image_7' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, Image_8) == 0x000318, "Member 'UCM_HorizontalSelectionWI_C::Image_8' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, Image_194) == 0x000320, "Member 'UCM_HorizontalSelectionWI_C::Image_194' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, L1button) == 0x000328, "Member 'UCM_HorizontalSelectionWI_C::L1button' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, LeftCap) == 0x000330, "Member 'UCM_HorizontalSelectionWI_C::LeftCap' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, MenubarHzBox) == 0x000338, "Member 'UCM_HorizontalSelectionWI_C::MenubarHzBox' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, MiddleSpacer) == 0x000340, "Member 'UCM_HorizontalSelectionWI_C::MiddleSpacer' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, R1button) == 0x000348, "Member 'UCM_HorizontalSelectionWI_C::R1button' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, RightCap) == 0x000350, "Member 'UCM_HorizontalSelectionWI_C::RightCap' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, UniformGridPanel_1) == 0x000358, "Member 'UCM_HorizontalSelectionWI_C::UniformGridPanel_1' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, Buttons) == 0x000360, "Member 'UCM_HorizontalSelectionWI_C::Buttons' has a wrong offset!");
static_assert(offsetof(UCM_HorizontalSelectionWI_C, ButtonTextureConversionMap) == 0x000370, "Member 'UCM_HorizontalSelectionWI_C::ButtonTextureConversionMap' has a wrong offset!");

}

