#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_HostCrossplayMessage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CM_HostCrossplayMessage.CM_HostCrossplayMessage_C.ExecuteUbergraph_CM_HostCrossplayMessage
// 0x0080 (0x0080 - 0x0000)
struct CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_2;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_3;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage) == 0x000008, "Wrong alignment on CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage");
static_assert(sizeof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage) == 0x000080, "Wrong size on CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, EntryPoint) == 0x000000, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_GetRenderOpacity_ReturnValue) == 0x000008, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00000C, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_FInterpTo_ReturnValue) == 0x000010, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000014, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x000018, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_FInterpTo_ReturnValue_1) == 0x00001C, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_GetRenderOpacity_ReturnValue_2) == 0x000020, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_GetRenderOpacity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_Less_FloatFloat_ReturnValue) == 0x000028, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000058, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000070, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_GetRenderOpacity_ReturnValue_3) == 0x000078, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_GetRenderOpacity_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00007C, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage, CallFunc_Not_PreBool_ReturnValue) == 0x00007D, "Member 'CM_HostCrossplayMessage_C_ExecuteUbergraph_CM_HostCrossplayMessage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CM_HostCrossplayMessage.CM_HostCrossplayMessage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_HostCrossplayMessage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_HostCrossplayMessage_C_PreConstruct) == 0x000001, "Wrong alignment on CM_HostCrossplayMessage_C_PreConstruct");
static_assert(sizeof(CM_HostCrossplayMessage_C_PreConstruct) == 0x000001, "Wrong size on CM_HostCrossplayMessage_C_PreConstruct");
static_assert(offsetof(CM_HostCrossplayMessage_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_HostCrossplayMessage_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_HostCrossplayMessage.CM_HostCrossplayMessage_C.SetSlateFont
// 0x0058 (0x0058 - 0x0000)
struct CM_HostCrossplayMessage_C_SetSlateFont final
{
public:
	struct FSlateFontInfo                         TempFont;                                          // 0x0000(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(CM_HostCrossplayMessage_C_SetSlateFont) == 0x000008, "Wrong alignment on CM_HostCrossplayMessage_C_SetSlateFont");
static_assert(sizeof(CM_HostCrossplayMessage_C_SetSlateFont) == 0x000058, "Wrong size on CM_HostCrossplayMessage_C_SetSlateFont");
static_assert(offsetof(CM_HostCrossplayMessage_C_SetSlateFont, TempFont) == 0x000000, "Member 'CM_HostCrossplayMessage_C_SetSlateFont::TempFont' has a wrong offset!");

}

