#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_LanguageWI

#include "Basic.hpp"

#include "FCT_structs.hpp"
#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CM_LanguageWI.CM_LanguageWI_C.OnUpdateCloudLanguage__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct CM_LanguageWI_C_OnUpdateCloudLanguage__DelegateSignature final
{
public:
	class FString                                 CultureCode;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_LanguageWI_C_OnUpdateCloudLanguage__DelegateSignature) == 0x000008, "Wrong alignment on CM_LanguageWI_C_OnUpdateCloudLanguage__DelegateSignature");
static_assert(sizeof(CM_LanguageWI_C_OnUpdateCloudLanguage__DelegateSignature) == 0x000010, "Wrong size on CM_LanguageWI_C_OnUpdateCloudLanguage__DelegateSignature");
static_assert(offsetof(CM_LanguageWI_C_OnUpdateCloudLanguage__DelegateSignature, CultureCode) == 0x000000, "Member 'CM_LanguageWI_C_OnUpdateCloudLanguage__DelegateSignature::CultureCode' has a wrong offset!");

// Function CM_LanguageWI.CM_LanguageWI_C.ExecuteUbergraph_CM_LanguageWI
// 0x03D0 (0x03D0 - 0x0000)
struct CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x005C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0070(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDefaultLocale_ReturnValue;             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x00B0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitialLoadComplete_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_1;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKeyIndex_ReturnValue;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindOptionIndex_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetKeyAt_ReturnValue;                     // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x01A8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x01C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x01D0(0x0010)(ConstParm, ReferenceParm)
	struct FLanguageDatum                         CallFunc_Map_Find_Value;                           // 0x01E0(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0208(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0220(0x0010)(ConstParm, ReferenceParm)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP_1;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_2;       // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKeyIndex_ReturnValue_1;                // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue;           // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UCM_GamepadOverviewWI_C*>        CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0260(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCM_GamepadOverviewWI_C*                CallFunc_Array_Get_Item;                           // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCM_XboxGamepadOverviewWI_C*>    CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0280(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCM_XboxGamepadOverviewWI_C*            CallFunc_Array_Get_Item_1;                         // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x02A4(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x02AC(0x0008)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x02B4(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x02F0(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0360(0x0070)(ConstParm)
};
static_assert(alignof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI) == 0x000008, "Wrong alignment on CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI");
static_assert(sizeof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI) == 0x0003D0, "Wrong size on CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, EntryPoint) == 0x000000, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_int_Array_Index_Variable) == 0x000024, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000050, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_Event_IsDesignTime) == 0x000058, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_delegate_Variable) == 0x00005C, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_struct_Variable) == 0x000070, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_ComponentBoundEvent_SelectedItem) == 0x000080, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_ComponentBoundEvent_SelectionType) == 0x000090, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_PostAkEvent_ReturnValue) == 0x000094, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_SwitchEnum_CmpSuccess) == 0x000098, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetDefaultLocale_ReturnValue) == 0x0000A0, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetDefaultLocale_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_delegate_Variable_1) == 0x0000B0, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_InitialLoadComplete_ReturnValue) == 0x0000D0, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_InitialLoadComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D8, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000E8, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetGameInstance_ReturnValue) == 0x0000F8, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_DynamicCast_AsSCTGame_Instance) == 0x000100, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_DynamicCast_AsSCTGame_Instance' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetSpecialOptions_SpecialOptions) == 0x000110, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetSpecialOptions_SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetSpecialOptions_SpecialOptions_1) == 0x000118, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetSpecialOptions_SpecialOptions_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_SaveGame_ReturnValue) == 0x000120, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_SaveGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000121, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_SelectString_ReturnValue) == 0x000128, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetKeyIndex_ReturnValue) == 0x000138, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetKeyIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_FindOptionIndex_ReturnValue) == 0x00013C, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_FindOptionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Greater_IntInt_ReturnValue) == 0x000140, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetKeyAt_ReturnValue) == 0x000148, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetKeyAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetGameInstance_ReturnValue_1) == 0x000158, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000160, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_DynamicCast_AsFCTGame_Instance_BP) == 0x000170, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_DynamicCast_AsFCTGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000180, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000190, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_IsEmpty_ReturnValue) == 0x0001A0, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_struct_Variable_1) == 0x0001A8, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Not_PreBool_ReturnValue) == 0x0001B8, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001BC, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_delegate_Variable_2) == 0x0001C0, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_struct_Variable_2) == 0x0001D0, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Map_Find_Value) == 0x0001E0, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Map_Find_ReturnValue) == 0x000200, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_PostAkEvent_ReturnValue_2) == 0x000204, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_delegate_Variable_3) == 0x000208, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetGameInstance_ReturnValue_2) == 0x000218, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_struct_Variable_3) == 0x000220, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_DynamicCast_AsFCTGame_Instance_BP_1) == 0x000230, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_DynamicCast_AsFCTGame_Instance_BP_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_DynamicCast_bSuccess_2) == 0x000238, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_PostAkEvent_ReturnValue_3) == 0x00023C, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetSpecialOptions_SpecialOptions_2) == 0x000240, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetSpecialOptions_SpecialOptions_2' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetKeyIndex_ReturnValue_1) == 0x000248, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetKeyIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00024C, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetCurrentLanguage_ReturnValue) == 0x000250, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000260, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Array_Get_Item) == 0x000270, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Array_Length_ReturnValue) == 0x000278, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, Temp_int_Loop_Counter_Variable_1) == 0x00027C, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000280, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Array_Get_Item_1) == 0x000290, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Array_Length_ReturnValue_1) == 0x000298, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Less_IntInt_ReturnValue) == 0x00029C, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Less_IntInt_ReturnValue_1) == 0x00029D, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002A0, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_Event_InFocusEvent_1) == 0x0002A4, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_Event_InFocusEvent) == 0x0002AC, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_Event_MyGeometry) == 0x0002B4, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_Event_MouseEvent_1) == 0x0002F0, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI, K2Node_Event_MouseEvent) == 0x000360, "Member 'CM_LanguageWI_C_ExecuteUbergraph_CM_LanguageWI::K2Node_Event_MouseEvent' has a wrong offset!");

// Function CM_LanguageWI.CM_LanguageWI_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct CM_LanguageWI_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CM_LanguageWI_C_OnMouseLeave) == 0x000008, "Wrong alignment on CM_LanguageWI_C_OnMouseLeave");
static_assert(sizeof(CM_LanguageWI_C_OnMouseLeave) == 0x000070, "Wrong size on CM_LanguageWI_C_OnMouseLeave");
static_assert(offsetof(CM_LanguageWI_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'CM_LanguageWI_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function CM_LanguageWI.CM_LanguageWI_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct CM_LanguageWI_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CM_LanguageWI_C_OnMouseEnter) == 0x000008, "Wrong alignment on CM_LanguageWI_C_OnMouseEnter");
static_assert(sizeof(CM_LanguageWI_C_OnMouseEnter) == 0x0000A8, "Wrong size on CM_LanguageWI_C_OnMouseEnter");
static_assert(offsetof(CM_LanguageWI_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'CM_LanguageWI_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'CM_LanguageWI_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function CM_LanguageWI.CM_LanguageWI_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CM_LanguageWI_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CM_LanguageWI_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on CM_LanguageWI_C_OnRemovedFromFocusPath");
static_assert(sizeof(CM_LanguageWI_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on CM_LanguageWI_C_OnRemovedFromFocusPath");
static_assert(offsetof(CM_LanguageWI_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'CM_LanguageWI_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function CM_LanguageWI.CM_LanguageWI_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CM_LanguageWI_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CM_LanguageWI_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on CM_LanguageWI_C_OnAddedToFocusPath");
static_assert(sizeof(CM_LanguageWI_C_OnAddedToFocusPath) == 0x000008, "Wrong size on CM_LanguageWI_C_OnAddedToFocusPath");
static_assert(offsetof(CM_LanguageWI_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'CM_LanguageWI_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function CM_LanguageWI.CM_LanguageWI_C.BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct CM_LanguageWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_LanguageWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on CM_LanguageWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(CM_LanguageWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on CM_LanguageWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(CM_LanguageWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'CM_LanguageWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'CM_LanguageWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function CM_LanguageWI.CM_LanguageWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_LanguageWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_LanguageWI_C_PreConstruct) == 0x000001, "Wrong alignment on CM_LanguageWI_C_PreConstruct");
static_assert(sizeof(CM_LanguageWI_C_PreConstruct) == 0x000001, "Wrong size on CM_LanguageWI_C_PreConstruct");
static_assert(offsetof(CM_LanguageWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_LanguageWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_LanguageWI.CM_LanguageWI_C.GetSpecialOptions
// 0x0028 (0x0028 - 0x0000)
struct CM_LanguageWI_C_GetSpecialOptions final
{
public:
	class Ubp_SpecialOptionsSave_C*               SpecialOptions;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGame_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               K2Node_DynamicCast_AsBp_Special_Options_Save;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_LanguageWI_C_GetSpecialOptions) == 0x000008, "Wrong alignment on CM_LanguageWI_C_GetSpecialOptions");
static_assert(sizeof(CM_LanguageWI_C_GetSpecialOptions) == 0x000028, "Wrong size on CM_LanguageWI_C_GetSpecialOptions");
static_assert(offsetof(CM_LanguageWI_C_GetSpecialOptions, SpecialOptions) == 0x000000, "Member 'CM_LanguageWI_C_GetSpecialOptions::SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_GetSpecialOptions, CallFunc_LoadGame_ReturnValue) == 0x000008, "Member 'CM_LanguageWI_C_GetSpecialOptions::CallFunc_LoadGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_LanguageWI_C_GetSpecialOptions, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000010, "Member 'CM_LanguageWI_C_GetSpecialOptions::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
