#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_MicrophoneRecommended

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_MicrophoneRecommended.CM_MicrophoneRecommended_C
// 0x0018 (0x0278 - 0x0260)
class UCM_MicrophoneRecommended_C final : public UUserWidget
{
public:
	class UImage*                                 Image;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_143;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URoundedBGBoxWI_C*                      RoundedBGBoxWI;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_MicrophoneRecommended_C">();
	}
	static class UCM_MicrophoneRecommended_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_MicrophoneRecommended_C>();
	}
};
static_assert(alignof(UCM_MicrophoneRecommended_C) == 0x000008, "Wrong alignment on UCM_MicrophoneRecommended_C");
static_assert(sizeof(UCM_MicrophoneRecommended_C) == 0x000278, "Wrong size on UCM_MicrophoneRecommended_C");
static_assert(offsetof(UCM_MicrophoneRecommended_C, Image) == 0x000260, "Member 'UCM_MicrophoneRecommended_C::Image' has a wrong offset!");
static_assert(offsetof(UCM_MicrophoneRecommended_C, Image_143) == 0x000268, "Member 'UCM_MicrophoneRecommended_C::Image_143' has a wrong offset!");
static_assert(offsetof(UCM_MicrophoneRecommended_C, RoundedBGBoxWI) == 0x000270, "Member 'UCM_MicrophoneRecommended_C::RoundedBGBoxWI' has a wrong offset!");

}

