#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_Mall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CM_MenuAreaWI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_Mall.CM_Mall_C
// 0x0048 (0x02B0 - 0x0268)
class UCM_Mall_C final : public UCM_MenuAreaWI_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CM_Mall_C;                          // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_DLCPreviewer_C*                     CM_DLCPreviewer;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_DLCUserWidget_C*                    CM_DLCUserWidget;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ComingSoonText;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_65;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_123;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowStore;                                        // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CM_Mall(int32 EntryPoint);
	void DeactivateWidget();
	void PreConstruct(bool IsDesignTime);
	void OnFadeIn();
	void Construct();
	void FadeIn();
	void ActivateWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_Mall_C">();
	}
	static class UCM_Mall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_Mall_C>();
	}
};
static_assert(alignof(UCM_Mall_C) == 0x000008, "Wrong alignment on UCM_Mall_C");
static_assert(sizeof(UCM_Mall_C) == 0x0002B0, "Wrong size on UCM_Mall_C");
static_assert(offsetof(UCM_Mall_C, UberGraphFrame_CM_Mall_C) == 0x000268, "Member 'UCM_Mall_C::UberGraphFrame_CM_Mall_C' has a wrong offset!");
static_assert(offsetof(UCM_Mall_C, CM_DLCPreviewer) == 0x000270, "Member 'UCM_Mall_C::CM_DLCPreviewer' has a wrong offset!");
static_assert(offsetof(UCM_Mall_C, CM_DLCUserWidget) == 0x000278, "Member 'UCM_Mall_C::CM_DLCUserWidget' has a wrong offset!");
static_assert(offsetof(UCM_Mall_C, ComingSoonText) == 0x000280, "Member 'UCM_Mall_C::ComingSoonText' has a wrong offset!");
static_assert(offsetof(UCM_Mall_C, Image_65) == 0x000288, "Member 'UCM_Mall_C::Image_65' has a wrong offset!");
static_assert(offsetof(UCM_Mall_C, Image_123) == 0x000290, "Member 'UCM_Mall_C::Image_123' has a wrong offset!");
static_assert(offsetof(UCM_Mall_C, WidgetSwitcher_0) == 0x000298, "Member 'UCM_Mall_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UCM_Mall_C, TimerHandle) == 0x0002A0, "Member 'UCM_Mall_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UCM_Mall_C, bShowStore) == 0x0002A8, "Member 'UCM_Mall_C::bShowStore' has a wrong offset!");

}

