#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_MainMenuSelectionButtonWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CM_MainMenuSelectionButtonWI.CM_MainMenuSelectionButtonWI_C.ExecuteUbergraph_CM_MainMenuSelectionButtonWI
// 0x0018 (0x0018 - 0x0000)
struct CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI) == 0x000004, "Wrong alignment on CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI");
static_assert(sizeof(CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI) == 0x000018, "Wrong size on CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI");
static_assert(offsetof(CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI, EntryPoint) == 0x000000, "Member 'CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI, K2Node_MakeStruct_Margin) == 0x000008, "Member 'CM_MainMenuSelectionButtonWI_C_ExecuteUbergraph_CM_MainMenuSelectionButtonWI::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function CM_MainMenuSelectionButtonWI.CM_MainMenuSelectionButtonWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_MainMenuSelectionButtonWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_MainMenuSelectionButtonWI_C_PreConstruct) == 0x000001, "Wrong alignment on CM_MainMenuSelectionButtonWI_C_PreConstruct");
static_assert(sizeof(CM_MainMenuSelectionButtonWI_C_PreConstruct) == 0x000001, "Wrong size on CM_MainMenuSelectionButtonWI_C_PreConstruct");
static_assert(offsetof(CM_MainMenuSelectionButtonWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_MainMenuSelectionButtonWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_MainMenuSelectionButtonWI.CM_MainMenuSelectionButtonWI_C.GamepadButtonReleased
// 0x0002 (0x0002 - 0x0000)
struct CM_MainMenuSelectionButtonWI_C_GamepadButtonReleased final
{
public:
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_MainMenuSelectionButtonWI_C_GamepadButtonReleased) == 0x000001, "Wrong alignment on CM_MainMenuSelectionButtonWI_C_GamepadButtonReleased");
static_assert(sizeof(CM_MainMenuSelectionButtonWI_C_GamepadButtonReleased) == 0x000002, "Wrong size on CM_MainMenuSelectionButtonWI_C_GamepadButtonReleased");
static_assert(offsetof(CM_MainMenuSelectionButtonWI_C_GamepadButtonReleased, CallFunc_IsHovered_ReturnValue) == 0x000000, "Member 'CM_MainMenuSelectionButtonWI_C_GamepadButtonReleased::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_MainMenuSelectionButtonWI_C_GamepadButtonReleased, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'CM_MainMenuSelectionButtonWI_C_GamepadButtonReleased::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

