#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_NetworkErrorContentDialog

#include "Basic.hpp"

#include "CM_ContentDialog_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_NetworkErrorContentDialog.CM_NetworkErrorContentDialog_C
// 0x0030 (0x02F0 - 0x02C0)
class UCM_NetworkErrorContentDialog_C final : public UCM_ContentDialog_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Background;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ContentDialogWrapperFocusWidget_C*  CM_ContentDialogWrapperFocusWidget;                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_36;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              ReconnectButton;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_151;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_NetworkErrorContentDialog(int32 EntryPoint);
	void BndEvt__CM_NetworkErrorContentDialog_CM_ClickableSubTitleWI_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_NetworkErrorContentDialog_C">();
	}
	static class UCM_NetworkErrorContentDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_NetworkErrorContentDialog_C>();
	}
};
static_assert(alignof(UCM_NetworkErrorContentDialog_C) == 0x000008, "Wrong alignment on UCM_NetworkErrorContentDialog_C");
static_assert(sizeof(UCM_NetworkErrorContentDialog_C) == 0x0002F0, "Wrong size on UCM_NetworkErrorContentDialog_C");
static_assert(offsetof(UCM_NetworkErrorContentDialog_C, UberGraphFrame) == 0x0002C0, "Member 'UCM_NetworkErrorContentDialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_NetworkErrorContentDialog_C, Background) == 0x0002C8, "Member 'UCM_NetworkErrorContentDialog_C::Background' has a wrong offset!");
static_assert(offsetof(UCM_NetworkErrorContentDialog_C, CM_ContentDialogWrapperFocusWidget) == 0x0002D0, "Member 'UCM_NetworkErrorContentDialog_C::CM_ContentDialogWrapperFocusWidget' has a wrong offset!");
static_assert(offsetof(UCM_NetworkErrorContentDialog_C, Overlay_36) == 0x0002D8, "Member 'UCM_NetworkErrorContentDialog_C::Overlay_36' has a wrong offset!");
static_assert(offsetof(UCM_NetworkErrorContentDialog_C, ReconnectButton) == 0x0002E0, "Member 'UCM_NetworkErrorContentDialog_C::ReconnectButton' has a wrong offset!");
static_assert(offsetof(UCM_NetworkErrorContentDialog_C, TextBlock_151) == 0x0002E8, "Member 'UCM_NetworkErrorContentDialog_C::TextBlock_151' has a wrong offset!");

}

