#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_PlayNow

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "Engine_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"


namespace SDK::Params
{

// Function CM_PlayNow.CM_PlayNow_C.OnRecievedMatchmakingResponse__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CM_PlayNow_C_OnRecievedMatchmakingResponse__DelegateSignature final
{
public:
	EAccelByteMatchmakingStatus                   Response;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_PlayNow_C_OnRecievedMatchmakingResponse__DelegateSignature) == 0x000001, "Wrong alignment on CM_PlayNow_C_OnRecievedMatchmakingResponse__DelegateSignature");
static_assert(sizeof(CM_PlayNow_C_OnRecievedMatchmakingResponse__DelegateSignature) == 0x000001, "Wrong size on CM_PlayNow_C_OnRecievedMatchmakingResponse__DelegateSignature");
static_assert(offsetof(CM_PlayNow_C_OnRecievedMatchmakingResponse__DelegateSignature, Response) == 0x000000, "Member 'CM_PlayNow_C_OnRecievedMatchmakingResponse__DelegateSignature::Response' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnAddBanMessage__DelegateSignature
// 0x0050 (0x0050 - 0x0000)
struct CM_PlayNow_C_OnAddBanMessage__DelegateSignature final
{
public:
	TMap<class FString, class FString>            Params_0;                                          // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CM_PlayNow_C_OnAddBanMessage__DelegateSignature) == 0x000008, "Wrong alignment on CM_PlayNow_C_OnAddBanMessage__DelegateSignature");
static_assert(sizeof(CM_PlayNow_C_OnAddBanMessage__DelegateSignature) == 0x000050, "Wrong size on CM_PlayNow_C_OnAddBanMessage__DelegateSignature");
static_assert(offsetof(CM_PlayNow_C_OnAddBanMessage__DelegateSignature, Params_0) == 0x000000, "Member 'CM_PlayNow_C_OnAddBanMessage__DelegateSignature::Params_0' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.ExecuteUbergraph_CM_PlayNow
// 0x0980 (0x0980 - 0x0000)
struct CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsInfoPartyResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsInfoPartyResponse      K2Node_CustomEvent_PartyInfo_1;                    // 0x0018(0x0070)()
	struct FAccelByteModelsInfoPartyResponse      Temp_struct_Variable;                              // 0x0088(0x0070)()
	class UFCTPartyInfoCallbackProxy*             CallFunc_GetPartyInfo_ReturnValue;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTMatchmakingManagementCallbackProxy* CallFunc_CancelMatchmaking_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccountUserData                       K2Node_CustomEvent_Result;                         // 0x0168(0x0120)(ConstParm)
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code;                           // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FAccountUserData& Result, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x029C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAccountUserData                       Temp_struct_Variable_1;                            // 0x02C0(0x0120)()
	class UUserDataCallbackProxy*                 CallFunc_GetUserData_ReturnValue;                  // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x03EC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x03FC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCM_CustomGameMenu_C*                   CallFunc_Create_ReturnValue;                       // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& UpdatedLanguage)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0418(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0428(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsInfoPartyResponse      K2Node_CustomEvent_PartyInfo;                      // 0x0438(0x0070)()
	TDelegate<void(const struct FAccelByteModelsInfoPartyResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x04A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsInfoPartyResponse      Temp_struct_Variable_2;                            // 0x04B8(0x0070)()
	class UFCTPartyInfoCallbackProxy*             CallFunc_GetPartyInfo_ReturnValue_1;               // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyInfoCallbackProxy*             CallFunc_GetPartyInfo_ReturnValue_2;               // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0540(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsInfoPartyResponse      Temp_struct_Variable_3;                            // 0x0558(0x0070)()
	class FString                                 CallFunc_GetUserId_ReturnValue;                    // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGetUserBansCallbackProxy*              CallFunc_GetUserBans_ReturnValue;                  // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCTUserBansPayload                    Temp_struct_Variable_4;                            // 0x05E8(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F9[0x3];                                      // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0600(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMostRelevantUserBanData_OutHasActiveBan; // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            CallFunc_GetMostRelevantUserBanData_ReturnValue;   // 0x0618(0x0050)()
	int32                                         Temp_int_Variable_1;                               // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0670(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAccelByteModelsInfoPartyResponse      K2Node_CustomEvent_PartyInfo_2;                    // 0x0680(0x0070)()
	class FString                                 CallFunc_GetUserId_ReturnValue_1;                  // 0x06F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701[0x7];                                      // 0x0701(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_1;                            // 0x0708(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0718(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0728(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0738(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0748(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAccelByteModelsMatchmakingNotice      K2Node_Event_Notification;                         // 0x0758(0x0060)(ConstParm)
	struct FFCTUserBansPayload                    K2Node_CustomEvent_Bans;                           // 0x07B8(0x0010)()
	int32                                         K2Node_CustomEvent_Code_2;                         // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CC[0x4];                                      // 0x07CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x07D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnPlayNowTab_IsOnTab;                   // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x07E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x07E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConnected_ReturnValue;                  // 0x07E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x07E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnPlayNowTab_IsOnTab_1;                 // 0x07E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnPlayNowTab_IsOnTab_2;                 // 0x07E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E7[0x1];                                      // 0x07E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsInfoPartyResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x07E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FFCTUserBansPayload& Bans, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x07F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsConnected_ReturnValue_1;                // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_809[0x3];                                      // 0x0809(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x080C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_IsHost;                         // 0x081C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnPlayNowTab_IsOnTab_3;                 // 0x081D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E[0x2];                                      // 0x081E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0820(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetABGameMode_GameMode;                   // 0x0830(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_UpdatedLanguage;                // 0x0840(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTUserBansPayload                    K2Node_CustomEvent_Bans_1;                         // 0x0850(0x0010)()
	int32                                         K2Node_CustomEvent_Code_3;                         // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_864[0x4];                                      // 0x0864(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x0868(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHostByActiveWidget_ReturnValue;         // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879[0x3];                                      // 0x0879(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FFCTUserBansPayload& Bans, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x087C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_88C[0x4];                                      // 0x088C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Host_Preference_Settings_Out_AllowCrossPlatformPlay; // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_Host_Preference_Settings_Out_Matchmaker_Language; // 0x08A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTMatchmakingManagementCallbackProxy* CallFunc_StartMatchmaking_ReturnValue;             // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9[0x3];                                      // 0x08C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x08CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8DC[0x4];                                      // 0x08DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserId_ReturnValue_2;                  // 0x08E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F1[0x3];                                      // 0x08F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartySizeRequired_Return_Value;        // 0x08F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F9[0x7];                                      // 0x08F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0900(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_941[0x7];                                      // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0948(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue;             // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959[0x7];                                      // 0x0959(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0960(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0979(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow) == 0x000008, "Wrong alignment on CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow");
static_assert(sizeof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow) == 0x000980, "Wrong size on CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, EntryPoint) == 0x000000, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_PartyInfo_1) == 0x000018, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_PartyInfo_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, Temp_struct_Variable) == 0x000088, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetPartyInfo_ReturnValue) == 0x0000F8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetPartyInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000104, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_2) == 0x000114, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_CancelMatchmaking_ReturnValue) == 0x000128, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_CancelMatchmaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000130, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_3) == 0x00013C, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Message_1) == 0x000150, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Code_1) == 0x000160, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Result) == 0x000168, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Message) == 0x000288, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Code) == 0x000298, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_4) == 0x00029C, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, Temp_int_Variable) == 0x0002AC, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, Temp_string_Variable) == 0x0002B0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, Temp_struct_Variable_1) == 0x0002C0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetUserData_ReturnValue) == 0x0003E0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetUserData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsValid_ReturnValue_2) == 0x0003E8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_5) == 0x0003EC, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_6) == 0x0003FC, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Create_ReturnValue) == 0x000410, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_7) == 0x000418, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_8) == 0x000428, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_PartyInfo) == 0x000438, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_PartyInfo' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_9) == 0x0004A8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, Temp_struct_Variable_2) == 0x0004B8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetPartyInfo_ReturnValue_1) == 0x000528, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetPartyInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsValid_ReturnValue_3) == 0x000530, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetPartyInfo_ReturnValue_2) == 0x000538, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetPartyInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_10) == 0x000540, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsValid_ReturnValue_4) == 0x000550, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, Temp_struct_Variable_3) == 0x000558, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetUserId_ReturnValue) == 0x0005C8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0005D8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetUserBans_ReturnValue) == 0x0005E0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetUserBans_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, Temp_struct_Variable_4) == 0x0005E8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsValid_ReturnValue_5) == 0x0005F8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Array_Length_ReturnValue) == 0x0005FC, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Conv_IntToString_ReturnValue) == 0x000600, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetMostRelevantUserBanData_OutHasActiveBan) == 0x000610, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetMostRelevantUserBanData_OutHasActiveBan' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetMostRelevantUserBanData_ReturnValue) == 0x000618, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetMostRelevantUserBanData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, Temp_int_Variable_1) == 0x000668, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Conv_BoolToString_ReturnValue) == 0x000670, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_PartyInfo_2) == 0x000680, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_PartyInfo_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetUserId_ReturnValue_1) == 0x0006F0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetUserId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000700, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, Temp_string_Variable_1) == 0x000708, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Concat_StrStr_ReturnValue) == 0x000718, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000728, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000738, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000748, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_Event_Notification) == 0x000758, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_Event_Notification' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Bans) == 0x0007B8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Bans' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Code_2) == 0x0007C8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Code_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Message_2) == 0x0007D0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsOnPlayNowTab_IsOnTab) == 0x0007E0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsOnPlayNowTab_IsOnTab' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsPS4Platform_ReturnValue) == 0x0007E1, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsPS5Platform_ReturnValue) == 0x0007E2, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsPS5Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsConnected_ReturnValue) == 0x0007E3, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsConnected_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_BooleanOR_ReturnValue) == 0x0007E4, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsOnPlayNowTab_IsOnTab_1) == 0x0007E5, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsOnPlayNowTab_IsOnTab_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsOnPlayNowTab_IsOnTab_2) == 0x0007E6, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsOnPlayNowTab_IsOnTab_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_11) == 0x0007E8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_12) == 0x0007F8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsConnected_ReturnValue_1) == 0x000808, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsConnected_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_13) == 0x00080C, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_IsHost) == 0x00081C, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_IsHost' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsOnPlayNowTab_IsOnTab_3) == 0x00081D, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsOnPlayNowTab_IsOnTab_3' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetActiveWidget_ReturnValue) == 0x000820, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000828, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetABGameMode_GameMode) == 0x000830, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetABGameMode_GameMode' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_UpdatedLanguage) == 0x000840, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_UpdatedLanguage' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Bans_1) == 0x000850, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Bans_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Code_3) == 0x000860, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Code_3' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CustomEvent_Message_3) == 0x000868, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CustomEvent_Message_3' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsHostByActiveWidget_ReturnValue) == 0x000878, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsHostByActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_14) == 0x00087C, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetGameInstance_ReturnValue) == 0x000890, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Get_Host_Preference_Settings_Out_AllowCrossPlatformPlay) == 0x000898, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Get_Host_Preference_Settings_Out_AllowCrossPlatformPlay' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Get_Host_Preference_Settings_Out_Matchmaker_Language) == 0x0008A0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Get_Host_Preference_Settings_Out_Matchmaker_Language' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_DynamicCast_AsFCTGame_Instance_BP) == 0x0008B0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_DynamicCast_AsFCTGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_DynamicCast_bSuccess) == 0x0008B8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_StartMatchmaking_ReturnValue) == 0x0008C0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_StartMatchmaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsValid_ReturnValue_6) == 0x0008C8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_CreateDelegate_OutputDelegate_15) == 0x0008CC, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetUserId_ReturnValue_2) == 0x0008E0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetUserId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x0008F0, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_GetPartySizeRequired_Return_Value) == 0x0008F4, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_GetPartySizeRequired_Return_Value' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsXboxPlatform_ReturnValue) == 0x0008F8, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsXboxPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_MakeStruct_FormatArgumentData) == 0x000900, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_BooleanOR_ReturnValue_1) == 0x000940, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, K2Node_MakeArray_Array) == 0x000948, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_IsWinGDKPlatform_ReturnValue) == 0x000958, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_IsWinGDKPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Format_ReturnValue) == 0x000960, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_BooleanOR_ReturnValue_2) == 0x000978, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow, CallFunc_Not_PreBool_ReturnValue_1) == 0x000979, "Member 'CM_PlayNow_C_ExecuteUbergraph_CM_PlayNow::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnMatchmakingLanguageUpdated
// 0x0010 (0x0010 - 0x0000)
struct CM_PlayNow_C_OnMatchmakingLanguageUpdated final
{
public:
	class FString                                 UpdatedLanguage;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_PlayNow_C_OnMatchmakingLanguageUpdated) == 0x000008, "Wrong alignment on CM_PlayNow_C_OnMatchmakingLanguageUpdated");
static_assert(sizeof(CM_PlayNow_C_OnMatchmakingLanguageUpdated) == 0x000010, "Wrong size on CM_PlayNow_C_OnMatchmakingLanguageUpdated");
static_assert(offsetof(CM_PlayNow_C_OnMatchmakingLanguageUpdated, UpdatedLanguage) == 0x000000, "Member 'CM_PlayNow_C_OnMatchmakingLanguageUpdated::UpdatedLanguage' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnJoinedParty
// 0x0001 (0x0001 - 0x0000)
struct CM_PlayNow_C_OnJoinedParty final
{
public:
	bool                                          IsHost;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_PlayNow_C_OnJoinedParty) == 0x000001, "Wrong alignment on CM_PlayNow_C_OnJoinedParty");
static_assert(sizeof(CM_PlayNow_C_OnJoinedParty) == 0x000001, "Wrong size on CM_PlayNow_C_OnJoinedParty");
static_assert(offsetof(CM_PlayNow_C_OnJoinedParty, IsHost) == 0x000000, "Member 'CM_PlayNow_C_OnJoinedParty::IsHost' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnMatchmakingNotif
// 0x0060 (0x0060 - 0x0000)
struct CM_PlayNow_C_OnMatchmakingNotif final
{
public:
	struct FAccelByteModelsMatchmakingNotice      Notification;                                      // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CM_PlayNow_C_OnMatchmakingNotif) == 0x000008, "Wrong alignment on CM_PlayNow_C_OnMatchmakingNotif");
static_assert(sizeof(CM_PlayNow_C_OnMatchmakingNotif) == 0x000060, "Wrong size on CM_PlayNow_C_OnMatchmakingNotif");
static_assert(offsetof(CM_PlayNow_C_OnMatchmakingNotif, Notification) == 0x000000, "Member 'CM_PlayNow_C_OnMatchmakingNotif::Notification' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnSuccess_576C8CDD43A1CBABF0711DB568948834
// 0x0070 (0x0070 - 0x0000)
struct CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB568948834 final
{
public:
	struct FAccelByteModelsInfoPartyResponse      PartyInfo;                                         // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB568948834) == 0x000008, "Wrong alignment on CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB568948834");
static_assert(sizeof(CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB568948834) == 0x000070, "Wrong size on CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB568948834");
static_assert(offsetof(CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB568948834, PartyInfo) == 0x000000, "Member 'CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB568948834::PartyInfo' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnSuccess_F4C3994C477803AB8C317198824CFBDC
// 0x0138 (0x0138 - 0x0000)
struct CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC final
{
public:
	struct FAccountUserData                       Result;                                            // 0x0000(0x0120)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Message;                                           // 0x0120(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Code;                                              // 0x0130(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC) == 0x000008, "Wrong alignment on CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC");
static_assert(sizeof(CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC) == 0x000138, "Wrong size on CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC");
static_assert(offsetof(CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC, Result) == 0x000000, "Member 'CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC::Result' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC, Message) == 0x000120, "Member 'CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC::Message' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC, Code) == 0x000130, "Member 'CM_PlayNow_C_OnSuccess_F4C3994C477803AB8C317198824CFBDC::Code' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnError_F4C3994C477803AB8C317198824CFBDC
// 0x0018 (0x0018 - 0x0000)
struct CM_PlayNow_C_OnError_F4C3994C477803AB8C317198824CFBDC final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Code;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_PlayNow_C_OnError_F4C3994C477803AB8C317198824CFBDC) == 0x000008, "Wrong alignment on CM_PlayNow_C_OnError_F4C3994C477803AB8C317198824CFBDC");
static_assert(sizeof(CM_PlayNow_C_OnError_F4C3994C477803AB8C317198824CFBDC) == 0x000018, "Wrong size on CM_PlayNow_C_OnError_F4C3994C477803AB8C317198824CFBDC");
static_assert(offsetof(CM_PlayNow_C_OnError_F4C3994C477803AB8C317198824CFBDC, Message) == 0x000000, "Member 'CM_PlayNow_C_OnError_F4C3994C477803AB8C317198824CFBDC::Message' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_OnError_F4C3994C477803AB8C317198824CFBDC, Code) == 0x000010, "Member 'CM_PlayNow_C_OnError_F4C3994C477803AB8C317198824CFBDC::Code' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnSuccess_576C8CDD43A1CBABF0711DB5CFB8801E
// 0x0070 (0x0070 - 0x0000)
struct CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5CFB8801E final
{
public:
	struct FAccelByteModelsInfoPartyResponse      PartyInfo;                                         // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5CFB8801E) == 0x000008, "Wrong alignment on CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5CFB8801E");
static_assert(sizeof(CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5CFB8801E) == 0x000070, "Wrong size on CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5CFB8801E");
static_assert(offsetof(CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5CFB8801E, PartyInfo) == 0x000000, "Member 'CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5CFB8801E::PartyInfo' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnSuccess_3DED6FF246B4C805D8831883697AEB88
// 0x0028 (0x0028 - 0x0000)
struct CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88 final
{
public:
	struct FFCTUserBansPayload                    Bans;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Code;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88) == 0x000008, "Wrong alignment on CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88");
static_assert(sizeof(CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88) == 0x000028, "Wrong size on CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88");
static_assert(offsetof(CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88, Bans) == 0x000000, "Member 'CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88::Bans' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88, Code) == 0x000010, "Member 'CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88::Code' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88, Message) == 0x000018, "Member 'CM_PlayNow_C_OnSuccess_3DED6FF246B4C805D8831883697AEB88::Message' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnError_3DED6FF246B4C805D8831883697AEB88
// 0x0028 (0x0028 - 0x0000)
struct CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88 final
{
public:
	struct FFCTUserBansPayload                    Bans;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Code;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88) == 0x000008, "Wrong alignment on CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88");
static_assert(sizeof(CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88) == 0x000028, "Wrong size on CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88");
static_assert(offsetof(CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88, Bans) == 0x000000, "Member 'CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88::Bans' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88, Code) == 0x000010, "Member 'CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88::Code' has a wrong offset!");
static_assert(offsetof(CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88, Message) == 0x000018, "Member 'CM_PlayNow_C_OnError_3DED6FF246B4C805D8831883697AEB88::Message' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.OnSuccess_576C8CDD43A1CBABF0711DB5B630051D
// 0x0070 (0x0070 - 0x0000)
struct CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5B630051D final
{
public:
	struct FAccelByteModelsInfoPartyResponse      PartyInfo;                                         // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5B630051D) == 0x000008, "Wrong alignment on CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5B630051D");
static_assert(sizeof(CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5B630051D) == 0x000070, "Wrong size on CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5B630051D");
static_assert(offsetof(CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5B630051D, PartyInfo) == 0x000000, "Member 'CM_PlayNow_C_OnSuccess_576C8CDD43A1CBABF0711DB5B630051D::PartyInfo' has a wrong offset!");

// Function CM_PlayNow.CM_PlayNow_C.GetABGameMode
// 0x0038 (0x0038 - 0x0000)
struct CM_PlayNow_C_GetABGameMode final
{
public:
	class FString                                 GameMode;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class AClientEntryPC*                         ClientPC;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDevConsolePlatform_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AClientEntryPC*                         K2Node_DynamicCast_AsClient_Entry_PC;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
