#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_RegionOptionWI

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.ExecuteUbergraph_CM_RegionOptionWI
// 0x0280 (0x0280 - 0x0000)
struct CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UCM_ContentDialogWrapper_C*             CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool China)>                   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitialLoadComplete_ReturnValue;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x00FC(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0104(0x0008)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x010C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0148(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x01B8(0x0070)(ConstParm)
	class FText                                   Temp_text_Variable;                                // 0x0228(0x0018)(ConstParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_Saved_Region_Unchanged;               // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_China;                          // 0x026A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSavedRegion_China;                     // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AClientEntryPC*                         CallFunc_GetMainMenuPlayerController_ReturnValue;  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSavedRegion_China_1;                   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI");
static_assert(sizeof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI) == 0x000280, "Wrong size on CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, EntryPoint) == 0x000000, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, Temp_struct_Variable) == 0x000008, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, Temp_delegate_Variable) == 0x000018, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, Temp_struct_Variable_1) == 0x000028, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, Temp_delegate_Variable_1) == 0x000038, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, Temp_struct_Variable_2) == 0x000048, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, Temp_delegate_Variable_2) == 0x000058, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_Create_ReturnValue) == 0x000068, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, Temp_int_Array_Index_Variable) == 0x000090, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A0, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_PostAkEvent_ReturnValue) == 0x0000AC, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x0000B0, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_PostAkEvent_ReturnValue_1) == 0x0000B8, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_PostAkEvent_ReturnValue_2) == 0x0000BC, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_Event_IsDesignTime) == 0x0000C4, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_ComponentBoundEvent_SelectedItem) == 0x0000D0, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_ComponentBoundEvent_SelectionType) == 0x0000E0, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_InitialLoadComplete_ReturnValue) == 0x0000E1, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_InitialLoadComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_GetGameInstance_ReturnValue) == 0x0000E8, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_DynamicCast_AsSCTGame_Instance) == 0x0000F0, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_DynamicCast_AsSCTGame_Instance' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_Event_InFocusEvent_1) == 0x0000FC, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_Event_InFocusEvent) == 0x000104, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_Event_MyGeometry) == 0x00010C, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_Event_MouseEvent_1) == 0x000148, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_Event_MouseEvent) == 0x0001B8, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, Temp_text_Variable) == 0x000228, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_Array_Get_Item) == 0x000240, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_Less_IntInt_ReturnValue) == 0x000254, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_Array_Find_ReturnValue) == 0x000258, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00025C, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_Array_AddUnique_ReturnValue) == 0x000260, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000264, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000268, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_Set_Saved_Region_Unchanged) == 0x000269, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_Set_Saved_Region_Unchanged' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, K2Node_CustomEvent_China) == 0x00026A, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::K2Node_CustomEvent_China' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_GetSavedRegion_China) == 0x00026B, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_GetSavedRegion_China' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_GetMainMenuPlayerController_ReturnValue) == 0x000270, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_GetMainMenuPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI, CallFunc_GetSavedRegion_China_1) == 0x000278, "Member 'CM_RegionOptionWI_C_ExecuteUbergraph_CM_RegionOptionWI::CallFunc_GetSavedRegion_China_1' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.OnRegionChanged
// 0x0001 (0x0001 - 0x0000)
struct CM_RegionOptionWI_C_OnRegionChanged final
{
public:
	bool                                          China;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_RegionOptionWI_C_OnRegionChanged) == 0x000001, "Wrong alignment on CM_RegionOptionWI_C_OnRegionChanged");
static_assert(sizeof(CM_RegionOptionWI_C_OnRegionChanged) == 0x000001, "Wrong size on CM_RegionOptionWI_C_OnRegionChanged");
static_assert(offsetof(CM_RegionOptionWI_C_OnRegionChanged, China) == 0x000000, "Member 'CM_RegionOptionWI_C_OnRegionChanged::China' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct CM_RegionOptionWI_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CM_RegionOptionWI_C_OnMouseLeave) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_OnMouseLeave");
static_assert(sizeof(CM_RegionOptionWI_C_OnMouseLeave) == 0x000070, "Wrong size on CM_RegionOptionWI_C_OnMouseLeave");
static_assert(offsetof(CM_RegionOptionWI_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'CM_RegionOptionWI_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct CM_RegionOptionWI_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CM_RegionOptionWI_C_OnMouseEnter) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_OnMouseEnter");
static_assert(sizeof(CM_RegionOptionWI_C_OnMouseEnter) == 0x0000A8, "Wrong size on CM_RegionOptionWI_C_OnMouseEnter");
static_assert(offsetof(CM_RegionOptionWI_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'CM_RegionOptionWI_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'CM_RegionOptionWI_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CM_RegionOptionWI_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CM_RegionOptionWI_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on CM_RegionOptionWI_C_OnRemovedFromFocusPath");
static_assert(sizeof(CM_RegionOptionWI_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on CM_RegionOptionWI_C_OnRemovedFromFocusPath");
static_assert(offsetof(CM_RegionOptionWI_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'CM_RegionOptionWI_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CM_RegionOptionWI_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CM_RegionOptionWI_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on CM_RegionOptionWI_C_OnAddedToFocusPath");
static_assert(sizeof(CM_RegionOptionWI_C_OnAddedToFocusPath) == 0x000008, "Wrong size on CM_RegionOptionWI_C_OnAddedToFocusPath");
static_assert(offsetof(CM_RegionOptionWI_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'CM_RegionOptionWI_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct CM_RegionOptionWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_RegionOptionWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(CM_RegionOptionWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on CM_RegionOptionWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(CM_RegionOptionWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'CM_RegionOptionWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'CM_RegionOptionWI_C_BndEvt__CM_LanguageWI_ComboBoxString_Language_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_RegionOptionWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_RegionOptionWI_C_PreConstruct) == 0x000001, "Wrong alignment on CM_RegionOptionWI_C_PreConstruct");
static_assert(sizeof(CM_RegionOptionWI_C_PreConstruct) == 0x000001, "Wrong size on CM_RegionOptionWI_C_PreConstruct");
static_assert(offsetof(CM_RegionOptionWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_RegionOptionWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.GetSpecialOptions
// 0x0028 (0x0028 - 0x0000)
struct CM_RegionOptionWI_C_GetSpecialOptions final
{
public:
	class Ubp_SpecialOptionsSave_C*               SpecialOptions;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGame_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               K2Node_DynamicCast_AsBp_Special_Options_Save;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_RegionOptionWI_C_GetSpecialOptions) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_GetSpecialOptions");
static_assert(sizeof(CM_RegionOptionWI_C_GetSpecialOptions) == 0x000028, "Wrong size on CM_RegionOptionWI_C_GetSpecialOptions");
static_assert(offsetof(CM_RegionOptionWI_C_GetSpecialOptions, SpecialOptions) == 0x000000, "Member 'CM_RegionOptionWI_C_GetSpecialOptions::SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_GetSpecialOptions, CallFunc_LoadGame_ReturnValue) == 0x000008, "Member 'CM_RegionOptionWI_C_GetSpecialOptions::CallFunc_LoadGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_GetSpecialOptions, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000010, "Member 'CM_RegionOptionWI_C_GetSpecialOptions::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_GetSpecialOptions, K2Node_DynamicCast_AsBp_Special_Options_Save) == 0x000018, "Member 'CM_RegionOptionWI_C_GetSpecialOptions::K2Node_DynamicCast_AsBp_Special_Options_Save' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_GetSpecialOptions, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CM_RegionOptionWI_C_GetSpecialOptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.UpdateRegionSelectedComboBox
// 0x0018 (0x0018 - 0x0000)
struct CM_RegionOptionWI_C_UpdateRegionSelectedComboBox final
{
public:
	bool                                          China;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Bool_To_Option_Region_Option;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_RegionOptionWI_C_UpdateRegionSelectedComboBox) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_UpdateRegionSelectedComboBox");
static_assert(sizeof(CM_RegionOptionWI_C_UpdateRegionSelectedComboBox) == 0x000018, "Wrong size on CM_RegionOptionWI_C_UpdateRegionSelectedComboBox");
static_assert(offsetof(CM_RegionOptionWI_C_UpdateRegionSelectedComboBox, China) == 0x000000, "Member 'CM_RegionOptionWI_C_UpdateRegionSelectedComboBox::China' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_UpdateRegionSelectedComboBox, CallFunc_Bool_To_Option_Region_Option) == 0x000008, "Member 'CM_RegionOptionWI_C_UpdateRegionSelectedComboBox::CallFunc_Bool_To_Option_Region_Option' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.GetSavedRegion
// 0x0018 (0x0018 - 0x0000)
struct CM_RegionOptionWI_C_GetSavedRegion final
{
public:
	bool                                          China;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AClientEntryPC*                         CallFunc_GetMainMenuPlayerController_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_RegionOptionWI_C_GetSavedRegion) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_GetSavedRegion");
static_assert(sizeof(CM_RegionOptionWI_C_GetSavedRegion) == 0x000018, "Wrong size on CM_RegionOptionWI_C_GetSavedRegion");
static_assert(offsetof(CM_RegionOptionWI_C_GetSavedRegion, China) == 0x000000, "Member 'CM_RegionOptionWI_C_GetSavedRegion::China' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_GetSavedRegion, CallFunc_GetMainMenuPlayerController_ReturnValue) == 0x000008, "Member 'CM_RegionOptionWI_C_GetSavedRegion::CallFunc_GetMainMenuPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_GetSavedRegion, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'CM_RegionOptionWI_C_GetSavedRegion::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.Set Saved Region
// 0x0018 (0x0018 - 0x0000)
struct CM_RegionOptionWI_C_Set_Saved_Region final
{
public:
	bool                                          InChina;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Unchanged;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AClientEntryPC*                         CallFunc_GetMainMenuPlayerController_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredRegion_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_RegionOptionWI_C_Set_Saved_Region) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_Set_Saved_Region");
static_assert(sizeof(CM_RegionOptionWI_C_Set_Saved_Region) == 0x000018, "Wrong size on CM_RegionOptionWI_C_Set_Saved_Region");
static_assert(offsetof(CM_RegionOptionWI_C_Set_Saved_Region, InChina) == 0x000000, "Member 'CM_RegionOptionWI_C_Set_Saved_Region::InChina' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_Set_Saved_Region, Unchanged) == 0x000001, "Member 'CM_RegionOptionWI_C_Set_Saved_Region::Unchanged' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_Set_Saved_Region, CallFunc_GetMainMenuPlayerController_ReturnValue) == 0x000008, "Member 'CM_RegionOptionWI_C_Set_Saved_Region::CallFunc_GetMainMenuPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_Set_Saved_Region, CallFunc_SetDesiredRegion_ReturnValue) == 0x000010, "Member 'CM_RegionOptionWI_C_Set_Saved_Region::CallFunc_SetDesiredRegion_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_Set_Saved_Region, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'CM_RegionOptionWI_C_Set_Saved_Region::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.Get Saved Region Option
// 0x0028 (0x0028 - 0x0000)
struct CM_RegionOptionWI_C_Get_Saved_Region_Option final
{
public:
	class FString                                 Return;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSavedRegion_China;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Bool_To_Option_Region_Option;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_RegionOptionWI_C_Get_Saved_Region_Option) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_Get_Saved_Region_Option");
static_assert(sizeof(CM_RegionOptionWI_C_Get_Saved_Region_Option) == 0x000028, "Wrong size on CM_RegionOptionWI_C_Get_Saved_Region_Option");
static_assert(offsetof(CM_RegionOptionWI_C_Get_Saved_Region_Option, Return) == 0x000000, "Member 'CM_RegionOptionWI_C_Get_Saved_Region_Option::Return' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_Get_Saved_Region_Option, CallFunc_GetSavedRegion_China) == 0x000010, "Member 'CM_RegionOptionWI_C_Get_Saved_Region_Option::CallFunc_GetSavedRegion_China' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_Get_Saved_Region_Option, CallFunc_Bool_To_Option_Region_Option) == 0x000018, "Member 'CM_RegionOptionWI_C_Get_Saved_Region_Option::CallFunc_Bool_To_Option_Region_Option' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.Bool To Option
// 0x0028 (0x0028 - 0x0000)
struct CM_RegionOptionWI_C_Bool_To_Option final
{
public:
	bool                                          China;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Region_Option;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_RegionOptionWI_C_Bool_To_Option) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_Bool_To_Option");
static_assert(sizeof(CM_RegionOptionWI_C_Bool_To_Option) == 0x000028, "Wrong size on CM_RegionOptionWI_C_Bool_To_Option");
static_assert(offsetof(CM_RegionOptionWI_C_Bool_To_Option, China) == 0x000000, "Member 'CM_RegionOptionWI_C_Bool_To_Option::China' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_Bool_To_Option, Region_Option) == 0x000008, "Member 'CM_RegionOptionWI_C_Bool_To_Option::Region_Option' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_Bool_To_Option, CallFunc_SelectString_ReturnValue) == 0x000018, "Member 'CM_RegionOptionWI_C_Bool_To_Option::CallFunc_SelectString_ReturnValue' has a wrong offset!");

// Function CM_RegionOptionWI.CM_RegionOptionWI_C.GetFCTGameInstance
// 0x0020 (0x0020 - 0x0000)
struct CM_RegionOptionWI_C_GetFCTGameInstance final
{
public:
	class UFCTGameInstanceBP_C*                   AsFCTGame_Instance_BP;                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_RegionOptionWI_C_GetFCTGameInstance) == 0x000008, "Wrong alignment on CM_RegionOptionWI_C_GetFCTGameInstance");
static_assert(sizeof(CM_RegionOptionWI_C_GetFCTGameInstance) == 0x000020, "Wrong size on CM_RegionOptionWI_C_GetFCTGameInstance");
static_assert(offsetof(CM_RegionOptionWI_C_GetFCTGameInstance, AsFCTGame_Instance_BP) == 0x000000, "Member 'CM_RegionOptionWI_C_GetFCTGameInstance::AsFCTGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_GetFCTGameInstance, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'CM_RegionOptionWI_C_GetFCTGameInstance::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_RegionOptionWI_C_GetFCTGameInstance, K2Node_DynamicCast_AsFCTGame_Instance_BP) == 0x000010, "Member 'CM_RegionOptionWI_C_GetFCTGameInstance::K2Node_DynamicCast_AsFCTGame_Instance_BP' has a wrong offset!");
