#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_SubMenuItemContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_SubMenuItemContainer.CM_SubMenuItemContainer_C
// 0x0068 (0x02C8 - 0x0260)
class UCM_SubMenuItemContainer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 BottomImage;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                CenterSpacing;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FlatLeftCapImage;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_235;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RoundContainer;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RoundedRightCapImage;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TailLeftImage;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopImage;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bSetVisibilityByHoveredState;                      // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitialized;                                      // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsRounded;                                        // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CM_SubMenuItemContainer(int32 EntryPoint);
	void OnIsRoundedUpdated();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetUIScale();
	void SetIsRounded(bool bInIsRounded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_SubMenuItemContainer_C">();
	}
	static class UCM_SubMenuItemContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_SubMenuItemContainer_C>();
	}
};
static_assert(alignof(UCM_SubMenuItemContainer_C) == 0x000008, "Wrong alignment on UCM_SubMenuItemContainer_C");
static_assert(sizeof(UCM_SubMenuItemContainer_C) == 0x0002C8, "Wrong size on UCM_SubMenuItemContainer_C");
static_assert(offsetof(UCM_SubMenuItemContainer_C, UberGraphFrame) == 0x000260, "Member 'UCM_SubMenuItemContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, BottomImage) == 0x000268, "Member 'UCM_SubMenuItemContainer_C::BottomImage' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, CenterSpacing) == 0x000270, "Member 'UCM_SubMenuItemContainer_C::CenterSpacing' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, FlatLeftCapImage) == 0x000278, "Member 'UCM_SubMenuItemContainer_C::FlatLeftCapImage' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, Image_235) == 0x000280, "Member 'UCM_SubMenuItemContainer_C::Image_235' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, RoundContainer) == 0x000288, "Member 'UCM_SubMenuItemContainer_C::RoundContainer' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, RoundedRightCapImage) == 0x000290, "Member 'UCM_SubMenuItemContainer_C::RoundedRightCapImage' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, TailLeftImage) == 0x000298, "Member 'UCM_SubMenuItemContainer_C::TailLeftImage' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, TopImage) == 0x0002A0, "Member 'UCM_SubMenuItemContainer_C::TopImage' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, Color) == 0x0002A8, "Member 'UCM_SubMenuItemContainer_C::Color' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, bSetVisibilityByHoveredState) == 0x0002B8, "Member 'UCM_SubMenuItemContainer_C::bSetVisibilityByHoveredState' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, Scale) == 0x0002BC, "Member 'UCM_SubMenuItemContainer_C::Scale' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, bInitialized) == 0x0002C0, "Member 'UCM_SubMenuItemContainer_C::bInitialized' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuItemContainer_C, bIsRounded) == 0x0002C1, "Member 'UCM_SubMenuItemContainer_C::bIsRounded' has a wrong offset!");

}

