#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_SettingsWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CM_MenuAreaWI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_SettingsWI.CM_SettingsWI_C
// 0x0098 (0x0300 - 0x0268)
class UCM_SettingsWI_C final : public UCM_MenuAreaWI_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CM_SettingsWI_C;                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_AudioTabWI_C*                       CM_AudioTabWI;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              CM_ClickableSubTitleWI_Back;                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ControlsTabWI_C*                    CM_ControlsTabWI;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_GameTabWI_C*                        CM_GameTabWI;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_SubMenuWI_C*                        CM_SubMenuWI;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_VideoTabWI_C*                       CM_VideoTabWI;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_VoiceTabWI_C*                       CM_VoiceTabWI;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BotLine;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TopLine;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_91;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_118;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_SubMenus;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         MenuButtonGame;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         MenuButtonVideo;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         MenuButtonVoice;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         MenuButtonAudio;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         MenuButtonControls;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BackButtonHidden;                                  // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_CM_SettingsWI(int32 EntryPoint);
	void BndEvt__CM_SettingsWI_CM_ClickableSubTitleWI_Back_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void On_Select_New_Tab(const class FString& Title);
	void PreConstruct(bool IsDesignTime);
	void DeactivateWidget();
	void ActivateWidget();
	void Hide_Settings();
	void Stop_Listening_For_Back();
	void Listen_For_Back();
	void Construct();
	void Navigate_To_Controls();
	void Navigate_To_Audio();
	void Navigate_To_Voice();
	void Navigate_To_Video();
	void Navigate_To_Game();
	void ToggleHide(bool Enter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_SettingsWI_C">();
	}
	static class UCM_SettingsWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_SettingsWI_C>();
	}
};
static_assert(alignof(UCM_SettingsWI_C) == 0x000008, "Wrong alignment on UCM_SettingsWI_C");
static_assert(sizeof(UCM_SettingsWI_C) == 0x000300, "Wrong size on UCM_SettingsWI_C");
static_assert(offsetof(UCM_SettingsWI_C, UberGraphFrame_CM_SettingsWI_C) == 0x000268, "Member 'UCM_SettingsWI_C::UberGraphFrame_CM_SettingsWI_C' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, CM_AudioTabWI) == 0x000270, "Member 'UCM_SettingsWI_C::CM_AudioTabWI' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, CM_ClickableSubTitleWI_Back) == 0x000278, "Member 'UCM_SettingsWI_C::CM_ClickableSubTitleWI_Back' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, CM_ControlsTabWI) == 0x000280, "Member 'UCM_SettingsWI_C::CM_ControlsTabWI' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, CM_GameTabWI) == 0x000288, "Member 'UCM_SettingsWI_C::CM_GameTabWI' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, CM_SubMenuWI) == 0x000290, "Member 'UCM_SettingsWI_C::CM_SubMenuWI' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, CM_VideoTabWI) == 0x000298, "Member 'UCM_SettingsWI_C::CM_VideoTabWI' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, CM_VoiceTabWI) == 0x0002A0, "Member 'UCM_SettingsWI_C::CM_VoiceTabWI' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, Img_BotLine) == 0x0002A8, "Member 'UCM_SettingsWI_C::Img_BotLine' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, Img_TopLine) == 0x0002B0, "Member 'UCM_SettingsWI_C::Img_TopLine' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, SafeZone_91) == 0x0002B8, "Member 'UCM_SettingsWI_C::SafeZone_91' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, SafeZone_118) == 0x0002C0, "Member 'UCM_SettingsWI_C::SafeZone_118' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, WidgetSwitcher_SubMenus) == 0x0002C8, "Member 'UCM_SettingsWI_C::WidgetSwitcher_SubMenus' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, MenuButtonGame) == 0x0002D0, "Member 'UCM_SettingsWI_C::MenuButtonGame' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, MenuButtonVideo) == 0x0002D8, "Member 'UCM_SettingsWI_C::MenuButtonVideo' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, MenuButtonVoice) == 0x0002E0, "Member 'UCM_SettingsWI_C::MenuButtonVoice' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, MenuButtonAudio) == 0x0002E8, "Member 'UCM_SettingsWI_C::MenuButtonAudio' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, MenuButtonControls) == 0x0002F0, "Member 'UCM_SettingsWI_C::MenuButtonControls' has a wrong offset!");
static_assert(offsetof(UCM_SettingsWI_C, BackButtonHidden) == 0x0002F8, "Member 'UCM_SettingsWI_C::BackButtonHidden' has a wrong offset!");

}

