#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_TheBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function CM_TheBar.CM_TheBar_C.ExecuteUbergraph_CM_TheBar
// 0x0340 (0x0340 - 0x0000)
struct CM_TheBar_C_ExecuteUbergraph_CM_TheBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTAchievement*                        Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTStatIncrementCallbackProxy*         CallFunc_UpdateStatistic_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_5;                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAchievement*                        K2Node_CustomEvent_AchievementInfo_2;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_4;                      // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UFCTAchievement* AchievementInfo, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAchievement*                        Temp_object_Variable_1;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTStatIncrementCallbackProxy*         CallFunc_UpdateStatistic_ReturnValue_1;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAchievement*                        K2Node_CustomEvent_AchievementInfo_1;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UFCTAchievement* AchievementInfo, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_1;                            // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAchievement*                        Temp_object_Variable_2;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTStatIncrementCallbackProxy*         CallFunc_UpdateStatistic_ReturnValue_2;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAchievement*                        K2Node_CustomEvent_AchievementInfo;                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message;                        // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UFCTAchievement* AchievementInfo, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_2;                            // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAchievement*                        Temp_object_Variable_3;                            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTStatIncrementCallbackProxy*         CallFunc_UpdateStatistic_ReturnValue_3;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0234(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0244(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController_2;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_1;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_PlayerController;               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      Temp_object_Variable_4;                            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULoadingSpinnerWI_C*                    CallFunc_Create_ReturnValue;                       // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_7;                      // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x02B4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_3;                            // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlueprintXboxUserSwitcherCallbackProxy* CallFunc_XboxUserSwitch_ReturnValue;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTAchievement*                        K2Node_CustomEvent_AchievementInfo_3;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_6;                      // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue_1;             // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_313[0x1];                                      // 0x0313(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFCTAchievement* AchievementInfo, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x0314(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP_1;        // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar) == 0x000008, "Wrong alignment on CM_TheBar_C_ExecuteUbergraph_CM_TheBar");
static_assert(sizeof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar) == 0x000340, "Wrong size on CM_TheBar_C_ExecuteUbergraph_CM_TheBar");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, EntryPoint) == 0x000000, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, Temp_object_Variable) == 0x000010, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_DynamicCast_AsFCTGame_Instance_BP) == 0x000018, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_DynamicCast_AsFCTGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_UpdateStatistic_ReturnValue) == 0x000038, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_UpdateStatistic_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_Message_5) == 0x000068, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_Message_5' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_AchievementInfo_2) == 0x000078, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_AchievementInfo_2' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_Message_4) == 0x000080, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_Message_4' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, Temp_string_Variable) == 0x0000A0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, Temp_object_Variable_1) == 0x0000B0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000B8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000C8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_UpdateStatistic_ReturnValue_1) == 0x0000D8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_UpdateStatistic_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_IsValid_ReturnValue_1) == 0x0000E0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E4, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_Message_3) == 0x0000F8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_Message_3' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_AchievementInfo_1) == 0x000108, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_AchievementInfo_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_Message_2) == 0x000110, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_3) == 0x000120, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, Temp_string_Variable_1) == 0x000130, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, Temp_object_Variable_2) == 0x000140, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000148, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000158, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_UpdateStatistic_ReturnValue_2) == 0x000168, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_UpdateStatistic_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_IsValid_ReturnValue_2) == 0x000170, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_4) == 0x000174, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_Message_1) == 0x000188, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_AchievementInfo) == 0x000198, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_AchievementInfo' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_Message) == 0x0001A0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001B0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, Temp_string_Variable_2) == 0x0001C0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, Temp_object_Variable_3) == 0x0001D0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Conv_IntToString_ReturnValue_3) == 0x0001D8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001E8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_UpdateStatistic_ReturnValue_3) == 0x0001F8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_UpdateStatistic_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_IsValid_ReturnValue_3) == 0x000200, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_6) == 0x000204, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_7) == 0x000214, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_8) == 0x000224, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_9) == 0x000234, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_10) == 0x000244, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_PlayerController_2) == 0x000258, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_PlayerController_2' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_PlayerController_1) == 0x000260, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_PlayerController_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_11) == 0x000268, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_PlayerController) == 0x000278, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_12) == 0x000280, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, Temp_object_Variable_4) == 0x000290, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Create_ReturnValue) == 0x000298, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_Message_7) == 0x0002A0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_Message_7' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_Event_IsDesignTime) == 0x0002B0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_13) == 0x0002B4, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Not_PreBool_ReturnValue) == 0x0002C4, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, Temp_string_Variable_3) == 0x0002C8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_IsXboxPlatform_ReturnValue) == 0x0002D8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_IsXboxPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_GetPlayerController_ReturnValue) == 0x0002E0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_XboxUserSwitch_ReturnValue) == 0x0002E8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_XboxUserSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_IsValid_ReturnValue_4) == 0x0002F0, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_IsValid_ReturnValue_5) == 0x0002F1, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_AchievementInfo_3) == 0x0002F8, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_AchievementInfo_3' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CustomEvent_Message_6) == 0x000300, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CustomEvent_Message_6' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_IsValid_ReturnValue_6) == 0x000310, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_IsValid_ReturnValue_7) == 0x000311, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_IsXboxPlatform_ReturnValue_1) == 0x000312, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_IsXboxPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_CreateDelegate_OutputDelegate_14) == 0x000314, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_Not_PreBool_ReturnValue_1) == 0x000324, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, CallFunc_GetGameInstance_ReturnValue_1) == 0x000328, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_DynamicCast_AsFCTGame_Instance_BP_1) == 0x000330, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_DynamicCast_AsFCTGame_Instance_BP_1' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_ExecuteUbergraph_CM_TheBar, K2Node_DynamicCast_bSuccess_1) == 0x000338, "Member 'CM_TheBar_C_ExecuteUbergraph_CM_TheBar::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_TheBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_TheBar_C_PreConstruct) == 0x000001, "Wrong alignment on CM_TheBar_C_PreConstruct");
static_assert(sizeof(CM_TheBar_C_PreConstruct) == 0x000001, "Wrong size on CM_TheBar_C_PreConstruct");
static_assert(offsetof(CM_TheBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_TheBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnSuccessNewUser_AC0809644530970FAB3F7BB74225418B
// 0x0008 (0x0008 - 0x0000)
struct CM_TheBar_C_OnSuccessNewUser_AC0809644530970FAB3F7BB74225418B final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnSuccessNewUser_AC0809644530970FAB3F7BB74225418B) == 0x000008, "Wrong alignment on CM_TheBar_C_OnSuccessNewUser_AC0809644530970FAB3F7BB74225418B");
static_assert(sizeof(CM_TheBar_C_OnSuccessNewUser_AC0809644530970FAB3F7BB74225418B) == 0x000008, "Wrong size on CM_TheBar_C_OnSuccessNewUser_AC0809644530970FAB3F7BB74225418B");
static_assert(offsetof(CM_TheBar_C_OnSuccessNewUser_AC0809644530970FAB3F7BB74225418B, PlayerController) == 0x000000, "Member 'CM_TheBar_C_OnSuccessNewUser_AC0809644530970FAB3F7BB74225418B::PlayerController' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnSuccessExistingUser_AC0809644530970FAB3F7BB74225418B
// 0x0008 (0x0008 - 0x0000)
struct CM_TheBar_C_OnSuccessExistingUser_AC0809644530970FAB3F7BB74225418B final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnSuccessExistingUser_AC0809644530970FAB3F7BB74225418B) == 0x000008, "Wrong alignment on CM_TheBar_C_OnSuccessExistingUser_AC0809644530970FAB3F7BB74225418B");
static_assert(sizeof(CM_TheBar_C_OnSuccessExistingUser_AC0809644530970FAB3F7BB74225418B) == 0x000008, "Wrong size on CM_TheBar_C_OnSuccessExistingUser_AC0809644530970FAB3F7BB74225418B");
static_assert(offsetof(CM_TheBar_C_OnSuccessExistingUser_AC0809644530970FAB3F7BB74225418B, PlayerController) == 0x000000, "Member 'CM_TheBar_C_OnSuccessExistingUser_AC0809644530970FAB3F7BB74225418B::PlayerController' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnFailure_AC0809644530970FAB3F7BB74225418B
// 0x0008 (0x0008 - 0x0000)
struct CM_TheBar_C_OnFailure_AC0809644530970FAB3F7BB74225418B final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnFailure_AC0809644530970FAB3F7BB74225418B) == 0x000008, "Wrong alignment on CM_TheBar_C_OnFailure_AC0809644530970FAB3F7BB74225418B");
static_assert(sizeof(CM_TheBar_C_OnFailure_AC0809644530970FAB3F7BB74225418B) == 0x000008, "Wrong size on CM_TheBar_C_OnFailure_AC0809644530970FAB3F7BB74225418B");
static_assert(offsetof(CM_TheBar_C_OnFailure_AC0809644530970FAB3F7BB74225418B, PlayerController) == 0x000000, "Member 'CM_TheBar_C_OnFailure_AC0809644530970FAB3F7BB74225418B::PlayerController' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0
// 0x0018 (0x0018 - 0x0000)
struct CM_TheBar_C_OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0 final
{
public:
	class UFCTAchievement*                        AchievementInfo;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0) == 0x000008, "Wrong alignment on CM_TheBar_C_OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0");
static_assert(sizeof(CM_TheBar_C_OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0) == 0x000018, "Wrong size on CM_TheBar_C_OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0");
static_assert(offsetof(CM_TheBar_C_OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0, AchievementInfo) == 0x000000, "Member 'CM_TheBar_C_OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0::AchievementInfo' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0, Message) == 0x000008, "Member 'CM_TheBar_C_OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0::Message' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnError_2D52C04E4BBCC75F1D52F88BB16BBFF0
// 0x0010 (0x0010 - 0x0000)
struct CM_TheBar_C_OnError_2D52C04E4BBCC75F1D52F88BB16BBFF0 final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnError_2D52C04E4BBCC75F1D52F88BB16BBFF0) == 0x000008, "Wrong alignment on CM_TheBar_C_OnError_2D52C04E4BBCC75F1D52F88BB16BBFF0");
static_assert(sizeof(CM_TheBar_C_OnError_2D52C04E4BBCC75F1D52F88BB16BBFF0) == 0x000010, "Wrong size on CM_TheBar_C_OnError_2D52C04E4BBCC75F1D52F88BB16BBFF0");
static_assert(offsetof(CM_TheBar_C_OnError_2D52C04E4BBCC75F1D52F88BB16BBFF0, Message) == 0x000000, "Member 'CM_TheBar_C_OnError_2D52C04E4BBCC75F1D52F88BB16BBFF0::Message' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231
// 0x0018 (0x0018 - 0x0000)
struct CM_TheBar_C_OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231 final
{
public:
	class UFCTAchievement*                        AchievementInfo;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231) == 0x000008, "Wrong alignment on CM_TheBar_C_OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231");
static_assert(sizeof(CM_TheBar_C_OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231) == 0x000018, "Wrong size on CM_TheBar_C_OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231");
static_assert(offsetof(CM_TheBar_C_OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231, AchievementInfo) == 0x000000, "Member 'CM_TheBar_C_OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231::AchievementInfo' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231, Message) == 0x000008, "Member 'CM_TheBar_C_OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231::Message' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnError_B58F06BF46FAA5BF77D8F199C9FF8231
// 0x0010 (0x0010 - 0x0000)
struct CM_TheBar_C_OnError_B58F06BF46FAA5BF77D8F199C9FF8231 final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnError_B58F06BF46FAA5BF77D8F199C9FF8231) == 0x000008, "Wrong alignment on CM_TheBar_C_OnError_B58F06BF46FAA5BF77D8F199C9FF8231");
static_assert(sizeof(CM_TheBar_C_OnError_B58F06BF46FAA5BF77D8F199C9FF8231) == 0x000010, "Wrong size on CM_TheBar_C_OnError_B58F06BF46FAA5BF77D8F199C9FF8231");
static_assert(offsetof(CM_TheBar_C_OnError_B58F06BF46FAA5BF77D8F199C9FF8231, Message) == 0x000000, "Member 'CM_TheBar_C_OnError_B58F06BF46FAA5BF77D8F199C9FF8231::Message' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnSuccess_6E8493764D2695F0004DBBB7702F6EC6
// 0x0018 (0x0018 - 0x0000)
struct CM_TheBar_C_OnSuccess_6E8493764D2695F0004DBBB7702F6EC6 final
{
public:
	class UFCTAchievement*                        AchievementInfo;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnSuccess_6E8493764D2695F0004DBBB7702F6EC6) == 0x000008, "Wrong alignment on CM_TheBar_C_OnSuccess_6E8493764D2695F0004DBBB7702F6EC6");
static_assert(sizeof(CM_TheBar_C_OnSuccess_6E8493764D2695F0004DBBB7702F6EC6) == 0x000018, "Wrong size on CM_TheBar_C_OnSuccess_6E8493764D2695F0004DBBB7702F6EC6");
static_assert(offsetof(CM_TheBar_C_OnSuccess_6E8493764D2695F0004DBBB7702F6EC6, AchievementInfo) == 0x000000, "Member 'CM_TheBar_C_OnSuccess_6E8493764D2695F0004DBBB7702F6EC6::AchievementInfo' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_OnSuccess_6E8493764D2695F0004DBBB7702F6EC6, Message) == 0x000008, "Member 'CM_TheBar_C_OnSuccess_6E8493764D2695F0004DBBB7702F6EC6::Message' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnError_6E8493764D2695F0004DBBB7702F6EC6
// 0x0010 (0x0010 - 0x0000)
struct CM_TheBar_C_OnError_6E8493764D2695F0004DBBB7702F6EC6 final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnError_6E8493764D2695F0004DBBB7702F6EC6) == 0x000008, "Wrong alignment on CM_TheBar_C_OnError_6E8493764D2695F0004DBBB7702F6EC6");
static_assert(sizeof(CM_TheBar_C_OnError_6E8493764D2695F0004DBBB7702F6EC6) == 0x000010, "Wrong size on CM_TheBar_C_OnError_6E8493764D2695F0004DBBB7702F6EC6");
static_assert(offsetof(CM_TheBar_C_OnError_6E8493764D2695F0004DBBB7702F6EC6, Message) == 0x000000, "Member 'CM_TheBar_C_OnError_6E8493764D2695F0004DBBB7702F6EC6::Message' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA
// 0x0018 (0x0018 - 0x0000)
struct CM_TheBar_C_OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA final
{
public:
	class UFCTAchievement*                        AchievementInfo;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA) == 0x000008, "Wrong alignment on CM_TheBar_C_OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA");
static_assert(sizeof(CM_TheBar_C_OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA) == 0x000018, "Wrong size on CM_TheBar_C_OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA");
static_assert(offsetof(CM_TheBar_C_OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA, AchievementInfo) == 0x000000, "Member 'CM_TheBar_C_OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA::AchievementInfo' has a wrong offset!");
static_assert(offsetof(CM_TheBar_C_OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA, Message) == 0x000008, "Member 'CM_TheBar_C_OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA::Message' has a wrong offset!");

// Function CM_TheBar.CM_TheBar_C.OnError_8DD72F9445E924A7150CDF9300C8FBAA
// 0x0010 (0x0010 - 0x0000)
struct CM_TheBar_C_OnError_8DD72F9445E924A7150CDF9300C8FBAA final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_TheBar_C_OnError_8DD72F9445E924A7150CDF9300C8FBAA) == 0x000008, "Wrong alignment on CM_TheBar_C_OnError_8DD72F9445E924A7150CDF9300C8FBAA");
static_assert(sizeof(CM_TheBar_C_OnError_8DD72F9445E924A7150CDF9300C8FBAA) == 0x000010, "Wrong size on CM_TheBar_C_OnError_8DD72F9445E924A7150CDF9300C8FBAA");
static_assert(offsetof(CM_TheBar_C_OnError_8DD72F9445E924A7150CDF9300C8FBAA, Message) == 0x000000, "Member 'CM_TheBar_C_OnError_8DD72F9445E924A7150CDF9300C8FBAA::Message' has a wrong offset!");

}

