#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_UtilityMenuWI

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CM_UtilityMenuWI.CM_UtilityMenuWI_C.ExecuteUbergraph_CM_UtilityMenuWI
// 0x000C (0x000C - 0x0000)
struct CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue_1;              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI) == 0x000004, "Wrong alignment on CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI");
static_assert(sizeof(CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI) == 0x00000C, "Wrong size on CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI");
static_assert(offsetof(CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI, EntryPoint) == 0x000000, "Member 'CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI, CallFunc_IsPS4Platform_ReturnValue) == 0x000004, "Member 'CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI, CallFunc_IsPS5Platform_ReturnValue) == 0x000005, "Member 'CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI::CallFunc_IsPS5Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI, CallFunc_IsPS5Platform_ReturnValue_1) == 0x000007, "Member 'CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI::CallFunc_IsPS5Platform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI, CallFunc_IsWinGDKPlatform_ReturnValue) == 0x000008, "Member 'CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI::CallFunc_IsWinGDKPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI, CallFunc_IsXboxPlatform_ReturnValue) == 0x000009, "Member 'CM_UtilityMenuWI_C_ExecuteUbergraph_CM_UtilityMenuWI::CallFunc_IsXboxPlatform_ReturnValue' has a wrong offset!");

// Function CM_UtilityMenuWI.CM_UtilityMenuWI_C.SetConsoleInviteButtonActive
// 0x0005 (0x0005 - 0x0000)
struct CM_UtilityMenuWI_C_SetConsoleInviteButtonActive final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_UtilityMenuWI_C_SetConsoleInviteButtonActive) == 0x000001, "Wrong alignment on CM_UtilityMenuWI_C_SetConsoleInviteButtonActive");
static_assert(sizeof(CM_UtilityMenuWI_C_SetConsoleInviteButtonActive) == 0x000005, "Wrong size on CM_UtilityMenuWI_C_SetConsoleInviteButtonActive");
static_assert(offsetof(CM_UtilityMenuWI_C_SetConsoleInviteButtonActive, Active) == 0x000000, "Member 'CM_UtilityMenuWI_C_SetConsoleInviteButtonActive::Active' has a wrong offset!");
static_assert(offsetof(CM_UtilityMenuWI_C_SetConsoleInviteButtonActive, Temp_bool_Variable) == 0x000001, "Member 'CM_UtilityMenuWI_C_SetConsoleInviteButtonActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CM_UtilityMenuWI_C_SetConsoleInviteButtonActive, Temp_byte_Variable) == 0x000002, "Member 'CM_UtilityMenuWI_C_SetConsoleInviteButtonActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CM_UtilityMenuWI_C_SetConsoleInviteButtonActive, Temp_byte_Variable_1) == 0x000003, "Member 'CM_UtilityMenuWI_C_SetConsoleInviteButtonActive::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_UtilityMenuWI_C_SetConsoleInviteButtonActive, K2Node_Select_Default) == 0x000004, "Member 'CM_UtilityMenuWI_C_SetConsoleInviteButtonActive::K2Node_Select_Default' has a wrong offset!");

}

