#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_VideoTabWI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CM_VideoTabWI.CM_VideoTabWI_C.ExecuteUbergraph_CM_VideoTabWI
// 0x0198 (0x0198 - 0x0000)
struct CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_2;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_1;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVSyncEnabled_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked;              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable_4;                              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue_1;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetScreenResolution_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetFullscreenMode_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_3;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOverallScalabilityLevel_ReturnValue;   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_4;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_1;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_2;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_3;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_4;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_5;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default_1;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0118(0x0018)()
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_2;         // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_2;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                K2Node_Select_Default_2;                           // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_1;         // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_1;        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0188(0x0010)(ReferenceParm)
};
static_assert(alignof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI");
static_assert(sizeof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI) == 0x000198, "Wrong size on CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, EntryPoint) == 0x000000, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, Temp_byte_Variable) == 0x000004, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, Temp_bool_Variable) == 0x000005, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, Temp_byte_Variable_1) == 0x000006, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, Temp_byte_Variable_2) == 0x000007, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, Temp_byte_Variable_3) == 0x000008, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, Temp_string_Variable) == 0x000010, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, Temp_string_Variable_1) == 0x000020, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, Temp_string_Variable_2) == 0x000030, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_ComponentBoundEvent_IsChecked_2) == 0x000040, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_ComponentBoundEvent_IsChecked_2' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_ComponentBoundEvent_IsChecked_1) == 0x000041, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_ComponentBoundEvent_IsChecked_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_IsChecked_ReturnValue) == 0x000042, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetGameUserSettings_ReturnValue) == 0x000048, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_IsVSyncEnabled_ReturnValue) == 0x000050, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_IsVSyncEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_ComponentBoundEvent_IsChecked) == 0x000051, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_ComponentBoundEvent_IsChecked' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, Temp_byte_Variable_4) == 0x000052, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_IsChecked_ReturnValue_1) == 0x000053, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_IsChecked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000058, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetScreenResolution_ReturnValue) == 0x000060, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetScreenResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_Conv_IntToString_ReturnValue) == 0x000068, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000078, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x000088, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetFullscreenMode_ReturnValue) == 0x0000A0, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetFullscreenMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A8, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_Select_Default) == 0x0000B8, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetGameUserSettings_ReturnValue_3) == 0x0000C8, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetGameUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetOverallScalabilityLevel_ReturnValue) == 0x0000D0, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetOverallScalabilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_IsConsolePlatform_ReturnValue) == 0x0000D4, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetGameUserSettings_ReturnValue_4) == 0x0000D8, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetGameUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetSpecialOptions_SpecialOptions) == 0x0000E0, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetSpecialOptions_SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetSpecialOptions_SpecialOptions_1) == 0x0000E8, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetSpecialOptions_SpecialOptions_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetSpecialOptions_SpecialOptions_2) == 0x0000F0, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetSpecialOptions_SpecialOptions_2' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetSpecialOptions_SpecialOptions_3) == 0x0000F8, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetSpecialOptions_SpecialOptions_3' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetSpecialOptions_SpecialOptions_4) == 0x000100, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetSpecialOptions_SpecialOptions_4' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_GetSpecialOptions_SpecialOptions_5) == 0x000108, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_GetSpecialOptions_SpecialOptions_5' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_Select_Default_1) == 0x000110, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, CallFunc_Conv_FloatToText_ReturnValue) == 0x000118, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_ComponentBoundEvent_SelectedItem_2) == 0x000130, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_ComponentBoundEvent_SelectedItem_2' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_ComponentBoundEvent_SelectionType_2) == 0x000140, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_ComponentBoundEvent_SelectionType_2' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, Temp_bool_Variable_1) == 0x000141, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_Event_IsDesignTime) == 0x000142, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_Select_Default_2) == 0x000143, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_ComponentBoundEvent_SelectedItem_1) == 0x000148, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_ComponentBoundEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_ComponentBoundEvent_SelectionType_1) == 0x000158, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_ComponentBoundEvent_SelectionType_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_ComponentBoundEvent_SelectedItem) == 0x000160, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_ComponentBoundEvent_SelectionType) == 0x000170, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_MakeArray_Array) == 0x000178, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI, K2Node_MakeArray_Array_1) == 0x000188, "Member 'CM_VideoTabWI_C_ExecuteUbergraph_CM_VideoTabWI::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.BndEvt__CM_VideoTabWI_DisplayMode_K2Node_ComponentBoundEvent_15_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_DisplayMode_K2Node_ComponentBoundEvent_15_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_DisplayMode_K2Node_ComponentBoundEvent_15_OnSelectionChanged__DelegateSignature) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_DisplayMode_K2Node_ComponentBoundEvent_15_OnSelectionChanged__DelegateSignature");
static_assert(sizeof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_DisplayMode_K2Node_ComponentBoundEvent_15_OnSelectionChanged__DelegateSignature) == 0x000018, "Wrong size on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_DisplayMode_K2Node_ComponentBoundEvent_15_OnSelectionChanged__DelegateSignature");
static_assert(offsetof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_DisplayMode_K2Node_ComponentBoundEvent_15_OnSelectionChanged__DelegateSignature, SelectedItem) == 0x000000, "Member 'CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_DisplayMode_K2Node_ComponentBoundEvent_15_OnSelectionChanged__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_DisplayMode_K2Node_ComponentBoundEvent_15_OnSelectionChanged__DelegateSignature, SelectionType) == 0x000010, "Member 'CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_DisplayMode_K2Node_ComponentBoundEvent_15_OnSelectionChanged__DelegateSignature::SelectionType' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.BndEvt__CM_VideoTabWI_GraphicsQuality_K2Node_ComponentBoundEvent_14_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_GraphicsQuality_K2Node_ComponentBoundEvent_14_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_GraphicsQuality_K2Node_ComponentBoundEvent_14_OnSelectionChanged__DelegateSignature) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_GraphicsQuality_K2Node_ComponentBoundEvent_14_OnSelectionChanged__DelegateSignature");
static_assert(sizeof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_GraphicsQuality_K2Node_ComponentBoundEvent_14_OnSelectionChanged__DelegateSignature) == 0x000018, "Wrong size on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_GraphicsQuality_K2Node_ComponentBoundEvent_14_OnSelectionChanged__DelegateSignature");
static_assert(offsetof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_GraphicsQuality_K2Node_ComponentBoundEvent_14_OnSelectionChanged__DelegateSignature, SelectedItem) == 0x000000, "Member 'CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_GraphicsQuality_K2Node_ComponentBoundEvent_14_OnSelectionChanged__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_GraphicsQuality_K2Node_ComponentBoundEvent_14_OnSelectionChanged__DelegateSignature, SelectionType) == 0x000010, "Member 'CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_GraphicsQuality_K2Node_ComponentBoundEvent_14_OnSelectionChanged__DelegateSignature::SelectionType' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_VideoTabWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_VideoTabWI_C_PreConstruct) == 0x000001, "Wrong alignment on CM_VideoTabWI_C_PreConstruct");
static_assert(sizeof(CM_VideoTabWI_C_PreConstruct) == 0x000001, "Wrong size on CM_VideoTabWI_C_PreConstruct");
static_assert(offsetof(CM_VideoTabWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_VideoTabWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.BndEvt__CM_VideoTabWI_Resolution_K2Node_ComponentBoundEvent_13_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_Resolution_K2Node_ComponentBoundEvent_13_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_Resolution_K2Node_ComponentBoundEvent_13_OnSelectionChanged__DelegateSignature) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_Resolution_K2Node_ComponentBoundEvent_13_OnSelectionChanged__DelegateSignature");
static_assert(sizeof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_Resolution_K2Node_ComponentBoundEvent_13_OnSelectionChanged__DelegateSignature) == 0x000018, "Wrong size on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_Resolution_K2Node_ComponentBoundEvent_13_OnSelectionChanged__DelegateSignature");
static_assert(offsetof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_Resolution_K2Node_ComponentBoundEvent_13_OnSelectionChanged__DelegateSignature, SelectedItem) == 0x000000, "Member 'CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_Resolution_K2Node_ComponentBoundEvent_13_OnSelectionChanged__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_Resolution_K2Node_ComponentBoundEvent_13_OnSelectionChanged__DelegateSignature, SelectionType) == 0x000010, "Member 'CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_Resolution_K2Node_ComponentBoundEvent_13_OnSelectionChanged__DelegateSignature::SelectionType' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.BndEvt__CM_VideoTabWI_CameraShakeCheckbox_K2Node_ComponentBoundEvent_5_StateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_CameraShakeCheckbox_K2Node_ComponentBoundEvent_5_StateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_CameraShakeCheckbox_K2Node_ComponentBoundEvent_5_StateChanged__DelegateSignature) == 0x000001, "Wrong alignment on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_CameraShakeCheckbox_K2Node_ComponentBoundEvent_5_StateChanged__DelegateSignature");
static_assert(sizeof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_CameraShakeCheckbox_K2Node_ComponentBoundEvent_5_StateChanged__DelegateSignature) == 0x000001, "Wrong size on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_CameraShakeCheckbox_K2Node_ComponentBoundEvent_5_StateChanged__DelegateSignature");
static_assert(offsetof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_CameraShakeCheckbox_K2Node_ComponentBoundEvent_5_StateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_CameraShakeCheckbox_K2Node_ComponentBoundEvent_5_StateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.BndEvt__CM_VideoTabWI_VsyncCheckbox_K2Node_ComponentBoundEvent_3_StateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_VsyncCheckbox_K2Node_ComponentBoundEvent_3_StateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_VsyncCheckbox_K2Node_ComponentBoundEvent_3_StateChanged__DelegateSignature) == 0x000001, "Wrong alignment on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_VsyncCheckbox_K2Node_ComponentBoundEvent_3_StateChanged__DelegateSignature");
static_assert(sizeof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_VsyncCheckbox_K2Node_ComponentBoundEvent_3_StateChanged__DelegateSignature) == 0x000001, "Wrong size on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_VsyncCheckbox_K2Node_ComponentBoundEvent_3_StateChanged__DelegateSignature");
static_assert(offsetof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_VsyncCheckbox_K2Node_ComponentBoundEvent_3_StateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_VsyncCheckbox_K2Node_ComponentBoundEvent_3_StateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.BndEvt__CM_VideoTabWI_motionblurCheckbox_K2Node_ComponentBoundEvent_4_StateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_motionblurCheckbox_K2Node_ComponentBoundEvent_4_StateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_motionblurCheckbox_K2Node_ComponentBoundEvent_4_StateChanged__DelegateSignature) == 0x000001, "Wrong alignment on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_motionblurCheckbox_K2Node_ComponentBoundEvent_4_StateChanged__DelegateSignature");
static_assert(sizeof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_motionblurCheckbox_K2Node_ComponentBoundEvent_4_StateChanged__DelegateSignature) == 0x000001, "Wrong size on CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_motionblurCheckbox_K2Node_ComponentBoundEvent_4_StateChanged__DelegateSignature");
static_assert(offsetof(CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_motionblurCheckbox_K2Node_ComponentBoundEvent_4_StateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'CM_VideoTabWI_C_BndEvt__CM_VideoTabWI_motionblurCheckbox_K2Node_ComponentBoundEvent_4_StateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.AddValuesToResolution
// 0x0078 (0x0078 - 0x0000)
struct CM_VideoTabWI_C_AddValuesToResolution final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIntPoint>                      CallFunc_GetSupportedFullscreenResolutions_Resolutions; // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSupportedFullscreenResolutions_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_VideoTabWI_C_AddValuesToResolution) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_AddValuesToResolution");
static_assert(sizeof(CM_VideoTabWI_C_AddValuesToResolution) == 0x000078, "Wrong size on CM_VideoTabWI_C_AddValuesToResolution");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, Temp_int_Array_Index_Variable) == 0x000000, "Member 'CM_VideoTabWI_C_AddValuesToResolution::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CM_VideoTabWI_C_AddValuesToResolution::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CM_VideoTabWI_C_AddValuesToResolution::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, CallFunc_GetSupportedFullscreenResolutions_Resolutions) == 0x000010, "Member 'CM_VideoTabWI_C_AddValuesToResolution::CallFunc_GetSupportedFullscreenResolutions_Resolutions' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, CallFunc_GetSupportedFullscreenResolutions_ReturnValue) == 0x000020, "Member 'CM_VideoTabWI_C_AddValuesToResolution::CallFunc_GetSupportedFullscreenResolutions_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'CM_VideoTabWI_C_AddValuesToResolution::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, CallFunc_Array_Get_Item) == 0x000028, "Member 'CM_VideoTabWI_C_AddValuesToResolution::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'CM_VideoTabWI_C_AddValuesToResolution::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'CM_VideoTabWI_C_AddValuesToResolution::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000048, "Member 'CM_VideoTabWI_C_AddValuesToResolution::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'CM_VideoTabWI_C_AddValuesToResolution::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_AddValuesToResolution, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'CM_VideoTabWI_C_AddValuesToResolution::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.ForceSetMotionblurFromScalability
// 0x0048 (0x0048 - 0x0000)
struct CM_VideoTabWI_C_ForceSetMotionblurFromScalability final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOverallScalabilityLevel_ReturnValue;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_ForceSetMotionblurFromScalability");
static_assert(sizeof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability) == 0x000048, "Wrong size on CM_VideoTabWI_C_ForceSetMotionblurFromScalability");
static_assert(offsetof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability, Temp_int_Variable) == 0x000000, "Member 'CM_VideoTabWI_C_ForceSetMotionblurFromScalability::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability, Temp_int_Variable_1) == 0x000004, "Member 'CM_VideoTabWI_C_ForceSetMotionblurFromScalability::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability, Temp_int_Variable_2) == 0x000008, "Member 'CM_VideoTabWI_C_ForceSetMotionblurFromScalability::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability, Temp_int_Variable_3) == 0x00000C, "Member 'CM_VideoTabWI_C_ForceSetMotionblurFromScalability::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability, Temp_int_Variable_4) == 0x000010, "Member 'CM_VideoTabWI_C_ForceSetMotionblurFromScalability::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'CM_VideoTabWI_C_ForceSetMotionblurFromScalability::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability, CallFunc_GetOverallScalabilityLevel_ReturnValue) == 0x000020, "Member 'CM_VideoTabWI_C_ForceSetMotionblurFromScalability::CallFunc_GetOverallScalabilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability, K2Node_Select_Default) == 0x000024, "Member 'CM_VideoTabWI_C_ForceSetMotionblurFromScalability::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'CM_VideoTabWI_C_ForceSetMotionblurFromScalability::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_ForceSetMotionblurFromScalability, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'CM_VideoTabWI_C_ForceSetMotionblurFromScalability::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.UpdateAndSaveResolution
// 0x0050 (0x0050 - 0x0000)
struct CM_VideoTabWI_C_UpdateAndSaveResolution final
{
public:
	class FString                                 SourceString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue_1;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_VideoTabWI_C_UpdateAndSaveResolution) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_UpdateAndSaveResolution");
static_assert(sizeof(CM_VideoTabWI_C_UpdateAndSaveResolution) == 0x000050, "Wrong size on CM_VideoTabWI_C_UpdateAndSaveResolution");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveResolution, SourceString) == 0x000000, "Member 'CM_VideoTabWI_C_UpdateAndSaveResolution::SourceString' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveResolution, CallFunc_GetGameUserSettings_ReturnValue) == 0x000010, "Member 'CM_VideoTabWI_C_UpdateAndSaveResolution::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveResolution, CallFunc_GetSubstring_ReturnValue) == 0x000018, "Member 'CM_VideoTabWI_C_UpdateAndSaveResolution::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveResolution, CallFunc_Conv_StringToInt_ReturnValue) == 0x000028, "Member 'CM_VideoTabWI_C_UpdateAndSaveResolution::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveResolution, CallFunc_GetSubstring_ReturnValue_1) == 0x000030, "Member 'CM_VideoTabWI_C_UpdateAndSaveResolution::CallFunc_GetSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveResolution, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x000040, "Member 'CM_VideoTabWI_C_UpdateAndSaveResolution::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveResolution, K2Node_MakeStruct_IntPoint) == 0x000044, "Member 'CM_VideoTabWI_C_UpdateAndSaveResolution::K2Node_MakeStruct_IntPoint' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.UpdateAndSaveFullscreenMode
// 0x0038 (0x0038 - 0x0000)
struct CM_VideoTabWI_C_UpdateAndSaveFullscreenMode final
{
public:
	class FString                                 Selection;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_3;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_VideoTabWI_C_UpdateAndSaveFullscreenMode) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_UpdateAndSaveFullscreenMode");
static_assert(sizeof(CM_VideoTabWI_C_UpdateAndSaveFullscreenMode) == 0x000038, "Wrong size on CM_VideoTabWI_C_UpdateAndSaveFullscreenMode");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveFullscreenMode, Selection) == 0x000000, "Member 'CM_VideoTabWI_C_UpdateAndSaveFullscreenMode::Selection' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveFullscreenMode, CallFunc_GetGameUserSettings_ReturnValue) == 0x000010, "Member 'CM_VideoTabWI_C_UpdateAndSaveFullscreenMode::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveFullscreenMode, K2Node_SwitchString_CmpSuccess) == 0x000018, "Member 'CM_VideoTabWI_C_UpdateAndSaveFullscreenMode::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveFullscreenMode, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000020, "Member 'CM_VideoTabWI_C_UpdateAndSaveFullscreenMode::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveFullscreenMode, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x000028, "Member 'CM_VideoTabWI_C_UpdateAndSaveFullscreenMode::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveFullscreenMode, CallFunc_GetGameUserSettings_ReturnValue_3) == 0x000030, "Member 'CM_VideoTabWI_C_UpdateAndSaveFullscreenMode::CallFunc_GetGameUserSettings_ReturnValue_3' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.UpdateAndSaveQualityFromComboBox
// 0x0010 (0x0010 - 0x0000)
struct CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox final
{
public:
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox");
static_assert(sizeof(CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox) == 0x000010, "Wrong size on CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox, CallFunc_GetGameUserSettings_ReturnValue) == 0x000000, "Member 'CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox, CallFunc_GetSelectedIndex_ReturnValue) == 0x000008, "Member 'CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'CM_VideoTabWI_C_UpdateAndSaveQualityFromComboBox::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.UpdateAndSaveVSync
// 0x0010 (0x0010 - 0x0000)
struct CM_VideoTabWI_C_UpdateAndSaveVSync final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_VideoTabWI_C_UpdateAndSaveVSync) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_UpdateAndSaveVSync");
static_assert(sizeof(CM_VideoTabWI_C_UpdateAndSaveVSync) == 0x000010, "Wrong size on CM_VideoTabWI_C_UpdateAndSaveVSync");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveVSync, bEnable) == 0x000000, "Member 'CM_VideoTabWI_C_UpdateAndSaveVSync::bEnable' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveVSync, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'CM_VideoTabWI_C_UpdateAndSaveVSync::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.UpdateAndSaveMotionBlur
// 0x0018 (0x0018 - 0x0000)
struct CM_VideoTabWI_C_UpdateAndSaveMotionBlur final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_SpecialOptionsSave_C*               SpecialOptions;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_VideoTabWI_C_UpdateAndSaveMotionBlur) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_UpdateAndSaveMotionBlur");
static_assert(sizeof(CM_VideoTabWI_C_UpdateAndSaveMotionBlur) == 0x000018, "Wrong size on CM_VideoTabWI_C_UpdateAndSaveMotionBlur");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveMotionBlur, IsChecked) == 0x000000, "Member 'CM_VideoTabWI_C_UpdateAndSaveMotionBlur::IsChecked' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveMotionBlur, SpecialOptions) == 0x000008, "Member 'CM_VideoTabWI_C_UpdateAndSaveMotionBlur::SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveMotionBlur, CallFunc_SaveGame_ReturnValue) == 0x000010, "Member 'CM_VideoTabWI_C_UpdateAndSaveMotionBlur::CallFunc_SaveGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveMotionBlur, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'CM_VideoTabWI_C_UpdateAndSaveMotionBlur::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.UpdateAndSaveCameraShake
// 0x0018 (0x0018 - 0x0000)
struct CM_VideoTabWI_C_UpdateAndSaveCameraShake final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_SpecialOptionsSave_C*               SpecialOptions;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_VideoTabWI_C_UpdateAndSaveCameraShake) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_UpdateAndSaveCameraShake");
static_assert(sizeof(CM_VideoTabWI_C_UpdateAndSaveCameraShake) == 0x000018, "Wrong size on CM_VideoTabWI_C_UpdateAndSaveCameraShake");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveCameraShake, IsChecked) == 0x000000, "Member 'CM_VideoTabWI_C_UpdateAndSaveCameraShake::IsChecked' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveCameraShake, SpecialOptions) == 0x000008, "Member 'CM_VideoTabWI_C_UpdateAndSaveCameraShake::SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveCameraShake, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'CM_VideoTabWI_C_UpdateAndSaveCameraShake::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveCameraShake, CallFunc_SaveGame_ReturnValue) == 0x000011, "Member 'CM_VideoTabWI_C_UpdateAndSaveCameraShake::CallFunc_SaveGame_ReturnValue' has a wrong offset!");

// Function CM_VideoTabWI.CM_VideoTabWI_C.UpdateAndSaveResolutionScale
// 0x0038 (0x0038 - 0x0000)
struct CM_VideoTabWI_C_UpdateAndSaveResolutionScale final
{
public:
	class Ubp_SpecialOptionsSave_C*               SpecialOptions;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_VideoTabWI_C_UpdateAndSaveResolutionScale) == 0x000008, "Wrong alignment on CM_VideoTabWI_C_UpdateAndSaveResolutionScale");
static_assert(sizeof(CM_VideoTabWI_C_UpdateAndSaveResolutionScale) == 0x000038, "Wrong size on CM_VideoTabWI_C_UpdateAndSaveResolutionScale");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveResolutionScale, SpecialOptions) == 0x000000, "Member 'CM_VideoTabWI_C_UpdateAndSaveResolutionScale::SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_VideoTabWI_C_UpdateAndSaveResolutionScale, CallFunc_Conv_FloatToString_ReturnValue) == 0x000008, "Member 'CM_VideoTabWI_C_UpdateAndSaveResolutionScale::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
