#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComboCustomizationTrophyWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComboCustomizationTrophyWI.ComboCustomizationTrophyWI_C
// 0x0118 (0x0378 - 0x0260)
class UComboCustomizationTrophyWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UButton*                                Button_Left;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Right;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelLocation;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_85;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_183;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ReturnButton;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Base;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Base;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Description;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnChanged;                                         // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         TrophyIndex;                                       // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrophyBaseBP_C*                        TrophyBase;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UFCTAchievement*>                TrophyAchievements;                                // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, class UFCTAchievement*>   TrophyAchievementStrings;                          // 0x02F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             UpdateTrophyActor;                                 // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FCloudTrophy>                   UnlockedTrophies;                                  // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnReturnFromTrophySelection;                       // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnChanged__DelegateSignature(class UStaticMesh* StaticMesh);
	void UpdateTrophyActor__DelegateSignature();
	void OnReturnFromTrophySelection__DelegateSignature();
	void ExecuteUbergraph_ComboCustomizationTrophyWI(int32 EntryPoint);
	void BndEvt__ReturnButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void OnSetWorldPosition();
	void Update_Position();
	void Construct();
	void BndEvt__Button_Right_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_Left_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_Right_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Left_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void GetTrophyDTRowFromIndex(int32 Index_0, class UFCTAchievement** Achievement, bool* NotFound, struct FTrophyStruct* Out_Row);
	void Initialize_From_Record(TArray<struct FCloudTrophy>& TrophyList);
	void DisplayNextTrophy(const struct FCloudTrophy& Trophy);
	void Get_Current_Trophy(int32 TrophyIndex_0, struct FCloudTrophy* OutTrophy);
	void SetCurrentTrophyUI(class ATrophyBaseBP_C* Trophy);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComboCustomizationTrophyWI_C">();
	}
	static class UComboCustomizationTrophyWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComboCustomizationTrophyWI_C>();
	}
};
static_assert(alignof(UComboCustomizationTrophyWI_C) == 0x000008, "Wrong alignment on UComboCustomizationTrophyWI_C");
static_assert(sizeof(UComboCustomizationTrophyWI_C) == 0x000378, "Wrong size on UComboCustomizationTrophyWI_C");
static_assert(offsetof(UComboCustomizationTrophyWI_C, UberGraphFrame) == 0x000260, "Member 'UComboCustomizationTrophyWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, Button_Left) == 0x000268, "Member 'UComboCustomizationTrophyWI_C::Button_Left' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, Button_Right) == 0x000270, "Member 'UComboCustomizationTrophyWI_C::Button_Right' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, CanvasPanelLocation) == 0x000278, "Member 'UComboCustomizationTrophyWI_C::CanvasPanelLocation' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, Image) == 0x000280, "Member 'UComboCustomizationTrophyWI_C::Image' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, Image_1) == 0x000288, "Member 'UComboCustomizationTrophyWI_C::Image_1' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, Image_2) == 0x000290, "Member 'UComboCustomizationTrophyWI_C::Image_2' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, Image_85) == 0x000298, "Member 'UComboCustomizationTrophyWI_C::Image_85' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, Image_183) == 0x0002A0, "Member 'UComboCustomizationTrophyWI_C::Image_183' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, ReturnButton) == 0x0002A8, "Member 'UComboCustomizationTrophyWI_C::ReturnButton' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, SizeBox_Base) == 0x0002B0, "Member 'UComboCustomizationTrophyWI_C::SizeBox_Base' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, TextBlock_Base) == 0x0002B8, "Member 'UComboCustomizationTrophyWI_C::TextBlock_Base' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, TextBlock_Description) == 0x0002C0, "Member 'UComboCustomizationTrophyWI_C::TextBlock_Description' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, OnChanged) == 0x0002C8, "Member 'UComboCustomizationTrophyWI_C::OnChanged' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, TrophyIndex) == 0x0002D8, "Member 'UComboCustomizationTrophyWI_C::TrophyIndex' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, TrophyBase) == 0x0002E0, "Member 'UComboCustomizationTrophyWI_C::TrophyBase' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, TrophyAchievements) == 0x0002E8, "Member 'UComboCustomizationTrophyWI_C::TrophyAchievements' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, TrophyAchievementStrings) == 0x0002F8, "Member 'UComboCustomizationTrophyWI_C::TrophyAchievementStrings' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, UpdateTrophyActor) == 0x000348, "Member 'UComboCustomizationTrophyWI_C::UpdateTrophyActor' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, UnlockedTrophies) == 0x000358, "Member 'UComboCustomizationTrophyWI_C::UnlockedTrophies' has a wrong offset!");
static_assert(offsetof(UComboCustomizationTrophyWI_C, OnReturnFromTrophySelection) == 0x000368, "Member 'UComboCustomizationTrophyWI_C::OnReturnFromTrophySelection' has a wrong offset!");

}

