#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfirmationPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConfirmationPopup.ConfirmationPopup_C
// 0x00C8 (0x0348 - 0x0280)
class UConfirmationPopup_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UButton*                                AcceptButton;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AcceptButton_Text;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              AcceptClickable;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DeclineButton;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DeclineButton_Text;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              DeclineClickable;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_210;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LargeBackground;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Linebottom;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Linetop;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Accept;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Cancel;                                            // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   AcceptText;                                        // 0x0310(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   DeclineText;                                       // 0x0328(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          AutomaticallyClose;                                // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void Accept__DelegateSignature();
	void Cancel__DelegateSignature();
	void ExecuteUbergraph_ConfirmationPopup(int32 EntryPoint);
	void BndEvt__ConfirmationPopup_AcceptClickable_K2Node_ComponentBoundEvent_3_OnButtonState__DelegateSignature();
	void BndEvt__ConfirmationPopup_DeclineClickable_K2Node_ComponentBoundEvent_2_OnButtonState__DelegateSignature();
	void Cancel_It();
	void Destruct();
	void Remove_Confirm();
	void BndEvt__DeclineButton_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__AcceptButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void SetAcceptText();
	void SetDeclineText();
	void RemoveOtherConfirmationPrompts();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ConfirmationPopup_C">();
	}
	static class UConfirmationPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfirmationPopup_C>();
	}
};
static_assert(alignof(UConfirmationPopup_C) == 0x000008, "Wrong alignment on UConfirmationPopup_C");
static_assert(sizeof(UConfirmationPopup_C) == 0x000348, "Wrong size on UConfirmationPopup_C");
static_assert(offsetof(UConfirmationPopup_C, UberGraphFrame) == 0x000280, "Member 'UConfirmationPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, AcceptButton) == 0x000288, "Member 'UConfirmationPopup_C::AcceptButton' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, AcceptButton_Text) == 0x000290, "Member 'UConfirmationPopup_C::AcceptButton_Text' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, AcceptClickable) == 0x000298, "Member 'UConfirmationPopup_C::AcceptClickable' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, Background) == 0x0002A0, "Member 'UConfirmationPopup_C::Background' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, Button_0) == 0x0002A8, "Member 'UConfirmationPopup_C::Button_0' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, Button_1) == 0x0002B0, "Member 'UConfirmationPopup_C::Button_1' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, DeclineButton) == 0x0002B8, "Member 'UConfirmationPopup_C::DeclineButton' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, DeclineButton_Text) == 0x0002C0, "Member 'UConfirmationPopup_C::DeclineButton_Text' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, DeclineClickable) == 0x0002C8, "Member 'UConfirmationPopup_C::DeclineClickable' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, Image_210) == 0x0002D0, "Member 'UConfirmationPopup_C::Image_210' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, LargeBackground) == 0x0002D8, "Member 'UConfirmationPopup_C::LargeBackground' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, Linebottom) == 0x0002E0, "Member 'UConfirmationPopup_C::Linebottom' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, Linetop) == 0x0002E8, "Member 'UConfirmationPopup_C::Linetop' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, Accept) == 0x0002F0, "Member 'UConfirmationPopup_C::Accept' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, Cancel) == 0x000300, "Member 'UConfirmationPopup_C::Cancel' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, AcceptText) == 0x000310, "Member 'UConfirmationPopup_C::AcceptText' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, DeclineText) == 0x000328, "Member 'UConfirmationPopup_C::DeclineText' has a wrong offset!");
static_assert(offsetof(UConfirmationPopup_C, AutomaticallyClose) == 0x000340, "Member 'UConfirmationPopup_C::AutomaticallyClose' has a wrong offset!");

}

