#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConsoleIconMainMenuWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConsoleIconMainMenuWI.ConsoleIconMainMenuWI_C
// 0x0020 (0x02D0 - 0x02B0)
class UConsoleIconMainMenuWI_C final : public UControllerIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UConsoleIconWI_C*                       ConsoleIconWI;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Holdable;                                          // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowHoldableText;                                  // 0x02C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ConsoleIconMainMenuWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ResetDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ConsoleIconMainMenuWI_C">();
	}
	static class UConsoleIconMainMenuWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConsoleIconMainMenuWI_C>();
	}
};
static_assert(alignof(UConsoleIconMainMenuWI_C) == 0x000008, "Wrong alignment on UConsoleIconMainMenuWI_C");
static_assert(sizeof(UConsoleIconMainMenuWI_C) == 0x0002D0, "Wrong size on UConsoleIconMainMenuWI_C");
static_assert(offsetof(UConsoleIconMainMenuWI_C, UberGraphFrame) == 0x0002B0, "Member 'UConsoleIconMainMenuWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UConsoleIconMainMenuWI_C, ConsoleIconWI) == 0x0002B8, "Member 'UConsoleIconMainMenuWI_C::ConsoleIconWI' has a wrong offset!");
static_assert(offsetof(UConsoleIconMainMenuWI_C, IconTexture) == 0x0002C0, "Member 'UConsoleIconMainMenuWI_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UConsoleIconMainMenuWI_C, Holdable) == 0x0002C8, "Member 'UConsoleIconMainMenuWI_C::Holdable' has a wrong offset!");
static_assert(offsetof(UConsoleIconMainMenuWI_C, ShowHoldableText) == 0x0002C9, "Member 'UConsoleIconMainMenuWI_C::ShowHoldableText' has a wrong offset!");

}

