#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoopActorSCT

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CoopActorSCT.CoopActorSCT_C.ExecuteUbergraph_CoopActorSCT
// 0x0278 (0x0278 - 0x0000)
struct CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACharacterSCTBP_C* PressingCharacter)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOxygenGeneratorBP_C*                   K2Node_DynamicCast_AsOxygen_Generator_BP;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOxygenGeneratorBP_C*                   K2Node_DynamicCast_AsOxygen_Generator_BP_1;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_Character_3;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_Character_2;                    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x00E0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_PressingCharacter_1;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_Character_1;                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_Character;                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_ReleasingCharacter_1;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_ReleasingCharacter;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMoreThanOnePresser_Output_Get;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_PressingCharacter;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACharacterSCTBP_C* ReleasingCharacter)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACharacterSCTBP_C* ReleasingCharacter)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_2;           // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_3;           // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_167[0x1];                                      // 0x0167(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Interactable_C>     K2Node_DynamicCast_AsI_Interactable;               // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubpc_ac_Opener_C*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InteractPressed_Success;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_3;            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACharacterSCTBP_C* PressingCharacter)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOxygenGeneratorBP_C*                   K2Node_DynamicCast_AsOxygen_Generator_BP_2;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x01C8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEscapePodSCT_C*                        K2Node_DynamicCast_AsEscape_Pod_SCT;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0204(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_Array_Get_Item_5;                         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0230(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_Array_Get_Item_6;                         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0270(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT) == 0x000008, "Wrong alignment on CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT");
static_assert(sizeof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT) == 0x000278, "Wrong size on CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, EntryPoint) == 0x000000, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::EntryPoint' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_delegate_Variable) == 0x000004, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_struct_Variable) == 0x000018, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_delegate_Variable_1) == 0x00002C, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_struct_Variable_1) == 0x000040, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_bool_IsClosed_Variable) == 0x000051, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_bool_Has_Been_Initd_Variable) == 0x000068, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_int_Array_Index_Variable) == 0x000070, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_bool_IsClosed_Variable_1) == 0x000074, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_bool_Has_Been_Initd_Variable_1) == 0x000075, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue_2) == 0x00007C, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_HasAuthority_ReturnValue) == 0x000084, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_int_Loop_Counter_Variable_2) == 0x000088, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Add_IntInt_ReturnValue_2) == 0x00008C, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_int_Array_Index_Variable_1) == 0x000090, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue_3) == 0x000094, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_PostAkEvent_ReturnValue) == 0x000098, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_bool_IsClosed_Variable_2) == 0x00009C, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue_4) == 0x00009D, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_bool_Has_Been_Initd_Variable_2) == 0x00009E, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_DynamicCast_AsOxygen_Generator_BP) == 0x0000B0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_DynamicCast_AsOxygen_Generator_BP' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_DynamicCast_AsOxygen_Generator_BP_1) == 0x0000C0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_DynamicCast_AsOxygen_Generator_BP_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue_5) == 0x0000C9, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CustomEvent_Character_3) == 0x0000D0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CustomEvent_Character_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CustomEvent_Character_2) == 0x0000D8, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CustomEvent_Character_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_delegate_Variable_2) == 0x0000E0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_HasAuthority_ReturnValue_1) == 0x0000F0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CustomEvent_PressingCharacter_1) == 0x0000F8, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CustomEvent_PressingCharacter_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_AddUnique_ReturnValue) == 0x000100, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000104, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CustomEvent_Character_1) == 0x000108, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CustomEvent_Character) == 0x000110, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CustomEvent_ReleasingCharacter_1) == 0x000118, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CustomEvent_ReleasingCharacter_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CustomEvent_ReleasingCharacter) == 0x000120, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CustomEvent_ReleasingCharacter' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_GetMoreThanOnePresser_Output_Get) == 0x000128, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_GetMoreThanOnePresser_Output_Get' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_RemoveItem_ReturnValue) == 0x000129, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x00012A, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CustomEvent_PressingCharacter) == 0x000130, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CustomEvent_PressingCharacter' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue_6) == 0x000138, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_HasAuthority_ReturnValue_2) == 0x000139, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CreateDelegate_OutputDelegate_1) == 0x00013C, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_HasAuthority_ReturnValue_3) == 0x00014C, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CreateDelegate_OutputDelegate_2) == 0x000150, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Less_IntInt_ReturnValue) == 0x000164, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_RemoveItem_ReturnValue_2) == 0x000165, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_RemoveItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_RemoveItem_ReturnValue_3) == 0x000166, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_RemoveItem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_int_Array_Index_Variable_2) == 0x000168, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_AddUnique_ReturnValue_2) == 0x00016C, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_AddUnique_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Get_Item_2) == 0x000170, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_DynamicCast_AsI_Interactable) == 0x000178, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_DynamicCast_AsI_Interactable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_DynamicCast_bSuccess_2) == 0x000188, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_GetComponentByClass_ReturnValue) == 0x000190, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_InteractPressed_Success) == 0x000198, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_InteractPressed_Success' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue_7) == 0x000199, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_AddUnique_ReturnValue_3) == 0x00019C, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_AddUnique_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001A0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Get_Item_3) == 0x0001B0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_DynamicCast_AsOxygen_Generator_BP_2) == 0x0001B8, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_DynamicCast_AsOxygen_Generator_BP_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_DynamicCast_bSuccess_3) == 0x0001C0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_struct_Variable_2) == 0x0001C8, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001D8, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Length_ReturnValue_1) == 0x0001DC, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001E0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Get_Item_4) == 0x0001E8, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue_8) == 0x0001F0, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_DynamicCast_AsEscape_Pod_SCT) == 0x0001F8, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_DynamicCast_AsEscape_Pod_SCT' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_DynamicCast_bSuccess_4) == 0x000200, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_delegate_Variable_3) == 0x000204, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_HasAuthority_ReturnValue_4) == 0x000214, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Get_Item_5) == 0x000218, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Length_ReturnValue_2) == 0x000220, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Less_IntInt_ReturnValue_1) == 0x000224, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_PostAkEvent_ReturnValue_2) == 0x000228, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, Temp_struct_Variable_3) == 0x000230, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_PostAkEvent_ReturnValue_3) == 0x000240, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Get_Item_6) == 0x000248, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Array_Length_ReturnValue_3) == 0x000250, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_Less_IntInt_ReturnValue_2) == 0x000254, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue_9) == 0x000255, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, K2Node_CreateDelegate_OutputDelegate_4) == 0x000258, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_IsValid_ReturnValue_10) == 0x000268, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000270, "Member 'CoopActorSCT_C_ExecuteUbergraph_CoopActorSCT::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function CoopActorSCT.CoopActorSCT_C.Proxy_Pressed 2
// 0x0008 (0x0008 - 0x0000)
struct CoopActorSCT_C_Proxy_Pressed_2 final
{
public:
	class ACharacterSCTBP_C*                      PressingCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopActorSCT_C_Proxy_Pressed_2) == 0x000008, "Wrong alignment on CoopActorSCT_C_Proxy_Pressed_2");
static_assert(sizeof(CoopActorSCT_C_Proxy_Pressed_2) == 0x000008, "Wrong size on CoopActorSCT_C_Proxy_Pressed_2");
static_assert(offsetof(CoopActorSCT_C_Proxy_Pressed_2, PressingCharacter) == 0x000000, "Member 'CoopActorSCT_C_Proxy_Pressed_2::PressingCharacter' has a wrong offset!");

// Function CoopActorSCT.CoopActorSCT_C.Proxy_Released 2
// 0x0008 (0x0008 - 0x0000)
struct CoopActorSCT_C_Proxy_Released_2 final
{
public:
	class ACharacterSCTBP_C*                      ReleasingCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopActorSCT_C_Proxy_Released_2) == 0x000008, "Wrong alignment on CoopActorSCT_C_Proxy_Released_2");
static_assert(sizeof(CoopActorSCT_C_Proxy_Released_2) == 0x000008, "Wrong size on CoopActorSCT_C_Proxy_Released_2");
static_assert(offsetof(CoopActorSCT_C_Proxy_Released_2, ReleasingCharacter) == 0x000000, "Member 'CoopActorSCT_C_Proxy_Released_2::ReleasingCharacter' has a wrong offset!");

// Function CoopActorSCT.CoopActorSCT_C.Proxy_Released 1
// 0x0008 (0x0008 - 0x0000)
struct CoopActorSCT_C_Proxy_Released_1 final
{
public:
	class ACharacterSCTBP_C*                      ReleasingCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopActorSCT_C_Proxy_Released_1) == 0x000008, "Wrong alignment on CoopActorSCT_C_Proxy_Released_1");
static_assert(sizeof(CoopActorSCT_C_Proxy_Released_1) == 0x000008, "Wrong size on CoopActorSCT_C_Proxy_Released_1");
static_assert(offsetof(CoopActorSCT_C_Proxy_Released_1, ReleasingCharacter) == 0x000000, "Member 'CoopActorSCT_C_Proxy_Released_1::ReleasingCharacter' has a wrong offset!");

// Function CoopActorSCT.CoopActorSCT_C.Released 2
// 0x0008 (0x0008 - 0x0000)
struct CoopActorSCT_C_Released_2 final
{
public:
	class ACharacterSCTBP_C*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopActorSCT_C_Released_2) == 0x000008, "Wrong alignment on CoopActorSCT_C_Released_2");
static_assert(sizeof(CoopActorSCT_C_Released_2) == 0x000008, "Wrong size on CoopActorSCT_C_Released_2");
static_assert(offsetof(CoopActorSCT_C_Released_2, Character) == 0x000000, "Member 'CoopActorSCT_C_Released_2::Character' has a wrong offset!");

// Function CoopActorSCT.CoopActorSCT_C.Released 1
// 0x0008 (0x0008 - 0x0000)
struct CoopActorSCT_C_Released_1 final
{
public:
	class ACharacterSCTBP_C*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopActorSCT_C_Released_1) == 0x000008, "Wrong alignment on CoopActorSCT_C_Released_1");
static_assert(sizeof(CoopActorSCT_C_Released_1) == 0x000008, "Wrong size on CoopActorSCT_C_Released_1");
static_assert(offsetof(CoopActorSCT_C_Released_1, Character) == 0x000000, "Member 'CoopActorSCT_C_Released_1::Character' has a wrong offset!");

// Function CoopActorSCT.CoopActorSCT_C.Proxy_Pressed 1
// 0x0008 (0x0008 - 0x0000)
struct CoopActorSCT_C_Proxy_Pressed_1 final
{
public:
	class ACharacterSCTBP_C*                      PressingCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopActorSCT_C_Proxy_Pressed_1) == 0x000008, "Wrong alignment on CoopActorSCT_C_Proxy_Pressed_1");
static_assert(sizeof(CoopActorSCT_C_Proxy_Pressed_1) == 0x000008, "Wrong size on CoopActorSCT_C_Proxy_Pressed_1");
static_assert(offsetof(CoopActorSCT_C_Proxy_Pressed_1, PressingCharacter) == 0x000000, "Member 'CoopActorSCT_C_Proxy_Pressed_1::PressingCharacter' has a wrong offset!");

// Function CoopActorSCT.CoopActorSCT_C.Pressed 2
// 0x0008 (0x0008 - 0x0000)
struct CoopActorSCT_C_Pressed_2 final
{
public:
	class ACharacterSCTBP_C*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopActorSCT_C_Pressed_2) == 0x000008, "Wrong alignment on CoopActorSCT_C_Pressed_2");
static_assert(sizeof(CoopActorSCT_C_Pressed_2) == 0x000008, "Wrong size on CoopActorSCT_C_Pressed_2");
static_assert(offsetof(CoopActorSCT_C_Pressed_2, Character) == 0x000000, "Member 'CoopActorSCT_C_Pressed_2::Character' has a wrong offset!");

// Function CoopActorSCT.CoopActorSCT_C.Pressed 1
// 0x0008 (0x0008 - 0x0000)
struct CoopActorSCT_C_Pressed_1 final
{
public:
	class ACharacterSCTBP_C*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopActorSCT_C_Pressed_1) == 0x000008, "Wrong alignment on CoopActorSCT_C_Pressed_1");
static_assert(sizeof(CoopActorSCT_C_Pressed_1) == 0x000008, "Wrong size on CoopActorSCT_C_Pressed_1");
static_assert(offsetof(CoopActorSCT_C_Pressed_1, Character) == 0x000000, "Member 'CoopActorSCT_C_Pressed_1::Character' has a wrong offset!");

// Function CoopActorSCT.CoopActorSCT_C.OnRep_Completed
// 0x0038 (0x0038 - 0x0000)
struct CoopActorSCT_C_OnRep_Completed final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Abp_ac_BaseDoor_C*                      K2Node_DynamicCast_AsBp_Ac_Base_Door;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CoopActorSCT_C_OnRep_Completed) == 0x000008, "Wrong alignment on CoopActorSCT_C_OnRep_Completed");
static_assert(sizeof(CoopActorSCT_C_OnRep_Completed) == 0x000038, "Wrong size on CoopActorSCT_C_OnRep_Completed");
static_assert(offsetof(CoopActorSCT_C_OnRep_Completed, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CoopActorSCT_C_OnRep_Completed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_OnRep_Completed, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CoopActorSCT_C_OnRep_Completed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_OnRep_Completed, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CoopActorSCT_C_OnRep_Completed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_OnRep_Completed, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CoopActorSCT_C_OnRep_Completed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_OnRep_Completed, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'CoopActorSCT_C_OnRep_Completed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_OnRep_Completed, CallFunc_Array_Get_Item) == 0x000018, "Member 'CoopActorSCT_C_OnRep_Completed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_OnRep_Completed, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'CoopActorSCT_C_OnRep_Completed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_OnRep_Completed, K2Node_DynamicCast_AsBp_Ac_Base_Door) == 0x000028, "Member 'CoopActorSCT_C_OnRep_Completed::K2Node_DynamicCast_AsBp_Ac_Base_Door' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_OnRep_Completed, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CoopActorSCT_C_OnRep_Completed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_OnRep_Completed, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'CoopActorSCT_C_OnRep_Completed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function CoopActorSCT.CoopActorSCT_C.ActivateActors
// 0x0068 (0x0068 - 0x0000)
struct CoopActorSCT_C_ActivateActors final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Abp_ac_BaseDoor_C*                      K2Node_DynamicCast_AsBp_Ac_Base_Door;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Interactable_C>     K2Node_DynamicCast_AsI_Interactable;               // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InteractPressed_Success;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubpc_ac_Opener_C*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopActorSCT_C_ActivateActors) == 0x000008, "Wrong alignment on CoopActorSCT_C_ActivateActors");
static_assert(sizeof(CoopActorSCT_C_ActivateActors) == 0x000068, "Wrong size on CoopActorSCT_C_ActivateActors");
static_assert(offsetof(CoopActorSCT_C_ActivateActors, Temp_int_Array_Index_Variable) == 0x000000, "Member 'CoopActorSCT_C_ActivateActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ActivateActors, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CoopActorSCT_C_ActivateActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ActivateActors, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CoopActorSCT_C_ActivateActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ActivateActors, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'CoopActorSCT_C_ActivateActors::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ActivateActors, CallFunc_Array_Get_Item) == 0x000010, "Member 'CoopActorSCT_C_ActivateActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ActivateActors, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'CoopActorSCT_C_ActivateActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ActivateActors, K2Node_DynamicCast_AsBp_Ac_Base_Door) == 0x000020, "Member 'CoopActorSCT_C_ActivateActors::K2Node_DynamicCast_AsBp_Ac_Base_Door' has a wrong offset!");
static_assert(offsetof(CoopActorSCT_C_ActivateActors, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CoopActorSCT_C_ActivateActors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
