#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CountdownWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CountdownWI.CountdownWI_C
// 0x0028 (0x0288 - 0x0260)
class UCountdownWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Fade;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CountdownText;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DescriptorText;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Counter;                                           // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CountdownWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void StopCountdown();
	void BeginCountdown(int32 Time, const class FString& Descriptor);
	void CountdownUpdate();
	void FadeFunction(bool In);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CountdownWI_C">();
	}
	static class UCountdownWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCountdownWI_C>();
	}
};
static_assert(alignof(UCountdownWI_C) == 0x000008, "Wrong alignment on UCountdownWI_C");
static_assert(sizeof(UCountdownWI_C) == 0x000288, "Wrong size on UCountdownWI_C");
static_assert(offsetof(UCountdownWI_C, UberGraphFrame) == 0x000260, "Member 'UCountdownWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCountdownWI_C, Fade) == 0x000268, "Member 'UCountdownWI_C::Fade' has a wrong offset!");
static_assert(offsetof(UCountdownWI_C, CountdownText) == 0x000270, "Member 'UCountdownWI_C::CountdownText' has a wrong offset!");
static_assert(offsetof(UCountdownWI_C, DescriptorText) == 0x000278, "Member 'UCountdownWI_C::DescriptorText' has a wrong offset!");
static_assert(offsetof(UCountdownWI_C, Counter) == 0x000280, "Member 'UCountdownWI_C::Counter' has a wrong offset!");

}

