#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyEvent_ProgressbarWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EmergencyEvent_ProgressbarWI.EmergencyEvent_ProgressbarWI_C
// 0x00A8 (0x0328 - 0x0280)
class UEmergencyEvent_ProgressbarWI_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       UpdateParticipants;                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Complete;                                          // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ActionText;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AmountText;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Container;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxParticipants;                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Line;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           InteractProgressBar;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          InProgress;                                        // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeStart;                                         // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CompleteTextColor;                                 // 0x02E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                WorldLocation;                                     // 0x0310(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWi_OffScreenIndicator_EmergencyEvent_C* OffscreenIndicator;                                // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EmergencyEvent_ProgressbarWI(int32 EntryPoint);
	void Construct();
	void Set_Color_And_Text(const struct FSlateColor& InColorAndOpacity, const struct FLinearColor& InColor, const class FText& InText);
	void Set_Participants(int32 Amount);
	void Show_Off_Screen_Indicator();
	void Complete_Cosmetics();
	void Set_Percentage(float InPercent);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmergencyEvent_ProgressbarWI_C">();
	}
	static class UEmergencyEvent_ProgressbarWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmergencyEvent_ProgressbarWI_C>();
	}
};
static_assert(alignof(UEmergencyEvent_ProgressbarWI_C) == 0x000008, "Wrong alignment on UEmergencyEvent_ProgressbarWI_C");
static_assert(sizeof(UEmergencyEvent_ProgressbarWI_C) == 0x000328, "Wrong size on UEmergencyEvent_ProgressbarWI_C");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, UberGraphFrame) == 0x000280, "Member 'UEmergencyEvent_ProgressbarWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, UpdateParticipants) == 0x000288, "Member 'UEmergencyEvent_ProgressbarWI_C::UpdateParticipants' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, Complete) == 0x000290, "Member 'UEmergencyEvent_ProgressbarWI_C::Complete' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, FadeIn) == 0x000298, "Member 'UEmergencyEvent_ProgressbarWI_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, ActionText) == 0x0002A0, "Member 'UEmergencyEvent_ProgressbarWI_C::ActionText' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, AmountText) == 0x0002A8, "Member 'UEmergencyEvent_ProgressbarWI_C::AmountText' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, BackgroundImage) == 0x0002B0, "Member 'UEmergencyEvent_ProgressbarWI_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, Container) == 0x0002B8, "Member 'UEmergencyEvent_ProgressbarWI_C::Container' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, HorizontalBoxParticipants) == 0x0002C0, "Member 'UEmergencyEvent_ProgressbarWI_C::HorizontalBoxParticipants' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, Img_Line) == 0x0002C8, "Member 'UEmergencyEvent_ProgressbarWI_C::Img_Line' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, InteractProgressBar) == 0x0002D0, "Member 'UEmergencyEvent_ProgressbarWI_C::InteractProgressBar' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, InProgress) == 0x0002D8, "Member 'UEmergencyEvent_ProgressbarWI_C::InProgress' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, TimeStart) == 0x0002DC, "Member 'UEmergencyEvent_ProgressbarWI_C::TimeStart' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, Duration) == 0x0002E0, "Member 'UEmergencyEvent_ProgressbarWI_C::Duration' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, CompleteTextColor) == 0x0002E8, "Member 'UEmergencyEvent_ProgressbarWI_C::CompleteTextColor' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, WorldLocation) == 0x000310, "Member 'UEmergencyEvent_ProgressbarWI_C::WorldLocation' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_ProgressbarWI_C, OffscreenIndicator) == 0x000320, "Member 'UEmergencyEvent_ProgressbarWI_C::OffscreenIndicator' has a wrong offset!");

}

