#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyMeetingWI

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.ExecuteUbergraph_EmergencyMeetingWI
// 0x0290 (0x0290 - 0x0000)
struct EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0070(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0080(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0090(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	TArray<class UEmergencyEliminationVoteWI_C*>  CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UEmergencyEliminationVoteWI_C*          CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmergencyMeetingComponent_C*           CallFunc_GetEmergencyMeetingComponent_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_TrustYes;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x00E4(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	class UVoteGivenWI_C*                         CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_VoteFrom;                       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_VoteFor;                        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_Vote;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyMeetingComponent_C*           CallFunc_GetEmergencyMeetingComponent_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyEliminationVoteWI_C*          K2Node_DynamicCast_AsEmergency_Elimination_Vote_WI; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Time;                           // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Immediately;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x016C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_4;                            // 0x0180(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x0190(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_5;                            // 0x01A0(0x0010)(ConstParm, ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6;                          // 0x01C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_6;                            // 0x01D8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_7;                          // 0x01EC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_7;                            // 0x0200(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable_2;                               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_1; // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_2; // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_3; // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue_1;      // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue_2;      // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_4; // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_5; // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue_3;      // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue_4;      // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_2;            // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_1;            // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked;              // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283[0x1];                                      // 0x0283(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI) == 0x000008, "Wrong alignment on EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI");
static_assert(sizeof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI) == 0x000290, "Wrong size on EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, EntryPoint) == 0x000000, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_int_Variable) == 0x000020, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_delegate_Variable) == 0x000028, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_struct_Variable) == 0x000048, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_bool_IsClosed_Variable) == 0x000058, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_bool_Has_Been_Initd_Variable) == 0x000059, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_int_Variable_1) == 0x000060, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_BooleanAND_ReturnValue) == 0x000065, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000066, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_delegate_Variable_1) == 0x000070, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_struct_Variable_1) == 0x000080, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_delegate_Variable_2) == 0x000090, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_Event_IsDesignTime) == 0x0000A0, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_struct_Variable_2) == 0x0000A8, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0000B8, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Array_Length_ReturnValue_1) == 0x0000D0, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D4, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_GetEmergencyMeetingComponent_ReturnValue) == 0x0000D8, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_GetEmergencyMeetingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_CustomEvent_TrustYes) == 0x0000E0, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_CustomEvent_TrustYes' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_delegate_Variable_3) == 0x0000E4, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_struct_Variable_3) == 0x0000F8, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_CustomEvent_VoteFrom) == 0x000110, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_CustomEvent_VoteFrom' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_CustomEvent_VoteFor) == 0x000118, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_CustomEvent_VoteFor' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_IsValid_ReturnValue_1) == 0x000121, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_CustomEvent_Vote) == 0x000128, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_CustomEvent_Vote' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_GetEmergencyMeetingComponent_ReturnValue_1) == 0x000130, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_GetEmergencyMeetingComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000138, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_int_Array_Index_Variable) == 0x000140, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Array_Get_Item_2) == 0x000148, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_DynamicCast_AsEmergency_Elimination_Vote_WI) == 0x000150, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_DynamicCast_AsEmergency_Elimination_Vote_WI' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000159, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_CustomEvent_Time) == 0x00015C, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_K2_SetTimer_ReturnValue) == 0x000160, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_CustomEvent_Immediately) == 0x000168, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_CustomEvent_Immediately' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_delegate_Variable_4) == 0x00016C, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_struct_Variable_4) == 0x000180, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_delegate_Variable_5) == 0x000190, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_struct_Variable_5) == 0x0001A0, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_PlayAnimationForward_ReturnValue) == 0x0001B0, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0001B8, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_delegate_Variable_6) == 0x0001C0, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001D0, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_GetRenderOpacity_ReturnValue) == 0x0001D4, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_struct_Variable_6) == 0x0001D8, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x0001E8, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_delegate_Variable_7) == 0x0001EC, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_delegate_Variable_7' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_struct_Variable_7) == 0x000200, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, Temp_int_Variable_2) == 0x000210, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000218, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_PostAkEvent_ReturnValue) == 0x000220, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_PostAkEvent_ReturnValue_1) == 0x000224, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue_1) == 0x000228, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_PostAkEvent_ReturnValue_2) == 0x000230, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000234, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue_2) == 0x000238, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue_3) == 0x000240, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_PostAssociatedAkEvent_ReturnValue_1) == 0x000248, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_PostAssociatedAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_PostAssociatedAkEvent_ReturnValue_2) == 0x00024C, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_PostAssociatedAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue_4) == 0x000250, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue_5) == 0x000258, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_PostAssociatedAkEvent_ReturnValue_3) == 0x000260, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_PostAssociatedAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_PostAssociatedAkEvent_ReturnValue_4) == 0x000264, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_PostAssociatedAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000268, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000278, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_ComponentBoundEvent_IsChecked_2) == 0x000280, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_ComponentBoundEvent_IsChecked_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_ComponentBoundEvent_IsChecked_1) == 0x000281, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_ComponentBoundEvent_IsChecked_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, K2Node_ComponentBoundEvent_IsChecked) == 0x000282, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::K2Node_ComponentBoundEvent_IsChecked' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Array_Length_ReturnValue_2) == 0x000284, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI, CallFunc_Greater_IntInt_ReturnValue) == 0x000288, "Member 'EmergencyMeetingWI_C_ExecuteUbergraph_EmergencyMeetingWI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.BndEvt__TrystYes_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct EmergencyMeetingWI_C_BndEvt__TrystYes_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingWI_C_BndEvt__TrystYes_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on EmergencyMeetingWI_C_BndEvt__TrystYes_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(EmergencyMeetingWI_C_BndEvt__TrystYes_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on EmergencyMeetingWI_C_BndEvt__TrystYes_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(EmergencyMeetingWI_C_BndEvt__TrystYes_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'EmergencyMeetingWI_C_BndEvt__TrystYes_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.BndEvt__TrystNo_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct EmergencyMeetingWI_C_BndEvt__TrystNo_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingWI_C_BndEvt__TrystNo_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on EmergencyMeetingWI_C_BndEvt__TrystNo_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(EmergencyMeetingWI_C_BndEvt__TrystNo_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on EmergencyMeetingWI_C_BndEvt__TrystNo_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(EmergencyMeetingWI_C_BndEvt__TrystNo_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'EmergencyMeetingWI_C_BndEvt__TrystNo_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.BndEvt__GamepadCompatibleCheckbox_K2Node_ComponentBoundEvent_0_OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct EmergencyMeetingWI_C_BndEvt__GamepadCompatibleCheckbox_K2Node_ComponentBoundEvent_0_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingWI_C_BndEvt__GamepadCompatibleCheckbox_K2Node_ComponentBoundEvent_0_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on EmergencyMeetingWI_C_BndEvt__GamepadCompatibleCheckbox_K2Node_ComponentBoundEvent_0_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(EmergencyMeetingWI_C_BndEvt__GamepadCompatibleCheckbox_K2Node_ComponentBoundEvent_0_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on EmergencyMeetingWI_C_BndEvt__GamepadCompatibleCheckbox_K2Node_ComponentBoundEvent_0_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(EmergencyMeetingWI_C_BndEvt__GamepadCompatibleCheckbox_K2Node_ComponentBoundEvent_0_OnCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'EmergencyMeetingWI_C_BndEvt__GamepadCompatibleCheckbox_K2Node_ComponentBoundEvent_0_OnCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.EndCountdown
// 0x0001 (0x0001 - 0x0000)
struct EmergencyMeetingWI_C_EndCountdown final
{
public:
	bool                                          Immediately;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingWI_C_EndCountdown) == 0x000001, "Wrong alignment on EmergencyMeetingWI_C_EndCountdown");
static_assert(sizeof(EmergencyMeetingWI_C_EndCountdown) == 0x000001, "Wrong size on EmergencyMeetingWI_C_EndCountdown");
static_assert(offsetof(EmergencyMeetingWI_C_EndCountdown, Immediately) == 0x000000, "Member 'EmergencyMeetingWI_C_EndCountdown::Immediately' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.CreateCountdown
// 0x0004 (0x0004 - 0x0000)
struct EmergencyMeetingWI_C_CreateCountdown final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyMeetingWI_C_CreateCountdown) == 0x000004, "Wrong alignment on EmergencyMeetingWI_C_CreateCountdown");
static_assert(sizeof(EmergencyMeetingWI_C_CreateCountdown) == 0x000004, "Wrong size on EmergencyMeetingWI_C_CreateCountdown");
static_assert(offsetof(EmergencyMeetingWI_C_CreateCountdown, Time) == 0x000000, "Member 'EmergencyMeetingWI_C_CreateCountdown::Time' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.EliminationVoteFor
// 0x0008 (0x0008 - 0x0000)
struct EmergencyMeetingWI_C_EliminationVoteFor final
{
public:
	class ACharacter*                             Vote;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyMeetingWI_C_EliminationVoteFor) == 0x000008, "Wrong alignment on EmergencyMeetingWI_C_EliminationVoteFor");
static_assert(sizeof(EmergencyMeetingWI_C_EliminationVoteFor) == 0x000008, "Wrong size on EmergencyMeetingWI_C_EliminationVoteFor");
static_assert(offsetof(EmergencyMeetingWI_C_EliminationVoteFor, Vote) == 0x000000, "Member 'EmergencyMeetingWI_C_EliminationVoteFor::Vote' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.AddEliminationVote
// 0x0010 (0x0010 - 0x0000)
struct EmergencyMeetingWI_C_AddEliminationVote final
{
public:
	class ACharacter*                             VoteFrom;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             VoteFor;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyMeetingWI_C_AddEliminationVote) == 0x000008, "Wrong alignment on EmergencyMeetingWI_C_AddEliminationVote");
static_assert(sizeof(EmergencyMeetingWI_C_AddEliminationVote) == 0x000010, "Wrong size on EmergencyMeetingWI_C_AddEliminationVote");
static_assert(offsetof(EmergencyMeetingWI_C_AddEliminationVote, VoteFrom) == 0x000000, "Member 'EmergencyMeetingWI_C_AddEliminationVote::VoteFrom' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddEliminationVote, VoteFor) == 0x000008, "Member 'EmergencyMeetingWI_C_AddEliminationVote::VoteFor' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.AddTrustVote
// 0x0001 (0x0001 - 0x0000)
struct EmergencyMeetingWI_C_AddTrustVote final
{
public:
	bool                                          TrustYes;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingWI_C_AddTrustVote) == 0x000001, "Wrong alignment on EmergencyMeetingWI_C_AddTrustVote");
static_assert(sizeof(EmergencyMeetingWI_C_AddTrustVote) == 0x000001, "Wrong size on EmergencyMeetingWI_C_AddTrustVote");
static_assert(offsetof(EmergencyMeetingWI_C_AddTrustVote, TrustYes) == 0x000000, "Member 'EmergencyMeetingWI_C_AddTrustVote::TrustYes' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct EmergencyMeetingWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingWI_C_PreConstruct) == 0x000001, "Wrong alignment on EmergencyMeetingWI_C_PreConstruct");
static_assert(sizeof(EmergencyMeetingWI_C_PreConstruct) == 0x000001, "Wrong size on EmergencyMeetingWI_C_PreConstruct");
static_assert(offsetof(EmergencyMeetingWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'EmergencyMeetingWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.AddVoteTypeVoteCount
// 0x0020 (0x0020 - 0x0000)
struct EmergencyMeetingWI_C_AddVoteTypeVoteCount final
{
public:
	class UWrapBox*                               Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyVoteTrackerWI_C*              CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyMeetingWI_C_AddVoteTypeVoteCount) == 0x000008, "Wrong alignment on EmergencyMeetingWI_C_AddVoteTypeVoteCount");
static_assert(sizeof(EmergencyMeetingWI_C_AddVoteTypeVoteCount) == 0x000020, "Wrong size on EmergencyMeetingWI_C_AddVoteTypeVoteCount");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTypeVoteCount, Target) == 0x000000, "Member 'EmergencyMeetingWI_C_AddVoteTypeVoteCount::Target' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTypeVoteCount, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'EmergencyMeetingWI_C_AddVoteTypeVoteCount::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTypeVoteCount, CallFunc_Create_ReturnValue) == 0x000010, "Member 'EmergencyMeetingWI_C_AddVoteTypeVoteCount::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTypeVoteCount, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000018, "Member 'EmergencyMeetingWI_C_AddVoteTypeVoteCount::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.GetEmergencyMeetingComponent
// 0x0018 (0x0018 - 0x0000)
struct EmergencyMeetingWI_C_GetEmergencyMeetingComponent final
{
public:
	class UEmergencyMeetingComponent_C*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyMeetingComponent_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyMeetingWI_C_GetEmergencyMeetingComponent) == 0x000008, "Wrong alignment on EmergencyMeetingWI_C_GetEmergencyMeetingComponent");
static_assert(sizeof(EmergencyMeetingWI_C_GetEmergencyMeetingComponent) == 0x000018, "Wrong size on EmergencyMeetingWI_C_GetEmergencyMeetingComponent");
static_assert(offsetof(EmergencyMeetingWI_C_GetEmergencyMeetingComponent, ReturnValue) == 0x000000, "Member 'EmergencyMeetingWI_C_GetEmergencyMeetingComponent::ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_GetEmergencyMeetingComponent, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'EmergencyMeetingWI_C_GetEmergencyMeetingComponent::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_GetEmergencyMeetingComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'EmergencyMeetingWI_C_GetEmergencyMeetingComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.AddVoteTrackerEntry
// 0x0040 (0x0040 - 0x0000)
struct EmergencyMeetingWI_C_AddVoteTrackerEntry final
{
public:
	struct FVector2D                              InPadding;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVoteGivenWI_C*                         CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyMeetingWI_C_AddVoteTrackerEntry) == 0x000008, "Wrong alignment on EmergencyMeetingWI_C_AddVoteTrackerEntry");
static_assert(sizeof(EmergencyMeetingWI_C_AddVoteTrackerEntry) == 0x000040, "Wrong size on EmergencyMeetingWI_C_AddVoteTrackerEntry");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTrackerEntry, InPadding) == 0x000000, "Member 'EmergencyMeetingWI_C_AddVoteTrackerEntry::InPadding' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTrackerEntry, CallFunc_BreakVector2D_X) == 0x000008, "Member 'EmergencyMeetingWI_C_AddVoteTrackerEntry::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTrackerEntry, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'EmergencyMeetingWI_C_AddVoteTrackerEntry::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTrackerEntry, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'EmergencyMeetingWI_C_AddVoteTrackerEntry::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTrackerEntry, K2Node_MakeStruct_Margin) == 0x000018, "Member 'EmergencyMeetingWI_C_AddVoteTrackerEntry::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTrackerEntry, CallFunc_Create_ReturnValue) == 0x000028, "Member 'EmergencyMeetingWI_C_AddVoteTrackerEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTrackerEntry, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'EmergencyMeetingWI_C_AddVoteTrackerEntry::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_AddVoteTrackerEntry, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000038, "Member 'EmergencyMeetingWI_C_AddVoteTrackerEntry::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.CreateVoteTracker
// 0x0014 (0x0014 - 0x0000)
struct EmergencyMeetingWI_C_CreateVoteTracker final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingWI_C_CreateVoteTracker) == 0x000004, "Wrong alignment on EmergencyMeetingWI_C_CreateVoteTracker");
static_assert(sizeof(EmergencyMeetingWI_C_CreateVoteTracker) == 0x000014, "Wrong size on EmergencyMeetingWI_C_CreateVoteTracker");
static_assert(offsetof(EmergencyMeetingWI_C_CreateVoteTracker, Amount) == 0x000000, "Member 'EmergencyMeetingWI_C_CreateVoteTracker::Amount' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_CreateVoteTracker, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'EmergencyMeetingWI_C_CreateVoteTracker::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_CreateVoteTracker, Temp_int_Variable) == 0x000008, "Member 'EmergencyMeetingWI_C_CreateVoteTracker::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_CreateVoteTracker, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'EmergencyMeetingWI_C_CreateVoteTracker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingWI_C_CreateVoteTracker, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'EmergencyMeetingWI_C_CreateVoteTracker::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function EmergencyMeetingWI.EmergencyMeetingWI_C.UpdateCountdown
// 0x000C (0x000C - 0x0000)
struct EmergencyMeetingWI_C_UpdateCountdown final
{
public:
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
