#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyEvent_DeathTimerWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EmergencyEvent_DeathTimerWI.EmergencyEvent_DeathTimerWI_C
// 0x00A0 (0x0300 - 0x0260)
class UEmergencyEvent_DeathTimerWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Pulse;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Complete;                                          // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ActionText;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ActionText_1;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Container;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_318;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           InteractProgressBar;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          InProgress;                                        // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeStart;                                         // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CompleteTextColor;                                 // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                WorldLocation;                                     // 0x02E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWi_OffScreenIndicator_EmergencyEvent_C* OffscreenIndicator;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EmergencyEvent_DeathTimerWI(int32 EntryPoint);
	void Construct();
	void Complete_Cosmetics();
	void Set_Percentage(float InPercent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmergencyEvent_DeathTimerWI_C">();
	}
	static class UEmergencyEvent_DeathTimerWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmergencyEvent_DeathTimerWI_C>();
	}
};
static_assert(alignof(UEmergencyEvent_DeathTimerWI_C) == 0x000008, "Wrong alignment on UEmergencyEvent_DeathTimerWI_C");
static_assert(sizeof(UEmergencyEvent_DeathTimerWI_C) == 0x000300, "Wrong size on UEmergencyEvent_DeathTimerWI_C");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, UberGraphFrame) == 0x000260, "Member 'UEmergencyEvent_DeathTimerWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, Pulse) == 0x000268, "Member 'UEmergencyEvent_DeathTimerWI_C::Pulse' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, Complete) == 0x000270, "Member 'UEmergencyEvent_DeathTimerWI_C::Complete' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, FadeIn) == 0x000278, "Member 'UEmergencyEvent_DeathTimerWI_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, ActionText) == 0x000280, "Member 'UEmergencyEvent_DeathTimerWI_C::ActionText' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, ActionText_1) == 0x000288, "Member 'UEmergencyEvent_DeathTimerWI_C::ActionText_1' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, BackgroundImage) == 0x000290, "Member 'UEmergencyEvent_DeathTimerWI_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, Container) == 0x000298, "Member 'UEmergencyEvent_DeathTimerWI_C::Container' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, Image_318) == 0x0002A0, "Member 'UEmergencyEvent_DeathTimerWI_C::Image_318' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, InteractProgressBar) == 0x0002A8, "Member 'UEmergencyEvent_DeathTimerWI_C::InteractProgressBar' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, InProgress) == 0x0002B0, "Member 'UEmergencyEvent_DeathTimerWI_C::InProgress' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, TimeStart) == 0x0002B4, "Member 'UEmergencyEvent_DeathTimerWI_C::TimeStart' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, Duration) == 0x0002B8, "Member 'UEmergencyEvent_DeathTimerWI_C::Duration' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, CompleteTextColor) == 0x0002C0, "Member 'UEmergencyEvent_DeathTimerWI_C::CompleteTextColor' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, WorldLocation) == 0x0002E8, "Member 'UEmergencyEvent_DeathTimerWI_C::WorldLocation' has a wrong offset!");
static_assert(offsetof(UEmergencyEvent_DeathTimerWI_C, OffscreenIndicator) == 0x0002F8, "Member 'UEmergencyEvent_DeathTimerWI_C::OffscreenIndicator' has a wrong offset!");

}

