#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyMeetingWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"
#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EmergencyMeetingWI.EmergencyMeetingWI_C
// 0x0240 (0x04C0 - 0x0280)
class UEmergencyMeetingWI_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       FadeToResult;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroSequence;                                     // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeCountdown;                                     // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeEntireWidget;                                  // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackgroundMid;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CircleBG;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circleframe;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CountdownFrame;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CountdownNumber;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DeadText;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadCompatibleCheckbox_C*           EliminationSkipButton;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EliminationSkipFrame;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EliminationVoteBG;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EliminationVoteBottomLine;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         EliminationVotesContainer;                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EliminationVoteTopLine;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Explanation;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFocusHandlerWI_C*                      FocusHandlerWI;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              GeneralVoteBox;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_514;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1446;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1754;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MainSwitcher;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPassengerLogLottoV2WI_C*               PassengerLogLottoV2WI;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ResultText;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SkipContainer;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SkipElimText;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SkipVoteTracker;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Trust_No;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Trust_Yes;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TrustButtons;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TrustNoTracker;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TrustYesTracker;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadCompatibleCheckbox_C*           TrystNo;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadCompatibleCheckbox_C*           TrystYes;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         VotesGiven;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AEmergencyMeetingSCTBP_C*               EmergencyMeetingActor;                             // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVoteGivenWI_C*>                 VoteTrackerVotes;                                  // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         VoteTrackerCount;                                  // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Countdown;                                         // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionDuration;                                // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionFadeDuration;                            // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableAllInteraction;                             // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacter*>                     CharactersOnEliminationVote;                       // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UAkComponent*                           Ak;                                                // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreventAudioCountdown;                             // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ColorTrustYes;                                     // 0x0404(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorTrustNo;                                      // 0x0414(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacter*>                     LottoEntries;                                      // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         LottoTarget;                                       // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LottoSeed;                                         // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPassengerLogInformation               TargetInfo;                                        // 0x0440(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TrustHoveredColor;                                 // 0x0468(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TrustUnhoveredColor;                               // 0x0490(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DidNotTrust;                                       // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Trusted;                                           // 0x04B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_EmergencyMeetingWI(int32 EntryPoint);
	void Yes_Trust_Set_Color();
	void No_Trust_Set_Color();
	void BndEvt__TrystYes_K2Node_ComponentBoundEvent_6_OnUnhovered__DelegateSignature();
	void BndEvt__TrystYes_K2Node_ComponentBoundEvent_5_OnHovered__DelegateSignature();
	void BndEvt__TrystNo_K2Node_ComponentBoundEvent_4_OnUnhovered__DelegateSignature();
	void BndEvt__TrystNo_K2Node_ComponentBoundEvent_3_OnHovered__DelegateSignature();
	void PassengerLogFinished();
	void TrustAnimFinished();
	void IntroAnimFinished();
	void BndEvt__TrystYes_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature(bool IsChecked);
	void BndEvt__TrystNo_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature(bool IsChecked);
	void BndEvt__GamepadCompatibleCheckbox_K2Node_ComponentBoundEvent_0_OnCheckStateChanged__DelegateSignature(bool IsChecked);
	void Pressed_Options();
	void Audio_Trust_Vote();
	void Audio_Click_Button();
	void Audio_Start_Meeting();
	void Audio_A_Player_Was_Ejected();
	void Audio_No_One_Was_Ejected();
	void Audio_Local_Vote_Cast();
	void Audio_Timer_Is_Almost_Up_Stop();
	void Audio_Time_Is_Almost_Up();
	void CountdownDelay();
	void EndCountdown(bool Immediately);
	void CreateCountdown(int32 Time);
	void OnInitialized();
	void EliminationVoteFor(class ACharacter* Vote);
	void AddEliminationVote(class ACharacter* VoteFrom, class ACharacter* VoteFor);
	void AddTrustVote(bool TrustYes);
	void PreConstruct(bool IsDesignTime);
	void AddVoteTypeVoteCount(class UWrapBox* Target);
	class UEmergencyMeetingComponent_C* GetEmergencyMeetingComponent();
	void AddVoteTrackerEntry(const struct FVector2D& InPadding);
	void CreateVoteTracker(int32 Amount);
	void DisableEliminationSkipButton();
	void UpdateCountdown();
	void SetCountdownText(int32 Time);
	void AddEliminationVoteEntry(class ACharacter* PlayerCharacter, bool IsMeetingCaller);
	void EnableSkipVoteButton();
	void AddSkipVoteTracker(class ACharacter* VoteFrom);
	void Hide_Elimination_Skip_Button();
	void SetupEmergencyMeeting(TArray<class ACharacter*>& CharactersForVote, int32 ExpectedVotes, int32 Countdown_0, const TArray<class ACharacter*>& PassengerLogs, int32 TargetPassengerLog, const struct FPassengerLogInformation& PassengerLogInfo, TArray<int32>& MeetingCallers, int32 LottoSeed_0, bool IsDead);
	void EndMeeting();
	void ShowEndResult(class ACharacter* CharacterVotedOut, const class FText& Text, int32 Countdown_0, int32 ExpectedVotes);
	void DisablePlayerInteractability();
	void DisableInteractions();
	void AddTrackedTrustVote(bool TrustYes);
	void SetupNewLotto();
	void Elimination_SkipVisibility(bool Visible);
	class UWidget* Navigate_to_Elimination_Vote(EUINavigation Navigation_0);
	void PlayIntroSequence();
	void SequenceEvent__ENTRYPOINTEmergencyMeetingWI_0();
	void SequenceEvent__ENTRYPOINTEmergencyMeetingWI_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmergencyMeetingWI_C">();
	}
	static class UEmergencyMeetingWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmergencyMeetingWI_C>();
	}
};
static_assert(alignof(UEmergencyMeetingWI_C) == 0x000008, "Wrong alignment on UEmergencyMeetingWI_C");
static_assert(sizeof(UEmergencyMeetingWI_C) == 0x0004C0, "Wrong size on UEmergencyMeetingWI_C");
static_assert(offsetof(UEmergencyMeetingWI_C, UberGraphFrame) == 0x000280, "Member 'UEmergencyMeetingWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, FadeToResult) == 0x000288, "Member 'UEmergencyMeetingWI_C::FadeToResult' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, IntroSequence) == 0x000290, "Member 'UEmergencyMeetingWI_C::IntroSequence' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, FadeCountdown) == 0x000298, "Member 'UEmergencyMeetingWI_C::FadeCountdown' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, FadeEntireWidget) == 0x0002A0, "Member 'UEmergencyMeetingWI_C::FadeEntireWidget' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, BackgroundMid) == 0x0002A8, "Member 'UEmergencyMeetingWI_C::BackgroundMid' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, CircleBG) == 0x0002B0, "Member 'UEmergencyMeetingWI_C::CircleBG' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, Circleframe) == 0x0002B8, "Member 'UEmergencyMeetingWI_C::Circleframe' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, CountdownFrame) == 0x0002C0, "Member 'UEmergencyMeetingWI_C::CountdownFrame' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, CountdownNumber) == 0x0002C8, "Member 'UEmergencyMeetingWI_C::CountdownNumber' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, DeadText) == 0x0002D0, "Member 'UEmergencyMeetingWI_C::DeadText' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, EliminationSkipButton) == 0x0002D8, "Member 'UEmergencyMeetingWI_C::EliminationSkipButton' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, EliminationSkipFrame) == 0x0002E0, "Member 'UEmergencyMeetingWI_C::EliminationSkipFrame' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, EliminationVoteBG) == 0x0002E8, "Member 'UEmergencyMeetingWI_C::EliminationVoteBG' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, EliminationVoteBottomLine) == 0x0002F0, "Member 'UEmergencyMeetingWI_C::EliminationVoteBottomLine' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, EliminationVotesContainer) == 0x0002F8, "Member 'UEmergencyMeetingWI_C::EliminationVotesContainer' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, EliminationVoteTopLine) == 0x000300, "Member 'UEmergencyMeetingWI_C::EliminationVoteTopLine' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, Explanation) == 0x000308, "Member 'UEmergencyMeetingWI_C::Explanation' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, FocusHandlerWI) == 0x000310, "Member 'UEmergencyMeetingWI_C::FocusHandlerWI' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, GeneralVoteBox) == 0x000318, "Member 'UEmergencyMeetingWI_C::GeneralVoteBox' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, Image) == 0x000320, "Member 'UEmergencyMeetingWI_C::Image' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, Image_1) == 0x000328, "Member 'UEmergencyMeetingWI_C::Image_1' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, Image_514) == 0x000330, "Member 'UEmergencyMeetingWI_C::Image_514' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, Image_1446) == 0x000338, "Member 'UEmergencyMeetingWI_C::Image_1446' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, Image_1754) == 0x000340, "Member 'UEmergencyMeetingWI_C::Image_1754' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, MainSwitcher) == 0x000348, "Member 'UEmergencyMeetingWI_C::MainSwitcher' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, PassengerLogLottoV2WI) == 0x000350, "Member 'UEmergencyMeetingWI_C::PassengerLogLottoV2WI' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, ResultText) == 0x000358, "Member 'UEmergencyMeetingWI_C::ResultText' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, SkipContainer) == 0x000360, "Member 'UEmergencyMeetingWI_C::SkipContainer' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, SkipElimText) == 0x000368, "Member 'UEmergencyMeetingWI_C::SkipElimText' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, SkipVoteTracker) == 0x000370, "Member 'UEmergencyMeetingWI_C::SkipVoteTracker' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TextBlock_Trust_No) == 0x000378, "Member 'UEmergencyMeetingWI_C::TextBlock_Trust_No' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TextBlock_Trust_Yes) == 0x000380, "Member 'UEmergencyMeetingWI_C::TextBlock_Trust_Yes' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TrustButtons) == 0x000388, "Member 'UEmergencyMeetingWI_C::TrustButtons' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TrustNoTracker) == 0x000390, "Member 'UEmergencyMeetingWI_C::TrustNoTracker' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TrustYesTracker) == 0x000398, "Member 'UEmergencyMeetingWI_C::TrustYesTracker' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TrystNo) == 0x0003A0, "Member 'UEmergencyMeetingWI_C::TrystNo' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TrystYes) == 0x0003A8, "Member 'UEmergencyMeetingWI_C::TrystYes' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, VotesGiven) == 0x0003B0, "Member 'UEmergencyMeetingWI_C::VotesGiven' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, EmergencyMeetingActor) == 0x0003B8, "Member 'UEmergencyMeetingWI_C::EmergencyMeetingActor' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, VoteTrackerVotes) == 0x0003C0, "Member 'UEmergencyMeetingWI_C::VoteTrackerVotes' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, VoteTrackerCount) == 0x0003D0, "Member 'UEmergencyMeetingWI_C::VoteTrackerCount' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, Countdown) == 0x0003D4, "Member 'UEmergencyMeetingWI_C::Countdown' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TransitionDuration) == 0x0003D8, "Member 'UEmergencyMeetingWI_C::TransitionDuration' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TransitionFadeDuration) == 0x0003DC, "Member 'UEmergencyMeetingWI_C::TransitionFadeDuration' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, DisableAllInteraction) == 0x0003E0, "Member 'UEmergencyMeetingWI_C::DisableAllInteraction' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, CharactersOnEliminationVote) == 0x0003E8, "Member 'UEmergencyMeetingWI_C::CharactersOnEliminationVote' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, Ak) == 0x0003F8, "Member 'UEmergencyMeetingWI_C::Ak' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, PreventAudioCountdown) == 0x000400, "Member 'UEmergencyMeetingWI_C::PreventAudioCountdown' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, ColorTrustYes) == 0x000404, "Member 'UEmergencyMeetingWI_C::ColorTrustYes' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, ColorTrustNo) == 0x000414, "Member 'UEmergencyMeetingWI_C::ColorTrustNo' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, LottoEntries) == 0x000428, "Member 'UEmergencyMeetingWI_C::LottoEntries' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, LottoTarget) == 0x000438, "Member 'UEmergencyMeetingWI_C::LottoTarget' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, LottoSeed) == 0x00043C, "Member 'UEmergencyMeetingWI_C::LottoSeed' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TargetInfo) == 0x000440, "Member 'UEmergencyMeetingWI_C::TargetInfo' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TrustHoveredColor) == 0x000468, "Member 'UEmergencyMeetingWI_C::TrustHoveredColor' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, TrustUnhoveredColor) == 0x000490, "Member 'UEmergencyMeetingWI_C::TrustUnhoveredColor' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, DidNotTrust) == 0x0004B8, "Member 'UEmergencyMeetingWI_C::DidNotTrust' has a wrong offset!");
static_assert(offsetof(UEmergencyMeetingWI_C, Trusted) == 0x0004B9, "Member 'UEmergencyMeetingWI_C::Trusted' has a wrong offset!");

}

