#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyEventWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EmergencyEventWI.EmergencyEventWI_C.ExecuteUbergraph_EmergencyEventWI
// 0x0098 (0x0098 - 0x0000)
struct EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetOrganizer*                       CallFunc_GetWidgetOrganizer_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI) == 0x000008, "Wrong alignment on EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI");
static_assert(sizeof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI) == 0x000098, "Wrong size on EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, EntryPoint) == 0x000000, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, K2Node_Event_MyGeometry) == 0x000014, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000058, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, CallFunc_GetPlayerPawn_ReturnValue) == 0x000068, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, CallFunc_GetWidgetOrganizer_ReturnValue) == 0x000088, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::CallFunc_GetWidgetOrganizer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000090, "Member 'EmergencyEventWI_C_ExecuteUbergraph_EmergencyEventWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");

// Function EmergencyEventWI.EmergencyEventWI_C.Tick
// 0x003C (0x003C - 0x0000)
struct EmergencyEventWI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEventWI_C_Tick) == 0x000004, "Wrong alignment on EmergencyEventWI_C_Tick");
static_assert(sizeof(EmergencyEventWI_C_Tick) == 0x00003C, "Wrong size on EmergencyEventWI_C_Tick");
static_assert(offsetof(EmergencyEventWI_C_Tick, MyGeometry) == 0x000000, "Member 'EmergencyEventWI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(EmergencyEventWI_C_Tick, InDeltaTime) == 0x000038, "Member 'EmergencyEventWI_C_Tick::InDeltaTime' has a wrong offset!");

}

