#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyMeetingSCTBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCT_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function EmergencyMeetingSCTBP.EmergencyMeetingSCTBP_C.ExecuteUbergraph_EmergencyMeetingSCTBP
// 0x0450 (0x0450 - 0x0000)
struct EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEmergencyWidget_IsValid;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEmergencyMeetingWI_C*>          CallFunc_GetEmergencyWidget_EmergencyMeetingWI;    // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEmergencyWidget_IsValid_1;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEmergencyMeetingWI_C*>          CallFunc_GetEmergencyWidget_EmergencyMeetingWI_1;  // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEmergencyWidget_IsValid_2;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEmergencyMeetingWI_C*>          CallFunc_GetEmergencyWidget_EmergencyMeetingWI_2;  // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEmergencyWidget_IsValid_3;             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEmergencyMeetingWI_C*>          CallFunc_GetEmergencyWidget_EmergencyMeetingWI_3;  // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UEmergencyMeetingWI_C*                  CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Vote_1;                         // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_TrustYes;                       // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_VoteComesFrom;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Vote;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_VoteFrom;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_VoteFor;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_VotedOut_1;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEmergencyWidget_IsValid_4;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEmergencyMeetingWI_C*>          CallFunc_GetEmergencyWidget_EmergencyMeetingWI_4;  // 0x00C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GetVoteIneligiblePlayers_VoteIneligible;  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CountEliminationVotes_WasDeadlocked;      // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacter*>                     CallFunc_CountEliminationVotes_Deadlocked;         // 0x00E8(0x0010)(ReferenceParm)
	class ACharacter*                             CallFunc_CountEliminationVotes_VotedOut;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyMeetingWI_C*                  CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEmergencyWidget_IsValid_5;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEmergencyMeetingWI_C*>          CallFunc_GetEmergencyWidget_EmergencyMeetingWI_5;  // 0x0118(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_ViewTarget;                     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_6;          // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x014C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ASCTGameMode_MatchBP_C*                 CallFunc_GetGameModeMatchSCT_AsSCTGame_Mode_Match_BP; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AnyPersonoidsAlive_PersonoidAlive;        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0174(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndConditions                                K2Node_CustomEvent_End_Condition;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTGameMode_MatchBP_C*                 K2Node_DynamicCast_AsSCTGame_Mode_Match_BP;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x01B8(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x01C8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacter*>                     K2Node_CustomEvent_CharactersForVote;              // 0x01E0(0x0010)(ReferenceParm)
	int32                                         K2Node_CustomEvent_ExpectedVotes_1;                // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Countdown;                      // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacter*>                     K2Node_CustomEvent_PassengerLogs;                  // 0x01F8(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_CustomEvent_TargetPassengerLog;             // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPassengerLogInformation               K2Node_CustomEvent_PassengerLogInfo;               // 0x0210(0x0028)()
	TArray<int32>                                 K2Node_CustomEvent_MeetingCallers;                 // 0x0238(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_CustomEvent_LottoSeed;                      // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEmergencyWidget_IsValid_6;             // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEmergencyMeetingWI_C*>          CallFunc_GetEmergencyWidget_EmergencyMeetingWI_6;  // 0x0250(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVoteEligibleCount_VoteEligiblePlayers; // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0268(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x0278(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_VotedOut;                       // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmergencyMeetingWI_C*                  CallFunc_Array_Get_Item_2;                         // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_FindAnyPassengerLogs_PassengerLogAvailable; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacter*>                     CallFunc_FindAnyPassengerLogs_PlayerWithLog;       // 0x02B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_FindAnyPassengerLogs_TargetLog;           // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPassengerLogInformation               CallFunc_FindAnyPassengerLogs_PassengerLog;        // 0x02D0(0x0028)()
	class ACharacter*                             K2Node_CustomEvent_CharacterVotedOut_1;            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ExpectedVotes;                  // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_7;          // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyMeetingWI_C*                  CallFunc_Array_Get_Item_3;                         // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0320(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_CharacterVotedOut;              // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVoteEligibleCount_VoteEligiblePlayers_1; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_MeetingCallerToIndex_MeetingCallersArray; // 0x0340(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable_4;                               // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyMeetingWI_C*                  CallFunc_Array_Get_Item_4;                         // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisableAirlockInEditor_ReturnValue; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_5;                         // 0x0380(0x0018)()
	int32                                         Temp_int_Variable_5;                               // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyMeetingWI_C*                  CallFunc_Array_Get_Item_6;                         // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisableAirlockInEditor_ReturnValue_1; // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEmergencyEventController_C*>    CallFunc_GetAllActorsOfClass_OutActors;            // 0x03B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmergencyEventController_C*            CallFunc_Array_Get_Item_7;                         // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetVoteIneligiblePlayers_VoteIneligible_1; // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTGameState*                          CallFunc_Get_SCT_Game_State_Game_State;            // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTGameState*                          CallFunc_Get_SCT_Game_State_Game_State_1;          // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacter*>                     CallFunc_GetCharactersToTeleport_Characters;       // 0x03F0(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0400(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0410(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EEndConditions End_Condition)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0418(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP) == 0x000008, "Wrong alignment on EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP");
static_assert(sizeof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP) == 0x000450, "Wrong size on EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, EntryPoint) == 0x000000, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_IsValid) == 0x000005, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_IsValid' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_EmergencyMeetingWI) == 0x000008, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_EmergencyMeetingWI' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_int_Variable) == 0x000018, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000024, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_IsValid_1) == 0x000025, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_IsValid_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_EmergencyMeetingWI_1) == 0x000028, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_EmergencyMeetingWI_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_IsValid_2) == 0x00003C, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_IsValid_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_EmergencyMeetingWI_2) == 0x000040, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_EmergencyMeetingWI_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000050, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Length_ReturnValue_2) == 0x000054, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000058, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_HasAuthority_ReturnValue) == 0x000059, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_IsValid_3) == 0x00005A, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_IsValid_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_EmergencyMeetingWI_3) == 0x000060, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_EmergencyMeetingWI_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Get_Item) == 0x000070, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Length_ReturnValue_3) == 0x000078, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_Vote_1) == 0x00007D, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_Vote_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_TrustYes) == 0x00007E, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_TrustYes' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x00007F, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_VoteComesFrom) == 0x000088, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_VoteComesFrom' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_Vote) == 0x000090, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_Vote' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_VoteFrom) == 0x000098, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_VoteFrom' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_VoteFor) == 0x0000A0, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_VoteFor' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_bool_Variable) == 0x0000A8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Contains_ReturnValue) == 0x0000A9, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Add_ReturnValue_1) == 0x0000AC, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B0, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_bool_Has_Been_Initd_Variable) == 0x0000B4, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_VotedOut_1) == 0x0000B8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_VotedOut_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_IsValid_4) == 0x0000C0, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_IsValid_4' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_EmergencyMeetingWI_4) == 0x0000C8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_EmergencyMeetingWI_4' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetVoteIneligiblePlayers_VoteIneligible) == 0x0000D8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetVoteIneligiblePlayers_VoteIneligible' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Length_ReturnValue_4) == 0x0000DC, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000E1, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_CountEliminationVotes_WasDeadlocked) == 0x0000E2, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_CountEliminationVotes_WasDeadlocked' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_CountEliminationVotes_Deadlocked) == 0x0000E8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_CountEliminationVotes_Deadlocked' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_CountEliminationVotes_VotedOut) == 0x0000F8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_CountEliminationVotes_VotedOut' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_int_Variable_1) == 0x000100, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Add_IntInt_ReturnValue_3) == 0x000104, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000110, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_IsValid_5) == 0x000111, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_IsValid_5' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_EmergencyMeetingWI_5) == 0x000118, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_EmergencyMeetingWI_5' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_HasAuthority_ReturnValue_1) == 0x000128, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Not_PreBool_ReturnValue) == 0x000129, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_ViewTarget) == 0x000130, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_ViewTarget' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetPlayerController_ReturnValue) == 0x000138, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000140, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x000148, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_IsDedicatedServer_ReturnValue_6) == 0x000149, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_IsDedicatedServer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_IsValid_ReturnValue) == 0x00014A, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CreateDelegate_OutputDelegate) == 0x00014C, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000160, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetGameModeMatchSCT_AsSCTGame_Mode_Match_BP) == 0x000168, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetGameModeMatchSCT_AsSCTGame_Mode_Match_BP' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_AnyPersonoidsAlive_PersonoidAlive) == 0x000170, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_AnyPersonoidsAlive_PersonoidAlive' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_delegate_Variable) == 0x000174, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetGameMode_ReturnValue) == 0x000188, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_End_Condition) == 0x000190, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_End_Condition' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_DynamicCast_AsSCTGame_Mode_Match_BP) == 0x000198, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_DynamicCast_AsSCTGame_Mode_Match_BP' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_bool_IsClosed_Variable) == 0x0001A1, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0001A8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0001B0, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_struct_Variable) == 0x0001B8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_delegate_Variable_1) == 0x0001C8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0001D8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_CharactersForVote) == 0x0001E0, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_CharactersForVote' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_ExpectedVotes_1) == 0x0001F0, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_ExpectedVotes_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_Countdown) == 0x0001F4, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_Countdown' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_PassengerLogs) == 0x0001F8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_PassengerLogs' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_TargetPassengerLog) == 0x000208, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_TargetPassengerLog' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_PassengerLogInfo) == 0x000210, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_PassengerLogInfo' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_MeetingCallers) == 0x000238, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_MeetingCallers' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_LottoSeed) == 0x000248, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_LottoSeed' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_IsValid_6) == 0x00024C, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_IsValid_6' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetEmergencyWidget_EmergencyMeetingWI_6) == 0x000250, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetEmergencyWidget_EmergencyMeetingWI_6' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Length_ReturnValue_5) == 0x000260, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_GetVoteEligibleCount_VoteEligiblePlayers) == 0x000264, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_GetVoteEligibleCount_VoteEligiblePlayers' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_struct_Variable_1) == 0x000268, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_bool_Variable_1) == 0x000278, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_FTrunc_ReturnValue) == 0x00027C, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Add_IntInt_ReturnValue_4) == 0x000280, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, Temp_int_Variable_2) == 0x000284, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_VotedOut) == 0x000288, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_VotedOut' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Add_IntInt_ReturnValue_5) == 0x000290, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Array_Get_Item_2) == 0x000298, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002A0, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002A4, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_FindAnyPassengerLogs_PassengerLogAvailable) == 0x0002B4, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_FindAnyPassengerLogs_PassengerLogAvailable' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_FindAnyPassengerLogs_PlayerWithLog) == 0x0002B8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_FindAnyPassengerLogs_PlayerWithLog' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_FindAnyPassengerLogs_TargetLog) == 0x0002C8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_FindAnyPassengerLogs_TargetLog' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_FindAnyPassengerLogs_PassengerLog) == 0x0002D0, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_FindAnyPassengerLogs_PassengerLog' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_CharacterVotedOut_1) == 0x0002F8, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_CharacterVotedOut_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, K2Node_CustomEvent_ExpectedVotes) == 0x000300, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::K2Node_CustomEvent_ExpectedVotes' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP, CallFunc_IsDedicatedServer_ReturnValue_7) == 0x000304, "Member 'EmergencyMeetingSCTBP_C_ExecuteUbergraph_EmergencyMeetingSCTBP::CallFunc_IsDedicatedServer_ReturnValue_7' has a wrong offset!");
