#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmoteWheelV2EntryWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "S_Emote_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EmoteWheelV2EntryWI.EmoteWheelV2EntryWI_C.OnSetCustomizationVisibility__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct EmoteWheelV2EntryWI_C_OnSetCustomizationVisibility__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmoteWheelV2EntryWI_C_OnSetCustomizationVisibility__DelegateSignature) == 0x000001, "Wrong alignment on EmoteWheelV2EntryWI_C_OnSetCustomizationVisibility__DelegateSignature");
static_assert(sizeof(EmoteWheelV2EntryWI_C_OnSetCustomizationVisibility__DelegateSignature) == 0x000001, "Wrong size on EmoteWheelV2EntryWI_C_OnSetCustomizationVisibility__DelegateSignature");
static_assert(offsetof(EmoteWheelV2EntryWI_C_OnSetCustomizationVisibility__DelegateSignature, InVisibility) == 0x000000, "Member 'EmoteWheelV2EntryWI_C_OnSetCustomizationVisibility__DelegateSignature::InVisibility' has a wrong offset!");

// Function EmoteWheelV2EntryWI.EmoteWheelV2EntryWI_C.ExecuteUbergraph_EmoteWheelV2EntryWI
// 0x0190 (0x0190 - 0x0000)
struct EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00A8(0x0028)(UObjectWrapper)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00D0(0x0028)(UObjectWrapper)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00F8(0x0088)()
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI) == 0x000008, "Wrong alignment on EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI");
static_assert(sizeof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI) == 0x000190, "Wrong size on EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, EntryPoint) == 0x000000, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_IsPS4Platform_ReturnValue) == 0x000030, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_IsPS5Platform_ReturnValue) == 0x000044, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_IsPS5Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_BooleanOR_ReturnValue) == 0x000045, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_IsXboxPlatform_ReturnValue) == 0x000046, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_IsXboxPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_BooleanOR_ReturnValue_1) == 0x000047, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, K2Node_Event_IsDesignTime) == 0x000048, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000050, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_MakeVector2D_ReturnValue_1) == 0x000064, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000070, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000078, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_GetPosition_ReturnValue) == 0x00007C, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_BreakVector2D_X) == 0x000084, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_BreakVector2D_Y) == 0x000088, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_Add_FloatFloat_ReturnValue) == 0x00008C, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000090, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_MakeVector2D_ReturnValue_2) == 0x000098, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_BooleanAND_ReturnValue) == 0x0000A0, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, K2Node_MakeStruct_SlateColor_1) == 0x0000A8, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, K2Node_MakeStruct_SlateColor_2) == 0x0000D0, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, K2Node_MakeStruct_SlateBrush) == 0x0000F8, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000180, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI, K2Node_CustomEvent_InVisibility) == 0x000188, "Member 'EmoteWheelV2EntryWI_C_ExecuteUbergraph_EmoteWheelV2EntryWI::K2Node_CustomEvent_InVisibility' has a wrong offset!");

// Function EmoteWheelV2EntryWI.EmoteWheelV2EntryWI_C.SetConsoleVisibility
// 0x0001 (0x0001 - 0x0000)
struct EmoteWheelV2EntryWI_C_SetConsoleVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmoteWheelV2EntryWI_C_SetConsoleVisibility) == 0x000001, "Wrong alignment on EmoteWheelV2EntryWI_C_SetConsoleVisibility");
static_assert(sizeof(EmoteWheelV2EntryWI_C_SetConsoleVisibility) == 0x000001, "Wrong size on EmoteWheelV2EntryWI_C_SetConsoleVisibility");
static_assert(offsetof(EmoteWheelV2EntryWI_C_SetConsoleVisibility, InVisibility) == 0x000000, "Member 'EmoteWheelV2EntryWI_C_SetConsoleVisibility::InVisibility' has a wrong offset!");

// Function EmoteWheelV2EntryWI.EmoteWheelV2EntryWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct EmoteWheelV2EntryWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmoteWheelV2EntryWI_C_PreConstruct) == 0x000001, "Wrong alignment on EmoteWheelV2EntryWI_C_PreConstruct");
static_assert(sizeof(EmoteWheelV2EntryWI_C_PreConstruct) == 0x000001, "Wrong size on EmoteWheelV2EntryWI_C_PreConstruct");
static_assert(offsetof(EmoteWheelV2EntryWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'EmoteWheelV2EntryWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function EmoteWheelV2EntryWI.EmoteWheelV2EntryWI_C.Initialize
// 0x0060 (0x0060 - 0x0000)
struct EmoteWheelV2EntryWI_C_Initialize final
{
public:
	struct FS_Emote                               Emote;                                             // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EmoteWheelV2EntryWI_C_Initialize) == 0x000008, "Wrong alignment on EmoteWheelV2EntryWI_C_Initialize");
static_assert(sizeof(EmoteWheelV2EntryWI_C_Initialize) == 0x000060, "Wrong size on EmoteWheelV2EntryWI_C_Initialize");
static_assert(offsetof(EmoteWheelV2EntryWI_C_Initialize, Emote) == 0x000000, "Member 'EmoteWheelV2EntryWI_C_Initialize::Emote' has a wrong offset!");

// Function EmoteWheelV2EntryWI.EmoteWheelV2EntryWI_C.SetTextParameters
// 0x0060 (0x0060 - 0x0000)
struct EmoteWheelV2EntryWI_C_SetTextParameters final
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0000(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmoteWheelV2EntryWI_C_SetTextParameters) == 0x000008, "Wrong alignment on EmoteWheelV2EntryWI_C_SetTextParameters");
static_assert(sizeof(EmoteWheelV2EntryWI_C_SetTextParameters) == 0x000060, "Wrong size on EmoteWheelV2EntryWI_C_SetTextParameters");
static_assert(offsetof(EmoteWheelV2EntryWI_C_SetTextParameters, Font) == 0x000000, "Member 'EmoteWheelV2EntryWI_C_SetTextParameters::Font' has a wrong offset!");
static_assert(offsetof(EmoteWheelV2EntryWI_C_SetTextParameters, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000058, "Member 'EmoteWheelV2EntryWI_C_SetTextParameters::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

}

