#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmoteWheelWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EmoteWheelWI.EmoteWheelWI_C
// 0x0108 (0x0388 - 0x0280)
class UEmoteWheelWI_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       OpenAnim;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_NoItems;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CenterIndicatorRotator;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CircleBG;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DeadzoneVisualizer;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InfoBox;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InfoBoxBG;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InfoBoxLineop;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PieContainer;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RadialBGLarge;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RadialBGMid;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RadialBGSmall;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThinframeOuter;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PieMaterial;                                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PieBorderContrast;                                 // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PieInnerRadius;                                    // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PieOuterRadius;                                    // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PieSize;                                           // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PieOffset;                                         // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemWheelV2EntryWI_C*>          PieEntries;                                        // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ActiveHoveredPieEntry;                             // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoEmotes;                                          // 0x033C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeadzoneSize;                                      // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugItems;                                        // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MousePos;                                          // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEmoteWheelV2EntryWI_C*>         PieEntries2;                                       // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsCustomizationMenu;                               // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CustomizationMenu;                                 // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             UpdatePositionForPreviewer;                        // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ACharacterPreviewerSCTBP_C*             CharacterPreviewer;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ViewportOffset;                                    // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdatePositionForPreviewer__DelegateSignature();
	void ExecuteUbergraph_EmoteWheelWI(int32 EntryPoint);
	void OnEmotesUsable();
	void OnClientConnected();
	void Input_Action();
	void Destruct();
	void Construct();
	void Clear_If_Null();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void OnSuccess_F99502DC445644C7591DDEA58A6C9C13(const struct FFCTCloudCustomizationPayload& Payload, int32 Code, const class FString& Message);
	void OnError_F99502DC445644C7591DDEA58A6C9C13(int32 Code, const class FString& Message);
	void PiePermutation(float DistanceFromCenter, int32 Index_0, int32* Return);
	void UnhoverCurrentEntrySelection(int32 EntryIndex);
	void HoverCurrentEntrySelection(int32 EntryIndex);
	void GetCharacterVisibleItems(TArray<struct FItemDetails>* Return);
	int32 GetVisibleEmotesAmount();
	float CalculateAngle(int32 A);
	void SetCanvasNoItemVisibility(bool* NoItems);
	bool GetCursorOutOfAngle(float Degree);
	void SetupPieParameters(const TArray<struct FS_Emote>& TargetArray);
	void GetCharacterEmotes(TArray<struct FS_Emote>* PlayerEmotes);
	bool GetOnly1PieEntry();
	void TryGetPowerInSlot(bool* Slot1Empty, class UPower** Power);
	void UpdateMousePositionForPreviewer();
	void GetHoveredEmoteCustomizationData(int32* SelectedIndex, struct FS_Emote* Details, struct FVector2D* Position);
	void SetPreviewerByTag(class FName Tag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmoteWheelWI_C">();
	}
	static class UEmoteWheelWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteWheelWI_C>();
	}
};
static_assert(alignof(UEmoteWheelWI_C) == 0x000008, "Wrong alignment on UEmoteWheelWI_C");
static_assert(sizeof(UEmoteWheelWI_C) == 0x000388, "Wrong size on UEmoteWheelWI_C");
static_assert(offsetof(UEmoteWheelWI_C, UberGraphFrame) == 0x000280, "Member 'UEmoteWheelWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, OpenAnim) == 0x000288, "Member 'UEmoteWheelWI_C::OpenAnim' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, BG) == 0x000290, "Member 'UEmoteWheelWI_C::BG' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, Canvas_NoItems) == 0x000298, "Member 'UEmoteWheelWI_C::Canvas_NoItems' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, CenterIndicatorRotator) == 0x0002A0, "Member 'UEmoteWheelWI_C::CenterIndicatorRotator' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, CircleBG) == 0x0002A8, "Member 'UEmoteWheelWI_C::CircleBG' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, DeadzoneVisualizer) == 0x0002B0, "Member 'UEmoteWheelWI_C::DeadzoneVisualizer' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, InfoBox) == 0x0002B8, "Member 'UEmoteWheelWI_C::InfoBox' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, InfoBoxBG) == 0x0002C0, "Member 'UEmoteWheelWI_C::InfoBoxBG' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, InfoBoxLineop) == 0x0002C8, "Member 'UEmoteWheelWI_C::InfoBoxLineop' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, PieContainer) == 0x0002D0, "Member 'UEmoteWheelWI_C::PieContainer' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, RadialBGLarge) == 0x0002D8, "Member 'UEmoteWheelWI_C::RadialBGLarge' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, RadialBGMid) == 0x0002E0, "Member 'UEmoteWheelWI_C::RadialBGMid' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, RadialBGSmall) == 0x0002E8, "Member 'UEmoteWheelWI_C::RadialBGSmall' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, Text_Description) == 0x0002F0, "Member 'UEmoteWheelWI_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, Text_Name) == 0x0002F8, "Member 'UEmoteWheelWI_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, ThinframeOuter) == 0x000300, "Member 'UEmoteWheelWI_C::ThinframeOuter' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, PieMaterial) == 0x000308, "Member 'UEmoteWheelWI_C::PieMaterial' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, PieBorderContrast) == 0x000310, "Member 'UEmoteWheelWI_C::PieBorderContrast' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, PieInnerRadius) == 0x000314, "Member 'UEmoteWheelWI_C::PieInnerRadius' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, PieOuterRadius) == 0x000318, "Member 'UEmoteWheelWI_C::PieOuterRadius' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, PieSize) == 0x00031C, "Member 'UEmoteWheelWI_C::PieSize' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, PieOffset) == 0x000320, "Member 'UEmoteWheelWI_C::PieOffset' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, PieEntries) == 0x000328, "Member 'UEmoteWheelWI_C::PieEntries' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, ActiveHoveredPieEntry) == 0x000338, "Member 'UEmoteWheelWI_C::ActiveHoveredPieEntry' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, NoEmotes) == 0x00033C, "Member 'UEmoteWheelWI_C::NoEmotes' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, DeadzoneSize) == 0x000340, "Member 'UEmoteWheelWI_C::DeadzoneSize' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, DebugItems) == 0x000344, "Member 'UEmoteWheelWI_C::DebugItems' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, MousePos) == 0x000348, "Member 'UEmoteWheelWI_C::MousePos' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, PieEntries2) == 0x000350, "Member 'UEmoteWheelWI_C::PieEntries2' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, IsCustomizationMenu) == 0x000360, "Member 'UEmoteWheelWI_C::IsCustomizationMenu' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, CustomizationMenu) == 0x000361, "Member 'UEmoteWheelWI_C::CustomizationMenu' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, UpdatePositionForPreviewer) == 0x000368, "Member 'UEmoteWheelWI_C::UpdatePositionForPreviewer' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, CharacterPreviewer) == 0x000378, "Member 'UEmoteWheelWI_C::CharacterPreviewer' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, ViewportOffset) == 0x000380, "Member 'UEmoteWheelWI_C::ViewportOffset' has a wrong offset!");

}

