#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipablePower_Scanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"
#include "E_ItemAnimation_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EquipablePower_Scanner.EquipablePower_Scanner_C
// 0x0020 (0x0258 - 0x0238)
class AEquipablePower_Scanner_C final : public AEquipablePower
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ACharacter*                             Character_Placeholder;                             // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EquipablePower_Scanner(int32 EntryPoint);
	void ItemAnimation(E_ItemAnimation ItemAnimation_0);
	void Initialize();
	void Activate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EquipablePower_Scanner_C">();
	}
	static class AEquipablePower_Scanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEquipablePower_Scanner_C>();
	}
};
static_assert(alignof(AEquipablePower_Scanner_C) == 0x000008, "Wrong alignment on AEquipablePower_Scanner_C");
static_assert(sizeof(AEquipablePower_Scanner_C) == 0x000258, "Wrong size on AEquipablePower_Scanner_C");
static_assert(offsetof(AEquipablePower_Scanner_C, UberGraphFrame) == 0x000238, "Member 'AEquipablePower_Scanner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEquipablePower_Scanner_C, StaticMesh) == 0x000240, "Member 'AEquipablePower_Scanner_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AEquipablePower_Scanner_C, Ak) == 0x000248, "Member 'AEquipablePower_Scanner_C::Ak' has a wrong offset!");
static_assert(offsetof(AEquipablePower_Scanner_C, Character_Placeholder) == 0x000250, "Member 'AEquipablePower_Scanner_C::Character_Placeholder' has a wrong offset!");

}

