#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipablePower_ChampagneBottle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EquipablePower_ChampagneBottle.EquipablePower_ChampagneBottle_C.ExecuteUbergraph_EquipablePower_ChampagneBottle
// 0x0460 (0x0460 - 0x0000)
struct EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_CreateAimReticle_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSpawnPoint_ReturnValue;                // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_SpawnTransform;                 // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class ACharacter*                             K2Node_CustomEvent_HomingTarget;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutHit; // 0x00D4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FVector>                        CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutPathPositions; // 0x0160(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutLastTraceDestination; // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_ReturnValue; // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetHomingTargetBPI_ReturnValue;           // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InterpReticleLocation_ReturnValue;        // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0224(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetSpawnPoint_ReturnValue_1;              // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue_1;          // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E4[0xC];                                      // 0x02E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02F0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AChampagneBottleProjectile_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_4;        // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343[0x5];                                      // 0x0343(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_5;        // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_1;                   // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_wasCancelled;                         // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x2];                                      // 0x03A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_CreateAimReticle_ReturnValue_1;           // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InterpReticleLocation_ReturnValue_1;      // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_CreateAimReticle_ReturnValue_2;           // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x03D0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle) == 0x000010, "Wrong alignment on EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle");
static_assert(sizeof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle) == 0x000460, "Wrong size on EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, EntryPoint) == 0x000000, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::EntryPoint' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_CreateAimReticle_ReturnValue) == 0x000008, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_CreateAimReticle_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_HasAuthority_ReturnValue) == 0x000012, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_IsLocallyControlled_ReturnValue) == 0x000013, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetSpawnPoint_ReturnValue) == 0x000018, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetSpawnPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000028, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetCameraRotation_ReturnValue) == 0x000030, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetForwardVector_ReturnValue) == 0x000048, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_MakeArray_Array) == 0x000058, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000068, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_CustomEvent_SpawnTransform) == 0x000080, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_CustomEvent_SpawnTransform' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_CustomEvent_HomingTarget) == 0x0000B0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_CustomEvent_HomingTarget' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B8, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_DynamicCast_AsICharacter_SCT) == 0x0000C0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutHit) == 0x0000D4, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutHit' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutPathPositions) == 0x000160, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutPathPositions' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutLastTraceDestination) == 0x000170, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutLastTraceDestination' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_ReturnValue) == 0x00017C, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetHomingTargetBPI_ReturnValue) == 0x000180, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetHomingTargetBPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_bBlockingHit) == 0x000188, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_bInitialOverlap) == 0x000189, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_Time) == 0x00018C, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_Distance) == 0x000190, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_Location) == 0x000194, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_Normal) == 0x0001AC, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_ImpactNormal) == 0x0001B8, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_PhysMat) == 0x0001C8, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_HitActor) == 0x0001D0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_HitComponent) == 0x0001D8, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_HitBoneName) == 0x0001E0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_HitItem) == 0x0001E8, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_FaceIndex) == 0x0001EC, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BreakHitResult_TraceEnd) == 0x0001FC, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_SelectVector_ReturnValue) == 0x000208, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_InterpReticleLocation_ReturnValue) == 0x000214, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_InterpReticleLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_IsValid_ReturnValue_2) == 0x000220, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000224, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetSpawnPoint_ReturnValue_1) == 0x0002B0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetSpawnPoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0002C0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x0002C8, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x0002D0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetCameraRotation_ReturnValue_1) == 0x0002D8, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetCameraRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_MakeTransform_ReturnValue) == 0x0002F0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetOwner_ReturnValue_1) == 0x000320, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000328, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000330, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_FinishSpawningActor_ReturnValue) == 0x000338, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x000340, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_IsLocallyControlled_ReturnValue_3) == 0x000341, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_IsLocallyControlled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_IsLocallyControlled_ReturnValue_4) == 0x000342, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_IsLocallyControlled_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetOwner_ReturnValue_2) == 0x000348, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000350, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_DynamicCast_bSuccess_1) == 0x000358, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_HasAuthority_ReturnValue_1) == 0x000359, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_DynamicCast_AsIAnim_Bp) == 0x000360, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_DynamicCast_bSuccess_2) == 0x000370, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_IsLocallyControlled_ReturnValue_5) == 0x000371, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_IsLocallyControlled_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetOwner_ReturnValue_3) == 0x000378, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000380, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_DynamicCast_bSuccess_3) == 0x000388, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_IsValid_ReturnValue_3) == 0x000389, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_DynamicCast_AsIAnim_Bp_1) == 0x000390, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_DynamicCast_AsIAnim_Bp_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_DynamicCast_bSuccess_4) == 0x0003A0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, K2Node_Event_wasCancelled) == 0x0003A1, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::K2Node_Event_wasCancelled' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_GetSocketLocation_ReturnValue) == 0x0003A4, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_CreateAimReticle_ReturnValue_1) == 0x0003B0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_CreateAimReticle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_InterpReticleLocation_ReturnValue_1) == 0x0003B8, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_InterpReticleLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_CreateAimReticle_ReturnValue_2) == 0x0003C8, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_CreateAimReticle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0003D0, "Member 'EquipablePower_ChampagneBottle_C_ExecuteUbergraph_EquipablePower_ChampagneBottle::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");

// Function EquipablePower_ChampagneBottle.EquipablePower_ChampagneBottle_C.Deactivate
// 0x0001 (0x0001 - 0x0000)
struct EquipablePower_ChampagneBottle_C_Deactivate final
{
public:
	bool                                          WasCancelled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipablePower_ChampagneBottle_C_Deactivate) == 0x000001, "Wrong alignment on EquipablePower_ChampagneBottle_C_Deactivate");
static_assert(sizeof(EquipablePower_ChampagneBottle_C_Deactivate) == 0x000001, "Wrong size on EquipablePower_ChampagneBottle_C_Deactivate");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_Deactivate, WasCancelled) == 0x000000, "Member 'EquipablePower_ChampagneBottle_C_Deactivate::WasCancelled' has a wrong offset!");

// Function EquipablePower_ChampagneBottle.EquipablePower_ChampagneBottle_C.SpawnProjectileServer
// 0x0040 (0x0040 - 0x0000)
struct EquipablePower_ChampagneBottle_C_SpawnProjectileServer final
{
public:
	struct FTransform                             SpawnTransform;                                    // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class ACharacter*                             HomingTarget;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_ChampagneBottle_C_SpawnProjectileServer) == 0x000010, "Wrong alignment on EquipablePower_ChampagneBottle_C_SpawnProjectileServer");
static_assert(sizeof(EquipablePower_ChampagneBottle_C_SpawnProjectileServer) == 0x000040, "Wrong size on EquipablePower_ChampagneBottle_C_SpawnProjectileServer");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_SpawnProjectileServer, SpawnTransform) == 0x000000, "Member 'EquipablePower_ChampagneBottle_C_SpawnProjectileServer::SpawnTransform' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_SpawnProjectileServer, HomingTarget) == 0x000030, "Member 'EquipablePower_ChampagneBottle_C_SpawnProjectileServer::HomingTarget' has a wrong offset!");

// Function EquipablePower_ChampagneBottle.EquipablePower_ChampagneBottle_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct EquipablePower_ChampagneBottle_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_ChampagneBottle_C_ReceiveTick) == 0x000004, "Wrong alignment on EquipablePower_ChampagneBottle_C_ReceiveTick");
static_assert(sizeof(EquipablePower_ChampagneBottle_C_ReceiveTick) == 0x000004, "Wrong size on EquipablePower_ChampagneBottle_C_ReceiveTick");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'EquipablePower_ChampagneBottle_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function EquipablePower_ChampagneBottle.EquipablePower_ChampagneBottle_C.CalculateThrowTargets
// 0x0248 (0x0248 - 0x0000)
struct EquipablePower_ChampagneBottle_C_CalculateThrowTargets final
{
public:
	class ACharacter*                             Target;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Closest;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacter*>                     Players;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x00C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter_1;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0130(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets) == 0x000008, "Wrong alignment on EquipablePower_ChampagneBottle_C_CalculateThrowTargets");
static_assert(sizeof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets) == 0x000248, "Wrong size on EquipablePower_ChampagneBottle_C_CalculateThrowTargets");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, Target) == 0x000000, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::Target' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, Closest) == 0x000008, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::Closest' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, Players) == 0x000010, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::Players' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, Temp_int_Array_Index_Variable) == 0x000020, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000030, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, CallFunc_GetCameraLocation_ReturnValue) == 0x000040, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, K2Node_DynamicCast_AsCharacter) == 0x000050, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, CallFunc_GetCameraRotation_ReturnValue) == 0x00005C, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, K2Node_MakeArray_Array) == 0x000068, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, CallFunc_GetForwardVector_ReturnValue) == 0x000078, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_ChampagneBottle_C_CalculateThrowTargets, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000084, "Member 'EquipablePower_ChampagneBottle_C_CalculateThrowTargets::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
