#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipablePower_FireExtinguisher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EquipablePower_FireExtinguisher.EquipablePower_FireExtinguisher_C.ExecuteUbergraph_EquipablePower_FireExtinguisher
// 0x0358 (0x0358 - 0x0000)
struct EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ConstParm, ReferenceParm)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_1;                   // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory_1; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_wasCancelled;                         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x0170(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0184(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Extinguishable_C>   K2Node_DynamicCast_AsI_Extinguishable;             // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B6[0x2];                                      // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x02C0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HitByExtinguisher_Void;                   // 0x034E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x034F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher) == 0x000008, "Wrong alignment on EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher");
static_assert(sizeof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher) == 0x000358, "Wrong size on EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, EntryPoint) == 0x000000, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::EntryPoint' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, Temp_object_Variable) == 0x000008, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, Temp_delegate_Variable) == 0x000018, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, Temp_bool_IsClosed_Variable) == 0x000028, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, Temp_bool_Has_Been_Initd_Variable) == 0x000029, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_IsLocallyControlled_ReturnValue) == 0x00002A, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, Temp_struct_Variable) == 0x000030, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, Temp_delegate_Variable_1) == 0x000040, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000050, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, Temp_struct_Variable_1) == 0x000058, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x000068, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_MakeArray_Array) == 0x000080, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000090, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000098, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_HasAuthority_ReturnValue) == 0x0000A4, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x0000B0, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x0000B8, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x0000C0, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_GetOwner_ReturnValue_1) == 0x0000D0, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_AsIAnim_Bp) == 0x0000D8, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x0000F0, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_bSuccess_2) == 0x0000F8, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, Temp_int_Array_Index_Variable) == 0x0000FC, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_AsIAnim_Bp_1) == 0x000100, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_AsIAnim_Bp_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_bSuccess_3) == 0x000110, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1) == 0x000118, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_GetSCT_Player_Character_CharacterInventory_1) == 0x000120, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_GetSCT_Player_Character_CharacterInventory_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_Event_wasCancelled) == 0x000128, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_Event_wasCancelled' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_GetForwardVector_ReturnValue) == 0x00012C, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000138, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_GetOwner_ReturnValue_2) == 0x000148, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_Add_VectorVector_ReturnValue) == 0x000150, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_AsCharacter) == 0x000160, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_bSuccess_4) == 0x000168, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_SphereTraceMultiForObjects_OutHits) == 0x000170, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_SphereTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_SphereTraceMultiForObjects_ReturnValue) == 0x000180, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_SphereTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_Array_Get_Item) == 0x000184, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_Array_Length_ReturnValue) == 0x000210, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_bBlockingHit) == 0x000214, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_bInitialOverlap) == 0x000215, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_Time) == 0x000218, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_Distance) == 0x00021C, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_Location) == 0x000220, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_ImpactPoint) == 0x00022C, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_Normal) == 0x000238, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_ImpactNormal) == 0x000244, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_PhysMat) == 0x000250, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_HitActor) == 0x000258, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_HitComponent) == 0x000260, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_HitBoneName) == 0x000268, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_HitItem) == 0x000270, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_FaceIndex) == 0x000274, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_TraceStart) == 0x000278, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_BreakHitResult_TraceEnd) == 0x000284, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_AsI_Extinguishable) == 0x000290, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_AsI_Extinguishable' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, K2Node_DynamicCast_bSuccess_5) == 0x0002A0, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_DoesImplementInterface_ReturnValue) == 0x0002A1, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_PostAkEvent_ReturnValue) == 0x0002A4, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_PostAkEvent_ReturnValue_1) == 0x0002A8, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_HasAuthority_ReturnValue_1) == 0x0002AC, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, Temp_int_Loop_Counter_Variable) == 0x0002B0, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_HasAuthority_ReturnValue_2) == 0x0002B4, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_Less_IntInt_ReturnValue) == 0x0002B5, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_Add_IntInt_ReturnValue) == 0x0002B8, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_IsDedicatedServer_ReturnValue) == 0x0002BC, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0002C0, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_HasAuthority_ReturnValue_3) == 0x00034C, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_IsLocallyControlled_ReturnValue_3) == 0x00034D, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_IsLocallyControlled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_HitByExtinguisher_Void) == 0x00034E, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_HitByExtinguisher_Void' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00034F, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000350, "Member 'EquipablePower_FireExtinguisher_C_ExecuteUbergraph_EquipablePower_FireExtinguisher::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function EquipablePower_FireExtinguisher.EquipablePower_FireExtinguisher_C.Deactivate
// 0x0001 (0x0001 - 0x0000)
struct EquipablePower_FireExtinguisher_C_Deactivate final
{
public:
	bool                                          WasCancelled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipablePower_FireExtinguisher_C_Deactivate) == 0x000001, "Wrong alignment on EquipablePower_FireExtinguisher_C_Deactivate");
static_assert(sizeof(EquipablePower_FireExtinguisher_C_Deactivate) == 0x000001, "Wrong size on EquipablePower_FireExtinguisher_C_Deactivate");
static_assert(offsetof(EquipablePower_FireExtinguisher_C_Deactivate, WasCancelled) == 0x000000, "Member 'EquipablePower_FireExtinguisher_C_Deactivate::WasCancelled' has a wrong offset!");

}

