#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCT_LogoWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FCT_LogoWI.FCT_LogoWI_C
// 0x0028 (0x0288 - 0x0260)
class UFCT_LogoWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Image_2095;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Removed;                                           // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMediaPlayer*                           LogoMediaPlayer;                                   // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Removed__DelegateSignature();
	void ExecuteUbergraph_FCT_LogoWI(int32 EntryPoint);
	void Close();
	void Construct();
	void SetPlatformRenderingDisabled(bool RenderingDisabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FCT_LogoWI_C">();
	}
	static class UFCT_LogoWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFCT_LogoWI_C>();
	}
};
static_assert(alignof(UFCT_LogoWI_C) == 0x000008, "Wrong alignment on UFCT_LogoWI_C");
static_assert(sizeof(UFCT_LogoWI_C) == 0x000288, "Wrong size on UFCT_LogoWI_C");
static_assert(offsetof(UFCT_LogoWI_C, UberGraphFrame) == 0x000260, "Member 'UFCT_LogoWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFCT_LogoWI_C, Image_2095) == 0x000268, "Member 'UFCT_LogoWI_C::Image_2095' has a wrong offset!");
static_assert(offsetof(UFCT_LogoWI_C, Removed) == 0x000270, "Member 'UFCT_LogoWI_C::Removed' has a wrong offset!");
static_assert(offsetof(UFCT_LogoWI_C, LogoMediaPlayer) == 0x000280, "Member 'UFCT_LogoWI_C::LogoMediaPlayer' has a wrong offset!");

}

