#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Footer_WI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Footer_WI.Footer_WI_C
// 0x0060 (0x02C0 - 0x0260)
class UFooter_WI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UButton*                                Button_0;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Back;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Main;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_0;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Back;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlockMainButton;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFooterMainButtonPressed;                         // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBackButtonPressed;                               // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAkComponent*                           Ak;                                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnFooterMainButtonPressed__DelegateSignature();
	void OnBackButtonPressed__DelegateSignature();
	void ExecuteUbergraph_Footer_WI(int32 EntryPoint);
	void BndEvt__Button_Back_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_Back_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Main_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void SetFooterButtonName(const class FText& InText);
	void HideMainButton();
	void HideBackButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Footer_WI_C">();
	}
	static class UFooter_WI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFooter_WI_C>();
	}
};
static_assert(alignof(UFooter_WI_C) == 0x000008, "Wrong alignment on UFooter_WI_C");
static_assert(sizeof(UFooter_WI_C) == 0x0002C0, "Wrong size on UFooter_WI_C");
static_assert(offsetof(UFooter_WI_C, UberGraphFrame) == 0x000260, "Member 'UFooter_WI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFooter_WI_C, Button_0) == 0x000268, "Member 'UFooter_WI_C::Button_0' has a wrong offset!");
static_assert(offsetof(UFooter_WI_C, Button_Back) == 0x000270, "Member 'UFooter_WI_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UFooter_WI_C, Button_Main) == 0x000278, "Member 'UFooter_WI_C::Button_Main' has a wrong offset!");
static_assert(offsetof(UFooter_WI_C, MenuButton_0) == 0x000280, "Member 'UFooter_WI_C::MenuButton_0' has a wrong offset!");
static_assert(offsetof(UFooter_WI_C, TextBlock_Back) == 0x000288, "Member 'UFooter_WI_C::TextBlock_Back' has a wrong offset!");
static_assert(offsetof(UFooter_WI_C, TextBlockMainButton) == 0x000290, "Member 'UFooter_WI_C::TextBlockMainButton' has a wrong offset!");
static_assert(offsetof(UFooter_WI_C, OnFooterMainButtonPressed) == 0x000298, "Member 'UFooter_WI_C::OnFooterMainButtonPressed' has a wrong offset!");
static_assert(offsetof(UFooter_WI_C, OnBackButtonPressed) == 0x0002A8, "Member 'UFooter_WI_C::OnBackButtonPressed' has a wrong offset!");
static_assert(offsetof(UFooter_WI_C, Ak) == 0x0002B8, "Member 'UFooter_WI_C::Ak' has a wrong offset!");

}

