#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ForceOpenDoorGA

#include "Basic.hpp"


namespace SDK::Params
{

// Function ForceOpenDoorGA.ForceOpenDoorGA_C.ExecuteUbergraph_ForceOpenDoorGA
// 0x00A0 (0x00A0 - 0x0000)
struct ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNetAuthority_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNetAuthority_ReturnValue_1;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_2;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNetAuthority_ReturnValue_2;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA) == 0x000008, "Wrong alignment on ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA");
static_assert(sizeof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA) == 0x0000A0, "Wrong size on ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, EntryPoint) == 0x000000, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_WaitDelay_ReturnValue) == 0x000018, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_K2_CommitAbility_ReturnValue) == 0x000021, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000028, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000030, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000038, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000048, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_GetController_ReturnValue) == 0x000058, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_GetController_ReturnValue_1) == 0x000060, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_IsNetAuthority_ReturnValue) == 0x000068, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_IsNetAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, K2Node_Event_bWasCancelled) == 0x000069, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue_2) == 0x000070, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_IsNetAuthority_ReturnValue_1) == 0x000078, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_IsNetAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, K2Node_DynamicCast_AsCharacter_SCTBP_2) == 0x000080, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::K2Node_DynamicCast_AsCharacter_SCTBP_2' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_GetController_ReturnValue_2) == 0x000090, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_GetController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA, CallFunc_IsNetAuthority_ReturnValue_2) == 0x000098, "Member 'ForceOpenDoorGA_C_ExecuteUbergraph_ForceOpenDoorGA::CallFunc_IsNetAuthority_ReturnValue_2' has a wrong offset!");

// Function ForceOpenDoorGA.ForceOpenDoorGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct ForceOpenDoorGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ForceOpenDoorGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on ForceOpenDoorGA_C_K2_OnEndAbility");
static_assert(sizeof(ForceOpenDoorGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on ForceOpenDoorGA_C_K2_OnEndAbility");
static_assert(offsetof(ForceOpenDoorGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'ForceOpenDoorGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function ForceOpenDoorGA.ForceOpenDoorGA_C.GetContextDescription
// 0x0018 (0x0018 - 0x0000)
struct ForceOpenDoorGA_C_GetContextDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(ForceOpenDoorGA_C_GetContextDescription) == 0x000008, "Wrong alignment on ForceOpenDoorGA_C_GetContextDescription");
static_assert(sizeof(ForceOpenDoorGA_C_GetContextDescription) == 0x000018, "Wrong size on ForceOpenDoorGA_C_GetContextDescription");
static_assert(offsetof(ForceOpenDoorGA_C_GetContextDescription, ReturnValue) == 0x000000, "Member 'ForceOpenDoorGA_C_GetContextDescription::ReturnValue' has a wrong offset!");

// Function ForceOpenDoorGA.ForceOpenDoorGA_C.StartAnimation
// 0x0018 (0x0018 - 0x0000)
struct ForceOpenDoorGA_C_StartAnimation final
{
public:
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ForceOpenDoorGA_C_StartAnimation) == 0x000008, "Wrong alignment on ForceOpenDoorGA_C_StartAnimation");
static_assert(sizeof(ForceOpenDoorGA_C_StartAnimation) == 0x000018, "Wrong size on ForceOpenDoorGA_C_StartAnimation");
static_assert(offsetof(ForceOpenDoorGA_C_StartAnimation, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000000, "Member 'ForceOpenDoorGA_C_StartAnimation::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_StartAnimation, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000008, "Member 'ForceOpenDoorGA_C_StartAnimation::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_StartAnimation, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ForceOpenDoorGA_C_StartAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ForceOpenDoorGA.ForceOpenDoorGA_C.EndAnimation
// 0x0018 (0x0018 - 0x0000)
struct ForceOpenDoorGA_C_EndAnimation final
{
public:
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ForceOpenDoorGA_C_EndAnimation) == 0x000008, "Wrong alignment on ForceOpenDoorGA_C_EndAnimation");
static_assert(sizeof(ForceOpenDoorGA_C_EndAnimation) == 0x000018, "Wrong size on ForceOpenDoorGA_C_EndAnimation");
static_assert(offsetof(ForceOpenDoorGA_C_EndAnimation, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000000, "Member 'ForceOpenDoorGA_C_EndAnimation::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_EndAnimation, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000008, "Member 'ForceOpenDoorGA_C_EndAnimation::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(ForceOpenDoorGA_C_EndAnimation, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ForceOpenDoorGA_C_EndAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

