#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FunctionLibrary_MatchBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "VertIndex_structs.hpp"
#include "SCT_structs.hpp"
#include "LineSegment_structs.hpp"
#include "EErrorSeverity_structs.hpp"
#include "Engine_structs.hpp"
#include "PassengerLogFactType_structs.hpp"


namespace SDK::Params
{

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.GetSCT Player Character
// 0x0030 (0x0030 - 0x0000)
struct FunctionLibrary_MatchBP_C_GetSCT_Player_Character final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      AsCharacter_SCT;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CharacterInventory;                                // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_MatchBP_C_GetSCT_Player_Character) == 0x000008, "Wrong alignment on FunctionLibrary_MatchBP_C_GetSCT_Player_Character");
static_assert(sizeof(FunctionLibrary_MatchBP_C_GetSCT_Player_Character) == 0x000030, "Wrong size on FunctionLibrary_MatchBP_C_GetSCT_Player_Character");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_Player_Character, __WorldContext) == 0x000000, "Member 'FunctionLibrary_MatchBP_C_GetSCT_Player_Character::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_Player_Character, AsCharacter_SCT) == 0x000008, "Member 'FunctionLibrary_MatchBP_C_GetSCT_Player_Character::AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_Player_Character, CharacterInventory) == 0x000010, "Member 'FunctionLibrary_MatchBP_C_GetSCT_Player_Character::CharacterInventory' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_Player_Character, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'FunctionLibrary_MatchBP_C_GetSCT_Player_Character::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_Player_Character, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000020, "Member 'FunctionLibrary_MatchBP_C_GetSCT_Player_Character::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_Player_Character, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'FunctionLibrary_MatchBP_C_GetSCT_Player_Character::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.GetSCT ItemWheel
// 0x0040 (0x0040 - 0x0000)
struct FunctionLibrary_MatchBP_C_GetSCT_ItemWheel final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemWheelV2WI_C*                       ItemWheelWI;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UModal*>                         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UModal*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemWheelV2WI_C*                       K2Node_DynamicCast_AsItem_Wheel_V2WI;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_MatchBP_C_GetSCT_ItemWheel) == 0x000008, "Wrong alignment on FunctionLibrary_MatchBP_C_GetSCT_ItemWheel");
static_assert(sizeof(FunctionLibrary_MatchBP_C_GetSCT_ItemWheel) == 0x000040, "Wrong size on FunctionLibrary_MatchBP_C_GetSCT_ItemWheel");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_ItemWheel, __WorldContext) == 0x000000, "Member 'FunctionLibrary_MatchBP_C_GetSCT_ItemWheel::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_ItemWheel, ItemWheelWI) == 0x000008, "Member 'FunctionLibrary_MatchBP_C_GetSCT_ItemWheel::ItemWheelWI' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_ItemWheel, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000010, "Member 'FunctionLibrary_MatchBP_C_GetSCT_ItemWheel::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_ItemWheel, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'FunctionLibrary_MatchBP_C_GetSCT_ItemWheel::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_ItemWheel, CallFunc_Array_Get_Item) == 0x000028, "Member 'FunctionLibrary_MatchBP_C_GetSCT_ItemWheel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_ItemWheel, K2Node_DynamicCast_AsItem_Wheel_V2WI) == 0x000030, "Member 'FunctionLibrary_MatchBP_C_GetSCT_ItemWheel::K2Node_DynamicCast_AsItem_Wheel_V2WI' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_ItemWheel, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'FunctionLibrary_MatchBP_C_GetSCT_ItemWheel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.GetSCT CharacterWidget
// 0x0038 (0x0038 - 0x0000)
struct FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterWI_C*                         CharacterWI;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCharacterWI_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCharacterWI_C*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget) == 0x000008, "Wrong alignment on FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget");
static_assert(sizeof(FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget) == 0x000038, "Wrong size on FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget, __WorldContext) == 0x000000, "Member 'FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget, CharacterWI) == 0x000008, "Member 'FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget::CharacterWI' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000018, "Member 'FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget, CallFunc_Array_Get_Item) == 0x000028, "Member 'FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000030, "Member 'FunctionLibrary_MatchBP_C_GetSCT_CharacterWidget::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.GetOwnerLocallyControlled
// 0x0030 (0x0030 - 0x0000)
struct FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocallyControlled;                               // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled) == 0x000008, "Wrong alignment on FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled");
static_assert(sizeof(FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled) == 0x000030, "Wrong size on FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled, Actor) == 0x000000, "Member 'FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled::Actor' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled, __WorldContext) == 0x000008, "Member 'FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled, IsLocallyControlled) == 0x000010, "Member 'FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled::IsLocallyControlled' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled, K2Node_DynamicCast_AsPawn) == 0x000020, "Member 'FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled, CallFunc_IsLocallyControlled_ReturnValue) == 0x000029, "Member 'FunctionLibrary_MatchBP_C_GetOwnerLocallyControlled::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.GetCharacterFromActorInfo
// 0x0030 (0x0030 - 0x0000)
struct FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo final
{
public:
	class UGameplayAbility*                       Gameplay_Ability;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      Character;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo) == 0x000008, "Wrong alignment on FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo");
static_assert(sizeof(FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo) == 0x000030, "Wrong size on FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo, Gameplay_Ability) == 0x000000, "Member 'FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo::Gameplay_Ability' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo, __WorldContext) == 0x000008, "Member 'FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo, Character) == 0x000010, "Member 'FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo::Character' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000020, "Member 'FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'FunctionLibrary_MatchBP_C_GetCharacterFromActorInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.GetPassengerLogFactByType
// 0x1588 (0x1588 - 0x0000)
struct FunctionLibrary_MatchBP_C_GetPassengerLogFactByType final
{
public:
	EPassengerLogFactType                         InFactType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPassengerLogFactType                         FactType;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlayerData>                    Players;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<struct FPlayerData>                    Personoids;                                        // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPlayerData>                    Residents;                                         // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPlayerData>                    Local;                                             // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPlayerData>                    Output;                                            // 0x0058(0x0010)(Edit, BlueprintVisible)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerData                            CallFunc_Array_Get_Item;                           // 0x0070(0x01E0)()
	struct FPlayerData                            CallFunc_Array_Get_Item_1;                         // 0x0250(0x01E0)()
	TArray<struct FPlayerData>                    K2Node_MakeArray_Array;                            // 0x0430(0x0010)(ReferenceParm)
	struct FPlayerData                            CallFunc_Array_Get_Item_2;                         // 0x0440(0x01E0)()
	struct FPlayerData                            CallFunc_Array_Get_Item_3;                         // 0x0620(0x01E0)()
	TArray<struct FPlayerData>                    K2Node_MakeArray_Array_1;                          // 0x0800(0x0010)(ReferenceParm)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_815[0x3];                                      // 0x0815(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerData                            CallFunc_Array_Get_Item_4;                         // 0x0818(0x01E0)()
	struct FPlayerData                            CallFunc_Array_Get_Item_5;                         // 0x09F8(0x01E0)()
	TArray<struct FPlayerData>                    K2Node_MakeArray_Array_2;                          // 0x0BD8(0x0010)(ReferenceParm)
	struct FPlayerData                            CallFunc_Array_Get_Item_6;                         // 0x0BE8(0x01E0)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0DC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DCC[0x4];                                      // 0x0DCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerData                            CallFunc_Array_Get_Item_7;                         // 0x0DD0(0x01E0)()
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0FB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB1[0x3];                                      // 0x0FB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0FB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerData                            CallFunc_Array_Get_Item_8;                         // 0x0FB8(0x01E0)()
	struct FPlayerData                            CallFunc_Array_Get_Item_9;                         // 0x1198(0x01E0)()
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x1378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x137C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerData                            CallFunc_Array_Get_Item_10;                        // 0x1380(0x01E0)()
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x1560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1561[0x3];                                     // 0x1561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x1564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPlayerData>                    CallFunc_GetPlayerInfoByFaction_Personoids;        // 0x1568(0x0010)(ReferenceParm)
	TArray<struct FPlayerData>                    CallFunc_GetPlayerInfoByFaction_Residents;         // 0x1578(0x0010)(ReferenceParm)
};
static_assert(alignof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType) == 0x000008, "Wrong alignment on FunctionLibrary_MatchBP_C_GetPassengerLogFactByType");
static_assert(sizeof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType) == 0x001588, "Wrong size on FunctionLibrary_MatchBP_C_GetPassengerLogFactByType");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, InFactType) == 0x000000, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::InFactType' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, __WorldContext) == 0x000008, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, FactType) == 0x000010, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::FactType' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, Players) == 0x000018, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::Players' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, Personoids) == 0x000028, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::Personoids' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, Residents) == 0x000038, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::Residents' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, Local) == 0x000048, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::Local' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, Output) == 0x000058, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::Output' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item) == 0x000070, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item_1) == 0x000250, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, K2Node_MakeArray_Array) == 0x000430, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item_2) == 0x000440, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item_3) == 0x000620, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, K2Node_MakeArray_Array_1) == 0x000800, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000810, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000814, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item_4) == 0x000818, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item_5) == 0x0009F8, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, K2Node_MakeArray_Array_2) == 0x000BD8, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item_6) == 0x000BE8, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Add_ReturnValue) == 0x000DC8, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item_7) == 0x000DD0, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_RemoveItem_ReturnValue) == 0x000FB0, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Add_ReturnValue_1) == 0x000FB4, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item_8) == 0x000FB8, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item_9) == 0x001198, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Add_ReturnValue_2) == 0x001378, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Add_ReturnValue_3) == 0x00137C, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Get_Item_10) == 0x001380, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Get_Item_10' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x001560, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_Array_Add_ReturnValue_4) == 0x001564, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_GetPlayerInfoByFaction_Personoids) == 0x001568, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_GetPlayerInfoByFaction_Personoids' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPassengerLogFactByType, CallFunc_GetPlayerInfoByFaction_Residents) == 0x001578, "Member 'FunctionLibrary_MatchBP_C_GetPassengerLogFactByType::CallFunc_GetPlayerInfoByFaction_Residents' has a wrong offset!");

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.FactTypeToText
// 0x00A8 (0x00A8 - 0x0000)
struct FunctionLibrary_MatchBP_C_FactTypeToText final
{
public:
	EPassengerLogFactType                         FactType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0010(0x0018)(Parm, OutParm)
	EPassengerLogFactType                         Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0090(0x0018)()
};
static_assert(alignof(FunctionLibrary_MatchBP_C_FactTypeToText) == 0x000008, "Wrong alignment on FunctionLibrary_MatchBP_C_FactTypeToText");
static_assert(sizeof(FunctionLibrary_MatchBP_C_FactTypeToText) == 0x0000A8, "Wrong size on FunctionLibrary_MatchBP_C_FactTypeToText");
static_assert(offsetof(FunctionLibrary_MatchBP_C_FactTypeToText, FactType) == 0x000000, "Member 'FunctionLibrary_MatchBP_C_FactTypeToText::FactType' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_FactTypeToText, __WorldContext) == 0x000008, "Member 'FunctionLibrary_MatchBP_C_FactTypeToText::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_FactTypeToText, Text) == 0x000010, "Member 'FunctionLibrary_MatchBP_C_FactTypeToText::Text' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_FactTypeToText, Temp_byte_Variable) == 0x000028, "Member 'FunctionLibrary_MatchBP_C_FactTypeToText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_FactTypeToText, Temp_text_Variable) == 0x000030, "Member 'FunctionLibrary_MatchBP_C_FactTypeToText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_FactTypeToText, Temp_text_Variable_1) == 0x000048, "Member 'FunctionLibrary_MatchBP_C_FactTypeToText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_FactTypeToText, Temp_text_Variable_2) == 0x000060, "Member 'FunctionLibrary_MatchBP_C_FactTypeToText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_FactTypeToText, Temp_text_Variable_3) == 0x000078, "Member 'FunctionLibrary_MatchBP_C_FactTypeToText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_FactTypeToText, K2Node_Select_Default) == 0x000090, "Member 'FunctionLibrary_MatchBP_C_FactTypeToText::K2Node_Select_Default' has a wrong offset!");

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.GetPlayerInfoByFaction
// 0x0380 (0x0380 - 0x0000)
struct FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPlayerData>                    Personoids;                                        // 0x0008(0x0010)(Parm, OutParm)
	TArray<struct FPlayerData>                    Residents;                                         // 0x0018(0x0010)(Parm, OutParm)
	TArray<struct FPlayerData>                    OthersArray;                                       // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPlayerData>                    ResidentsArray;                                    // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPlayerData>                    PersonoidsArray;                                   // 0x0048(0x0010)(Edit, BlueprintVisible)
	class UPlayerInfoGIS*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlayerData>                    CallFunc_GetAllPlayerData_ReturnValue;             // 0x0068(0x0010)(ReferenceParm)
	struct FPlayerData                            CallFunc_Array_Get_Item;                           // 0x0078(0x01E0)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0260(0x0018)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0288(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02C8(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02E8(0x0040)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0330(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0340(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction) == 0x000008, "Wrong alignment on FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction");
static_assert(sizeof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction) == 0x000380, "Wrong size on FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, __WorldContext) == 0x000000, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, Personoids) == 0x000008, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::Personoids' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, Residents) == 0x000018, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::Residents' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, OthersArray) == 0x000028, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::OthersArray' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, ResidentsArray) == 0x000038, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::ResidentsArray' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, PersonoidsArray) == 0x000048, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::PersonoidsArray' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, Temp_int_Array_Index_Variable) == 0x000060, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_GetAllPlayerData_ReturnValue) == 0x000068, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_GetAllPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_Array_Get_Item) == 0x000078, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_Array_Length_ReturnValue) == 0x000258, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_Conv_StringToText_ReturnValue) == 0x000260, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000278, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, K2Node_MakeStruct_FormatArgumentData) == 0x000288, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002C8, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, K2Node_SwitchEnum_CmpSuccess) == 0x0002E0, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002E8, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, Temp_int_Loop_Counter_Variable) == 0x000328, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, K2Node_MakeArray_Array) == 0x000330, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_Format_ReturnValue) == 0x000340, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_Less_IntInt_ReturnValue) == 0x000358, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_Conv_TextToString_ReturnValue) == 0x000360, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_Add_IntInt_ReturnValue) == 0x000370, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_Array_Add_ReturnValue) == 0x000374, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction, CallFunc_Array_Add_ReturnValue_1) == 0x000378, "Member 'FunctionLibrary_MatchBP_C_GetPlayerInfoByFaction::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.GetAllPawnsExceptSelf
// 0x0060 (0x0060 - 0x0000)
struct FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APawn*>                          OtherPawns;                                        // 0x0010(0x0010)(Parm, OutParm)
	TArray<class APawn*>                          L_Pawns;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf) == 0x000008, "Wrong alignment on FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf");
static_assert(sizeof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf) == 0x000060, "Wrong size on FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, Pawn) == 0x000000, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::Pawn' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, __WorldContext) == 0x000008, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, OtherPawns) == 0x000010, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::OtherPawns' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, L_Pawns) == 0x000020, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::L_Pawns' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, CallFunc_GetGameState_ReturnValue) == 0x000030, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, Temp_int_Array_Index_Variable) == 0x000038, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, CallFunc_Array_Get_Item) == 0x000040, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000050, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'FunctionLibrary_MatchBP_C_GetAllPawnsExceptSelf::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.VendelWarning
// 0x00A0 (0x00A0 - 0x0000)
struct FunctionLibrary_MatchBP_C_VendelWarning final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EErrorSeverity                                ErrorSeverity;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ErrorColor;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_MatchBP_C_VendelWarning) == 0x000008, "Wrong alignment on FunctionLibrary_MatchBP_C_VendelWarning");
static_assert(sizeof(FunctionLibrary_MatchBP_C_VendelWarning) == 0x0000A0, "Wrong size on FunctionLibrary_MatchBP_C_VendelWarning");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, InString) == 0x000000, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::InString' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, ErrorSeverity) == 0x000010, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::ErrorSeverity' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, __WorldContext) == 0x000018, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, ErrorColor) == 0x000020, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::ErrorColor' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000048, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000068, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000078, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000088, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_MatchBP_C_VendelWarning, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'FunctionLibrary_MatchBP_C_VendelWarning::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_MatchBP.FunctionLibrary_MatchBP_C.SetGamepadFocus
// 0x0060 (0x0060 - 0x0000)
struct FunctionLibrary_MatchBP_C_SetGamepadFocus final
{
public:
	class UWidget*                                WidgetToFocus;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFocusHandlerWI_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UFocusHandlerWI_C*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
