#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FunctionLibrary_SCTBP

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "E_PickupAudioSource_structs.hpp"
#include "AkAudio_structs.hpp"
#include "S_TutorialContent_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.RunFireForgetProgressbar
// 0x0040 (0x0040 - 0x0000)
struct FunctionLibrary_SCTBP_C_RunFireForgetProgressbar final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OptionalDescriptor;                                // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Reverse;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGenericProgressBarWI_TempFix_C*        CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbar) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_RunFireForgetProgressbar");
static_assert(sizeof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbar) == 0x000040, "Wrong size on FunctionLibrary_SCTBP_C_RunFireForgetProgressbar");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbar, Duration) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbar::Duration' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbar, OptionalDescriptor) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbar::OptionalDescriptor' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbar, Reverse) == 0x000018, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbar::Reverse' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbar, __WorldContext) == 0x000020, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbar::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbar, CallFunc_IsDedicatedServer_ReturnValue) == 0x000028, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbar::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbar, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000030, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbar::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbar, CallFunc_Create_ReturnValue) == 0x000038, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbar::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.CancelFireForgetProgressbar
// 0x0048 (0x0048 - 0x0000)
struct FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGenericProgressBarWI_TempFix_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGenericProgressBarWI_TempFix_C*        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar");
static_assert(sizeof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar) == 0x000048, "Wrong size on FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar, __WorldContext) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000C, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000018, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000020, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar, Temp_int_Array_Index_Variable) == 0x000030, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar, CallFunc_Array_Get_Item) == 0x000038, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.LockActorMovement
// 0x0028 (0x0028 - 0x0000)
struct FunctionLibrary_SCTBP_C_LockActorMovement final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_LockActorMovement) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_LockActorMovement");
static_assert(sizeof(FunctionLibrary_SCTBP_C_LockActorMovement) == 0x000028, "Wrong size on FunctionLibrary_SCTBP_C_LockActorMovement");
static_assert(offsetof(FunctionLibrary_SCTBP_C_LockActorMovement, Target) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_LockActorMovement::Target' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_LockActorMovement, __WorldContext) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_LockActorMovement::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_LockActorMovement, ReturnValue) == 0x000010, "Member 'FunctionLibrary_SCTBP_C_LockActorMovement::ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_LockActorMovement, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'FunctionLibrary_SCTBP_C_LockActorMovement::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_LockActorMovement, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000020, "Member 'FunctionLibrary_SCTBP_C_LockActorMovement::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.UnlockActorMovement
// 0x0020 (0x0020 - 0x0000)
struct FunctionLibrary_SCTBP_C_UnlockActorMovement final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_UnlockActorMovement) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_UnlockActorMovement");
static_assert(sizeof(FunctionLibrary_SCTBP_C_UnlockActorMovement) == 0x000020, "Wrong size on FunctionLibrary_SCTBP_C_UnlockActorMovement");
static_assert(offsetof(FunctionLibrary_SCTBP_C_UnlockActorMovement, Target) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_UnlockActorMovement::Target' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_UnlockActorMovement, __WorldContext) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_UnlockActorMovement::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_UnlockActorMovement, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'FunctionLibrary_SCTBP_C_UnlockActorMovement::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_UnlockActorMovement, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x000018, "Member 'FunctionLibrary_SCTBP_C_UnlockActorMovement::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.PostMessageSelfSCT
// 0x0058 (0x0058 - 0x0000)
struct FunctionLibrary_SCTBP_C_PostMessageSelfSCT final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCharacterWI_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCharacterWI_C*                         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_PostMessageSelfSCT");
static_assert(sizeof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT) == 0x000058, "Wrong size on FunctionLibrary_SCTBP_C_PostMessageSelfSCT");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT, Duration) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_PostMessageSelfSCT::Duration' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT, Text) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_PostMessageSelfSCT::Text' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT, __WorldContext) == 0x000020, "Member 'FunctionLibrary_SCTBP_C_PostMessageSelfSCT::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'FunctionLibrary_SCTBP_C_PostMessageSelfSCT::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT, CallFunc_IsDedicatedServer_ReturnValue) == 0x000030, "Member 'FunctionLibrary_SCTBP_C_PostMessageSelfSCT::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000038, "Member 'FunctionLibrary_SCTBP_C_PostMessageSelfSCT::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT, CallFunc_Array_Get_Item) == 0x000048, "Member 'FunctionLibrary_SCTBP_C_PostMessageSelfSCT::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000050, "Member 'FunctionLibrary_SCTBP_C_PostMessageSelfSCT::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSelfSCT, CallFunc_IsInViewport_ReturnValue) == 0x000051, "Member 'FunctionLibrary_SCTBP_C_PostMessageSelfSCT::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.AddScoreSCT
// 0x0030 (0x0030 - 0x0000)
struct FunctionLibrary_SCTBP_C_AddScoreSCT final
{
public:
	class FName                                   DataTableRowName;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEndScenario__IgnoreDataTable_;                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EndScenarioScore;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                PlayerState;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_AddScoreSCT) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_AddScoreSCT");
static_assert(sizeof(FunctionLibrary_SCTBP_C_AddScoreSCT) == 0x000030, "Wrong size on FunctionLibrary_SCTBP_C_AddScoreSCT");
static_assert(offsetof(FunctionLibrary_SCTBP_C_AddScoreSCT, DataTableRowName) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_AddScoreSCT::DataTableRowName' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_AddScoreSCT, IsEndScenario__IgnoreDataTable_) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_AddScoreSCT::IsEndScenario__IgnoreDataTable_' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_AddScoreSCT, EndScenarioScore) == 0x00000C, "Member 'FunctionLibrary_SCTBP_C_AddScoreSCT::EndScenarioScore' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_AddScoreSCT, PlayerState) == 0x000010, "Member 'FunctionLibrary_SCTBP_C_AddScoreSCT::PlayerState' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_AddScoreSCT, __WorldContext) == 0x000018, "Member 'FunctionLibrary_SCTBP_C_AddScoreSCT::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_AddScoreSCT, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP) == 0x000020, "Member 'FunctionLibrary_SCTBP_C_AddScoreSCT::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_AddScoreSCT, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'FunctionLibrary_SCTBP_C_AddScoreSCT::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.GetPlayerStatesSCT
// 0x0068 (0x0068 - 0x0000)
struct FunctionLibrary_SCTBP_C_GetPlayerStatesSCT final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASCTPlayerState_MatchBP_C*>      SCT_Match_PlayerStates;                            // 0x0008(0x0010)(Parm, OutParm)
	TArray<class ASCTPlayerState_MatchBP_C*>      L_PlayerStates;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_GetPlayerStatesSCT");
static_assert(sizeof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT) == 0x000068, "Wrong size on FunctionLibrary_SCTBP_C_GetPlayerStatesSCT");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, __WorldContext) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, SCT_Match_PlayerStates) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::SCT_Match_PlayerStates' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, L_PlayerStates) == 0x000018, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::L_PlayerStates' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, CallFunc_GetGameState_ReturnValue) == 0x000028, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, Temp_int_Array_Index_Variable) == 0x000030, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, CallFunc_Array_Get_Item) == 0x000038, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP) == 0x000048, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetPlayerStatesSCT, CallFunc_Array_AddUnique_ReturnValue) == 0x000060, "Member 'FunctionLibrary_SCTBP_C_GetPlayerStatesSCT::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.PostMessageSpecifiedControllerSCT
// 0x0060 (0x0060 - 0x0000)
struct FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class APlayerController*                      PlayerController;                                  // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCharacterWI_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterWI_C*                         CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT");
static_assert(sizeof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT) == 0x000060, "Wrong size on FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT, Duration) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT::Duration' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT, Text) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT::Text' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT, PlayerController) == 0x000020, "Member 'FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT::PlayerController' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT, __WorldContext) == 0x000028, "Member 'FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000038, "Member 'FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000048, "Member 'FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT, CallFunc_Array_Get_Item) == 0x000050, "Member 'FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT, CallFunc_IsInViewport_ReturnValue) == 0x000058, "Member 'FunctionLibrary_SCTBP_C_PostMessageSpecifiedControllerSCT::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.RunFireForgetProgressbarSpecific
// 0x0048 (0x0048 - 0x0000)
struct FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OptionalDescriptor;                                // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                PlayerController;                                  // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UModal*                                 CallFunc_GetModal_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterWI_C*                         CallFunc_GetSCT_CharacterWidget_CharacterWI;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific");
static_assert(sizeof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific) == 0x000048, "Wrong size on FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific, Duration) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific::Duration' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific, OptionalDescriptor) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific::OptionalDescriptor' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific, PlayerController) == 0x000018, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific::PlayerController' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific, __WorldContext) == 0x000020, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000028, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific, CallFunc_GetModal_ReturnValue) == 0x000030, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific::CallFunc_GetModal_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific, CallFunc_GetSCT_CharacterWidget_CharacterWI) == 0x000038, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific::CallFunc_GetSCT_CharacterWidget_CharacterWI' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'FunctionLibrary_SCTBP_C_RunFireForgetProgressbarSpecific::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.CancelFireForgetProgressbarSpecific
// 0x0050 (0x0050 - 0x0000)
struct FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific final
{
public:
	class UObject*                                PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGenericProgressBarWI_TempFix_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGenericProgressBarWI_TempFix_C*        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific");
static_assert(sizeof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific) == 0x000050, "Wrong size on FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, PlayerController) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::PlayerController' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, __WorldContext) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, Temp_int_Array_Index_Variable) == 0x000010, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, CallFunc_IsDedicatedServer_ReturnValue) == 0x000014, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000018, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000020, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, CallFunc_Array_Get_Item) == 0x000038, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'FunctionLibrary_SCTBP_C_CancelFireForgetProgressbarSpecific::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.GetTutorialDataFromRowName
// 0x00B8 (0x00B8 - 0x0000)
struct FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TutorialContent                     Out_Row;                                           // 0x0010(0x0050)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_TutorialContent                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0050)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName");
static_assert(sizeof(FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName) == 0x0000B8, "Wrong size on FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName, RowName) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName::RowName' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName, __WorldContext) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName, Out_Row) == 0x000010, "Member 'FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName::Out_Row' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B0, "Member 'FunctionLibrary_SCTBP_C_GetTutorialDataFromRowName::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.GetRandomGeneratorClass
// 0x00E0 (0x00E0 - 0x0000)
struct FunctionLibrary_SCTBP_C_GetRandomGeneratorClass final
{
public:
	TMap<class UClass*, int32>                    WeightMap;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OutputPin;                                         // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Offset;                                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetValue;                                       // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ValueSum;                                          // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         CallFunc_Map_Keys_Keys;                            // 0x0070(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_GetRandomGeneratorClass");
static_assert(sizeof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass) == 0x0000E0, "Wrong size on FunctionLibrary_SCTBP_C_GetRandomGeneratorClass");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, WeightMap) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::WeightMap' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, __WorldContext) == 0x000050, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, OutputPin) == 0x000058, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::OutputPin' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, Offset) == 0x000060, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::Offset' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, TargetValue) == 0x000064, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::TargetValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, ValueSum) == 0x000068, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::ValueSum' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Map_Keys_Keys) == 0x000070, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Map_Values_Values) == 0x000088, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, Temp_int_Array_Index_Variable) == 0x00009C, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Array_Get_Item) == 0x0000A4, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, Temp_int_Loop_Counter_Variable_1) == 0x0000A8, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AC, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000B0, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B4, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, Temp_int_Array_Index_Variable_1) == 0x0000B8, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000BC, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Map_Find_Value) == 0x0000C8, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Map_Find_ReturnValue) == 0x0000CC, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000D0, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000D4, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_GetRandomGeneratorClass, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'FunctionLibrary_SCTBP_C_GetRandomGeneratorClass::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_SCTBP.FunctionLibrary_SCTBP_C.Play Sound 2D Wise
// 0x0048 (0x0048 - 0x0000)
struct FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise) == 0x000008, "Wrong alignment on FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise");
static_assert(sizeof(FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise) == 0x000048, "Wrong size on FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise");
static_assert(offsetof(FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise, AkEvent) == 0x000000, "Member 'FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise::AkEvent' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise, __WorldContext) == 0x000008, "Member 'FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise, Temp_struct_Variable) == 0x000010, "Member 'FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise, Temp_delegate_Variable) == 0x000020, "Member 'FunctionLibrary_SCTBP_C_Play_Sound_2D_Wise::Temp_delegate_Variable' has a wrong offset!");
