#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadScrollUtilityWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function GamepadScrollUtilityWI.GamepadScrollUtilityWI_C.OnGamepadScrolled__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct GamepadScrollUtilityWI_C_OnGamepadScrolled__DelegateSignature final
{
public:
	float                                         CurrentOffset;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadScrollUtilityWI_C_OnGamepadScrolled__DelegateSignature) == 0x000004, "Wrong alignment on GamepadScrollUtilityWI_C_OnGamepadScrolled__DelegateSignature");
static_assert(sizeof(GamepadScrollUtilityWI_C_OnGamepadScrolled__DelegateSignature) == 0x000004, "Wrong size on GamepadScrollUtilityWI_C_OnGamepadScrolled__DelegateSignature");
static_assert(offsetof(GamepadScrollUtilityWI_C_OnGamepadScrolled__DelegateSignature, CurrentOffset) == 0x000000, "Member 'GamepadScrollUtilityWI_C_OnGamepadScrolled__DelegateSignature::CurrentOffset' has a wrong offset!");

// Function GamepadScrollUtilityWI.GamepadScrollUtilityWI_C.ExecuteUbergraph_GamepadScrollUtilityWI
// 0x0008 (0x0008 - 0x0000)
struct GamepadScrollUtilityWI_C_ExecuteUbergraph_GamepadScrollUtilityWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ScrollValue;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadScrollUtilityWI_C_ExecuteUbergraph_GamepadScrollUtilityWI) == 0x000004, "Wrong alignment on GamepadScrollUtilityWI_C_ExecuteUbergraph_GamepadScrollUtilityWI");
static_assert(sizeof(GamepadScrollUtilityWI_C_ExecuteUbergraph_GamepadScrollUtilityWI) == 0x000008, "Wrong size on GamepadScrollUtilityWI_C_ExecuteUbergraph_GamepadScrollUtilityWI");
static_assert(offsetof(GamepadScrollUtilityWI_C_ExecuteUbergraph_GamepadScrollUtilityWI, EntryPoint) == 0x000000, "Member 'GamepadScrollUtilityWI_C_ExecuteUbergraph_GamepadScrollUtilityWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_ExecuteUbergraph_GamepadScrollUtilityWI, K2Node_Event_ScrollValue) == 0x000004, "Member 'GamepadScrollUtilityWI_C_ExecuteUbergraph_GamepadScrollUtilityWI::K2Node_Event_ScrollValue' has a wrong offset!");

// Function GamepadScrollUtilityWI.GamepadScrollUtilityWI_C.OnGamepadScroll
// 0x0004 (0x0004 - 0x0000)
struct GamepadScrollUtilityWI_C_OnGamepadScroll final
{
public:
	float                                         ScrollValue;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadScrollUtilityWI_C_OnGamepadScroll) == 0x000004, "Wrong alignment on GamepadScrollUtilityWI_C_OnGamepadScroll");
static_assert(sizeof(GamepadScrollUtilityWI_C_OnGamepadScroll) == 0x000004, "Wrong size on GamepadScrollUtilityWI_C_OnGamepadScroll");
static_assert(offsetof(GamepadScrollUtilityWI_C_OnGamepadScroll, ScrollValue) == 0x000000, "Member 'GamepadScrollUtilityWI_C_OnGamepadScroll::ScrollValue' has a wrong offset!");

// Function GamepadScrollUtilityWI.GamepadScrollUtilityWI_C.PerformScroll
// 0x0044 (0x0044 - 0x0000)
struct GamepadScrollUtilityWI_C_PerformScroll final
{
public:
	float                                         ScrollValue;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DesiredScrollRate;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue_2;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GamepadScrollUtilityWI_C_PerformScroll) == 0x000004, "Wrong alignment on GamepadScrollUtilityWI_C_PerformScroll");
static_assert(sizeof(GamepadScrollUtilityWI_C_PerformScroll) == 0x000044, "Wrong size on GamepadScrollUtilityWI_C_PerformScroll");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, ScrollValue) == 0x000000, "Member 'GamepadScrollUtilityWI_C_PerformScroll::ScrollValue' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, DesiredScrollRate) == 0x000004, "Member 'GamepadScrollUtilityWI_C_PerformScroll::DesiredScrollRate' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000010, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_GetScrollOffset_ReturnValue) == 0x00001C, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000024, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_BooleanAND_ReturnValue) == 0x00002C, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_GetScrollOffset_ReturnValue_1) == 0x000030, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_GetScrollOffset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000034, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_GetScrollOffset_ReturnValue_2) == 0x000038, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_GetScrollOffset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GamepadScrollUtilityWI_C_PerformScroll, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'GamepadScrollUtilityWI_C_PerformScroll::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

