#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericInteractionSkillSecondaryGA

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function GenericInteractionSkillSecondaryGA.GenericInteractionSkillSecondaryGA_C.ExecuteUbergraph_GenericInteractionSkillSecondaryGA
// 0x0038 (0x0038 - 0x0000)
struct GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA) == 0x000008, "Wrong alignment on GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA");
static_assert(sizeof(GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA) == 0x000038, "Wrong size on GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA, EntryPoint) == 0x000000, "Member 'GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000010, "Member 'GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000018, "Member 'GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000028, "Member 'GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'GenericInteractionSkillSecondaryGA_C_ExecuteUbergraph_GenericInteractionSkillSecondaryGA::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GenericInteractionSkillSecondaryGA.GenericInteractionSkillSecondaryGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GenericInteractionSkillSecondaryGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GenericInteractionSkillSecondaryGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GenericInteractionSkillSecondaryGA_C_K2_OnEndAbility");
static_assert(sizeof(GenericInteractionSkillSecondaryGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on GenericInteractionSkillSecondaryGA_C_K2_OnEndAbility");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GenericInteractionSkillSecondaryGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GenericInteractionSkillSecondaryGA.GenericInteractionSkillSecondaryGA_C.K2_CanUseContextSpec
// 0x00C8 (0x00C8 - 0x0000)
struct GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec final
{
public:
	struct FContextSpec                           Spec;                                              // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasValidInteractionComponent_ReturnValue; // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec) == 0x000008, "Wrong alignment on GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec");
static_assert(sizeof(GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec) == 0x0000C8, "Wrong size on GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec, Spec) == 0x000000, "Member 'GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec::Spec' has a wrong offset!");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec, ReturnValue) == 0x0000C0, "Member 'GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec::ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec, CallFunc_HasValidInteractionComponent_ReturnValue) == 0x0000C1, "Member 'GenericInteractionSkillSecondaryGA_C_K2_CanUseContextSpec::CallFunc_HasValidInteractionComponent_ReturnValue' has a wrong offset!");

}

