#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HatPickup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HatPickup.HatPickup_C.ExecuteUbergraph_HatPickup
// 0x02C8 (0x02C8 - 0x0000)
struct HatPickup_C_ExecuteUbergraph_HatPickup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0020(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        CallFunc_GetSCTPlayerState_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00F8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVruumbaSCTBP_C*                        K2Node_DynamicCast_AsVruumba_SCTBP;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_for_new_flagholder_NewHolder;       // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTGameState*                          CallFunc_Get_SCT_Game_State_Game_State;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchEnded_ReturnValue;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHatTagWI_C*>                    CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x01C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UHatTagWI_C*                            CallFunc_Array_Get_Item;                           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVruumbaSCTBP_C*                        K2Node_DynamicCast_AsVruumba_SCTBP_1;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAliveBPI_Alive;                         // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT_1;             // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAliveBPI_Alive_1;                       // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_233[0x5];                                      // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0240(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT_2;             // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAliveBPI_Alive_2;                       // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0268(0x0010)(ConstParm, ReferenceParm)
	class AHatStand_C*                            CallFunc_GetActorOfClass_ReturnValue;              // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPOI_WI_HatTag_C*>               CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0288(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPOI_WI_HatTag_C*                       CallFunc_Array_Get_Item_1;                         // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HatPickup_C_ExecuteUbergraph_HatPickup) == 0x000008, "Wrong alignment on HatPickup_C_ExecuteUbergraph_HatPickup");
static_assert(sizeof(HatPickup_C_ExecuteUbergraph_HatPickup) == 0x0002C8, "Wrong size on HatPickup_C_ExecuteUbergraph_HatPickup");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, EntryPoint) == 0x000000, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::EntryPoint' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_MakeStruct_SlateBrush) == 0x000020, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_GetSCTPlayerState_ReturnValue) == 0x0000B0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_GetSCTPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_GetPlayerName_ReturnValue) == 0x0000C0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_HasAuthority_ReturnValue) == 0x0000D0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_HasAuthority_ReturnValue_1) == 0x0000D1, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000D8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_ComponentBoundEvent_OtherActor) == 0x0000E0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_ComponentBoundEvent_OtherComp) == 0x0000E8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000F0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000F4, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_ComponentBoundEvent_SweepResult) == 0x0000F8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_DynamicCast_AsVruumba_SCTBP) == 0x000188, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_DynamicCast_AsVruumba_SCTBP' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_Check_for_new_flagholder_NewHolder) == 0x000191, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_Check_for_new_flagholder_NewHolder' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000198, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_DoesSocketExist_ReturnValue) == 0x0001A0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, Temp_int_Variable) == 0x0001A4, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_Add_IntInt_ReturnValue) == 0x0001A8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_HasAuthority_ReturnValue_2) == 0x0001AC, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_Get_SCT_Game_State_Game_State) == 0x0001B0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_Get_SCT_Game_State_Game_State' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_HasMatchEnded_ReturnValue) == 0x0001B8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_HasMatchEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001BC, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0001C8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_Array_Get_Item) == 0x0001D8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_Array_Length_ReturnValue) == 0x0001E0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_Less_IntInt_ReturnValue) == 0x0001E4, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_IsValid_ReturnValue_2) == 0x0001E5, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0001E8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_DynamicCast_AsICharacter_SCT) == 0x0001F0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_DynamicCast_AsVruumba_SCTBP_1) == 0x000208, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_DynamicCast_AsVruumba_SCTBP_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_DynamicCast_bSuccess_2) == 0x000210, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_IsAliveBPI_Alive) == 0x000211, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_IsAliveBPI_Alive' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000218, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_DynamicCast_AsICharacter_SCT_1) == 0x000220, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_DynamicCast_AsICharacter_SCT_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_DynamicCast_bSuccess_3) == 0x000230, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000231, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_IsAliveBPI_Alive_1) == 0x000232, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_IsAliveBPI_Alive_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_GetPlayerCharacter_ReturnValue_2) == 0x000238, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_GetPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, Temp_delegate_Variable) == 0x000240, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_DynamicCast_AsICharacter_SCT_2) == 0x000250, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_DynamicCast_AsICharacter_SCT_2' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_DynamicCast_bSuccess_4) == 0x000260, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_IsAliveBPI_Alive_2) == 0x000261, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_IsAliveBPI_Alive_2' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, Temp_struct_Variable) == 0x000268, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_GetActorOfClass_ReturnValue) == 0x000278, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_PostAkEvent_ReturnValue) == 0x000280, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_IsValid_ReturnValue_3) == 0x000284, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, Temp_bool_Has_Been_Initd_Variable) == 0x000285, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000288, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_Array_Get_Item_1) == 0x000298, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_IsValid_ReturnValue_4) == 0x0002A0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_HasAuthority_ReturnValue_3) == 0x0002A1, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002A4, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0002B8, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, CallFunc_HasAuthority_ReturnValue_4) == 0x0002C0, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HatPickup_C_ExecuteUbergraph_HatPickup, Temp_bool_IsClosed_Variable) == 0x0002C1, "Member 'HatPickup_C_ExecuteUbergraph_HatPickup::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function HatPickup.HatPickup_C.BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'HatPickup_C_BndEvt__Radius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function HatPickup.HatPickup_C.Check for new flagholder
// 0x0020 (0x0020 - 0x0000)
struct HatPickup_C_Check_for_new_flagholder final
{
public:
	class UObject*                                NewFlagHolder;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewHolder;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVruumbaSCTBP_C*                        K2Node_DynamicCast_AsVruumba_SCTBP;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HatPickup_C_Check_for_new_flagholder) == 0x000008, "Wrong alignment on HatPickup_C_Check_for_new_flagholder");
static_assert(sizeof(HatPickup_C_Check_for_new_flagholder) == 0x000020, "Wrong size on HatPickup_C_Check_for_new_flagholder");
static_assert(offsetof(HatPickup_C_Check_for_new_flagholder, NewFlagHolder) == 0x000000, "Member 'HatPickup_C_Check_for_new_flagholder::NewFlagHolder' has a wrong offset!");
static_assert(offsetof(HatPickup_C_Check_for_new_flagholder, NewHolder) == 0x000008, "Member 'HatPickup_C_Check_for_new_flagholder::NewHolder' has a wrong offset!");
static_assert(offsetof(HatPickup_C_Check_for_new_flagholder, K2Node_DynamicCast_AsVruumba_SCTBP) == 0x000010, "Member 'HatPickup_C_Check_for_new_flagholder::K2Node_DynamicCast_AsVruumba_SCTBP' has a wrong offset!");
