#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HatStand

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HatStand.HatStand_C.ExecuteUbergraph_HatStand
// 0x0190 (0x0190 - 0x0000)
struct HatStand_C_ExecuteUbergraph_HatStand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x002C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00B8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_144[0xC];                                      // 0x0144(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHatPickup_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HatStand_C_ExecuteUbergraph_HatStand) == 0x000010, "Wrong alignment on HatStand_C_ExecuteUbergraph_HatStand");
static_assert(sizeof(HatStand_C_ExecuteUbergraph_HatStand) == 0x000190, "Wrong size on HatStand_C_ExecuteUbergraph_HatStand");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, EntryPoint) == 0x000000, "Member 'HatStand_C_ExecuteUbergraph_HatStand::EntryPoint' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_MapRangeClamped_ReturnValue) == 0x000004, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_HasAuthority_ReturnValue) == 0x000014, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000018, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_MakeRotator_ReturnValue) == 0x00001C, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_HasAuthority_ReturnValue_1) == 0x000028, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_IsDedicatedServer_ReturnValue) == 0x000029, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00002C, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000B8, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000150, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatStand_C_ExecuteUbergraph_HatStand, CallFunc_FinishSpawningActor_ReturnValue) == 0x000188, "Member 'HatStand_C_ExecuteUbergraph_HatStand::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

