#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HatStand

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HatStand.HatStand_C
// 0x0068 (0x0288 - 0x0220)
class AHatStand_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UStaticMeshComponent*                   Arrow1;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Arrow;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FlagHolder;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Rotation_Location_CCD917894C436EB3D921ABA7E44FC014; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Rotation__Direction_CCD917894C436EB3D921ABA7E44FC014; // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Rotation;                                          // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Location_Location_3B70CD5F432FD04A9DD07CA6BE1E9FE2; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Location__Direction_3B70CD5F432FD04A9DD07CA6BE1E9FE2; // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Location;                                          // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVruumbaSCTBP_C*                        VruumbaHolder;                                     // 0x0270(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVruumbaSCTBP_C*                        PrevVruumbaHolder;                                 // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameStarted;                                       // 0x0280(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HatType;                                           // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HatStand(int32 EntryPoint);
	void Picked_up();
	void ReceiveBeginPlay();
	void Rotation__UpdateFunc();
	void Rotation__FinishedFunc();
	void Location__UpdateFunc();
	void Location__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HatStand_C">();
	}
	static class AHatStand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHatStand_C>();
	}
};
static_assert(alignof(AHatStand_C) == 0x000008, "Wrong alignment on AHatStand_C");
static_assert(sizeof(AHatStand_C) == 0x000288, "Wrong size on AHatStand_C");
static_assert(offsetof(AHatStand_C, UberGraphFrame) == 0x000220, "Member 'AHatStand_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHatStand_C, Arrow1) == 0x000228, "Member 'AHatStand_C::Arrow1' has a wrong offset!");
static_assert(offsetof(AHatStand_C, Arrow) == 0x000230, "Member 'AHatStand_C::Arrow' has a wrong offset!");
static_assert(offsetof(AHatStand_C, ParticleSystem) == 0x000238, "Member 'AHatStand_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AHatStand_C, FlagHolder) == 0x000240, "Member 'AHatStand_C::FlagHolder' has a wrong offset!");
static_assert(offsetof(AHatStand_C, Scene) == 0x000248, "Member 'AHatStand_C::Scene' has a wrong offset!");
static_assert(offsetof(AHatStand_C, Rotation_Location_CCD917894C436EB3D921ABA7E44FC014) == 0x000250, "Member 'AHatStand_C::Rotation_Location_CCD917894C436EB3D921ABA7E44FC014' has a wrong offset!");
static_assert(offsetof(AHatStand_C, Rotation__Direction_CCD917894C436EB3D921ABA7E44FC014) == 0x000254, "Member 'AHatStand_C::Rotation__Direction_CCD917894C436EB3D921ABA7E44FC014' has a wrong offset!");
static_assert(offsetof(AHatStand_C, Rotation) == 0x000258, "Member 'AHatStand_C::Rotation' has a wrong offset!");
static_assert(offsetof(AHatStand_C, Location_Location_3B70CD5F432FD04A9DD07CA6BE1E9FE2) == 0x000260, "Member 'AHatStand_C::Location_Location_3B70CD5F432FD04A9DD07CA6BE1E9FE2' has a wrong offset!");
static_assert(offsetof(AHatStand_C, Location__Direction_3B70CD5F432FD04A9DD07CA6BE1E9FE2) == 0x000264, "Member 'AHatStand_C::Location__Direction_3B70CD5F432FD04A9DD07CA6BE1E9FE2' has a wrong offset!");
static_assert(offsetof(AHatStand_C, Location) == 0x000268, "Member 'AHatStand_C::Location' has a wrong offset!");
static_assert(offsetof(AHatStand_C, VruumbaHolder) == 0x000270, "Member 'AHatStand_C::VruumbaHolder' has a wrong offset!");
static_assert(offsetof(AHatStand_C, PrevVruumbaHolder) == 0x000278, "Member 'AHatStand_C::PrevVruumbaHolder' has a wrong offset!");
static_assert(offsetof(AHatStand_C, GameStarted) == 0x000280, "Member 'AHatStand_C::GameStarted' has a wrong offset!");
static_assert(offsetof(AHatStand_C, HatType) == 0x000284, "Member 'AHatStand_C::HatType' has a wrong offset!");

}

