#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HiddenAgendaWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HiddenAgendaWI.HiddenAgendaWI_C
// 0x0048 (0x02A8 - 0x0260)
class UHiddenAgendaWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 BG;                                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Description;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Linetop;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Linetop_1;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Progress;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAgendaStateIconWI_C*                   StateIcon;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StateText;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              PlayerState;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HiddenAgendaWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void UpdateAgendaText();
	void BindToEvents();
	void OnDescriptionChanged(const class FString& Value);
	void OnProgressionChanged(const class FString& Value);
	void OnStateChanged(EAgendaObjectState State);
	void UpdateState();
	void InitializePlayerState(class APlayerState* PlayerState_0);
	void BindToGetPlayerState();
	void OnPlayerStateReceived(class ASCTPlayerState* PlayerState_0);
	void Initialize();

	void GetPlayerState(class ASCTPlayerState_MatchBP_C** AsSCTPlayer_State_Match_BP) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HiddenAgendaWI_C">();
	}
	static class UHiddenAgendaWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHiddenAgendaWI_C>();
	}
};
static_assert(alignof(UHiddenAgendaWI_C) == 0x000008, "Wrong alignment on UHiddenAgendaWI_C");
static_assert(sizeof(UHiddenAgendaWI_C) == 0x0002A8, "Wrong size on UHiddenAgendaWI_C");
static_assert(offsetof(UHiddenAgendaWI_C, UberGraphFrame) == 0x000260, "Member 'UHiddenAgendaWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHiddenAgendaWI_C, BG) == 0x000268, "Member 'UHiddenAgendaWI_C::BG' has a wrong offset!");
static_assert(offsetof(UHiddenAgendaWI_C, Description) == 0x000270, "Member 'UHiddenAgendaWI_C::Description' has a wrong offset!");
static_assert(offsetof(UHiddenAgendaWI_C, Linetop) == 0x000278, "Member 'UHiddenAgendaWI_C::Linetop' has a wrong offset!");
static_assert(offsetof(UHiddenAgendaWI_C, Linetop_1) == 0x000280, "Member 'UHiddenAgendaWI_C::Linetop_1' has a wrong offset!");
static_assert(offsetof(UHiddenAgendaWI_C, Progress) == 0x000288, "Member 'UHiddenAgendaWI_C::Progress' has a wrong offset!");
static_assert(offsetof(UHiddenAgendaWI_C, StateIcon) == 0x000290, "Member 'UHiddenAgendaWI_C::StateIcon' has a wrong offset!");
static_assert(offsetof(UHiddenAgendaWI_C, StateText) == 0x000298, "Member 'UHiddenAgendaWI_C::StateText' has a wrong offset!");
static_assert(offsetof(UHiddenAgendaWI_C, PlayerState) == 0x0002A0, "Member 'UHiddenAgendaWI_C::PlayerState' has a wrong offset!");

}

