#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IdleEntry_AnimNotify

#include "Basic.hpp"


namespace SDK::Params
{

// Function IdleEntry_AnimNotify.IdleEntry_AnimNotify_C.Received_Notify
// 0x0038 (0x0038 - 0x0000)
struct IdleEntry_AnimNotify_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IdleEntry_AnimNotify_C_Received_Notify) == 0x000008, "Wrong alignment on IdleEntry_AnimNotify_C_Received_Notify");
static_assert(sizeof(IdleEntry_AnimNotify_C_Received_Notify) == 0x000038, "Wrong size on IdleEntry_AnimNotify_C_Received_Notify");
static_assert(offsetof(IdleEntry_AnimNotify_C_Received_Notify, MeshComp) == 0x000000, "Member 'IdleEntry_AnimNotify_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(IdleEntry_AnimNotify_C_Received_Notify, Animation) == 0x000008, "Member 'IdleEntry_AnimNotify_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(IdleEntry_AnimNotify_C_Received_Notify, ReturnValue) == 0x000010, "Member 'IdleEntry_AnimNotify_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(IdleEntry_AnimNotify_C_Received_Notify, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'IdleEntry_AnimNotify_C_Received_Notify::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(IdleEntry_AnimNotify_C_Received_Notify, K2Node_DynamicCast_AsIAnim_Bp) == 0x000020, "Member 'IdleEntry_AnimNotify_C_Received_Notify::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(IdleEntry_AnimNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'IdleEntry_AnimNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

