#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InGameWI.InGameWI_C
// 0x0048 (0x02C8 - 0x0280)
class UInGameWI_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_ClickableSubTitleWI_C*              CM_ClickableSubTitleWI_CloseMenu;                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              CM_ClickableSubTitleWI_Quit;                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              CM_ClickableSubTitleWI_Report;                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_SettingsWI_C*                       CM_SettingsWI;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInGameReport_C*                        InGameReport;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_47;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_110;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_363;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InGameWI(int32 EntryPoint);
	void Destruct();
	void Report_Player();
	void BndEvt__InGameWI_CM_ClickableSubTitleWI_Report_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature();
	void Construct();
	void Proxy_Quit();
	void Proxy_Close_Menu();
	void BndEvt__InGameWI_CM_ClickableSubTitleWI_Quit_1_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature();
	void Quit_To_Menu();
	void Close_Menu();
	void BndEvt__InGameWI_CM_ClickableSubTitleWI_Quit_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void Quit_Game_Confirmed();
	void OnSuccess_EC5964AB4A60F0A712B0B589F11821F5();
	void OnFail_EC5964AB4A60F0A712B0B589F11821F5();
	void HandleKarmaScoreOnLeave();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGameWI_C">();
	}
	static class UInGameWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInGameWI_C>();
	}
};
static_assert(alignof(UInGameWI_C) == 0x000008, "Wrong alignment on UInGameWI_C");
static_assert(sizeof(UInGameWI_C) == 0x0002C8, "Wrong size on UInGameWI_C");
static_assert(offsetof(UInGameWI_C, UberGraphFrame) == 0x000280, "Member 'UInGameWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInGameWI_C, CM_ClickableSubTitleWI_CloseMenu) == 0x000288, "Member 'UInGameWI_C::CM_ClickableSubTitleWI_CloseMenu' has a wrong offset!");
static_assert(offsetof(UInGameWI_C, CM_ClickableSubTitleWI_Quit) == 0x000290, "Member 'UInGameWI_C::CM_ClickableSubTitleWI_Quit' has a wrong offset!");
static_assert(offsetof(UInGameWI_C, CM_ClickableSubTitleWI_Report) == 0x000298, "Member 'UInGameWI_C::CM_ClickableSubTitleWI_Report' has a wrong offset!");
static_assert(offsetof(UInGameWI_C, CM_SettingsWI) == 0x0002A0, "Member 'UInGameWI_C::CM_SettingsWI' has a wrong offset!");
static_assert(offsetof(UInGameWI_C, InGameReport) == 0x0002A8, "Member 'UInGameWI_C::InGameReport' has a wrong offset!");
static_assert(offsetof(UInGameWI_C, SafeZone_47) == 0x0002B0, "Member 'UInGameWI_C::SafeZone_47' has a wrong offset!");
static_assert(offsetof(UInGameWI_C, SafeZone_110) == 0x0002B8, "Member 'UInGameWI_C::SafeZone_110' has a wrong offset!");
static_assert(offsetof(UInGameWI_C, WidgetSwitcher_363) == 0x0002C0, "Member 'UInGameWI_C::WidgetSwitcher_363' has a wrong offset!");

}

