#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function InGameWI.InGameWI_C.ExecuteUbergraph_InGameWI
// 0x0170 (0x0170 - 0x0000)
struct InGameWI_C_ExecuteUbergraph_InGameWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSonyEnterButtonSwapped_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConfirmationPopup_C*                   CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0068(0x0018)()
	class ASCTPlayerController*                   K2Node_DynamicCast_AsSCTPlayer_Controller;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00A0(0x0018)(ConstParm)
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetOrganizer*                       CallFunc_GetWidgetOrganizer_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x00C8(0x0018)(ConstParm)
	TScriptInterface<class II_Focusable_C>        K2Node_DynamicCast_AsI_Focusable;                  // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerController_WarmupBP_C*        K2Node_DynamicCast_AsSCTPlayer_Controller_Warmup_BP; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController_MatchBP_C*         K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerController_WarmupBP_C*        K2Node_DynamicCast_AsSCTPlayer_Controller_Warmup_BP_1; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController_MatchBP_C*         K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP_1; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller_1; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue;           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSonyEnterButtonSwapped_ReturnValue_1;  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGameWI_C_ExecuteUbergraph_InGameWI) == 0x000008, "Wrong alignment on InGameWI_C_ExecuteUbergraph_InGameWI");
static_assert(sizeof(InGameWI_C_ExecuteUbergraph_InGameWI) == 0x000170, "Wrong size on InGameWI_C_ExecuteUbergraph_InGameWI");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, EntryPoint) == 0x000000, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_GetSonyEnterButtonSwapped_ReturnValue) == 0x000004, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_GetSonyEnterButtonSwapped_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_LeaveParty_ReturnValue) == 0x000028, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_LeaveParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_Create_ReturnValue) == 0x000030, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_CreateDelegate_OutputDelegate_3) == 0x00004C, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_MakeLiteralText_ReturnValue) == 0x000068, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_AsSCTPlayer_Controller) == 0x000080, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_CreateDelegate_OutputDelegate_4) == 0x00008C, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, Temp_text_Variable) == 0x0000A0, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x0000B8, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_GetWidgetOrganizer_ReturnValue) == 0x0000C0, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_GetWidgetOrganizer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, Temp_text_Variable_1) == 0x0000C8, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_AsI_Focusable) == 0x0000E0, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_AsI_Focusable' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_GetPlayerController_ReturnValue) == 0x0000F8, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_AsSCTPlayer_Controller_Warmup_BP) == 0x000100, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_AsSCTPlayer_Controller_Warmup_BP' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP) == 0x000110, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_GetPlayerController_ReturnValue_1) == 0x000120, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_AsSCTPlayer_Controller_Warmup_BP_1) == 0x000128, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_AsSCTPlayer_Controller_Warmup_BP_1' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_bSuccess_4) == 0x000130, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP_1) == 0x000138, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP_1' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, K2Node_DynamicCast_bSuccess_5) == 0x000140, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller_1) == 0x000148, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000150, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_GetCurrentLanguage_ReturnValue) == 0x000158, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_ExecuteUbergraph_InGameWI, CallFunc_GetSonyEnterButtonSwapped_ReturnValue_1) == 0x000168, "Member 'InGameWI_C_ExecuteUbergraph_InGameWI::CallFunc_GetSonyEnterButtonSwapped_ReturnValue_1' has a wrong offset!");

// Function InGameWI.InGameWI_C.HandleKarmaScoreOnLeave
// 0x0018 (0x0018 - 0x0000)
struct InGameWI_C_HandleKarmaScoreOnLeave final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGameWI_C_HandleKarmaScoreOnLeave) == 0x000008, "Wrong alignment on InGameWI_C_HandleKarmaScoreOnLeave");
static_assert(sizeof(InGameWI_C_HandleKarmaScoreOnLeave) == 0x000018, "Wrong size on InGameWI_C_HandleKarmaScoreOnLeave");
static_assert(offsetof(InGameWI_C_HandleKarmaScoreOnLeave, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'InGameWI_C_HandleKarmaScoreOnLeave::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameWI_C_HandleKarmaScoreOnLeave, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP) == 0x000008, "Member 'InGameWI_C_HandleKarmaScoreOnLeave::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(InGameWI_C_HandleKarmaScoreOnLeave, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'InGameWI_C_HandleKarmaScoreOnLeave::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InGameWI_C_HandleKarmaScoreOnLeave, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'InGameWI_C_HandleKarmaScoreOnLeave::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

