#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractionWaveSkillcheckWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function InteractionWaveSkillcheckWI.InteractionWaveSkillcheckWI_C.ExecuteUbergraph_InteractionWaveSkillcheckWI
// 0x0020 (0x0020 - 0x0000)
struct InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI) == 0x000004, "Wrong alignment on InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI");
static_assert(sizeof(InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI) == 0x000020, "Wrong size on InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI");
static_assert(offsetof(InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI, EntryPoint) == 0x000000, "Member 'InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI, Temp_int_Variable) == 0x000018, "Member 'InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'InteractionWaveSkillcheckWI_C_ExecuteUbergraph_InteractionWaveSkillcheckWI::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

