#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemWheelV2EntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SCT_structs.hpp"
#include "E_ItemSlotStates_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemWheelV2EntryWI.ItemWheelV2EntryWI_C
// 0x00A8 (0x0308 - 0x0260)
class UItemWheelV2EntryWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Icon;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           IconAndStackSize;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemWheelV3SlotWI_C*                   ItemWheelV3SlotWI;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PieImage;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_104;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     PieMaterial;                                       // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PieSize;                                           // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PieOffset;                                         // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FItemDetails                           ItemDetails;                                       // 0x02A0(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         RenderAngle;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  Item;                                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemWheelV2WI_C*                       ParentWidgetItemWheel;                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemWheelV2EntryWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateDataOfV3Slot();
	void Initialize(class UItem* Item_0);
	void Rebuild(E_ItemSlotStates Selection);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemWheelV2EntryWI_C">();
	}
	static class UItemWheelV2EntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemWheelV2EntryWI_C>();
	}
};
static_assert(alignof(UItemWheelV2EntryWI_C) == 0x000008, "Wrong alignment on UItemWheelV2EntryWI_C");
static_assert(sizeof(UItemWheelV2EntryWI_C) == 0x000308, "Wrong size on UItemWheelV2EntryWI_C");
static_assert(offsetof(UItemWheelV2EntryWI_C, UberGraphFrame) == 0x000260, "Member 'UItemWheelV2EntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, Icon) == 0x000268, "Member 'UItemWheelV2EntryWI_C::Icon' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, IconAndStackSize) == 0x000270, "Member 'UItemWheelV2EntryWI_C::IconAndStackSize' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, ItemWheelV3SlotWI) == 0x000278, "Member 'UItemWheelV2EntryWI_C::ItemWheelV3SlotWI' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, PieImage) == 0x000280, "Member 'UItemWheelV2EntryWI_C::PieImage' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, TextBlock_104) == 0x000288, "Member 'UItemWheelV2EntryWI_C::TextBlock_104' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, PieMaterial) == 0x000290, "Member 'UItemWheelV2EntryWI_C::PieMaterial' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, PieSize) == 0x000298, "Member 'UItemWheelV2EntryWI_C::PieSize' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, PieOffset) == 0x00029C, "Member 'UItemWheelV2EntryWI_C::PieOffset' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, ItemDetails) == 0x0002A0, "Member 'UItemWheelV2EntryWI_C::ItemDetails' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, RenderAngle) == 0x0002F0, "Member 'UItemWheelV2EntryWI_C::RenderAngle' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, Item) == 0x0002F8, "Member 'UItemWheelV2EntryWI_C::Item' has a wrong offset!");
static_assert(offsetof(UItemWheelV2EntryWI_C, ParentWidgetItemWheel) == 0x000300, "Member 'UItemWheelV2EntryWI_C::ParentWidgetItemWheel' has a wrong offset!");

}

