#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeybindingSelectorWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass KeybindingSelectorWI.KeybindingSelectorWI_C
// 0x0018 (0x0718 - 0x0700)
class UKeybindingSelectorWI_C final : public USCTKeySelector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 GamepadIcon;                                       // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UControllerIconData*                    Controller_Icon_Data;                              // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_KeybindingSelectorWI(int32 EntryPoint);
	void SetKeyboardStyle(const struct FInputChord& Chord);
	void SetGamepadStyle(const struct FInputChord& Chord);
	class UTexture2D* GetGamepadIcon(const struct FInputChord& InputChord);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KeybindingSelectorWI_C">();
	}
	static class UKeybindingSelectorWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeybindingSelectorWI_C>();
	}
};
static_assert(alignof(UKeybindingSelectorWI_C) == 0x000008, "Wrong alignment on UKeybindingSelectorWI_C");
static_assert(sizeof(UKeybindingSelectorWI_C) == 0x000718, "Wrong size on UKeybindingSelectorWI_C");
static_assert(offsetof(UKeybindingSelectorWI_C, UberGraphFrame) == 0x000700, "Member 'UKeybindingSelectorWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKeybindingSelectorWI_C, GamepadIcon) == 0x000708, "Member 'UKeybindingSelectorWI_C::GamepadIcon' has a wrong offset!");
static_assert(offsetof(UKeybindingSelectorWI_C, Controller_Icon_Data) == 0x000710, "Member 'UKeybindingSelectorWI_C::Controller_Icon_Data' has a wrong offset!");

}

