#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeycardFinderGA

#include "Basic.hpp"


namespace SDK::Params
{

// Function KeycardFinderGA.KeycardFinderGA_C.ExecuteUbergraph_KeycardFinderGA
// 0x0050 (0x0050 - 0x0000)
struct KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA) == 0x000008, "Wrong alignment on KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA");
static_assert(sizeof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA) == 0x000050, "Wrong size on KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, EntryPoint) == 0x000000, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, K2Node_CustomEvent_TimeHeld) == 0x000004, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, Temp_float_Variable) == 0x000018, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, CallFunc_WaitInputRelease_ReturnValue) == 0x000020, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, CallFunc_WaitDelay_ReturnValue) == 0x000040, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA, K2Node_Event_bWasCancelled) == 0x000049, "Member 'KeycardFinderGA_C_ExecuteUbergraph_KeycardFinderGA::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function KeycardFinderGA.KeycardFinderGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct KeycardFinderGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeycardFinderGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on KeycardFinderGA_C_K2_OnEndAbility");
static_assert(sizeof(KeycardFinderGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on KeycardFinderGA_C_K2_OnEndAbility");
static_assert(offsetof(KeycardFinderGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'KeycardFinderGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function KeycardFinderGA.KeycardFinderGA_C.OnRelease_F257A6E048BDE86DDCA793BF9859846E
// 0x0004 (0x0004 - 0x0000)
struct KeycardFinderGA_C_OnRelease_F257A6E048BDE86DDCA793BF9859846E final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeycardFinderGA_C_OnRelease_F257A6E048BDE86DDCA793BF9859846E) == 0x000004, "Wrong alignment on KeycardFinderGA_C_OnRelease_F257A6E048BDE86DDCA793BF9859846E");
static_assert(sizeof(KeycardFinderGA_C_OnRelease_F257A6E048BDE86DDCA793BF9859846E) == 0x000004, "Wrong size on KeycardFinderGA_C_OnRelease_F257A6E048BDE86DDCA793BF9859846E");
static_assert(offsetof(KeycardFinderGA_C_OnRelease_F257A6E048BDE86DDCA793BF9859846E, TimeHeld) == 0x000000, "Member 'KeycardFinderGA_C_OnRelease_F257A6E048BDE86DDCA793BF9859846E::TimeHeld' has a wrong offset!");

}

