#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeycardObjectiveEntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KeycardObjectiveEntryWI.KeycardObjectiveEntryWI_C
// 0x0030 (0x0290 - 0x0260)
class UKeycardObjectiveEntryWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       AnimateIn;                                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Keycard;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           ColorCompleted;                                    // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_KeycardObjectiveEntryWI(int32 EntryPoint);
	void Set_As_Non_Completed();
	void Set_As_Completed();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KeycardObjectiveEntryWI_C">();
	}
	static class UKeycardObjectiveEntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeycardObjectiveEntryWI_C>();
	}
};
static_assert(alignof(UKeycardObjectiveEntryWI_C) == 0x000008, "Wrong alignment on UKeycardObjectiveEntryWI_C");
static_assert(sizeof(UKeycardObjectiveEntryWI_C) == 0x000290, "Wrong size on UKeycardObjectiveEntryWI_C");
static_assert(offsetof(UKeycardObjectiveEntryWI_C, UberGraphFrame) == 0x000260, "Member 'UKeycardObjectiveEntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKeycardObjectiveEntryWI_C, AnimateIn) == 0x000268, "Member 'UKeycardObjectiveEntryWI_C::AnimateIn' has a wrong offset!");
static_assert(offsetof(UKeycardObjectiveEntryWI_C, Frame) == 0x000270, "Member 'UKeycardObjectiveEntryWI_C::Frame' has a wrong offset!");
static_assert(offsetof(UKeycardObjectiveEntryWI_C, Keycard) == 0x000278, "Member 'UKeycardObjectiveEntryWI_C::Keycard' has a wrong offset!");
static_assert(offsetof(UKeycardObjectiveEntryWI_C, ColorCompleted) == 0x000280, "Member 'UKeycardObjectiveEntryWI_C::ColorCompleted' has a wrong offset!");

}

