#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeySocket3in1BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_KeyCardColors_structs.hpp"
#include "E_PickupType_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SCT_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function KeySocket3in1BP.KeySocket3in1BP_C.On Recieve Key__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct KeySocket3in1BP_C_On_Recieve_Key__DelegateSignature final
{
public:
	E_PickupType                                  PickUpType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeySocket3in1BP_C_On_Recieve_Key__DelegateSignature) == 0x000001, "Wrong alignment on KeySocket3in1BP_C_On_Recieve_Key__DelegateSignature");
static_assert(sizeof(KeySocket3in1BP_C_On_Recieve_Key__DelegateSignature) == 0x000001, "Wrong size on KeySocket3in1BP_C_On_Recieve_Key__DelegateSignature");
static_assert(offsetof(KeySocket3in1BP_C_On_Recieve_Key__DelegateSignature, PickUpType) == 0x000000, "Member 'KeySocket3in1BP_C_On_Recieve_Key__DelegateSignature::PickUpType' has a wrong offset!");

// Function KeySocket3in1BP.KeySocket3in1BP_C.ExecuteUbergraph_KeySocket3in1BP
// 0x0730 (0x0730 - 0x0000)
struct KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PickupType                                  Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00C8(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x00F8(0x0018)()
	E_PickupType                                  Temp_byte_Variable_1;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_11;                             // 0x0118(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0130(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0148(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0160(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0178(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x0190(0x0018)()
	class FText                                   Temp_text_Variable_17;                             // 0x01A8(0x0018)()
	class FText                                   Temp_text_Variable_18;                             // 0x01C0(0x0018)()
	class FText                                   Temp_text_Variable_19;                             // 0x01D8(0x0018)()
	class FText                                   Temp_text_Variable_20;                             // 0x01F0(0x0018)()
	class FText                                   Temp_text_Variable_21;                             // 0x0208(0x0018)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0228(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0238(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0250(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0270(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2; // 0x0290(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x02B8(0x0010)(ConstParm, ReferenceParm)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_1;              // 0x02C8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload;                // 0x02F8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled;           // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_2; // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2; // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventory*                             CallFunc_GetComponentByClass_ReturnValue;          // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemovePowerTypeAll_ReturnValue;           // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue; // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x03B8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x03D0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E5[0x3];                                      // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterWI_C*                         CallFunc_GetSCT_CharacterWidget_CharacterWI;       // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PickupType                                  K2Node_CustomEvent_Card;                           // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40A[0x6];                                      // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0410(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0428(0x0040)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0468(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0480(0x0040)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C2[0x2];                                      // 0x04C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x04C4(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D6[0x2];                                      // 0x04D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x04D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x04F0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_KeyCardColors                               K2Node_CustomEvent_Colors;                         // 0x0504(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0505(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_506[0x2];                                      // 0x0506(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x050D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E[0x2];                                      // 0x050E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEmergencyEventController_C*>    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0510(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0520(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmergencyEventController_C*            CallFunc_Array_Get_Item;                           // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x05B8(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x05D8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0620(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0640(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0680(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0690(0x0018)()
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x06A8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_4;                            // 0x06B8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9[0x3];                                      // 0x06C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x06D0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x06E0(0x0018)()
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0700(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0718(0x0018)()
};
static_assert(alignof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP) == 0x000008, "Wrong alignment on KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP");
static_assert(sizeof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP) == 0x000730, "Wrong size on KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, EntryPoint) == 0x000000, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_byte_Variable) == 0x000004, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable) == 0x000008, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_1) == 0x000020, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_2) == 0x000038, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_3) == 0x000050, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_4) == 0x000068, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_5) == 0x000080, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_6) == 0x000098, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_7) == 0x0000B0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_8) == 0x0000C8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_9) == 0x0000E0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_10) == 0x0000F8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_byte_Variable_1) == 0x000110, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_11) == 0x000118, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_12) == 0x000130, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_13) == 0x000148, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_14) == 0x000160, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_14' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_15) == 0x000178, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_15' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_16) == 0x000190, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_16' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_17) == 0x0001A8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_17' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_18) == 0x0001C0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_18' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_19) == 0x0001D8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_19' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_20) == 0x0001F0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_20' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_text_Variable_21) == 0x000208, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_text_Variable_21' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_HasAuthority_ReturnValue) == 0x000220, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_struct_Variable) == 0x000228, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_delegate_Variable) == 0x000238, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_bool_IsClosed_Variable) == 0x000248, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_bool_Has_Been_Initd_Variable) == 0x000249, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000250, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000270, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2) == 0x000290, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_IsValid_ReturnValue_1) == 0x0002B0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x0002B1, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_struct_Variable_1) == 0x0002B8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_ComponentBoundEvent_payload_1) == 0x0002C8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_ComponentBoundEvent_payload_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_ComponentBoundEvent_payload) == 0x0002F8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_ComponentBoundEvent_payload' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_ComponentBoundEvent_wasCancelled) == 0x000328, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_ComponentBoundEvent_wasCancelled' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000329, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000330, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000338, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000348, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000350, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000358, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000368, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000370, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_2) == 0x000378, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2) == 0x000388, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_GetComponentByClass_ReturnValue) == 0x000390, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_RemovePowerTypeAll_ReturnValue) == 0x000398, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_RemovePowerTypeAll_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_GetAbilitySystemComponent_ReturnValue_3) == 0x0003A0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_GetAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x0003A8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_DynamicCast_bSuccess) == 0x0003B0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue) == 0x0003B4, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_delegate_Variable_1) == 0x0003B8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_PostAkEvent_ReturnValue) == 0x0003C8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0003CC, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_struct_Variable_2) == 0x0003D0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_PostAkEvent_ReturnValue_1) == 0x0003E0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_HasAuthority_ReturnValue_1) == 0x0003E4, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003E8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x0003F8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_GetSCT_CharacterWidget_CharacterWI) == 0x000400, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_GetSCT_CharacterWidget_CharacterWI' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_CustomEvent_Card) == 0x000408, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_CustomEvent_Card' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000409, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_Select_Default) == 0x000410, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_MakeStruct_FormatArgumentData) == 0x000428, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_Select_Default_1) == 0x000468, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_MakeStruct_FormatArgumentData_1) == 0x000480, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_SwitchEnum_CmpSuccess) == 0x0004C0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_SwitchEnum_CmpSuccess_1) == 0x0004C1, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_delegate_Variable_2) == 0x0004C4, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_HasAuthority_ReturnValue_2) == 0x0004D4, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_IsValid_ReturnValue_2) == 0x0004D5, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_DynamicCast_AsICharacter_SCT) == 0x0004D8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_DynamicCast_bSuccess_1) == 0x0004E8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_struct_Variable_3) == 0x0004F0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_PostAkEvent_ReturnValue_2) == 0x000500, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_CustomEvent_Colors) == 0x000504, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_CustomEvent_Colors' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_SwitchEnum_CmpSuccess_2) == 0x000505, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_Event_DeltaSeconds) == 0x000508, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_Not_PreBool_ReturnValue) == 0x00050C, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_IsValid_ReturnValue_3) == 0x00050D, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_GetAllActorsOfClass_OutActors) == 0x000510, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000520, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_Array_Get_Item) == 0x0005B0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_MakeLiteralText_ReturnValue) == 0x0005B8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_BooleanAND_ReturnValue) == 0x0005D0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_MakeStruct_FormatArgumentData_2) == 0x0005D8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_BooleanAND_ReturnValue_1) == 0x000618, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000620, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_BooleanAND_ReturnValue_2) == 0x000638, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_MakeStruct_FormatArgumentData_3) == 0x000640, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, K2Node_MakeArray_Array) == 0x000680, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_Format_ReturnValue) == 0x000690, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_delegate_Variable_3) == 0x0006A8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_struct_Variable_4) == 0x0006B8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_HasAuthority_ReturnValue_3) == 0x0006C8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x0006CC, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, Temp_delegate_Variable_4) == 0x0006D0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0006E0, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_PostAkEvent_ReturnValue_3) == 0x0006F8, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000700, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000718, "Member 'KeySocket3in1BP_C_ExecuteUbergraph_KeySocket3in1BP::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");

// Function KeySocket3in1BP.KeySocket3in1BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct KeySocket3in1BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeySocket3in1BP_C_ReceiveTick) == 0x000004, "Wrong alignment on KeySocket3in1BP_C_ReceiveTick");
static_assert(sizeof(KeySocket3in1BP_C_ReceiveTick) == 0x000004, "Wrong size on KeySocket3in1BP_C_ReceiveTick");
static_assert(offsetof(KeySocket3in1BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'KeySocket3in1BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function KeySocket3in1BP.KeySocket3in1BP_C.Set Key As Placed
// 0x0001 (0x0001 - 0x0000)
struct KeySocket3in1BP_C_Set_Key_As_Placed final
{
public:
	E_KeyCardColors                               Colors;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeySocket3in1BP_C_Set_Key_As_Placed) == 0x000001, "Wrong alignment on KeySocket3in1BP_C_Set_Key_As_Placed");
static_assert(sizeof(KeySocket3in1BP_C_Set_Key_As_Placed) == 0x000001, "Wrong size on KeySocket3in1BP_C_Set_Key_As_Placed");
static_assert(offsetof(KeySocket3in1BP_C_Set_Key_As_Placed, Colors) == 0x000000, "Member 'KeySocket3in1BP_C_Set_Key_As_Placed::Colors' has a wrong offset!");

// Function KeySocket3in1BP.KeySocket3in1BP_C.ReceiveKey
// 0x0001 (0x0001 - 0x0000)
struct KeySocket3in1BP_C_ReceiveKey final
{
public:
	E_PickupType                                  Card;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeySocket3in1BP_C_ReceiveKey) == 0x000001, "Wrong alignment on KeySocket3in1BP_C_ReceiveKey");
static_assert(sizeof(KeySocket3in1BP_C_ReceiveKey) == 0x000001, "Wrong size on KeySocket3in1BP_C_ReceiveKey");
static_assert(offsetof(KeySocket3in1BP_C_ReceiveKey, Card) == 0x000000, "Member 'KeySocket3in1BP_C_ReceiveKey::Card' has a wrong offset!");

// Function KeySocket3in1BP.KeySocket3in1BP_C.BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature");
static_assert(sizeof(KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature) == 0x000038, "Wrong size on KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature");
static_assert(offsetof(KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature, Payload) == 0x000000, "Member 'KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature::Payload' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature, WasCancelled) == 0x000030, "Member 'KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature::WasCancelled' has a wrong offset!");

// Function KeySocket3in1BP.KeySocket3in1BP_C.BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature");
static_assert(sizeof(KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature");
static_assert(offsetof(KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'KeySocket3in1BP_C_BndEvt__KeycardInteractionComponent_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function KeySocket3in1BP.KeySocket3in1BP_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct KeySocket3in1BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInteractionSubComponentInterface> CallFunc_AddSubComponent_component_CastInput;      // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(KeySocket3in1BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on KeySocket3in1BP_C_UserConstructionScript");
static_assert(sizeof(KeySocket3in1BP_C_UserConstructionScript) == 0x000018, "Wrong size on KeySocket3in1BP_C_UserConstructionScript");
static_assert(offsetof(KeySocket3in1BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'KeySocket3in1BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'KeySocket3in1BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_UserConstructionScript, CallFunc_AddSubComponent_component_CastInput) == 0x000008, "Member 'KeySocket3in1BP_C_UserConstructionScript::CallFunc_AddSubComponent_component_CastInput' has a wrong offset!");

// Function KeySocket3in1BP.KeySocket3in1BP_C.SetColorOfFalseKeyCard
// 0x0001 (0x0001 - 0x0000)
struct KeySocket3in1BP_C_SetColorOfFalseKeyCard final
{
public:
	E_PickupType                                  PickUpType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeySocket3in1BP_C_SetColorOfFalseKeyCard) == 0x000001, "Wrong alignment on KeySocket3in1BP_C_SetColorOfFalseKeyCard");
static_assert(sizeof(KeySocket3in1BP_C_SetColorOfFalseKeyCard) == 0x000001, "Wrong size on KeySocket3in1BP_C_SetColorOfFalseKeyCard");
static_assert(offsetof(KeySocket3in1BP_C_SetColorOfFalseKeyCard, PickUpType) == 0x000000, "Member 'KeySocket3in1BP_C_SetColorOfFalseKeyCard::PickUpType' has a wrong offset!");

// Function KeySocket3in1BP.KeySocket3in1BP_C.SetNoKeyColorOfSocket
// 0x001C (0x001C - 0x0000)
struct KeySocket3in1BP_C_SetNoKeyColorOfSocket final
{
public:
	E_PickupType                                  PickUpType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue_1;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue_2;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeySocket3in1BP_C_SetNoKeyColorOfSocket) == 0x000004, "Wrong alignment on KeySocket3in1BP_C_SetNoKeyColorOfSocket");
static_assert(sizeof(KeySocket3in1BP_C_SetNoKeyColorOfSocket) == 0x00001C, "Wrong size on KeySocket3in1BP_C_SetNoKeyColorOfSocket");
static_assert(offsetof(KeySocket3in1BP_C_SetNoKeyColorOfSocket, PickUpType) == 0x000000, "Member 'KeySocket3in1BP_C_SetNoKeyColorOfSocket::PickUpType' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_SetNoKeyColorOfSocket, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'KeySocket3in1BP_C_SetNoKeyColorOfSocket::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_SetNoKeyColorOfSocket, CallFunc_Conv_ByteToFloat_ReturnValue) == 0x000004, "Member 'KeySocket3in1BP_C_SetNoKeyColorOfSocket::CallFunc_Conv_ByteToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_SetNoKeyColorOfSocket, CallFunc_Conv_ByteToFloat_ReturnValue_1) == 0x000008, "Member 'KeySocket3in1BP_C_SetNoKeyColorOfSocket::CallFunc_Conv_ByteToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_SetNoKeyColorOfSocket, CallFunc_Conv_ByteToFloat_ReturnValue_2) == 0x00000C, "Member 'KeySocket3in1BP_C_SetNoKeyColorOfSocket::CallFunc_Conv_ByteToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeySocket3in1BP_C_SetNoKeyColorOfSocket, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'KeySocket3in1BP_C_SetNoKeyColorOfSocket::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function KeySocket3in1BP.KeySocket3in1BP_C.SetHasKeyColorOfSocket
// 0x0068 (0x0068 - 0x0000)
struct KeySocket3in1BP_C_SetHasKeyColorOfSocket final
{
public:
	E_PickupType                                  PickUpType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PickupType                                  Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
