#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelVotingEntryWI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LevelVotingEntryWI.LevelVotingEntryWI_C.ExecuteUbergraph_LevelVotingEntryWI
// 0x0080 (0x0080 - 0x0000)
struct LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelVoteComponent*                    CallFunc_GetLevelVoteManager_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue; // 0x0040(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0074(0x0008)(NoDestructor)
};
static_assert(alignof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI) == 0x000008, "Wrong alignment on LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI");
static_assert(sizeof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI) == 0x000080, "Wrong size on LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, EntryPoint) == 0x000000, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, K2Node_Event_InFocusEvent) == 0x000004, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, K2Node_CustomEvent_Loaded) == 0x000010, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, Temp_object_Variable) == 0x000018, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, CallFunc_GetLevelVoteManager_ReturnValue) == 0x000020, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::CallFunc_GetLevelVoteManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, K2Node_Event_IsDesignTime) == 0x000028, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue) == 0x000040, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000068, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI, K2Node_Event_InFocusEvent_1) == 0x000074, "Member 'LevelVotingEntryWI_C_ExecuteUbergraph_LevelVotingEntryWI::K2Node_Event_InFocusEvent_1' has a wrong offset!");

// Function LevelVotingEntryWI.LevelVotingEntryWI_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct LevelVotingEntryWI_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(LevelVotingEntryWI_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on LevelVotingEntryWI_C_OnRemovedFromFocusPath");
static_assert(sizeof(LevelVotingEntryWI_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on LevelVotingEntryWI_C_OnRemovedFromFocusPath");
static_assert(offsetof(LevelVotingEntryWI_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'LevelVotingEntryWI_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function LevelVotingEntryWI.LevelVotingEntryWI_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct LevelVotingEntryWI_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(LevelVotingEntryWI_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on LevelVotingEntryWI_C_OnAddedToFocusPath");
static_assert(sizeof(LevelVotingEntryWI_C_OnAddedToFocusPath) == 0x000008, "Wrong size on LevelVotingEntryWI_C_OnAddedToFocusPath");
static_assert(offsetof(LevelVotingEntryWI_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'LevelVotingEntryWI_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function LevelVotingEntryWI.LevelVotingEntryWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LevelVotingEntryWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LevelVotingEntryWI_C_PreConstruct) == 0x000001, "Wrong alignment on LevelVotingEntryWI_C_PreConstruct");
static_assert(sizeof(LevelVotingEntryWI_C_PreConstruct) == 0x000001, "Wrong size on LevelVotingEntryWI_C_PreConstruct");
static_assert(offsetof(LevelVotingEntryWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LevelVotingEntryWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LevelVotingEntryWI.LevelVotingEntryWI_C.OnLoaded_E57C6BCC4E33F49593B8E1AAF195D54C
// 0x0008 (0x0008 - 0x0000)
struct LevelVotingEntryWI_C_OnLoaded_E57C6BCC4E33F49593B8E1AAF195D54C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingEntryWI_C_OnLoaded_E57C6BCC4E33F49593B8E1AAF195D54C) == 0x000008, "Wrong alignment on LevelVotingEntryWI_C_OnLoaded_E57C6BCC4E33F49593B8E1AAF195D54C");
static_assert(sizeof(LevelVotingEntryWI_C_OnLoaded_E57C6BCC4E33F49593B8E1AAF195D54C) == 0x000008, "Wrong size on LevelVotingEntryWI_C_OnLoaded_E57C6BCC4E33F49593B8E1AAF195D54C");
static_assert(offsetof(LevelVotingEntryWI_C_OnLoaded_E57C6BCC4E33F49593B8E1AAF195D54C, Loaded) == 0x000000, "Member 'LevelVotingEntryWI_C_OnLoaded_E57C6BCC4E33F49593B8E1AAF195D54C::Loaded' has a wrong offset!");

// Function LevelVotingEntryWI.LevelVotingEntryWI_C.SetTotalVotes
// 0x000C (0x000C - 0x0000)
struct LevelVotingEntryWI_C_SetTotalVotes final
{
public:
	int32                                         Votes;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingEntryWI_C_SetTotalVotes) == 0x000004, "Wrong alignment on LevelVotingEntryWI_C_SetTotalVotes");
static_assert(sizeof(LevelVotingEntryWI_C_SetTotalVotes) == 0x00000C, "Wrong size on LevelVotingEntryWI_C_SetTotalVotes");
static_assert(offsetof(LevelVotingEntryWI_C_SetTotalVotes, Votes) == 0x000000, "Member 'LevelVotingEntryWI_C_SetTotalVotes::Votes' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_SetTotalVotes, Temp_byte_Variable) == 0x000004, "Member 'LevelVotingEntryWI_C_SetTotalVotes::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_SetTotalVotes, CallFunc_Greater_IntInt_ReturnValue) == 0x000005, "Member 'LevelVotingEntryWI_C_SetTotalVotes::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_SetTotalVotes, Temp_byte_Variable_1) == 0x000006, "Member 'LevelVotingEntryWI_C_SetTotalVotes::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_SetTotalVotes, Temp_bool_Variable) == 0x000007, "Member 'LevelVotingEntryWI_C_SetTotalVotes::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_SetTotalVotes, K2Node_Select_Default) == 0x000008, "Member 'LevelVotingEntryWI_C_SetTotalVotes::K2Node_Select_Default' has a wrong offset!");

// Function LevelVotingEntryWI.LevelVotingEntryWI_C.Increment Throbber Count
// 0x0004 (0x0004 - 0x0000)
struct LevelVotingEntryWI_C_Increment_Throbber_Count final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingEntryWI_C_Increment_Throbber_Count) == 0x000004, "Wrong alignment on LevelVotingEntryWI_C_Increment_Throbber_Count");
static_assert(sizeof(LevelVotingEntryWI_C_Increment_Throbber_Count) == 0x000004, "Wrong size on LevelVotingEntryWI_C_Increment_Throbber_Count");
static_assert(offsetof(LevelVotingEntryWI_C_Increment_Throbber_Count, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'LevelVotingEntryWI_C_Increment_Throbber_Count::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function LevelVotingEntryWI.LevelVotingEntryWI_C.Set Level Background
// 0x0070 (0x0070 - 0x0000)
struct LevelVotingEntryWI_C_Set_Level_Background final
{
public:
	class FString                                 CallFunc_BreakSoftObjectPath_PathString;           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue; // 0x0020(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LevelVotingEntryWI_C_Set_Level_Background) == 0x000008, "Wrong alignment on LevelVotingEntryWI_C_Set_Level_Background");
static_assert(sizeof(LevelVotingEntryWI_C_Set_Level_Background) == 0x000070, "Wrong size on LevelVotingEntryWI_C_Set_Level_Background");
static_assert(offsetof(LevelVotingEntryWI_C_Set_Level_Background, CallFunc_BreakSoftObjectPath_PathString) == 0x000000, "Member 'LevelVotingEntryWI_C_Set_Level_Background::CallFunc_BreakSoftObjectPath_PathString' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_Set_Level_Background, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'LevelVotingEntryWI_C_Set_Level_Background::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_Set_Level_Background, CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue) == 0x000020, "Member 'LevelVotingEntryWI_C_Set_Level_Background::CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_Set_Level_Background, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'LevelVotingEntryWI_C_Set_Level_Background::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_Set_Level_Background, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000058, "Member 'LevelVotingEntryWI_C_Set_Level_Background::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_Set_Level_Background, K2Node_DynamicCast_AsTexture_2D) == 0x000060, "Member 'LevelVotingEntryWI_C_Set_Level_Background::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(LevelVotingEntryWI_C_Set_Level_Background, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'LevelVotingEntryWI_C_Set_Level_Background::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function LevelVotingEntryWI.LevelVotingEntryWI_C.OnVotingFinished
// 0x0008 (0x0008 - 0x0000)
struct LevelVotingEntryWI_C_OnVotingFinished final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingEntryWI_C_OnVotingFinished) == 0x000008, "Wrong alignment on LevelVotingEntryWI_C_OnVotingFinished");
static_assert(sizeof(LevelVotingEntryWI_C_OnVotingFinished) == 0x000008, "Wrong size on LevelVotingEntryWI_C_OnVotingFinished");
static_assert(offsetof(LevelVotingEntryWI_C_OnVotingFinished, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'LevelVotingEntryWI_C_OnVotingFinished::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

