#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelVotingWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function LevelVotingWI.LevelVotingWI_C.ExecuteUbergraph_LevelVotingWI
// 0x0030 (0x0030 - 0x0000)
struct LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetOrganizer*                       CallFunc_GetWidgetOrganizer_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI) == 0x000008, "Wrong alignment on LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI");
static_assert(sizeof(LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI) == 0x000030, "Wrong size on LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI");
static_assert(offsetof(LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI, EntryPoint) == 0x000000, "Member 'LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000008, "Member 'LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI, CallFunc_GetWidgetOrganizer_ReturnValue) == 0x000028, "Member 'LevelVotingWI_C_ExecuteUbergraph_LevelVotingWI::CallFunc_GetWidgetOrganizer_ReturnValue' has a wrong offset!");

// Function LevelVotingWI.LevelVotingWI_C.PopulateChildren
// 0x00D8 (0x00D8 - 0x0000)
struct LevelVotingWI_C_PopulateChildren final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelVotingEntryWI_C*                  CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelVotingEntryWI_C*                  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelVoteComponent*                    CallFunc_GetLevelVoteManager_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLevelVoteData>                 CallFunc_GetLevelVoteData_ReturnValue;             // 0x0060(0x0010)(ReferenceParm)
	class ULevelVoteComponent*                    CallFunc_GetLevelVoteManager_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Array_Get_Item_1;                         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLevelVoteData                         CallFunc_Array_Get_Item_2;                         // 0x0088(0x0050)()
};
static_assert(alignof(LevelVotingWI_C_PopulateChildren) == 0x000008, "Wrong alignment on LevelVotingWI_C_PopulateChildren");
static_assert(sizeof(LevelVotingWI_C_PopulateChildren) == 0x0000D8, "Wrong size on LevelVotingWI_C_PopulateChildren");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, Temp_int_Array_Index_Variable) == 0x000000, "Member 'LevelVotingWI_C_PopulateChildren::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'LevelVotingWI_C_PopulateChildren::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'LevelVotingWI_C_PopulateChildren::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Create_ReturnValue) == 0x000010, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'LevelVotingWI_C_PopulateChildren::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Array_Get_Item) == 0x000020, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_GetLevelVoteManager_ReturnValue) == 0x000038, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_GetLevelVoteManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Array_Length_ReturnValue_2) == 0x000044, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000048, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_GetLevelVoteData_ReturnValue) == 0x000060, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_GetLevelVoteData_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_GetLevelVoteManager_ReturnValue_1) == 0x000070, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_GetLevelVoteManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Array_Length_ReturnValue_3) == 0x000078, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Array_Get_Item_1) == 0x00007C, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Less_IntInt_ReturnValue_1) == 0x00007D, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000080, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_PopulateChildren, CallFunc_Array_Get_Item_2) == 0x000088, "Member 'LevelVotingWI_C_PopulateChildren::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function LevelVotingWI.LevelVotingWI_C.Disable Selections
// 0x0020 (0x0020 - 0x0000)
struct LevelVotingWI_C_Disable_Selections final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelVotingEntryWI_C*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LevelVotingWI_C_Disable_Selections) == 0x000008, "Wrong alignment on LevelVotingWI_C_Disable_Selections");
static_assert(sizeof(LevelVotingWI_C_Disable_Selections) == 0x000020, "Wrong size on LevelVotingWI_C_Disable_Selections");
static_assert(offsetof(LevelVotingWI_C_Disable_Selections, Temp_int_Array_Index_Variable) == 0x000000, "Member 'LevelVotingWI_C_Disable_Selections::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Disable_Selections, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'LevelVotingWI_C_Disable_Selections::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Disable_Selections, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'LevelVotingWI_C_Disable_Selections::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Disable_Selections, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'LevelVotingWI_C_Disable_Selections::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Disable_Selections, CallFunc_Array_Get_Item) == 0x000010, "Member 'LevelVotingWI_C_Disable_Selections::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Disable_Selections, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'LevelVotingWI_C_Disable_Selections::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function LevelVotingWI.LevelVotingWI_C.On Final Level Selected
// 0x0060 (0x0060 - 0x0000)
struct LevelVotingWI_C_On_Final_Level_Selected final
{
public:
	struct FSelectedLevelData                     SelectedLevel;                                     // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingWI_C_On_Final_Level_Selected) == 0x000008, "Wrong alignment on LevelVotingWI_C_On_Final_Level_Selected");
static_assert(sizeof(LevelVotingWI_C_On_Final_Level_Selected) == 0x000060, "Wrong size on LevelVotingWI_C_On_Final_Level_Selected");
static_assert(offsetof(LevelVotingWI_C_On_Final_Level_Selected, SelectedLevel) == 0x000000, "Member 'LevelVotingWI_C_On_Final_Level_Selected::SelectedLevel' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_On_Final_Level_Selected, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'LevelVotingWI_C_On_Final_Level_Selected::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function LevelVotingWI.LevelVotingWI_C.OnTotalVotesChanged
// 0x0010 (0x0010 - 0x0000)
struct LevelVotingWI_C_OnTotalVotesChanged final
{
public:
	int32                                         UpdatedLevel;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewVoteCount;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelVotingEntryWI_C*                  CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingWI_C_OnTotalVotesChanged) == 0x000008, "Wrong alignment on LevelVotingWI_C_OnTotalVotesChanged");
static_assert(sizeof(LevelVotingWI_C_OnTotalVotesChanged) == 0x000010, "Wrong size on LevelVotingWI_C_OnTotalVotesChanged");
static_assert(offsetof(LevelVotingWI_C_OnTotalVotesChanged, UpdatedLevel) == 0x000000, "Member 'LevelVotingWI_C_OnTotalVotesChanged::UpdatedLevel' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_OnTotalVotesChanged, NewVoteCount) == 0x000004, "Member 'LevelVotingWI_C_OnTotalVotesChanged::NewVoteCount' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_OnTotalVotesChanged, CallFunc_Array_Get_Item) == 0x000008, "Member 'LevelVotingWI_C_OnTotalVotesChanged::CallFunc_Array_Get_Item' has a wrong offset!");

// Function LevelVotingWI.LevelVotingWI_C.UpdateTimeoutText
// 0x0028 (0x0028 - 0x0000)
struct LevelVotingWI_C_UpdateTimeoutText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTimeoutTime_Secconds;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	int32                                         CallFunc_GetTimeoutTime_Secconds_1;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingWI_C_UpdateTimeoutText) == 0x000008, "Wrong alignment on LevelVotingWI_C_UpdateTimeoutText");
static_assert(sizeof(LevelVotingWI_C_UpdateTimeoutText) == 0x000028, "Wrong size on LevelVotingWI_C_UpdateTimeoutText");
static_assert(offsetof(LevelVotingWI_C_UpdateTimeoutText, Temp_bool_Variable) == 0x000000, "Member 'LevelVotingWI_C_UpdateTimeoutText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_UpdateTimeoutText, Temp_byte_Variable) == 0x000001, "Member 'LevelVotingWI_C_UpdateTimeoutText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_UpdateTimeoutText, Temp_byte_Variable_1) == 0x000002, "Member 'LevelVotingWI_C_UpdateTimeoutText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_UpdateTimeoutText, CallFunc_GetTimeoutTime_Secconds) == 0x000004, "Member 'LevelVotingWI_C_UpdateTimeoutText::CallFunc_GetTimeoutTime_Secconds' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_UpdateTimeoutText, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'LevelVotingWI_C_UpdateTimeoutText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_UpdateTimeoutText, CallFunc_GetTimeoutTime_Secconds_1) == 0x000020, "Member 'LevelVotingWI_C_UpdateTimeoutText::CallFunc_GetTimeoutTime_Secconds_1' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_UpdateTimeoutText, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'LevelVotingWI_C_UpdateTimeoutText::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_UpdateTimeoutText, K2Node_Select_Default) == 0x000025, "Member 'LevelVotingWI_C_UpdateTimeoutText::K2Node_Select_Default' has a wrong offset!");

// Function LevelVotingWI.LevelVotingWI_C.Bind To Callbacks
// 0x0030 (0x0030 - 0x0000)
struct LevelVotingWI_C_Bind_To_Callbacks final
{
public:
	TDelegate<void(float ServerTimeoutTime)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class ULevelVoteComponent*                    CallFunc_GetLevelVoteManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 UpdatedLevel, int32 NewVoteCount)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class ULevelVoteComponent*                    CallFunc_GetLevelVoteManager_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingWI_C_Bind_To_Callbacks) == 0x000008, "Wrong alignment on LevelVotingWI_C_Bind_To_Callbacks");
static_assert(sizeof(LevelVotingWI_C_Bind_To_Callbacks) == 0x000030, "Wrong size on LevelVotingWI_C_Bind_To_Callbacks");
static_assert(offsetof(LevelVotingWI_C_Bind_To_Callbacks, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'LevelVotingWI_C_Bind_To_Callbacks::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Bind_To_Callbacks, CallFunc_GetLevelVoteManager_ReturnValue) == 0x000010, "Member 'LevelVotingWI_C_Bind_To_Callbacks::CallFunc_GetLevelVoteManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Bind_To_Callbacks, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'LevelVotingWI_C_Bind_To_Callbacks::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Bind_To_Callbacks, CallFunc_GetLevelVoteManager_ReturnValue_1) == 0x000028, "Member 'LevelVotingWI_C_Bind_To_Callbacks::CallFunc_GetLevelVoteManager_ReturnValue_1' has a wrong offset!");

// Function LevelVotingWI.LevelVotingWI_C.Timeout Time Changed
// 0x0028 (0x0028 - 0x0000)
struct LevelVotingWI_C_Timeout_Time_Changed final
{
public:
	float                                         ServerTimeoutTime;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LevelVotingWI_C_Timeout_Time_Changed) == 0x000008, "Wrong alignment on LevelVotingWI_C_Timeout_Time_Changed");
static_assert(sizeof(LevelVotingWI_C_Timeout_Time_Changed) == 0x000028, "Wrong size on LevelVotingWI_C_Timeout_Time_Changed");
static_assert(offsetof(LevelVotingWI_C_Timeout_Time_Changed, ServerTimeoutTime) == 0x000000, "Member 'LevelVotingWI_C_Timeout_Time_Changed::ServerTimeoutTime' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Timeout_Time_Changed, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'LevelVotingWI_C_Timeout_Time_Changed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Timeout_Time_Changed, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'LevelVotingWI_C_Timeout_Time_Changed::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Timeout_Time_Changed, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000020, "Member 'LevelVotingWI_C_Timeout_Time_Changed::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function LevelVotingWI.LevelVotingWI_C.Communicate Finished To Children
// 0x0020 (0x0020 - 0x0000)
struct LevelVotingWI_C_Communicate_Finished_To_Children final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelVotingEntryWI_C*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LevelVotingWI_C_Communicate_Finished_To_Children) == 0x000008, "Wrong alignment on LevelVotingWI_C_Communicate_Finished_To_Children");
static_assert(sizeof(LevelVotingWI_C_Communicate_Finished_To_Children) == 0x000020, "Wrong size on LevelVotingWI_C_Communicate_Finished_To_Children");
static_assert(offsetof(LevelVotingWI_C_Communicate_Finished_To_Children, Temp_int_Array_Index_Variable) == 0x000000, "Member 'LevelVotingWI_C_Communicate_Finished_To_Children::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Communicate_Finished_To_Children, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'LevelVotingWI_C_Communicate_Finished_To_Children::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Communicate_Finished_To_Children, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'LevelVotingWI_C_Communicate_Finished_To_Children::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Communicate_Finished_To_Children, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'LevelVotingWI_C_Communicate_Finished_To_Children::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Communicate_Finished_To_Children, CallFunc_Array_Get_Item) == 0x000010, "Member 'LevelVotingWI_C_Communicate_Finished_To_Children::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_Communicate_Finished_To_Children, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'LevelVotingWI_C_Communicate_Finished_To_Children::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function LevelVotingWI.LevelVotingWI_C.Show Final Level Panel
// 0x0008 (0x0008 - 0x0000)
struct LevelVotingWI_C_Show_Final_Level_Panel final
{
public:
	class ULevelVoteComponent*                    CallFunc_GetLevelVoteManager_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingWI_C_Show_Final_Level_Panel) == 0x000008, "Wrong alignment on LevelVotingWI_C_Show_Final_Level_Panel");
static_assert(sizeof(LevelVotingWI_C_Show_Final_Level_Panel) == 0x000008, "Wrong size on LevelVotingWI_C_Show_Final_Level_Panel");
static_assert(offsetof(LevelVotingWI_C_Show_Final_Level_Panel, CallFunc_GetLevelVoteManager_ReturnValue) == 0x000000, "Member 'LevelVotingWI_C_Show_Final_Level_Panel::CallFunc_GetLevelVoteManager_ReturnValue' has a wrong offset!");

// Function LevelVotingWI.LevelVotingWI_C.GetTimeoutTime
// 0x0028 (0x0028 - 0x0000)
struct LevelVotingWI_C_GetTimeoutTime final
{
public:
	int32                                         Secconds;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelVoteComponent*                    CallFunc_GetLevelVoteManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelVotingWI_C_GetTimeoutTime) == 0x000008, "Wrong alignment on LevelVotingWI_C_GetTimeoutTime");
static_assert(sizeof(LevelVotingWI_C_GetTimeoutTime) == 0x000028, "Wrong size on LevelVotingWI_C_GetTimeoutTime");
static_assert(offsetof(LevelVotingWI_C_GetTimeoutTime, Secconds) == 0x000000, "Member 'LevelVotingWI_C_GetTimeoutTime::Secconds' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_GetTimeoutTime, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'LevelVotingWI_C_GetTimeoutTime::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelVotingWI_C_GetTimeoutTime, CallFunc_GetLevelVoteManager_ReturnValue) == 0x000010, "Member 'LevelVotingWI_C_GetTimeoutTime::CallFunc_GetLevelVoteManager_ReturnValue' has a wrong offset!");
