#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelVotingWI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LevelVotingWI.LevelVotingWI_C
// 0x00A8 (0x0328 - 0x0280)
class ULevelVotingWI_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       OnFinalLevelSelected;                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CountdownNumber;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULevelVotingFinalSelectionWI_C*         FinalLevelSelectionPanel;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Options;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TimeoutFrame;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class ULevelVotingEntryWI_C*>          Children;                                          // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FSelectedLevelData                     Selected_Level;                                    // 0x02C8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           TimeoutTimerHandle;                                // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LevelVotingWI(int32 EntryPoint);
	void Pressed_Options();
	void Construct();
	void PopulateChildren();
	void Disable_Selections();
	void On_Final_Level_Selected(const struct FSelectedLevelData& SelectedLevel);
	void OnTotalVotesChanged(int32 UpdatedLevel, int32 NewVoteCount);
	void UpdateTimeoutText();
	void Bind_To_Callbacks();
	void Timeout_Time_Changed(float ServerTimeoutTime);
	void Communicate_Finished_To_Children();
	void Show_Final_Level_Panel();

	void GetTimeoutTime(int32* Secconds) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LevelVotingWI_C">();
	}
	static class ULevelVotingWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelVotingWI_C>();
	}
};
static_assert(alignof(ULevelVotingWI_C) == 0x000008, "Wrong alignment on ULevelVotingWI_C");
static_assert(sizeof(ULevelVotingWI_C) == 0x000328, "Wrong size on ULevelVotingWI_C");
static_assert(offsetof(ULevelVotingWI_C, UberGraphFrame) == 0x000280, "Member 'ULevelVotingWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULevelVotingWI_C, OnFinalLevelSelected) == 0x000288, "Member 'ULevelVotingWI_C::OnFinalLevelSelected' has a wrong offset!");
static_assert(offsetof(ULevelVotingWI_C, Background) == 0x000290, "Member 'ULevelVotingWI_C::Background' has a wrong offset!");
static_assert(offsetof(ULevelVotingWI_C, CountdownNumber) == 0x000298, "Member 'ULevelVotingWI_C::CountdownNumber' has a wrong offset!");
static_assert(offsetof(ULevelVotingWI_C, FinalLevelSelectionPanel) == 0x0002A0, "Member 'ULevelVotingWI_C::FinalLevelSelectionPanel' has a wrong offset!");
static_assert(offsetof(ULevelVotingWI_C, Options) == 0x0002A8, "Member 'ULevelVotingWI_C::Options' has a wrong offset!");
static_assert(offsetof(ULevelVotingWI_C, TimeoutFrame) == 0x0002B0, "Member 'ULevelVotingWI_C::TimeoutFrame' has a wrong offset!");
static_assert(offsetof(ULevelVotingWI_C, Children) == 0x0002B8, "Member 'ULevelVotingWI_C::Children' has a wrong offset!");
static_assert(offsetof(ULevelVotingWI_C, Selected_Level) == 0x0002C8, "Member 'ULevelVotingWI_C::Selected_Level' has a wrong offset!");
static_assert(offsetof(ULevelVotingWI_C, TimeoutTimerHandle) == 0x000320, "Member 'ULevelVotingWI_C::TimeoutTimerHandle' has a wrong offset!");

}

