#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lighter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass lighter.lighter_C
// 0x0018 (0x0238 - 0x0220)
class ALighter_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_lighter(int32 EntryPoint);
	void LighterVisibility();
	void SimulatePhysics();
	void LightOff();
	void LightOn();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"lighter_C">();
	}
	static class ALighter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALighter_C>();
	}
};
static_assert(alignof(ALighter_C) == 0x000008, "Wrong alignment on ALighter_C");
static_assert(sizeof(ALighter_C) == 0x000238, "Wrong size on ALighter_C");
static_assert(offsetof(ALighter_C, UberGraphFrame) == 0x000220, "Member 'ALighter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALighter_C, SkeletalMesh) == 0x000228, "Member 'ALighter_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ALighter_C, DefaultSceneRoot) == 0x000230, "Member 'ALighter_C::DefaultSceneRoot' has a wrong offset!");

}

