#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocalUserRecords

#include "Basic.hpp"

#include "SCT_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LocalUserRecords.LocalUserRecords_C
// 0x0010 (0x0050 - 0x0040)
class ULocalUserRecords_C final : public USCTSaveSlot
{
public:
	int32                                         Level;                                             // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         XP;                                                // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InfinityCoins;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LocalUserRecords_C">();
	}
	static class ULocalUserRecords_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalUserRecords_C>();
	}
};
static_assert(alignof(ULocalUserRecords_C) == 0x000008, "Wrong alignment on ULocalUserRecords_C");
static_assert(sizeof(ULocalUserRecords_C) == 0x000050, "Wrong size on ULocalUserRecords_C");
static_assert(offsetof(ULocalUserRecords_C, Level) == 0x000040, "Member 'ULocalUserRecords_C::Level' has a wrong offset!");
static_assert(offsetof(ULocalUserRecords_C, XP) == 0x000044, "Member 'ULocalUserRecords_C::XP' has a wrong offset!");
static_assert(offsetof(ULocalUserRecords_C, InfinityCoins) == 0x000048, "Member 'ULocalUserRecords_C::InfinityCoins' has a wrong offset!");

}

