#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootBox_CrateBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LootBox_CrateBP.LootBox_CrateBP_C.ExecuteUbergraph_LootBox_CrateBP
// 0x00A8 (0x00A8 - 0x0000)
struct LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Alpha;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x001C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP) == 0x000004, "Wrong alignment on LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP");
static_assert(sizeof(LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP) == 0x0000A8, "Wrong size on LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP");
static_assert(offsetof(LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP, EntryPoint) == 0x000000, "Member 'LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP, K2Node_Event_Alpha) == 0x000004, "Member 'LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP::K2Node_Event_Alpha' has a wrong offset!");
static_assert(offsetof(LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP, CallFunc_Abs_ReturnValue) == 0x000008, "Member 'LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP, CallFunc_Lerp_ReturnValue) == 0x00000C, "Member 'LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00001C, "Member 'LootBox_CrateBP_C_ExecuteUbergraph_LootBox_CrateBP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function LootBox_CrateBP.LootBox_CrateBP_C.OpenUpdate_Cosmetic
// 0x0004 (0x0004 - 0x0000)
struct LootBox_CrateBP_C_OpenUpdate_Cosmetic final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LootBox_CrateBP_C_OpenUpdate_Cosmetic) == 0x000004, "Wrong alignment on LootBox_CrateBP_C_OpenUpdate_Cosmetic");
static_assert(sizeof(LootBox_CrateBP_C_OpenUpdate_Cosmetic) == 0x000004, "Wrong size on LootBox_CrateBP_C_OpenUpdate_Cosmetic");
static_assert(offsetof(LootBox_CrateBP_C_OpenUpdate_Cosmetic, Alpha) == 0x000000, "Member 'LootBox_CrateBP_C_OpenUpdate_Cosmetic::Alpha' has a wrong offset!");

// Function LootBox_CrateBP.LootBox_CrateBP_C.GetOutlineMeshes
// 0x0020 (0x0020 - 0x0000)
struct LootBox_CrateBP_C_GetOutlineMeshes final
{
public:
	TArray<class UPrimitiveComponent*>            Meshes;                                            // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(LootBox_CrateBP_C_GetOutlineMeshes) == 0x000008, "Wrong alignment on LootBox_CrateBP_C_GetOutlineMeshes");
static_assert(sizeof(LootBox_CrateBP_C_GetOutlineMeshes) == 0x000020, "Wrong size on LootBox_CrateBP_C_GetOutlineMeshes");
static_assert(offsetof(LootBox_CrateBP_C_GetOutlineMeshes, Meshes) == 0x000000, "Member 'LootBox_CrateBP_C_GetOutlineMeshes::Meshes' has a wrong offset!");
static_assert(offsetof(LootBox_CrateBP_C_GetOutlineMeshes, K2Node_MakeArray_Array) == 0x000010, "Member 'LootBox_CrateBP_C_GetOutlineMeshes::K2Node_MakeArray_Array' has a wrong offset!");

}

