#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootBox_CrateBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LooBoxBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LootBox_CrateBP.LootBox_CrateBP_C
// 0x0018 (0x0350 - 0x0338)
class ALootBox_CrateBP_C final : public ALooBoxBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_LootBox_CrateBP_C;                  // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Lid;                                               // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Lid_Open_Rotation_Offset;                          // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LootBox_CrateBP(int32 EntryPoint);
	void OpenStart_Cosmetic();
	void OpenUpdate_Cosmetic(float Alpha);
	void GetOutlineMeshes(TArray<class UPrimitiveComponent*>* Meshes);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LootBox_CrateBP_C">();
	}
	static class ALootBox_CrateBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALootBox_CrateBP_C>();
	}
};
static_assert(alignof(ALootBox_CrateBP_C) == 0x000008, "Wrong alignment on ALootBox_CrateBP_C");
static_assert(sizeof(ALootBox_CrateBP_C) == 0x000350, "Wrong size on ALootBox_CrateBP_C");
static_assert(offsetof(ALootBox_CrateBP_C, UberGraphFrame_LootBox_CrateBP_C) == 0x000338, "Member 'ALootBox_CrateBP_C::UberGraphFrame_LootBox_CrateBP_C' has a wrong offset!");
static_assert(offsetof(ALootBox_CrateBP_C, Lid) == 0x000340, "Member 'ALootBox_CrateBP_C::Lid' has a wrong offset!");
static_assert(offsetof(ALootBox_CrateBP_C, Lid_Open_Rotation_Offset) == 0x000348, "Member 'ALootBox_CrateBP_C::Lid_Open_Rotation_Offset' has a wrong offset!");

}

