#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsSliderCheckboxWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function OptionsSliderCheckboxWI.OptionsSliderCheckboxWI_C.UpdateSliderTextValue
// 0x0028 (0x0028 - 0x0000)
struct OptionsSliderCheckboxWI_C_UpdateSliderTextValue final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOn_ReturnValue;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0008(0x0018)()
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsSliderCheckboxWI_C_UpdateSliderTextValue) == 0x000008, "Wrong alignment on OptionsSliderCheckboxWI_C_UpdateSliderTextValue");
static_assert(sizeof(OptionsSliderCheckboxWI_C_UpdateSliderTextValue) == 0x000028, "Wrong size on OptionsSliderCheckboxWI_C_UpdateSliderTextValue");
static_assert(offsetof(OptionsSliderCheckboxWI_C_UpdateSliderTextValue, Temp_bool_Variable) == 0x000000, "Member 'OptionsSliderCheckboxWI_C_UpdateSliderTextValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsSliderCheckboxWI_C_UpdateSliderTextValue, CallFunc_IsOn_ReturnValue) == 0x000001, "Member 'OptionsSliderCheckboxWI_C_UpdateSliderTextValue::CallFunc_IsOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderCheckboxWI_C_UpdateSliderTextValue, K2Node_Select_Default) == 0x000008, "Member 'OptionsSliderCheckboxWI_C_UpdateSliderTextValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OptionsSliderCheckboxWI_C_UpdateSliderTextValue, CallFunc_GetValue_ReturnValue) == 0x000020, "Member 'OptionsSliderCheckboxWI_C_UpdateSliderTextValue::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderCheckboxWI_C_UpdateSliderTextValue, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'OptionsSliderCheckboxWI_C_UpdateSliderTextValue::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function OptionsSliderCheckboxWI.OptionsSliderCheckboxWI_C.IsOn
// 0x0014 (0x0014 - 0x0000)
struct OptionsSliderCheckboxWI_C_IsOn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsSliderCheckboxWI_C_IsOn) == 0x000004, "Wrong alignment on OptionsSliderCheckboxWI_C_IsOn");
static_assert(sizeof(OptionsSliderCheckboxWI_C_IsOn) == 0x000014, "Wrong size on OptionsSliderCheckboxWI_C_IsOn");
static_assert(offsetof(OptionsSliderCheckboxWI_C_IsOn, ReturnValue) == 0x000000, "Member 'OptionsSliderCheckboxWI_C_IsOn::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderCheckboxWI_C_IsOn, CallFunc_GetValue_ReturnValue) == 0x000004, "Member 'OptionsSliderCheckboxWI_C_IsOn::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderCheckboxWI_C_IsOn, CallFunc_GridSnap_Float_ReturnValue) == 0x000008, "Member 'OptionsSliderCheckboxWI_C_IsOn::CallFunc_GridSnap_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderCheckboxWI_C_IsOn, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'OptionsSliderCheckboxWI_C_IsOn::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderCheckboxWI_C_IsOn, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'OptionsSliderCheckboxWI_C_IsOn::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

