#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsTabButtonWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsTabButtonWI.OptionsTabButtonWI_C
// 0x0048 (0x02A8 - 0x0260)
class UOptionsTabButtonWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UMenuButton*                            ButtonTabMenu;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0278(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             Pressed;                                           // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          AltStyle;                                          // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Pressed__DelegateSignature();
	void ExecuteUbergraph_OptionsTabButtonWI(int32 EntryPoint);
	void BndEvt__ButtonTabMenu_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__ButtonTabMenu_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void GetNavigationWidget(class UWidget** NavigationWidget);
	void SetNavigationForDirection(EUINavigation Direction, class UWidget* WidgetTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsTabButtonWI_C">();
	}
	static class UOptionsTabButtonWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsTabButtonWI_C>();
	}
};
static_assert(alignof(UOptionsTabButtonWI_C) == 0x000008, "Wrong alignment on UOptionsTabButtonWI_C");
static_assert(sizeof(UOptionsTabButtonWI_C) == 0x0002A8, "Wrong size on UOptionsTabButtonWI_C");
static_assert(offsetof(UOptionsTabButtonWI_C, UberGraphFrame) == 0x000260, "Member 'UOptionsTabButtonWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsTabButtonWI_C, ButtonTabMenu) == 0x000268, "Member 'UOptionsTabButtonWI_C::ButtonTabMenu' has a wrong offset!");
static_assert(offsetof(UOptionsTabButtonWI_C, Text) == 0x000270, "Member 'UOptionsTabButtonWI_C::Text' has a wrong offset!");
static_assert(offsetof(UOptionsTabButtonWI_C, ButtonText) == 0x000278, "Member 'UOptionsTabButtonWI_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UOptionsTabButtonWI_C, Pressed) == 0x000290, "Member 'UOptionsTabButtonWI_C::Pressed' has a wrong offset!");
static_assert(offsetof(UOptionsTabButtonWI_C, AltStyle) == 0x0002A0, "Member 'UOptionsTabButtonWI_C::AltStyle' has a wrong offset!");

}

