#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OtherPersonoidsList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OtherPersonoidsList.OtherPersonoidsList_C
// 0x0040 (0x02A0 - 0x0260)
class UOtherPersonoidsList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UHorizontalBox*                         EntryList;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HiddenPersonoids;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           NoOtherPersonoids;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OtherPersonoidFrame;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           OtherPersonoids;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class ASCTPlayerState*>                PlayerStates;                                      // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_OtherPersonoidsList(int32 EntryPoint);
	void Initialize();
	void CacheOtherPersonoidsPlayerStates();
	void Initialize_Only_Personoid();
	void InitializeOtherPersonoids();
	void InitializeHiddenPersonoids();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OtherPersonoidsList_C">();
	}
	static class UOtherPersonoidsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOtherPersonoidsList_C>();
	}
};
static_assert(alignof(UOtherPersonoidsList_C) == 0x000008, "Wrong alignment on UOtherPersonoidsList_C");
static_assert(sizeof(UOtherPersonoidsList_C) == 0x0002A0, "Wrong size on UOtherPersonoidsList_C");
static_assert(offsetof(UOtherPersonoidsList_C, UberGraphFrame) == 0x000260, "Member 'UOtherPersonoidsList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOtherPersonoidsList_C, EntryList) == 0x000268, "Member 'UOtherPersonoidsList_C::EntryList' has a wrong offset!");
static_assert(offsetof(UOtherPersonoidsList_C, HiddenPersonoids) == 0x000270, "Member 'UOtherPersonoidsList_C::HiddenPersonoids' has a wrong offset!");
static_assert(offsetof(UOtherPersonoidsList_C, NoOtherPersonoids) == 0x000278, "Member 'UOtherPersonoidsList_C::NoOtherPersonoids' has a wrong offset!");
static_assert(offsetof(UOtherPersonoidsList_C, OtherPersonoidFrame) == 0x000280, "Member 'UOtherPersonoidsList_C::OtherPersonoidFrame' has a wrong offset!");
static_assert(offsetof(UOtherPersonoidsList_C, OtherPersonoids) == 0x000288, "Member 'UOtherPersonoidsList_C::OtherPersonoids' has a wrong offset!");
static_assert(offsetof(UOtherPersonoidsList_C, PlayerStates) == 0x000290, "Member 'UOtherPersonoidsList_C::PlayerStates' has a wrong offset!");

}

