#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OtherPersonoidsEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OtherPersonoidsEntry.OtherPersonoidsEntry_C.ExecuteUbergraph_OtherPersonoidsEntry
// 0x0100 (0x0100 - 0x0000)
struct OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	class FString                                 CallFunc_ColorToHex_ReturnValue;                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0080(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
};
static_assert(alignof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry) == 0x000008, "Wrong alignment on OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry");
static_assert(sizeof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry) == 0x000100, "Wrong size on OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry");
static_assert(offsetof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry, EntryPoint) == 0x000000, "Member 'OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry, CallFunc_GetPlayerName_ReturnValue) == 0x000008, "Member 'OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry, CallFunc_ColorToHex_ReturnValue) == 0x000030, "Member 'OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry::CallFunc_ColorToHex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000080, "Member 'OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry, K2Node_MakeArray_Array) == 0x0000D8, "Member 'OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'OtherPersonoidsEntry_C_ExecuteUbergraph_OtherPersonoidsEntry::CallFunc_Format_ReturnValue' has a wrong offset!");

}

