#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OverdoseSyringeGA

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.ExecuteUbergraph_OverdoseSyringeGA
// 0x0260 (0x0260 - 0x0000)
struct OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_1;                   // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_GrabbedCharacter;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_CustomEvent_TargetTransform;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_OwningActor;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Owning_Actor;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNetAuthority_ReturnValue;               // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNetAuthority_ReturnValue_1;             // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNetAuthority_ReturnValue_2;             // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNetAuthority_ReturnValue_3;             // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate_6;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0190(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x01A8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01CC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA) == 0x000010, "Wrong alignment on OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA");
static_assert(sizeof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA) == 0x000260, "Wrong size on OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, EntryPoint) == 0x000000, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000048, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CreateDelegate_OutputDelegate_4) == 0x000050, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_DynamicCast_AsIAnim_Bp) == 0x000068, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_DynamicCast_AsIAnim_Bp_1) == 0x000080, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_DynamicCast_AsIAnim_Bp_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsValid_ReturnValue_1) == 0x000091, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000094, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsValid_ReturnValue_2) == 0x0000A0, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000A1, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CustomEvent_GrabbedCharacter) == 0x0000A8, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CustomEvent_GrabbedCharacter' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CustomEvent_TargetTransform) == 0x0000B0, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CustomEvent_TargetTransform' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CustomEvent_OwningActor) == 0x0000E0, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CustomEvent_OwningActor' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_BreakTransform_Location) == 0x0000E8, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_BreakTransform_Rotation) == 0x0000F4, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_BreakTransform_Scale) == 0x000100, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00010C, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_WaitInputRelease_ReturnValue) == 0x000110, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsValid_ReturnValue_3) == 0x000118, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CreateDelegate_OutputDelegate_5) == 0x00011C, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000130, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, Temp_float_Variable) == 0x000138, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CustomEvent_Owning_Actor) == 0x000140, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CustomEvent_Owning_Actor' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CustomEvent_TimeHeld) == 0x000148, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsNetAuthority_ReturnValue) == 0x00014C, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsNetAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsNetAuthority_ReturnValue_1) == 0x00014D, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsNetAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_GetOwner_ReturnValue) == 0x000150, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000158, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_DynamicCast_bSuccess_2) == 0x000160, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_Event_bWasCancelled) == 0x000161, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsNetAuthority_ReturnValue_2) == 0x000162, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsNetAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsNetAuthority_ReturnValue_3) == 0x000163, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsNetAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000164, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000170, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, K2Node_CreateDelegate_OutputDelegate_6) == 0x000178, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_WaitDelay_ReturnValue) == 0x000188, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, Temp_delegate_Variable) == 0x000190, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_IsValid_ReturnValue_4) == 0x0001A0, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, Temp_struct_Variable) == 0x0001A8, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_PostAkEvent_ReturnValue) == 0x0001B8, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0001BC, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_VInterpTo_ReturnValue) == 0x0001C0, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0001CC, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000258, "Member 'OverdoseSyringeGA_C_ExecuteUbergraph_OverdoseSyringeGA::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct OverdoseSyringeGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OverdoseSyringeGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on OverdoseSyringeGA_C_K2_OnEndAbility");
static_assert(sizeof(OverdoseSyringeGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on OverdoseSyringeGA_C_K2_OnEndAbility");
static_assert(offsetof(OverdoseSyringeGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'OverdoseSyringeGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.MulticastStopGrab
// 0x0008 (0x0008 - 0x0000)
struct OverdoseSyringeGA_C_MulticastStopGrab final
{
public:
	class AActor*                                 Owning_Actor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OverdoseSyringeGA_C_MulticastStopGrab) == 0x000008, "Wrong alignment on OverdoseSyringeGA_C_MulticastStopGrab");
static_assert(sizeof(OverdoseSyringeGA_C_MulticastStopGrab) == 0x000008, "Wrong size on OverdoseSyringeGA_C_MulticastStopGrab");
static_assert(offsetof(OverdoseSyringeGA_C_MulticastStopGrab, Owning_Actor) == 0x000000, "Member 'OverdoseSyringeGA_C_MulticastStopGrab::Owning_Actor' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.MulticastStartGrab
// 0x0050 (0x0050 - 0x0000)
struct OverdoseSyringeGA_C_MulticastStartGrab final
{
public:
	class ACharacter*                             GrabbedCharacter;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TargetTransform;                                   // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class AActor*                                 OwningActor;                                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OverdoseSyringeGA_C_MulticastStartGrab) == 0x000010, "Wrong alignment on OverdoseSyringeGA_C_MulticastStartGrab");
static_assert(sizeof(OverdoseSyringeGA_C_MulticastStartGrab) == 0x000050, "Wrong size on OverdoseSyringeGA_C_MulticastStartGrab");
static_assert(offsetof(OverdoseSyringeGA_C_MulticastStartGrab, GrabbedCharacter) == 0x000000, "Member 'OverdoseSyringeGA_C_MulticastStartGrab::GrabbedCharacter' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_MulticastStartGrab, TargetTransform) == 0x000010, "Member 'OverdoseSyringeGA_C_MulticastStartGrab::TargetTransform' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_MulticastStartGrab, OwningActor) == 0x000040, "Member 'OverdoseSyringeGA_C_MulticastStartGrab::OwningActor' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.OnRelease_950F9AE4413484E8498DA2B3CF8C6B89
// 0x0004 (0x0004 - 0x0000)
struct OverdoseSyringeGA_C_OnRelease_950F9AE4413484E8498DA2B3CF8C6B89 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OverdoseSyringeGA_C_OnRelease_950F9AE4413484E8498DA2B3CF8C6B89) == 0x000004, "Wrong alignment on OverdoseSyringeGA_C_OnRelease_950F9AE4413484E8498DA2B3CF8C6B89");
static_assert(sizeof(OverdoseSyringeGA_C_OnRelease_950F9AE4413484E8498DA2B3CF8C6B89) == 0x000004, "Wrong size on OverdoseSyringeGA_C_OnRelease_950F9AE4413484E8498DA2B3CF8C6B89");
static_assert(offsetof(OverdoseSyringeGA_C_OnRelease_950F9AE4413484E8498DA2B3CF8C6B89, TimeHeld) == 0x000000, "Member 'OverdoseSyringeGA_C_OnRelease_950F9AE4413484E8498DA2B3CF8C6B89::TimeHeld' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.IgnoreCollision
// 0x0020 (0x0020 - 0x0000)
struct OverdoseSyringeGA_C_IgnoreCollision final
{
public:
	class ACharacter*                             GrabbedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OwningActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OverdoseSyringeGA_C_IgnoreCollision) == 0x000008, "Wrong alignment on OverdoseSyringeGA_C_IgnoreCollision");
static_assert(sizeof(OverdoseSyringeGA_C_IgnoreCollision) == 0x000020, "Wrong size on OverdoseSyringeGA_C_IgnoreCollision");
static_assert(offsetof(OverdoseSyringeGA_C_IgnoreCollision, GrabbedActor) == 0x000000, "Member 'OverdoseSyringeGA_C_IgnoreCollision::GrabbedActor' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_IgnoreCollision, OwningActor) == 0x000008, "Member 'OverdoseSyringeGA_C_IgnoreCollision::OwningActor' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_IgnoreCollision, K2Node_DynamicCast_AsCharacter) == 0x000010, "Member 'OverdoseSyringeGA_C_IgnoreCollision::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_IgnoreCollision, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'OverdoseSyringeGA_C_IgnoreCollision::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.EnableCollision
// 0x0020 (0x0020 - 0x0000)
struct OverdoseSyringeGA_C_EnableCollision final
{
public:
	class ACharacter*                             GrabbedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OwningActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OverdoseSyringeGA_C_EnableCollision) == 0x000008, "Wrong alignment on OverdoseSyringeGA_C_EnableCollision");
static_assert(sizeof(OverdoseSyringeGA_C_EnableCollision) == 0x000020, "Wrong size on OverdoseSyringeGA_C_EnableCollision");
static_assert(offsetof(OverdoseSyringeGA_C_EnableCollision, GrabbedActor) == 0x000000, "Member 'OverdoseSyringeGA_C_EnableCollision::GrabbedActor' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_EnableCollision, OwningActor) == 0x000008, "Member 'OverdoseSyringeGA_C_EnableCollision::OwningActor' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_EnableCollision, K2Node_DynamicCast_AsCharacter) == 0x000010, "Member 'OverdoseSyringeGA_C_EnableCollision::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_EnableCollision, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'OverdoseSyringeGA_C_EnableCollision::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.CalculateTargetTransforms
// 0x00F0 (0x00F0 - 0x0000)
struct OverdoseSyringeGA_C_CalculateTargetTransforms final
{
public:
	class AActor*                                 GrabbingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 GrabbedActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetRotation;                                    // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter_1;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OverdoseSyringeGA_C_CalculateTargetTransforms) == 0x000008, "Wrong alignment on OverdoseSyringeGA_C_CalculateTargetTransforms");
static_assert(sizeof(OverdoseSyringeGA_C_CalculateTargetTransforms) == 0x0000F0, "Wrong size on OverdoseSyringeGA_C_CalculateTargetTransforms");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, GrabbingActor) == 0x000000, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::GrabbingActor' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, GrabbedActor) == 0x000008, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::GrabbedActor' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, TargetLocation) == 0x000010, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::TargetLocation' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, TargetRotation) == 0x00001C, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::TargetRotation' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, K2Node_DynamicCast_AsCharacter) == 0x000028, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, K2Node_DynamicCast_AsCharacter_1) == 0x000038, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::K2Node_DynamicCast_AsCharacter_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000044, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00005C, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000068, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_Normal_ReturnValue) == 0x000074, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_Normal_ReturnValue_1) == 0x000080, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x00008C, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_MakeRotFromX_ReturnValue) == 0x000098, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A4, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_BreakRotator_Roll) == 0x0000B0, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_BreakRotator_Pitch) == 0x0000B4, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_BreakRotator_Yaw) == 0x0000B8, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000BC, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_MakeRotator_ReturnValue) == 0x0000C8, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0000D4, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_CalculateTargetTransforms, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E0, "Member 'OverdoseSyringeGA_C_CalculateTargetTransforms::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.GiveScore
// 0x0068 (0x0068 - 0x0000)
struct OverdoseSyringeGA_C_GiveScore final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_2;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OverdoseSyringeGA_C_GiveScore) == 0x000008, "Wrong alignment on OverdoseSyringeGA_C_GiveScore");
static_assert(sizeof(OverdoseSyringeGA_C_GiveScore) == 0x000068, "Wrong size on OverdoseSyringeGA_C_GiveScore");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, Temp_bool_Variable) == 0x000000, "Member 'OverdoseSyringeGA_C_GiveScore::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, Temp_name_Variable) == 0x000004, "Member 'OverdoseSyringeGA_C_GiveScore::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, Temp_name_Variable_1) == 0x00000C, "Member 'OverdoseSyringeGA_C_GiveScore::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'OverdoseSyringeGA_C_GiveScore::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000020, "Member 'OverdoseSyringeGA_C_GiveScore::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'OverdoseSyringeGA_C_GiveScore::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, CallFunc_GetOwner_ReturnValue_1) == 0x000030, "Member 'OverdoseSyringeGA_C_GiveScore::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000038, "Member 'OverdoseSyringeGA_C_GiveScore::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'OverdoseSyringeGA_C_GiveScore::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, K2Node_Select_Default) == 0x000044, "Member 'OverdoseSyringeGA_C_GiveScore::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000050, "Member 'OverdoseSyringeGA_C_GiveScore::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, K2Node_DynamicCast_AsCharacter_SCTBP_2) == 0x000058, "Member 'OverdoseSyringeGA_C_GiveScore::K2Node_DynamicCast_AsCharacter_SCTBP_2' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_GiveScore, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'OverdoseSyringeGA_C_GiveScore::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.ServerCompleted
// 0x00C0 (0x00C0 - 0x0000)
struct OverdoseSyringeGA_C_ServerCompleted final
{
public:
	struct FVector                                CallFunc_GetKillImpulseVector_ReturnValue;         // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetKillImpulseVector_ReturnValue_1;       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT_1;             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryRemoveShieldGE_WasShielded;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFactionInfoInterface> CallFunc_IsResident_self_CastInput;                // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsResident_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetKillImpulseVector_ReturnValue_2;       // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OverdoseSyringeGA_C_ServerCompleted) == 0x000008, "Wrong alignment on OverdoseSyringeGA_C_ServerCompleted");
static_assert(sizeof(OverdoseSyringeGA_C_ServerCompleted) == 0x0000C0, "Wrong size on OverdoseSyringeGA_C_ServerCompleted");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_GetKillImpulseVector_ReturnValue) == 0x000000, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_GetKillImpulseVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000010, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000018, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, K2Node_DynamicCast_AsICharacter_SCT) == 0x000028, "Member 'OverdoseSyringeGA_C_ServerCompleted::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'OverdoseSyringeGA_C_ServerCompleted::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_GetKillImpulseVector_ReturnValue_1) == 0x000048, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_GetKillImpulseVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, K2Node_DynamicCast_AsICharacter_SCT_1) == 0x000058, "Member 'OverdoseSyringeGA_C_ServerCompleted::K2Node_DynamicCast_AsICharacter_SCT_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'OverdoseSyringeGA_C_ServerCompleted::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00006C, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000078, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_TryRemoveShieldGE_WasShielded) == 0x000080, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_TryRemoveShieldGE_WasShielded' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000088, "Member 'OverdoseSyringeGA_C_ServerCompleted::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'OverdoseSyringeGA_C_ServerCompleted::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_IsResident_self_CastInput) == 0x000098, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_IsResident_self_CastInput' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_IsResident_ReturnValue) == 0x0000A8, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_IsResident_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000A9, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_GetKillImpulseVector_ReturnValue_2) == 0x0000AC, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_GetKillImpulseVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerCompleted, CallFunc_GetOwningActorFromActorInfo_ReturnValue_2) == 0x0000B8, "Member 'OverdoseSyringeGA_C_ServerCompleted::CallFunc_GetOwningActorFromActorInfo_ReturnValue_2' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.ServerClientCompleted
// 0x0018 (0x0018 - 0x0000)
struct OverdoseSyringeGA_C_ServerClientCompleted final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OverdoseSyringeGA_C_ServerClientCompleted) == 0x000008, "Wrong alignment on OverdoseSyringeGA_C_ServerClientCompleted");
static_assert(sizeof(OverdoseSyringeGA_C_ServerClientCompleted) == 0x000018, "Wrong size on OverdoseSyringeGA_C_ServerClientCompleted");
static_assert(offsetof(OverdoseSyringeGA_C_ServerClientCompleted, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'OverdoseSyringeGA_C_ServerClientCompleted::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerClientCompleted, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'OverdoseSyringeGA_C_ServerClientCompleted::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(OverdoseSyringeGA_C_ServerClientCompleted, CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue) == 0x000010, "Member 'OverdoseSyringeGA_C_ServerClientCompleted::CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue' has a wrong offset!");

// Function OverdoseSyringeGA.OverdoseSyringeGA_C.ServerStart
// 0x0060 (0x0060 - 0x0000)
