#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OxygenLocalWI

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function OxygenLocalWI.OxygenLocalWI_C.ExecuteUbergraph_OxygenLocalWI
// 0x0078 (0x0078 - 0x0000)
struct OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        K2Node_CustomEvent_PlayerState;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ASCTPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_InPercent;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetGlobalObject_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACharacterSCT* NewCharacter)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UOnCharacterPossessed_C*                K2Node_DynamicCast_AsOn_Character_Possessed;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI) == 0x000008, "Wrong alignment on OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI");
static_assert(sizeof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI) == 0x000078, "Wrong size on OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, EntryPoint) == 0x000000, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, K2Node_CustomEvent_PlayerState) == 0x000008, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, K2Node_CustomEvent_InPercent) == 0x000020, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::K2Node_CustomEvent_InPercent' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000028, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000030, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, CallFunc_GetGlobalObject_ReturnValue) == 0x000038, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::CallFunc_GetGlobalObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, K2Node_DynamicCast_AsOn_Character_Possessed) == 0x000050, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::K2Node_DynamicCast_AsOn_Character_Possessed' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000060, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, K2Node_DynamicCast_AsSCTPlayer_State) == 0x000068, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::K2Node_DynamicCast_AsSCTPlayer_State' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'OxygenLocalWI_C_ExecuteUbergraph_OxygenLocalWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function OxygenLocalWI.OxygenLocalWI_C.OnPlayerStateReceived_Event_0
// 0x0008 (0x0008 - 0x0000)
struct OxygenLocalWI_C_OnPlayerStateReceived_Event_0 final
{
public:
	class ASCTPlayerState*                        PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OxygenLocalWI_C_OnPlayerStateReceived_Event_0) == 0x000008, "Wrong alignment on OxygenLocalWI_C_OnPlayerStateReceived_Event_0");
static_assert(sizeof(OxygenLocalWI_C_OnPlayerStateReceived_Event_0) == 0x000008, "Wrong size on OxygenLocalWI_C_OnPlayerStateReceived_Event_0");
static_assert(offsetof(OxygenLocalWI_C_OnPlayerStateReceived_Event_0, PlayerState) == 0x000000, "Member 'OxygenLocalWI_C_OnPlayerStateReceived_Event_0::PlayerState' has a wrong offset!");

// Function OxygenLocalWI.OxygenLocalWI_C.Update Oxygen
// 0x0004 (0x0004 - 0x0000)
struct OxygenLocalWI_C_Update_Oxygen final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OxygenLocalWI_C_Update_Oxygen) == 0x000004, "Wrong alignment on OxygenLocalWI_C_Update_Oxygen");
static_assert(sizeof(OxygenLocalWI_C_Update_Oxygen) == 0x000004, "Wrong size on OxygenLocalWI_C_Update_Oxygen");
static_assert(offsetof(OxygenLocalWI_C_Update_Oxygen, InPercent) == 0x000000, "Member 'OxygenLocalWI_C_Update_Oxygen::InPercent' has a wrong offset!");

// Function OxygenLocalWI.OxygenLocalWI_C.InitializeTarget
// 0x0010 (0x0010 - 0x0000)
struct OxygenLocalWI_C_InitializeTarget final
{
public:
	class ACharacterSCTBP_C*                      CallFunc_GetCurrentCharacter_AsCharacter_SCT;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenLocalWI_C_InitializeTarget) == 0x000008, "Wrong alignment on OxygenLocalWI_C_InitializeTarget");
static_assert(sizeof(OxygenLocalWI_C_InitializeTarget) == 0x000010, "Wrong size on OxygenLocalWI_C_InitializeTarget");
static_assert(offsetof(OxygenLocalWI_C_InitializeTarget, CallFunc_GetCurrentCharacter_AsCharacter_SCT) == 0x000000, "Member 'OxygenLocalWI_C_InitializeTarget::CallFunc_GetCurrentCharacter_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_InitializeTarget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'OxygenLocalWI_C_InitializeTarget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function OxygenLocalWI.OxygenLocalWI_C.RemovePreviousTarget
// 0x0024 (0x0024 - 0x0000)
struct OxygenLocalWI_C_RemovePreviousTarget final
{
public:
	TDelegate<void(float NewValue)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EOxygenState NewState)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenLocalWI_C_RemovePreviousTarget) == 0x000004, "Wrong alignment on OxygenLocalWI_C_RemovePreviousTarget");
static_assert(sizeof(OxygenLocalWI_C_RemovePreviousTarget) == 0x000024, "Wrong size on OxygenLocalWI_C_RemovePreviousTarget");
static_assert(offsetof(OxygenLocalWI_C_RemovePreviousTarget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'OxygenLocalWI_C_RemovePreviousTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_RemovePreviousTarget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'OxygenLocalWI_C_RemovePreviousTarget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_RemovePreviousTarget, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'OxygenLocalWI_C_RemovePreviousTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function OxygenLocalWI.OxygenLocalWI_C.SetNewTarget
// 0x0030 (0x0030 - 0x0000)
struct OxygenLocalWI_C_SetNewTarget final
{
public:
	TDelegate<void(float NewValue)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EOxygenState NewState)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class ACharacterSCTBP_C*                      CallFunc_GetCurrentCharacter_AsCharacter_SCT;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenLocalWI_C_SetNewTarget) == 0x000008, "Wrong alignment on OxygenLocalWI_C_SetNewTarget");
static_assert(sizeof(OxygenLocalWI_C_SetNewTarget) == 0x000030, "Wrong size on OxygenLocalWI_C_SetNewTarget");
static_assert(offsetof(OxygenLocalWI_C_SetNewTarget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'OxygenLocalWI_C_SetNewTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_SetNewTarget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'OxygenLocalWI_C_SetNewTarget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_SetNewTarget, CallFunc_GetCurrentCharacter_AsCharacter_SCT) == 0x000020, "Member 'OxygenLocalWI_C_SetNewTarget::CallFunc_GetCurrentCharacter_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_SetNewTarget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'OxygenLocalWI_C_SetNewTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function OxygenLocalWI.OxygenLocalWI_C.OnOxygenValueChanged
// 0x0004 (0x0004 - 0x0000)
struct OxygenLocalWI_C_OnOxygenValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OxygenLocalWI_C_OnOxygenValueChanged) == 0x000004, "Wrong alignment on OxygenLocalWI_C_OnOxygenValueChanged");
static_assert(sizeof(OxygenLocalWI_C_OnOxygenValueChanged) == 0x000004, "Wrong size on OxygenLocalWI_C_OnOxygenValueChanged");
static_assert(offsetof(OxygenLocalWI_C_OnOxygenValueChanged, NewValue) == 0x000000, "Member 'OxygenLocalWI_C_OnOxygenValueChanged::NewValue' has a wrong offset!");

// Function OxygenLocalWI.OxygenLocalWI_C.OnOxygenStateChanged
// 0x0002 (0x0002 - 0x0000)
struct OxygenLocalWI_C_OnOxygenStateChanged final
{
public:
	EOxygenState                                  NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenLocalWI_C_OnOxygenStateChanged) == 0x000001, "Wrong alignment on OxygenLocalWI_C_OnOxygenStateChanged");
static_assert(sizeof(OxygenLocalWI_C_OnOxygenStateChanged) == 0x000002, "Wrong size on OxygenLocalWI_C_OnOxygenStateChanged");
static_assert(offsetof(OxygenLocalWI_C_OnOxygenStateChanged, NewState) == 0x000000, "Member 'OxygenLocalWI_C_OnOxygenStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_OnOxygenStateChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'OxygenLocalWI_C_OnOxygenStateChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function OxygenLocalWI.OxygenLocalWI_C.OnPossessedCharacterChanged
// 0x0008 (0x0008 - 0x0000)
struct OxygenLocalWI_C_OnPossessedCharacterChanged final
{
public:
	class ACharacterSCT*                          NewCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OxygenLocalWI_C_OnPossessedCharacterChanged) == 0x000008, "Wrong alignment on OxygenLocalWI_C_OnPossessedCharacterChanged");
static_assert(sizeof(OxygenLocalWI_C_OnPossessedCharacterChanged) == 0x000008, "Wrong size on OxygenLocalWI_C_OnPossessedCharacterChanged");
static_assert(offsetof(OxygenLocalWI_C_OnPossessedCharacterChanged, NewCharacter) == 0x000000, "Member 'OxygenLocalWI_C_OnPossessedCharacterChanged::NewCharacter' has a wrong offset!");

// Function OxygenLocalWI.OxygenLocalWI_C.ReceivedPlayerState
// 0x0008 (0x0008 - 0x0000)
struct OxygenLocalWI_C_ReceivedPlayerState final
{
public:
	class ASCTPlayerState*                        PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OxygenLocalWI_C_ReceivedPlayerState) == 0x000008, "Wrong alignment on OxygenLocalWI_C_ReceivedPlayerState");
static_assert(sizeof(OxygenLocalWI_C_ReceivedPlayerState) == 0x000008, "Wrong size on OxygenLocalWI_C_ReceivedPlayerState");
static_assert(offsetof(OxygenLocalWI_C_ReceivedPlayerState, PlayerState) == 0x000000, "Member 'OxygenLocalWI_C_ReceivedPlayerState::PlayerState' has a wrong offset!");

// Function OxygenLocalWI.OxygenLocalWI_C.GetCurrentCharacter
// 0x0018 (0x0018 - 0x0000)
struct OxygenLocalWI_C_GetCurrentCharacter final
{
public:
	class ACharacterSCTBP_C*                      AsCharacter_SCT;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OxygenLocalWI_C_GetCurrentCharacter) == 0x000008, "Wrong alignment on OxygenLocalWI_C_GetCurrentCharacter");
static_assert(sizeof(OxygenLocalWI_C_GetCurrentCharacter) == 0x000018, "Wrong size on OxygenLocalWI_C_GetCurrentCharacter");
static_assert(offsetof(OxygenLocalWI_C_GetCurrentCharacter, AsCharacter_SCT) == 0x000000, "Member 'OxygenLocalWI_C_GetCurrentCharacter::AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_GetCurrentCharacter, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000008, "Member 'OxygenLocalWI_C_GetCurrentCharacter::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(OxygenLocalWI_C_GetCurrentCharacter, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000010, "Member 'OxygenLocalWI_C_GetCurrentCharacter::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");

}

