#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OxygenPotionInteractionComponent

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function OxygenPotionInteractionComponent.OxygenPotionInteractionComponent_C.CanActivate
// 0x0048 (0x0048 - 0x0000)
struct OxygenPotionInteractionComponent_C_CanActivate final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPower*                                 CallFunc_TryGetPowerFromType_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenPotionInteractionComponent_C_CanActivate) == 0x000008, "Wrong alignment on OxygenPotionInteractionComponent_C_CanActivate");
static_assert(sizeof(OxygenPotionInteractionComponent_C_CanActivate) == 0x000048, "Wrong size on OxygenPotionInteractionComponent_C_CanActivate");
static_assert(offsetof(OxygenPotionInteractionComponent_C_CanActivate, Payload) == 0x000000, "Member 'OxygenPotionInteractionComponent_C_CanActivate::Payload' has a wrong offset!");
static_assert(offsetof(OxygenPotionInteractionComponent_C_CanActivate, ReturnValue) == 0x000030, "Member 'OxygenPotionInteractionComponent_C_CanActivate::ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenPotionInteractionComponent_C_CanActivate, CallFunc_TryGetPowerFromType_ReturnValue) == 0x000038, "Member 'OxygenPotionInteractionComponent_C_CanActivate::CallFunc_TryGetPowerFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenPotionInteractionComponent_C_CanActivate, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'OxygenPotionInteractionComponent_C_CanActivate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function OxygenPotionInteractionComponent.OxygenPotionInteractionComponent_C.GetInactiveContextDescription
// 0x0070 (0x0070 - 0x0000)
struct OxygenPotionInteractionComponent_C_GetInactiveContextDescription final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	class FText                                   ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetInactiveContextDescription_ReturnValue; // 0x0048(0x0018)()
	class UPower*                                 CallFunc_TryGetPowerFromType_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenPotionInteractionComponent_C_GetInactiveContextDescription) == 0x000008, "Wrong alignment on OxygenPotionInteractionComponent_C_GetInactiveContextDescription");
static_assert(sizeof(OxygenPotionInteractionComponent_C_GetInactiveContextDescription) == 0x000070, "Wrong size on OxygenPotionInteractionComponent_C_GetInactiveContextDescription");
static_assert(offsetof(OxygenPotionInteractionComponent_C_GetInactiveContextDescription, Payload) == 0x000000, "Member 'OxygenPotionInteractionComponent_C_GetInactiveContextDescription::Payload' has a wrong offset!");
static_assert(offsetof(OxygenPotionInteractionComponent_C_GetInactiveContextDescription, ReturnValue) == 0x000030, "Member 'OxygenPotionInteractionComponent_C_GetInactiveContextDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenPotionInteractionComponent_C_GetInactiveContextDescription, CallFunc_GetInactiveContextDescription_ReturnValue) == 0x000048, "Member 'OxygenPotionInteractionComponent_C_GetInactiveContextDescription::CallFunc_GetInactiveContextDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenPotionInteractionComponent_C_GetInactiveContextDescription, CallFunc_TryGetPowerFromType_ReturnValue) == 0x000060, "Member 'OxygenPotionInteractionComponent_C_GetInactiveContextDescription::CallFunc_TryGetPowerFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenPotionInteractionComponent_C_GetInactiveContextDescription, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'OxygenPotionInteractionComponent_C_GetInactiveContextDescription::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

