#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveItemEntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PassiveItemEntryWI.PassiveItemEntryWI_C.ExecuteUbergraph_PassiveItemEntryWI
// 0x000C (0x000C - 0x0000)
struct PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI) == 0x000004, "Wrong alignment on PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI");
static_assert(sizeof(PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI) == 0x00000C, "Wrong size on PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI");
static_assert(offsetof(PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI, EntryPoint) == 0x000000, "Member 'PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI, Temp_bool_Variable) == 0x000004, "Member 'PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI, Temp_byte_Variable) == 0x000005, "Member 'PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI, Temp_byte_Variable_1) == 0x000006, "Member 'PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI, CallFunc_Not_PreBool_ReturnValue) == 0x000007, "Member 'PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI, K2Node_Select_Default) == 0x000008, "Member 'PassiveItemEntryWI_C_ExecuteUbergraph_PassiveItemEntryWI::K2Node_Select_Default' has a wrong offset!");

// Function PassiveItemEntryWI.PassiveItemEntryWI_C.UpdateStackText
// 0x0018 (0x0018 - 0x0000)
struct PassiveItemEntryWI_C_UpdateStackText final
{
public:
	class FText                                   CallFunc_GetFormattedStackText_NewParam;           // 0x0000(0x0018)()
};
static_assert(alignof(PassiveItemEntryWI_C_UpdateStackText) == 0x000008, "Wrong alignment on PassiveItemEntryWI_C_UpdateStackText");
static_assert(sizeof(PassiveItemEntryWI_C_UpdateStackText) == 0x000018, "Wrong size on PassiveItemEntryWI_C_UpdateStackText");
static_assert(offsetof(PassiveItemEntryWI_C_UpdateStackText, CallFunc_GetFormattedStackText_NewParam) == 0x000000, "Member 'PassiveItemEntryWI_C_UpdateStackText::CallFunc_GetFormattedStackText_NewParam' has a wrong offset!");

// Function PassiveItemEntryWI.PassiveItemEntryWI_C.Initialize
// 0x0018 (0x0018 - 0x0000)
struct PassiveItemEntryWI_C_Initialize final
{
public:
	class UItem*                                  Item_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(PassiveItemEntryWI_C_Initialize) == 0x000008, "Wrong alignment on PassiveItemEntryWI_C_Initialize");
static_assert(sizeof(PassiveItemEntryWI_C_Initialize) == 0x000018, "Wrong size on PassiveItemEntryWI_C_Initialize");
static_assert(offsetof(PassiveItemEntryWI_C_Initialize, Item_0) == 0x000000, "Member 'PassiveItemEntryWI_C_Initialize::Item_0' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PassiveItemEntryWI_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function PassiveItemEntryWI.PassiveItemEntryWI_C.UpdateIcon
// 0x00D8 (0x00D8 - 0x0000)
struct PassiveItemEntryWI_C_UpdateIcon final
{
public:
	struct FItemDetails                           CallFunc_GetItemDetails_ReturnValue;               // 0x0000(0x0050)(ConstParm)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0050(0x0088)()
};
static_assert(alignof(PassiveItemEntryWI_C_UpdateIcon) == 0x000008, "Wrong alignment on PassiveItemEntryWI_C_UpdateIcon");
static_assert(sizeof(PassiveItemEntryWI_C_UpdateIcon) == 0x0000D8, "Wrong size on PassiveItemEntryWI_C_UpdateIcon");
static_assert(offsetof(PassiveItemEntryWI_C_UpdateIcon, CallFunc_GetItemDetails_ReturnValue) == 0x000000, "Member 'PassiveItemEntryWI_C_UpdateIcon::CallFunc_GetItemDetails_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_UpdateIcon, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000050, "Member 'PassiveItemEntryWI_C_UpdateIcon::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

// Function PassiveItemEntryWI.PassiveItemEntryWI_C.GetItemCurrentStackSize
// 0x0058 (0x0058 - 0x0000)
struct PassiveItemEntryWI_C_GetItemCurrentStackSize final
{
public:
	int32                                         CurrentStackCount;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDetails                           CallFunc_GetItemDetails_ReturnValue;               // 0x0008(0x0050)(ConstParm)
};
static_assert(alignof(PassiveItemEntryWI_C_GetItemCurrentStackSize) == 0x000008, "Wrong alignment on PassiveItemEntryWI_C_GetItemCurrentStackSize");
static_assert(sizeof(PassiveItemEntryWI_C_GetItemCurrentStackSize) == 0x000058, "Wrong size on PassiveItemEntryWI_C_GetItemCurrentStackSize");
static_assert(offsetof(PassiveItemEntryWI_C_GetItemCurrentStackSize, CurrentStackCount) == 0x000000, "Member 'PassiveItemEntryWI_C_GetItemCurrentStackSize::CurrentStackCount' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_GetItemCurrentStackSize, CallFunc_GetItemDetails_ReturnValue) == 0x000008, "Member 'PassiveItemEntryWI_C_GetItemCurrentStackSize::CallFunc_GetItemDetails_ReturnValue' has a wrong offset!");

// Function PassiveItemEntryWI.PassiveItemEntryWI_C.GetItemMaxStacks
// 0x0058 (0x0058 - 0x0000)
struct PassiveItemEntryWI_C_GetItemMaxStacks final
{
public:
	int32                                         Maximum_Stack_Count;                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDetails                           CallFunc_GetItemDetails_ReturnValue;               // 0x0008(0x0050)(ConstParm)
};
static_assert(alignof(PassiveItemEntryWI_C_GetItemMaxStacks) == 0x000008, "Wrong alignment on PassiveItemEntryWI_C_GetItemMaxStacks");
static_assert(sizeof(PassiveItemEntryWI_C_GetItemMaxStacks) == 0x000058, "Wrong size on PassiveItemEntryWI_C_GetItemMaxStacks");
static_assert(offsetof(PassiveItemEntryWI_C_GetItemMaxStacks, Maximum_Stack_Count) == 0x000000, "Member 'PassiveItemEntryWI_C_GetItemMaxStacks::Maximum_Stack_Count' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_GetItemMaxStacks, CallFunc_GetItemDetails_ReturnValue) == 0x000008, "Member 'PassiveItemEntryWI_C_GetItemMaxStacks::CallFunc_GetItemDetails_ReturnValue' has a wrong offset!");

// Function PassiveItemEntryWI.PassiveItemEntryWI_C.GetFormattedStackText
// 0x00F8 (0x00F8 - 0x0000)
struct PassiveItemEntryWI_C_GetFormattedStackText final
{
public:
	class FText                                   NewParam;                                          // 0x0000(0x0018)(Parm, OutParm)
	int32                                         CallFunc_GetItemMaxStacks_Maximum_Stack_Count;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCurrentStackSize_CurrentStackCount; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
};
static_assert(alignof(PassiveItemEntryWI_C_GetFormattedStackText) == 0x000008, "Wrong alignment on PassiveItemEntryWI_C_GetFormattedStackText");
static_assert(sizeof(PassiveItemEntryWI_C_GetFormattedStackText) == 0x0000F8, "Wrong size on PassiveItemEntryWI_C_GetFormattedStackText");
static_assert(offsetof(PassiveItemEntryWI_C_GetFormattedStackText, NewParam) == 0x000000, "Member 'PassiveItemEntryWI_C_GetFormattedStackText::NewParam' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_GetFormattedStackText, CallFunc_GetItemMaxStacks_Maximum_Stack_Count) == 0x000018, "Member 'PassiveItemEntryWI_C_GetFormattedStackText::CallFunc_GetItemMaxStacks_Maximum_Stack_Count' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_GetFormattedStackText, CallFunc_GetItemCurrentStackSize_CurrentStackCount) == 0x00001C, "Member 'PassiveItemEntryWI_C_GetFormattedStackText::CallFunc_GetItemCurrentStackSize_CurrentStackCount' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_GetFormattedStackText, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'PassiveItemEntryWI_C_GetFormattedStackText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_GetFormattedStackText, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'PassiveItemEntryWI_C_GetFormattedStackText::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_GetFormattedStackText, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'PassiveItemEntryWI_C_GetFormattedStackText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_GetFormattedStackText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'PassiveItemEntryWI_C_GetFormattedStackText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_GetFormattedStackText, K2Node_MakeArray_Array) == 0x0000D0, "Member 'PassiveItemEntryWI_C_GetFormattedStackText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PassiveItemEntryWI_C_GetFormattedStackText, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'PassiveItemEntryWI_C_GetFormattedStackText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

