#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassengerLogDisplay_Tutorial_WI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"
#include "PassengerLogFactType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PassengerLogDisplay_Tutorial_WI.PassengerLogDisplay_Tutorial_WI_C
// 0x0050 (0x02D0 - 0x0280)
class UPassengerLogDisplay_Tutorial_WI_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Circleframe;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circleinnerbg;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circleinnerfront;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         FactText;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_118;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Linebottom;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Linetop;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlayerList;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI(int32 EntryPoint);
	void Audio_PassengerLog_FadeOut();
	void Audio_PassengerLog_FadeIn();
	void AddEntry(const EPassengerLogFactType FactType, const TArray<int32>& Players);
	void Fade(bool In, float OptionalDuration);
	void PreConstruct(bool IsDesignTime);
	void AddPlayerEntry(const class FText& CharacterName, float Padding_0, const struct FLinearColor& IdentificationColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PassengerLogDisplay_Tutorial_WI_C">();
	}
	static class UPassengerLogDisplay_Tutorial_WI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassengerLogDisplay_Tutorial_WI_C>();
	}
};
static_assert(alignof(UPassengerLogDisplay_Tutorial_WI_C) == 0x000008, "Wrong alignment on UPassengerLogDisplay_Tutorial_WI_C");
static_assert(sizeof(UPassengerLogDisplay_Tutorial_WI_C) == 0x0002D0, "Wrong size on UPassengerLogDisplay_Tutorial_WI_C");
static_assert(offsetof(UPassengerLogDisplay_Tutorial_WI_C, UberGraphFrame) == 0x000280, "Member 'UPassengerLogDisplay_Tutorial_WI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplay_Tutorial_WI_C, FadeIn) == 0x000288, "Member 'UPassengerLogDisplay_Tutorial_WI_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplay_Tutorial_WI_C, Circleframe) == 0x000290, "Member 'UPassengerLogDisplay_Tutorial_WI_C::Circleframe' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplay_Tutorial_WI_C, Circleinnerbg) == 0x000298, "Member 'UPassengerLogDisplay_Tutorial_WI_C::Circleinnerbg' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplay_Tutorial_WI_C, Circleinnerfront) == 0x0002A0, "Member 'UPassengerLogDisplay_Tutorial_WI_C::Circleinnerfront' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplay_Tutorial_WI_C, FactText) == 0x0002A8, "Member 'UPassengerLogDisplay_Tutorial_WI_C::FactText' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplay_Tutorial_WI_C, Image_118) == 0x0002B0, "Member 'UPassengerLogDisplay_Tutorial_WI_C::Image_118' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplay_Tutorial_WI_C, Linebottom) == 0x0002B8, "Member 'UPassengerLogDisplay_Tutorial_WI_C::Linebottom' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplay_Tutorial_WI_C, Linetop) == 0x0002C0, "Member 'UPassengerLogDisplay_Tutorial_WI_C::Linetop' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplay_Tutorial_WI_C, PlayerList) == 0x0002C8, "Member 'UPassengerLogDisplay_Tutorial_WI_C::PlayerList' has a wrong offset!");

}

