#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassengerLogVoteEntryWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function PassengerLogVoteEntryWI.PassengerLogVoteEntryWI_C.ExecuteUbergraph_PassengerLogVoteEntryWI
// 0x0070 (0x0070 - 0x0000)
struct PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerNameBPI_Name;                    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT_1;             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI) == 0x000008, "Wrong alignment on PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI");
static_assert(sizeof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI) == 0x000070, "Wrong size on PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, EntryPoint) == 0x000000, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, K2Node_DynamicCast_AsICharacter_SCT) == 0x000008, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, CallFunc_GetPlayerNameBPI_Name) == 0x000020, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::CallFunc_GetPlayerNameBPI_Name' has a wrong offset!");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, K2Node_ComponentBoundEvent_bIsChecked) == 0x000048, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000050, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, K2Node_DynamicCast_AsICharacter_SCT_1) == 0x000058, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::K2Node_DynamicCast_AsICharacter_SCT_1' has a wrong offset!");
static_assert(offsetof(PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'PassengerLogVoteEntryWI_C_ExecuteUbergraph_PassengerLogVoteEntryWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function PassengerLogVoteEntryWI.PassengerLogVoteEntryWI_C.BndEvt__PassengerLogButton_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct PassengerLogVoteEntryWI_C_BndEvt__PassengerLogButton_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassengerLogVoteEntryWI_C_BndEvt__PassengerLogButton_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on PassengerLogVoteEntryWI_C_BndEvt__PassengerLogButton_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(PassengerLogVoteEntryWI_C_BndEvt__PassengerLogButton_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on PassengerLogVoteEntryWI_C_BndEvt__PassengerLogButton_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(PassengerLogVoteEntryWI_C_BndEvt__PassengerLogButton_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'PassengerLogVoteEntryWI_C_BndEvt__PassengerLogButton_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function PassengerLogVoteEntryWI.PassengerLogVoteEntryWI_C.DisableButton
// 0x0001 (0x0001 - 0x0000)
struct PassengerLogVoteEntryWI_C_DisableButton final
{
public:
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassengerLogVoteEntryWI_C_DisableButton) == 0x000001, "Wrong alignment on PassengerLogVoteEntryWI_C_DisableButton");
static_assert(sizeof(PassengerLogVoteEntryWI_C_DisableButton) == 0x000001, "Wrong size on PassengerLogVoteEntryWI_C_DisableButton");
static_assert(offsetof(PassengerLogVoteEntryWI_C_DisableButton, CallFunc_IsChecked_ReturnValue) == 0x000000, "Member 'PassengerLogVoteEntryWI_C_DisableButton::CallFunc_IsChecked_ReturnValue' has a wrong offset!");

}

