#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PersonoidChatNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PersonoidChatNotification.PersonoidChatNotification_C
// 0x0090 (0x02F0 - 0x0260)
class UPersonoidChatNotification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelIncomingIconL;                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelOutgoingIconL;                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxIncoming;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxOutgoing;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow_1;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow_2;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Phone_1;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Phone_2;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlockOUTGOINGPERSONOIDCHAT;                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsHiding;                                          // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Outgoing_Personoid_VOIP_Begin;                     // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Outgoing_Personoid_VOIP_End;                       // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Incoming_Personoid_VOIP_Begin;                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Incoming_Personoid_VOIP_End;                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Push_To_Talk_Personoid_Pressed;                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Push_To_Talk_Personoid_Released;                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PersonoidChatNotification(int32 EntryPoint);
	void Handle_On_Register_Talker_Component(class UVivoxTalkerComponent* TalkerComponent);
	void OnInitialized();
	void Handle_On_Talking_Personoid_Channel(const bool IsTalking, const bool IsLocallyControlled);
	void Handle_Push_To_Talk_Personoid_Channel(bool bIsPressed);
	void Set_Outgoing_Personoid_Chat(bool Outoing_PTT_Pressed, bool Chat_Outgoing);
	void Set_Incoming_Personoid_Chat(bool Incoming_Chat_On);
	void PreConstruct(bool IsDesignTime);
	void Hide_Fade();
	void Show_Fade();
	void Finished_9A620AC349C04A0544F334BC33CC3369();

	void IsAnyShown(bool* Return) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PersonoidChatNotification_C">();
	}
	static class UPersonoidChatNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPersonoidChatNotification_C>();
	}
};
static_assert(alignof(UPersonoidChatNotification_C) == 0x000008, "Wrong alignment on UPersonoidChatNotification_C");
static_assert(sizeof(UPersonoidChatNotification_C) == 0x0002F0, "Wrong size on UPersonoidChatNotification_C");
static_assert(offsetof(UPersonoidChatNotification_C, UberGraphFrame) == 0x000260, "Member 'UPersonoidChatNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, FadeIn) == 0x000268, "Member 'UPersonoidChatNotification_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, CanvasPanelIncomingIconL) == 0x000270, "Member 'UPersonoidChatNotification_C::CanvasPanelIncomingIconL' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, CanvasPanelOutgoingIconL) == 0x000278, "Member 'UPersonoidChatNotification_C::CanvasPanelOutgoingIconL' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, HorizontalBoxIncoming) == 0x000280, "Member 'UPersonoidChatNotification_C::HorizontalBoxIncoming' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, HorizontalBoxOutgoing) == 0x000288, "Member 'UPersonoidChatNotification_C::HorizontalBoxOutgoing' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, Image_Arrow_1) == 0x000290, "Member 'UPersonoidChatNotification_C::Image_Arrow_1' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, Image_Arrow_2) == 0x000298, "Member 'UPersonoidChatNotification_C::Image_Arrow_2' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, Image_Phone_1) == 0x0002A0, "Member 'UPersonoidChatNotification_C::Image_Phone_1' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, Image_Phone_2) == 0x0002A8, "Member 'UPersonoidChatNotification_C::Image_Phone_2' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, TextBlockOUTGOINGPERSONOIDCHAT) == 0x0002B0, "Member 'UPersonoidChatNotification_C::TextBlockOUTGOINGPERSONOIDCHAT' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, IsHiding) == 0x0002B8, "Member 'UPersonoidChatNotification_C::IsHiding' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, Outgoing_Personoid_VOIP_Begin) == 0x0002C0, "Member 'UPersonoidChatNotification_C::Outgoing_Personoid_VOIP_Begin' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, Outgoing_Personoid_VOIP_End) == 0x0002C8, "Member 'UPersonoidChatNotification_C::Outgoing_Personoid_VOIP_End' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, Incoming_Personoid_VOIP_Begin) == 0x0002D0, "Member 'UPersonoidChatNotification_C::Incoming_Personoid_VOIP_Begin' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, Incoming_Personoid_VOIP_End) == 0x0002D8, "Member 'UPersonoidChatNotification_C::Incoming_Personoid_VOIP_End' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, Push_To_Talk_Personoid_Pressed) == 0x0002E0, "Member 'UPersonoidChatNotification_C::Push_To_Talk_Personoid_Pressed' has a wrong offset!");
static_assert(offsetof(UPersonoidChatNotification_C, Push_To_Talk_Personoid_Released) == 0x0002E8, "Member 'UPersonoidChatNotification_C::Push_To_Talk_Personoid_Released' has a wrong offset!");

}

