#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickupComponentBC

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PickupComponentBC.PickupComponentBC_C.ExecuteUbergraph_PickupComponentBC
// 0x0048 (0x0048 - 0x0000)
struct PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_Event_payload;                              // 0x0008(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC) == 0x000008, "Wrong alignment on PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC");
static_assert(sizeof(PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC) == 0x000048, "Wrong size on PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC");
static_assert(offsetof(PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC, EntryPoint) == 0x000000, "Member 'PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC::EntryPoint' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC, K2Node_Event_payload) == 0x000008, "Member 'PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC::K2Node_Event_payload' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC, CallFunc_HasAuthority_ReturnValue) == 0x000040, "Member 'PickupComponentBC_C_ExecuteUbergraph_PickupComponentBC::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function PickupComponentBC.PickupComponentBC_C.InteractionStarted
// 0x0030 (0x0030 - 0x0000)
struct PickupComponentBC_C_InteractionStarted final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PickupComponentBC_C_InteractionStarted) == 0x000008, "Wrong alignment on PickupComponentBC_C_InteractionStarted");
static_assert(sizeof(PickupComponentBC_C_InteractionStarted) == 0x000030, "Wrong size on PickupComponentBC_C_InteractionStarted");
static_assert(offsetof(PickupComponentBC_C_InteractionStarted, Payload) == 0x000000, "Member 'PickupComponentBC_C_InteractionStarted::Payload' has a wrong offset!");

// Function PickupComponentBC.PickupComponentBC_C.GrantPowers
// 0x0060 (0x0060 - 0x0000)
struct PickupComponentBC_C_GrantPowers final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
	bool                                          GrantedAnyPower;                                   // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDropLocation_WorldPosition;            // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TrySwapPower_ReturnValue;                 // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupComponentBC_C_GrantPowers) == 0x000008, "Wrong alignment on PickupComponentBC_C_GrantPowers");
static_assert(sizeof(PickupComponentBC_C_GrantPowers) == 0x000060, "Wrong size on PickupComponentBC_C_GrantPowers");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, Payload) == 0x000000, "Member 'PickupComponentBC_C_GrantPowers::Payload' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, GrantedAnyPower) == 0x000030, "Member 'PickupComponentBC_C_GrantPowers::GrantedAnyPower' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, Temp_int_Array_Index_Variable) == 0x000034, "Member 'PickupComponentBC_C_GrantPowers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, CallFunc_IsServer_ReturnValue) == 0x000038, "Member 'PickupComponentBC_C_GrantPowers::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'PickupComponentBC_C_GrantPowers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'PickupComponentBC_C_GrantPowers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, CallFunc_GetDropLocation_WorldPosition) == 0x000044, "Member 'PickupComponentBC_C_GrantPowers::CallFunc_GetDropLocation_WorldPosition' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, CallFunc_Array_Get_Item) == 0x000050, "Member 'PickupComponentBC_C_GrantPowers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'PickupComponentBC_C_GrantPowers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'PickupComponentBC_C_GrantPowers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GrantPowers, CallFunc_TrySwapPower_ReturnValue) == 0x00005D, "Member 'PickupComponentBC_C_GrantPowers::CallFunc_TrySwapPower_ReturnValue' has a wrong offset!");

// Function PickupComponentBC.PickupComponentBC_C.PrintErrorMessageForPower
// 0x00A8 (0x00A8 - 0x0000)
struct PickupComponentBC_C_PrintErrorMessageForPower final
{
public:
	class UClass*                                 Power_Type;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PickupComponentBC_C_PrintErrorMessageForPower) == 0x000008, "Wrong alignment on PickupComponentBC_C_PrintErrorMessageForPower");
static_assert(sizeof(PickupComponentBC_C_PrintErrorMessageForPower) == 0x0000A8, "Wrong size on PickupComponentBC_C_PrintErrorMessageForPower");
static_assert(offsetof(PickupComponentBC_C_PrintErrorMessageForPower, Power_Type) == 0x000000, "Member 'PickupComponentBC_C_PrintErrorMessageForPower::Power_Type' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintErrorMessageForPower, CallFunc_GetClassDisplayName_ReturnValue) == 0x000008, "Member 'PickupComponentBC_C_PrintErrorMessageForPower::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintErrorMessageForPower, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'PickupComponentBC_C_PrintErrorMessageForPower::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintErrorMessageForPower, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'PickupComponentBC_C_PrintErrorMessageForPower::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintErrorMessageForPower, K2Node_MakeArray_Array) == 0x000070, "Member 'PickupComponentBC_C_PrintErrorMessageForPower::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintErrorMessageForPower, CallFunc_Format_ReturnValue) == 0x000080, "Member 'PickupComponentBC_C_PrintErrorMessageForPower::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintErrorMessageForPower, CallFunc_Conv_TextToString_ReturnValue) == 0x000098, "Member 'PickupComponentBC_C_PrintErrorMessageForPower::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function PickupComponentBC.PickupComponentBC_C.CacheRuntimeData
// 0x00D8 (0x00D8 - 0x0000)
struct PickupComponentBC_C_CacheRuntimeData final
{
public:
	struct FPowerRuntimeData                      RuntimeData_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0048(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PickupComponentBC_C_CacheRuntimeData) == 0x000008, "Wrong alignment on PickupComponentBC_C_CacheRuntimeData");
static_assert(sizeof(PickupComponentBC_C_CacheRuntimeData) == 0x0000D8, "Wrong size on PickupComponentBC_C_CacheRuntimeData");
static_assert(offsetof(PickupComponentBC_C_CacheRuntimeData, RuntimeData_0) == 0x000000, "Member 'PickupComponentBC_C_CacheRuntimeData::RuntimeData_0' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CacheRuntimeData, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'PickupComponentBC_C_CacheRuntimeData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CacheRuntimeData, CallFunc_Conv_BoolToText_ReturnValue) == 0x000048, "Member 'PickupComponentBC_C_CacheRuntimeData::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CacheRuntimeData, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'PickupComponentBC_C_CacheRuntimeData::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CacheRuntimeData, K2Node_MakeArray_Array) == 0x0000A0, "Member 'PickupComponentBC_C_CacheRuntimeData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CacheRuntimeData, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'PickupComponentBC_C_CacheRuntimeData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CacheRuntimeData, CallFunc_Conv_TextToString_ReturnValue) == 0x0000C8, "Member 'PickupComponentBC_C_CacheRuntimeData::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function PickupComponentBC.PickupComponentBC_C.CanActivate
// 0x0060 (0x0060 - 0x0000)
struct PickupComponentBC_C_CanActivate final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanActivate_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddPower_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupComponentBC_C_CanActivate) == 0x000008, "Wrong alignment on PickupComponentBC_C_CanActivate");
static_assert(sizeof(PickupComponentBC_C_CanActivate) == 0x000060, "Wrong size on PickupComponentBC_C_CanActivate");
static_assert(offsetof(PickupComponentBC_C_CanActivate, Payload) == 0x000000, "Member 'PickupComponentBC_C_CanActivate::Payload' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, ReturnValue) == 0x000030, "Member 'PickupComponentBC_C_CanActivate::ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, CallFunc_CanActivate_ReturnValue) == 0x000031, "Member 'PickupComponentBC_C_CanActivate::CallFunc_CanActivate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, Temp_int_Array_Index_Variable) == 0x000034, "Member 'PickupComponentBC_C_CanActivate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'PickupComponentBC_C_CanActivate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'PickupComponentBC_C_CanActivate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'PickupComponentBC_C_CanActivate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'PickupComponentBC_C_CanActivate::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, CallFunc_Array_Get_Item) == 0x000048, "Member 'PickupComponentBC_C_CanActivate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, CallFunc_CanAddPower_ReturnValue) == 0x000050, "Member 'PickupComponentBC_C_CanActivate::CallFunc_CanAddPower_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, CallFunc_Array_Length_ReturnValue_1) == 0x000054, "Member 'PickupComponentBC_C_CanActivate::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_CanActivate, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'PickupComponentBC_C_CanActivate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function PickupComponentBC.PickupComponentBC_C.GetInactiveContextDescription
// 0x0088 (0x0088 - 0x0000)
struct PickupComponentBC_C_GetInactiveContextDescription final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	class FText                                   ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetInactiveContextDescription_ReturnValue; // 0x0050(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPickupUniqueItem_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUniqueItem_ReturnValue;                 // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAddPower_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupComponentBC_C_GetInactiveContextDescription) == 0x000008, "Wrong alignment on PickupComponentBC_C_GetInactiveContextDescription");
static_assert(sizeof(PickupComponentBC_C_GetInactiveContextDescription) == 0x000088, "Wrong size on PickupComponentBC_C_GetInactiveContextDescription");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, Payload) == 0x000000, "Member 'PickupComponentBC_C_GetInactiveContextDescription::Payload' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, ReturnValue) == 0x000030, "Member 'PickupComponentBC_C_GetInactiveContextDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, Temp_int_Array_Index_Variable) == 0x000048, "Member 'PickupComponentBC_C_GetInactiveContextDescription::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, CallFunc_GetInactiveContextDescription_ReturnValue) == 0x000050, "Member 'PickupComponentBC_C_GetInactiveContextDescription::CallFunc_GetInactiveContextDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'PickupComponentBC_C_GetInactiveContextDescription::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'PickupComponentBC_C_GetInactiveContextDescription::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'PickupComponentBC_C_GetInactiveContextDescription::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, CallFunc_Array_Get_Item) == 0x000078, "Member 'PickupComponentBC_C_GetInactiveContextDescription::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'PickupComponentBC_C_GetInactiveContextDescription::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, CallFunc_CanPickupUniqueItem_ReturnValue) == 0x000081, "Member 'PickupComponentBC_C_GetInactiveContextDescription::CallFunc_CanPickupUniqueItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, CallFunc_Not_PreBool_ReturnValue) == 0x000082, "Member 'PickupComponentBC_C_GetInactiveContextDescription::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, CallFunc_IsUniqueItem_ReturnValue) == 0x000083, "Member 'PickupComponentBC_C_GetInactiveContextDescription::CallFunc_IsUniqueItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, CallFunc_CanAddPower_ReturnValue) == 0x000084, "Member 'PickupComponentBC_C_GetInactiveContextDescription::CallFunc_CanAddPower_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetInactiveContextDescription, CallFunc_BooleanAND_ReturnValue) == 0x000085, "Member 'PickupComponentBC_C_GetInactiveContextDescription::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PickupComponentBC.PickupComponentBC_C.PrintNoPowersWarning
// 0x00A8 (0x00A8 - 0x0000)
struct PickupComponentBC_C_PrintNoPowersWarning final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PickupComponentBC_C_PrintNoPowersWarning) == 0x000008, "Wrong alignment on PickupComponentBC_C_PrintNoPowersWarning");
static_assert(sizeof(PickupComponentBC_C_PrintNoPowersWarning) == 0x0000A8, "Wrong size on PickupComponentBC_C_PrintNoPowersWarning");
static_assert(offsetof(PickupComponentBC_C_PrintNoPowersWarning, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'PickupComponentBC_C_PrintNoPowersWarning::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintNoPowersWarning, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'PickupComponentBC_C_PrintNoPowersWarning::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintNoPowersWarning, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'PickupComponentBC_C_PrintNoPowersWarning::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintNoPowersWarning, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'PickupComponentBC_C_PrintNoPowersWarning::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintNoPowersWarning, K2Node_MakeArray_Array) == 0x000070, "Member 'PickupComponentBC_C_PrintNoPowersWarning::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintNoPowersWarning, CallFunc_Format_ReturnValue) == 0x000080, "Member 'PickupComponentBC_C_PrintNoPowersWarning::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_PrintNoPowersWarning, CallFunc_Conv_TextToString_ReturnValue) == 0x000098, "Member 'PickupComponentBC_C_PrintNoPowersWarning::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function PickupComponentBC.PickupComponentBC_C.GetDropLocation
// 0x0028 (0x0028 - 0x0000)
struct PickupComponentBC_C_GetDropLocation final
{
public:
	struct FVector                                WorldPosition;                                     // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PickupComponentBC_C_GetDropLocation) == 0x000008, "Wrong alignment on PickupComponentBC_C_GetDropLocation");
static_assert(sizeof(PickupComponentBC_C_GetDropLocation) == 0x000028, "Wrong size on PickupComponentBC_C_GetDropLocation");
static_assert(offsetof(PickupComponentBC_C_GetDropLocation, WorldPosition) == 0x000000, "Member 'PickupComponentBC_C_GetDropLocation::WorldPosition' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetDropLocation, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'PickupComponentBC_C_GetDropLocation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupComponentBC_C_GetDropLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'PickupComponentBC_C_GetDropLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

