#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickupActor_OverdoseSyringe

#include "Basic.hpp"


namespace SDK::Params
{

// Function PickupActor_OverdoseSyringe.PickupActor_OverdoseSyringe_C.ExecuteUbergraph_PickupActor_OverdoseSyringe
// 0x0004 (0x0004 - 0x0000)
struct PickupActor_OverdoseSyringe_C_ExecuteUbergraph_PickupActor_OverdoseSyringe final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PickupActor_OverdoseSyringe_C_ExecuteUbergraph_PickupActor_OverdoseSyringe) == 0x000004, "Wrong alignment on PickupActor_OverdoseSyringe_C_ExecuteUbergraph_PickupActor_OverdoseSyringe");
static_assert(sizeof(PickupActor_OverdoseSyringe_C_ExecuteUbergraph_PickupActor_OverdoseSyringe) == 0x000004, "Wrong size on PickupActor_OverdoseSyringe_C_ExecuteUbergraph_PickupActor_OverdoseSyringe");
static_assert(offsetof(PickupActor_OverdoseSyringe_C_ExecuteUbergraph_PickupActor_OverdoseSyringe, EntryPoint) == 0x000000, "Member 'PickupActor_OverdoseSyringe_C_ExecuteUbergraph_PickupActor_OverdoseSyringe::EntryPoint' has a wrong offset!");

// Function PickupActor_OverdoseSyringe.PickupActor_OverdoseSyringe_C.Show For Personoids
// 0x0020 (0x0020 - 0x0000)
struct PickupActor_OverdoseSyringe_C_Show_For_Personoids final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupActor_OverdoseSyringe_C_Show_For_Personoids) == 0x000008, "Wrong alignment on PickupActor_OverdoseSyringe_C_Show_For_Personoids");
static_assert(sizeof(PickupActor_OverdoseSyringe_C_Show_For_Personoids) == 0x000020, "Wrong size on PickupActor_OverdoseSyringe_C_Show_For_Personoids");
static_assert(offsetof(PickupActor_OverdoseSyringe_C_Show_For_Personoids, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'PickupActor_OverdoseSyringe_C_Show_For_Personoids::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_OverdoseSyringe_C_Show_For_Personoids, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000008, "Member 'PickupActor_OverdoseSyringe_C_Show_For_Personoids::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(PickupActor_OverdoseSyringe_C_Show_For_Personoids, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000010, "Member 'PickupActor_OverdoseSyringe_C_Show_For_Personoids::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(PickupActor_OverdoseSyringe_C_Show_For_Personoids, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'PickupActor_OverdoseSyringe_C_Show_For_Personoids::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PickupActor_OverdoseSyringe.PickupActor_OverdoseSyringe_C.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct PickupActor_OverdoseSyringe_C_SetVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupActor_OverdoseSyringe_C_SetVisibility) == 0x000001, "Wrong alignment on PickupActor_OverdoseSyringe_C_SetVisibility");
static_assert(sizeof(PickupActor_OverdoseSyringe_C_SetVisibility) == 0x000001, "Wrong size on PickupActor_OverdoseSyringe_C_SetVisibility");
static_assert(offsetof(PickupActor_OverdoseSyringe_C_SetVisibility, Visible) == 0x000000, "Member 'PickupActor_OverdoseSyringe_C_SetVisibility::Visible' has a wrong offset!");

}

