#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickupActor_OxygenKit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PickupActor_OxygenKit.PickupActor_OxygenKit_C.ExecuteUbergraph_PickupActor_OxygenKit
// 0x0060 (0x0060 - 0x0000)
struct PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOxygenKitHolder_Remaints_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCloseToGround_Close;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit) == 0x000010, "Wrong alignment on PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit");
static_assert(sizeof(PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit) == 0x000060, "Wrong size on PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit");
static_assert(offsetof(PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit, EntryPoint) == 0x000000, "Member 'PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit::EntryPoint' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit, CallFunc_IsCloseToGround_Close) == 0x000058, "Member 'PickupActor_OxygenKit_C_ExecuteUbergraph_PickupActor_OxygenKit::CallFunc_IsCloseToGround_Close' has a wrong offset!");

// Function PickupActor_OxygenKit.PickupActor_OxygenKit_C.IsCloseToGround
// 0x0098 (0x0098 - 0x0000)
struct PickupActor_OxygenKit_C_IsCloseToGround final
{
public:
	bool                                          Close;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_BoxTraceMultiForObjects_OutHits;          // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceMultiForObjects_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_BoxTraceMulti_OutHits;                    // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceMulti_ReturnValue;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupActor_OxygenKit_C_IsCloseToGround) == 0x000008, "Wrong alignment on PickupActor_OxygenKit_C_IsCloseToGround");
static_assert(sizeof(PickupActor_OxygenKit_C_IsCloseToGround) == 0x000098, "Wrong size on PickupActor_OxygenKit_C_IsCloseToGround");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, Close) == 0x000000, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::Close' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, Temp_object_Variable) == 0x000008, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, Temp_object_Variable_1) == 0x000018, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, K2Node_MakeArray_Array) == 0x000028, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000044, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, CallFunc_Add_VectorVector_ReturnValue) == 0x000050, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00005C, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, CallFunc_BoxTraceMultiForObjects_OutHits) == 0x000068, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::CallFunc_BoxTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, CallFunc_BoxTraceMultiForObjects_ReturnValue) == 0x000078, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::CallFunc_BoxTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, CallFunc_BoxTraceMulti_OutHits) == 0x000080, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::CallFunc_BoxTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, CallFunc_BoxTraceMulti_ReturnValue) == 0x000090, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::CallFunc_BoxTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_OxygenKit_C_IsCloseToGround, CallFunc_BooleanOR_ReturnValue) == 0x000091, "Member 'PickupActor_OxygenKit_C_IsCloseToGround::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function PickupActor_OxygenKit.PickupActor_OxygenKit_C.OnRep_WallMounted
// 0x008C (0x008C - 0x0000)
struct PickupActor_OxygenKit_C_OnRep_WallMounted final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0000(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PickupActor_OxygenKit_C_OnRep_WallMounted) == 0x000004, "Wrong alignment on PickupActor_OxygenKit_C_OnRep_WallMounted");
static_assert(sizeof(PickupActor_OxygenKit_C_OnRep_WallMounted) == 0x00008C, "Wrong size on PickupActor_OxygenKit_C_OnRep_WallMounted");
static_assert(offsetof(PickupActor_OxygenKit_C_OnRep_WallMounted, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000000, "Member 'PickupActor_OxygenKit_C_OnRep_WallMounted::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

