#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickupActor_FireExtinguisher

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PickupActor_FireExtinguisher.PickupActor_FireExtinguisher_C.ExecuteUbergraph_PickupActor_FireExtinguisher
// 0x0008 (0x0008 - 0x0000)
struct PickupActor_FireExtinguisher_C_ExecuteUbergraph_PickupActor_FireExtinguisher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCloseToGroundBelow_Close;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupActor_FireExtinguisher_C_ExecuteUbergraph_PickupActor_FireExtinguisher) == 0x000004, "Wrong alignment on PickupActor_FireExtinguisher_C_ExecuteUbergraph_PickupActor_FireExtinguisher");
static_assert(sizeof(PickupActor_FireExtinguisher_C_ExecuteUbergraph_PickupActor_FireExtinguisher) == 0x000008, "Wrong size on PickupActor_FireExtinguisher_C_ExecuteUbergraph_PickupActor_FireExtinguisher");
static_assert(offsetof(PickupActor_FireExtinguisher_C_ExecuteUbergraph_PickupActor_FireExtinguisher, EntryPoint) == 0x000000, "Member 'PickupActor_FireExtinguisher_C_ExecuteUbergraph_PickupActor_FireExtinguisher::EntryPoint' has a wrong offset!");
static_assert(offsetof(PickupActor_FireExtinguisher_C_ExecuteUbergraph_PickupActor_FireExtinguisher, CallFunc_IsCloseToGroundBelow_Close) == 0x000004, "Member 'PickupActor_FireExtinguisher_C_ExecuteUbergraph_PickupActor_FireExtinguisher::CallFunc_IsCloseToGroundBelow_Close' has a wrong offset!");

// Function PickupActor_FireExtinguisher.PickupActor_FireExtinguisher_C.IsCloseToGroundBelow
// 0x0048 (0x0048 - 0x0000)
struct PickupActor_FireExtinguisher_C_IsCloseToGroundBelow final
{
public:
	bool                                          Close;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_BoxTraceMulti_OutHits;                    // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceMulti_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupActor_FireExtinguisher_C_IsCloseToGroundBelow) == 0x000008, "Wrong alignment on PickupActor_FireExtinguisher_C_IsCloseToGroundBelow");
static_assert(sizeof(PickupActor_FireExtinguisher_C_IsCloseToGroundBelow) == 0x000048, "Wrong size on PickupActor_FireExtinguisher_C_IsCloseToGroundBelow");
static_assert(offsetof(PickupActor_FireExtinguisher_C_IsCloseToGroundBelow, Close) == 0x000000, "Member 'PickupActor_FireExtinguisher_C_IsCloseToGroundBelow::Close' has a wrong offset!");
static_assert(offsetof(PickupActor_FireExtinguisher_C_IsCloseToGroundBelow, Temp_object_Variable) == 0x000008, "Member 'PickupActor_FireExtinguisher_C_IsCloseToGroundBelow::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PickupActor_FireExtinguisher_C_IsCloseToGroundBelow, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'PickupActor_FireExtinguisher_C_IsCloseToGroundBelow::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_FireExtinguisher_C_IsCloseToGroundBelow, CallFunc_Add_VectorVector_ReturnValue) == 0x000024, "Member 'PickupActor_FireExtinguisher_C_IsCloseToGroundBelow::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_FireExtinguisher_C_IsCloseToGroundBelow, CallFunc_BoxTraceMulti_OutHits) == 0x000030, "Member 'PickupActor_FireExtinguisher_C_IsCloseToGroundBelow::CallFunc_BoxTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(PickupActor_FireExtinguisher_C_IsCloseToGroundBelow, CallFunc_BoxTraceMulti_ReturnValue) == 0x000040, "Member 'PickupActor_FireExtinguisher_C_IsCloseToGroundBelow::CallFunc_BoxTraceMulti_ReturnValue' has a wrong offset!");

}

