#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerProfileMainMenu_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SCT_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerProfileMainMenu_BP.PlayerProfileMainMenu_BP_C
// 0x0208 (0x0468 - 0x0260)
class UPlayerProfileMainMenu_BP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       XPAdded;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CoinFlowLoop;                                      // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FinishCoins;                                       // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LevelUp;                                           // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GrantCoinsLoop;                                    // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GrantScoreLoop;                                    // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Spark;                                             // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeSparklesIn;                                    // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                AddEXPTestButton;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               AltAvatarOverlay;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AltAvatarTextBlock;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        AvatarSwitcher;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_Sparkles;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           CurrentExperience;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentLevel;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                ExpBarSpacer;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ExperienceSwitcher;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ExperienceText;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ExpNotchHZBox;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FriendCodeText;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_143;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Conversion;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Conversion_1;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Conversion_2;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainAvatarOverlay;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxLevelText;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProfileAvatar;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProfileBackground2;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProfileBackground2_1;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProfileBackground2_2;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ProfileNameText;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ProfileNameText_1;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_InfinityCoins;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_XPAdded;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_XPCurrent;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_XPForNext;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_XPForNext_1;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnlockedItemsWI_C*                     UnlockedItemsWI;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ExperienceToAdd;                                   // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           Ak;                                                // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InfinityCoinsToAdd;                                // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 NewLevelRequirement;                               // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             InitializeSteam;                                   // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 Log_String;                                        // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          StorageCoreEnabled;                                // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             FinishAll;                                         // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ULocalUserRecords_C*                    LocalSaveInstance;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InitialLevel;                                      // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         XPToConvertCosmetics;                              // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InfCoinConversionDivider;                          // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTPublicPlayerData                   CloudProfile;                                      // 0x0418(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FPlayerCustomizationItemTableRow> ItemsUnlockedForLevel;                             // 0x0440(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NothingUnlocked;                                   // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EndMatchPreviousLevel;                             // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NotchSpacing;                                      // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NotchWidth;                                        // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NotchCountMax;                                     // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InitializeSteam__DelegateSignature();
	void FinishAll__DelegateSignature();
	void ExecuteUbergraph_PlayerProfileMainMenu_BP(int32 EntryPoint);
	void InitializeForEndScreen();
	void OnClientLoggedOut();
	void OnLinkedToVersusEvilAccount();
	void Finished_Showing_All_Unlocks();
	void OnClientLoggedIn();
	void Construct();
	void SetDisplayName();
	void PreConstruct(bool IsDesignTime);
	void Audio_Init();
	void Audio_Score_Count_Start();
	void Audio_Coin_Tick();
	void Audio_Coin_Count_Stop();
	void Audio_Coin_Count_Start();
	void Increment_Inf_Coins();
	void Start_Interpolate_XP_Gain(int32 ExperienceToAdd_0);
	void Increment_Score();
	void BndEvt__Button_95_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Gain_Level();
	void Update_XP_Instantly(bool SkipCoinUpdate, bool SkipLevelUpAudio);
	void Count_Up_Infinity_Coins();
	void Audio_Score_Tick();
	void Audio_Level_Up();
	void Audio_Score_Count_Stop();
	void OnRetrieved_E5E8F42846FEA105F161E79DDB6A5728(const class FString& AccelByteId, class UTexture2DDynamic* AvatarTexture);
	void OnSuccess_92A41F364BAB25AF48C395BFBF793F75(const struct FFCTPublicPlayerData& Payload, int32 Code, const class FString& Message);
	void OnError_92A41F364BAB25AF48C395BFBF793F75(int32 Code, const class FString& Message);
	void OnSuccess_D9770AF244157052EC5B15943F261428(const struct FFCTPublicPlayerData& Payload, int32 Code, const class FString& Message);
	void OnError_D9770AF244157052EC5B15943F261428(int32 Code, const class FString& Message);
	void SetSparklePosition();
	void CreateAndSetAKComponent();
	void ConvertToInfCoin(int32 Score, int32* Return);
	void SaveExperienceAndInfCoins(int32 Experience, int32 InfinityCoins);
	void FindLevelFromXP(int32 CurrentExp, int32* Level, float* PercentageIntoLevel);
	void TryGainLevel();
	class FText GetXPToNextLevel();
	class FText GetXPInCurrentCurrent();
	void GetTargetXPForCurrentLevel(int32* Output);
	void GetItemUnlocksForCurrentLevel(TArray<struct FPlayerCustomizationItemTableRow>* ItemUnlocksForCurrentLevel, bool* NothingUnlocked_0);
	void TryResettingLocalSaveFile();
	void UpdateExperienceBar(float InPercent);

	void GetNewLevelRequirement(int32 Level, int32* Requirement) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerProfileMainMenu_BP_C">();
	}
	static class UPlayerProfileMainMenu_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerProfileMainMenu_BP_C>();
	}
};
static_assert(alignof(UPlayerProfileMainMenu_BP_C) == 0x000008, "Wrong alignment on UPlayerProfileMainMenu_BP_C");
static_assert(sizeof(UPlayerProfileMainMenu_BP_C) == 0x000468, "Wrong size on UPlayerProfileMainMenu_BP_C");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, UberGraphFrame) == 0x000260, "Member 'UPlayerProfileMainMenu_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, XPAdded) == 0x000268, "Member 'UPlayerProfileMainMenu_BP_C::XPAdded' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, CoinFlowLoop) == 0x000270, "Member 'UPlayerProfileMainMenu_BP_C::CoinFlowLoop' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, FinishCoins) == 0x000278, "Member 'UPlayerProfileMainMenu_BP_C::FinishCoins' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, LevelUp) == 0x000280, "Member 'UPlayerProfileMainMenu_BP_C::LevelUp' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, GrantCoinsLoop) == 0x000288, "Member 'UPlayerProfileMainMenu_BP_C::GrantCoinsLoop' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, GrantScoreLoop) == 0x000290, "Member 'UPlayerProfileMainMenu_BP_C::GrantScoreLoop' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Spark) == 0x000298, "Member 'UPlayerProfileMainMenu_BP_C::Spark' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, FadeSparklesIn) == 0x0002A0, "Member 'UPlayerProfileMainMenu_BP_C::FadeSparklesIn' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, AddEXPTestButton) == 0x0002A8, "Member 'UPlayerProfileMainMenu_BP_C::AddEXPTestButton' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, AltAvatarOverlay) == 0x0002B0, "Member 'UPlayerProfileMainMenu_BP_C::AltAvatarOverlay' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, AltAvatarTextBlock) == 0x0002B8, "Member 'UPlayerProfileMainMenu_BP_C::AltAvatarTextBlock' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, AvatarSwitcher) == 0x0002C0, "Member 'UPlayerProfileMainMenu_BP_C::AvatarSwitcher' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Button) == 0x0002C8, "Member 'UPlayerProfileMainMenu_BP_C::Button' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Canvas_Sparkles) == 0x0002D0, "Member 'UPlayerProfileMainMenu_BP_C::Canvas_Sparkles' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, CurrentExperience) == 0x0002D8, "Member 'UPlayerProfileMainMenu_BP_C::CurrentExperience' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, CurrentLevel) == 0x0002E0, "Member 'UPlayerProfileMainMenu_BP_C::CurrentLevel' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ExpBarSpacer) == 0x0002E8, "Member 'UPlayerProfileMainMenu_BP_C::ExpBarSpacer' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ExperienceSwitcher) == 0x0002F0, "Member 'UPlayerProfileMainMenu_BP_C::ExperienceSwitcher' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ExperienceText) == 0x0002F8, "Member 'UPlayerProfileMainMenu_BP_C::ExperienceText' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ExpNotchHZBox) == 0x000300, "Member 'UPlayerProfileMainMenu_BP_C::ExpNotchHZBox' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, FriendCodeText) == 0x000308, "Member 'UPlayerProfileMainMenu_BP_C::FriendCodeText' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, HorizontalBox_143) == 0x000310, "Member 'UPlayerProfileMainMenu_BP_C::HorizontalBox_143' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Image_Conversion) == 0x000318, "Member 'UPlayerProfileMainMenu_BP_C::Image_Conversion' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Image_Conversion_1) == 0x000320, "Member 'UPlayerProfileMainMenu_BP_C::Image_Conversion_1' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Image_Conversion_2) == 0x000328, "Member 'UPlayerProfileMainMenu_BP_C::Image_Conversion_2' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, MainAvatarOverlay) == 0x000330, "Member 'UPlayerProfileMainMenu_BP_C::MainAvatarOverlay' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, MaxLevelText) == 0x000338, "Member 'UPlayerProfileMainMenu_BP_C::MaxLevelText' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ProfileAvatar) == 0x000340, "Member 'UPlayerProfileMainMenu_BP_C::ProfileAvatar' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ProfileBackground2) == 0x000348, "Member 'UPlayerProfileMainMenu_BP_C::ProfileBackground2' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ProfileBackground2_1) == 0x000350, "Member 'UPlayerProfileMainMenu_BP_C::ProfileBackground2_1' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ProfileBackground2_2) == 0x000358, "Member 'UPlayerProfileMainMenu_BP_C::ProfileBackground2_2' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ProfileNameText) == 0x000360, "Member 'UPlayerProfileMainMenu_BP_C::ProfileNameText' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ProfileNameText_1) == 0x000368, "Member 'UPlayerProfileMainMenu_BP_C::ProfileNameText_1' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Text_InfinityCoins) == 0x000370, "Member 'UPlayerProfileMainMenu_BP_C::Text_InfinityCoins' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Text_XPAdded) == 0x000378, "Member 'UPlayerProfileMainMenu_BP_C::Text_XPAdded' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Text_XPCurrent) == 0x000380, "Member 'UPlayerProfileMainMenu_BP_C::Text_XPCurrent' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Text_XPForNext) == 0x000388, "Member 'UPlayerProfileMainMenu_BP_C::Text_XPForNext' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Text_XPForNext_1) == 0x000390, "Member 'UPlayerProfileMainMenu_BP_C::Text_XPForNext_1' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, UnlockedItemsWI) == 0x000398, "Member 'UPlayerProfileMainMenu_BP_C::UnlockedItemsWI' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ExperienceToAdd) == 0x0003A0, "Member 'UPlayerProfileMainMenu_BP_C::ExperienceToAdd' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Ak) == 0x0003A8, "Member 'UPlayerProfileMainMenu_BP_C::Ak' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, InfinityCoinsToAdd) == 0x0003B0, "Member 'UPlayerProfileMainMenu_BP_C::InfinityCoinsToAdd' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, NewLevelRequirement) == 0x0003B8, "Member 'UPlayerProfileMainMenu_BP_C::NewLevelRequirement' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, InitializeSteam) == 0x0003C8, "Member 'UPlayerProfileMainMenu_BP_C::InitializeSteam' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, Log_String) == 0x0003D8, "Member 'UPlayerProfileMainMenu_BP_C::Log_String' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, StorageCoreEnabled) == 0x0003E8, "Member 'UPlayerProfileMainMenu_BP_C::StorageCoreEnabled' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, FinishAll) == 0x0003F0, "Member 'UPlayerProfileMainMenu_BP_C::FinishAll' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, LocalSaveInstance) == 0x000400, "Member 'UPlayerProfileMainMenu_BP_C::LocalSaveInstance' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, InitialLevel) == 0x000408, "Member 'UPlayerProfileMainMenu_BP_C::InitialLevel' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, XPToConvertCosmetics) == 0x00040C, "Member 'UPlayerProfileMainMenu_BP_C::XPToConvertCosmetics' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, InfCoinConversionDivider) == 0x000410, "Member 'UPlayerProfileMainMenu_BP_C::InfCoinConversionDivider' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, CloudProfile) == 0x000418, "Member 'UPlayerProfileMainMenu_BP_C::CloudProfile' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, ItemsUnlockedForLevel) == 0x000440, "Member 'UPlayerProfileMainMenu_BP_C::ItemsUnlockedForLevel' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, NothingUnlocked) == 0x000450, "Member 'UPlayerProfileMainMenu_BP_C::NothingUnlocked' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, EndMatchPreviousLevel) == 0x000454, "Member 'UPlayerProfileMainMenu_BP_C::EndMatchPreviousLevel' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, NotchSpacing) == 0x000458, "Member 'UPlayerProfileMainMenu_BP_C::NotchSpacing' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, NotchWidth) == 0x00045C, "Member 'UPlayerProfileMainMenu_BP_C::NotchWidth' has a wrong offset!");
static_assert(offsetof(UPlayerProfileMainMenu_BP_C, NotchCountMax) == 0x000460, "Member 'UPlayerProfileMainMenu_BP_C::NotchCountMax' has a wrong offset!");

}

