#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerCustomizationStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct PlayerCustomizationStruct.PlayerCustomizationStruct
// 0x00C0 (0x00C0 - 0x0000)
struct FPlayerCustomizationStruct final
{
public:
	bool                                          Male_8_49C704184F0CD56559D54ABAC953390B;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Height_27_0DC1C0B04C0BAF5D2D8EBAA654F4FC24;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HairColor_23_D211CFE54BC33865E2C35FAA6268E4FD;     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SkinMaterial_30_A9A8F7BE40E615DD94DD25B18225109E;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UTexture2D*>          Clothes_18_A5E046E04E6C72736B053BBA089ACF25;       // 0x0020(0x0050)(Edit, BlueprintVisible)
	TMap<class FName, float>                      BodyMorphs_16_8B6B5F3849BEB598AF7C0CBA9D278D8B;    // 0x0070(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FPlayerCustomizationStruct) == 0x000008, "Wrong alignment on FPlayerCustomizationStruct");
static_assert(sizeof(FPlayerCustomizationStruct) == 0x0000C0, "Wrong size on FPlayerCustomizationStruct");
static_assert(offsetof(FPlayerCustomizationStruct, Male_8_49C704184F0CD56559D54ABAC953390B) == 0x000000, "Member 'FPlayerCustomizationStruct::Male_8_49C704184F0CD56559D54ABAC953390B' has a wrong offset!");
static_assert(offsetof(FPlayerCustomizationStruct, Height_27_0DC1C0B04C0BAF5D2D8EBAA654F4FC24) == 0x000004, "Member 'FPlayerCustomizationStruct::Height_27_0DC1C0B04C0BAF5D2D8EBAA654F4FC24' has a wrong offset!");
static_assert(offsetof(FPlayerCustomizationStruct, HairColor_23_D211CFE54BC33865E2C35FAA6268E4FD) == 0x000008, "Member 'FPlayerCustomizationStruct::HairColor_23_D211CFE54BC33865E2C35FAA6268E4FD' has a wrong offset!");
static_assert(offsetof(FPlayerCustomizationStruct, SkinMaterial_30_A9A8F7BE40E615DD94DD25B18225109E) == 0x000018, "Member 'FPlayerCustomizationStruct::SkinMaterial_30_A9A8F7BE40E615DD94DD25B18225109E' has a wrong offset!");
static_assert(offsetof(FPlayerCustomizationStruct, Clothes_18_A5E046E04E6C72736B053BBA089ACF25) == 0x000020, "Member 'FPlayerCustomizationStruct::Clothes_18_A5E046E04E6C72736B053BBA089ACF25' has a wrong offset!");
static_assert(offsetof(FPlayerCustomizationStruct, BodyMorphs_16_8B6B5F3849BEB598AF7C0CBA9D278D8B) == 0x000070, "Member 'FPlayerCustomizationStruct::BodyMorphs_16_8B6B5F3849BEB598AF7C0CBA9D278D8B' has a wrong offset!");

}

