#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerProfileMainMenu_BP

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerProfileMainMenu_BP.PlayerProfileMainMenu_BP_C.ExecuteUbergraph_PlayerProfileMainMenu_BP
// 0x0628 (0x0628 - 0x0000)
struct PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_AccelByteID;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      K2Node_CustomEvent_AvatarTexture;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& AccelByteId, class UTexture2DDynamic* AvatarTexture)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture2DDynamic*                      Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteAvatarCacheCallbackProxy*     CallFunc_GetCachedAvatarForPrimaryUserAsync_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_SkipCoinUpdate;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_SkipLevelUpAudio;               // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_ExperienceToAdd;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0088(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0098(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B0(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTPublicPlayerData                   Temp_struct_Variable_1;                            // 0x00D0(0x0028)()
	int32                                         Temp_int_Variable_1;                               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_1;                            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCTPublicPlayerData                   K2Node_CustomEvent_Payload;                        // 0x0118(0x0028)()
	int32                                         K2Node_CustomEvent_Code;                           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTPublicPlayerData& Payload, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetXPInCurrentCurrent_ReturnValue;        // 0x0198(0x0018)()
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x01B0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x01C0(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable_2;                               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0228(0x0010)(ZeroConstructor, NoDestructor)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0260(0x0018)()
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFCTAccelByteCloudPublicProfileCallbackProxy* CallFunc_GetCloudPublicProfile_ReturnValue;        // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTPublicPlayerData                   Temp_struct_Variable_3;                            // 0x0290(0x0028)()
	int32                                         Temp_int_Variable_4;                               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_2;                            // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x02D0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_5;                               // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x02E8(0x0018)()
	int32                                         CallFunc_GetTargetXPForCurrentLevel_Output;        // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_4;                            // 0x0308(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0318(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_5;                            // 0x0330(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNewLevelRequirement_Requirement;       // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNewLevelRequirement_Requirement_1;     // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_6;            // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_7;            // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0368(0x0018)()
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_386[0x2];                                      // 0x0386(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x0388(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FFCTPublicPlayerData                   K2Node_CustomEvent_Payload_1;                      // 0x0398(0x0028)()
	int32                                         K2Node_CustomEvent_Code_2;                         // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindLevelFromXP_Level;                    // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindLevelFromXP_PercentageIntoLevel;      // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x03F8(0x0018)()
	TArray<struct FPlayerCustomizationItemTableRow> CallFunc_GetItemUnlocksForCurrentLevel_ItemUnlocksForCurrentLevel; // 0x0410(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetItemUnlocksForCurrentLevel_NothingUnlocked; // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FFCTPublicPlayerData& Payload, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0424(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTAccelByteCloudPublicProfileCallbackProxy* CallFunc_SetCloudPublicProfile_ReturnValue;        // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ConvertToInfCoin_Return;                  // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_3;                         // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindLevelFromXP_Level_1;                  // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindLevelFromXP_PercentageIntoLevel_1;    // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0468(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_FindLevelFromXP_Level_2;                  // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindLevelFromXP_PercentageIntoLevel_2;    // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0482(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x0483(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_485[0x3];                                      // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTPublicPlayerData                   K2Node_MakeStruct_FCTPublicPlayerData;             // 0x0488(0x0028)(UObjectWrapper)
	class FText                                   CallFunc_GetXPToNextLevel_ReturnValue;             // 0x04B0(0x0018)()
	bool                                          CallFunc_IsConnected_ReturnValue;                  // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserDisplayName_ReturnValue;           // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSplitDisplayNameAndFriendCode_OutDisplayName; // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSplitDisplayNameAndFriendCode_OutFriendCode; // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0508(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0520(0x0018)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetUserDisplayName_ReturnValue_1;         // 0x0540(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0570(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x058C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x0594(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_6;                            // 0x05A8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6;                          // 0x05BC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_7;                            // 0x05D0(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_8;                            // 0x05E0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_6;                // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_7;                          // 0x05F8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_9;                            // 0x0608(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_7;                // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x061C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x061D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x061E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x061F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP) == 0x000008, "Wrong alignment on PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP");
static_assert(sizeof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP) == 0x000628, "Wrong size on PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, EntryPoint) == 0x000000, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_IsWinGDKPlatform_ReturnValue) == 0x000004, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_IsWinGDKPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_AccelByteID) == 0x000008, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_AccelByteID' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_AvatarTexture) == 0x000018, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_AvatarTexture' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_object_Variable) == 0x000030, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_string_Variable) == 0x000038, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_GetCachedAvatarForPrimaryUserAsync_ReturnValue) == 0x000050, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_GetCachedAvatarForPrimaryUserAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_SkipCoinUpdate) == 0x000059, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_SkipCoinUpdate' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_SkipLevelUpAudio) == 0x00005A, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_SkipLevelUpAudio' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00005B, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Subtract_IntInt_ReturnValue) == 0x00005C, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_ExperienceToAdd) == 0x000070, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_ExperienceToAdd' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000074, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Clamp_ReturnValue) == 0x000084, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_delegate_Variable) == 0x000088, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_struct_Variable) == 0x000098, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_int_Variable) == 0x0000A8, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000C8, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_struct_Variable_1) == 0x0000D0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_int_Variable_1) == 0x0000F8, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_string_Variable_1) == 0x000100, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000110, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000114, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_Payload) == 0x000118, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_Code) == 0x000140, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_Message) == 0x000148, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000158, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_PostAkEvent_ReturnValue) == 0x00015C, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CreateDelegate_OutputDelegate_3) == 0x000160, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000170, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000178, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_PlayAnimation_ReturnValue_2) == 0x000180, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_PlayAnimation_ReturnValue_3) == 0x000188, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_PlayAnimation_ReturnValue_4) == 0x000190, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_GetXPInCurrentCurrent_ReturnValue) == 0x000198, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_GetXPInCurrentCurrent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_delegate_Variable_1) == 0x0001B0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_struct_Variable_2) == 0x0001C0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_int_Variable_2) == 0x0001D0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001D4, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_PlayAnimation_ReturnValue_5) == 0x0001D8, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_Event_IsDesignTime) == 0x0001E0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_int_Variable_3) == 0x0001E4, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0001E8, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_Code_1) == 0x0001EC, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_Message_1) == 0x0001F0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CreateDelegate_OutputDelegate_4) == 0x000200, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000210, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CreateDelegate_OutputDelegate_5) == 0x000218, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CreateDelegate_OutputDelegate_6) == 0x000228, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000238, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000240, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CreateDelegate_OutputDelegate_7) == 0x000244, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x000254, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000258, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x00025C, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000260, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000278, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_GetCloudPublicProfile_ReturnValue) == 0x000280, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_GetCloudPublicProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_IsValid_ReturnValue_1) == 0x000288, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_struct_Variable_3) == 0x000290, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_int_Variable_4) == 0x0002B8, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_string_Variable_2) == 0x0002C0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_delegate_Variable_2) == 0x0002D0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_int_Variable_5) == 0x0002E0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0002E8, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_GetTargetXPForCurrentLevel_Output) == 0x000300, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_GetTargetXPForCurrentLevel_Output' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_struct_Variable_4) == 0x000308, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_delegate_Variable_3) == 0x000318, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_PostAkEvent_ReturnValue_2) == 0x000328, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_struct_Variable_5) == 0x000330, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_PostAkEvent_ReturnValue_3) == 0x000340, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_GetNewLevelRequirement_Requirement) == 0x000344, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_GetNewLevelRequirement_Requirement' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x000348, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00034C, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_GetNewLevelRequirement_Requirement_1) == 0x000350, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_GetNewLevelRequirement_Requirement_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000354, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Subtract_IntInt_ReturnValue_5) == 0x000358, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Subtract_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Subtract_IntInt_ReturnValue_6) == 0x00035C, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Subtract_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Subtract_IntInt_ReturnValue_7) == 0x000360, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Subtract_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000364, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000368, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000380, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000384, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_IsEditor_ReturnValue) == 0x000385, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, Temp_delegate_Variable_4) == 0x000388, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_Payload_1) == 0x000398, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_Code_2) == 0x0003C0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_Code_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CustomEvent_Message_2) == 0x0003C8, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_FindLevelFromXP_Level) == 0x0003D8, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_FindLevelFromXP_Level' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_FindLevelFromXP_PercentageIntoLevel) == 0x0003DC, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_FindLevelFromXP_PercentageIntoLevel' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Conv_IntToString_ReturnValue) == 0x0003E0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0003F0, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Add_IntInt_ReturnValue_3) == 0x0003F4, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Conv_IntToText_ReturnValue_4) == 0x0003F8, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_GetItemUnlocksForCurrentLevel_ItemUnlocksForCurrentLevel) == 0x000410, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_GetItemUnlocksForCurrentLevel_ItemUnlocksForCurrentLevel' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_GetItemUnlocksForCurrentLevel_NothingUnlocked) == 0x000420, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_GetItemUnlocksForCurrentLevel_NothingUnlocked' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, K2Node_CreateDelegate_OutputDelegate_8) == 0x000424, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_Add_IntInt_ReturnValue_4) == 0x000434, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_SetCloudPublicProfile_ReturnValue) == 0x000438, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_SetCloudPublicProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP, CallFunc_IsValid_ReturnValue_2) == 0x000440, "Member 'PlayerProfileMainMenu_BP_C_ExecuteUbergraph_PlayerProfileMainMenu_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
