#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: POI_WI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function POI_WI.POI_WI_C.ExecuteUbergraph_POI_WI
// 0x0020 (0x0020 - 0x0000)
struct POI_WI_C_ExecuteUbergraph_POI_WI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(POI_WI_C_ExecuteUbergraph_POI_WI) == 0x000008, "Wrong alignment on POI_WI_C_ExecuteUbergraph_POI_WI");
static_assert(sizeof(POI_WI_C_ExecuteUbergraph_POI_WI) == 0x000020, "Wrong size on POI_WI_C_ExecuteUbergraph_POI_WI");
static_assert(offsetof(POI_WI_C_ExecuteUbergraph_POI_WI, EntryPoint) == 0x000000, "Member 'POI_WI_C_ExecuteUbergraph_POI_WI::EntryPoint' has a wrong offset!");
static_assert(offsetof(POI_WI_C_ExecuteUbergraph_POI_WI, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'POI_WI_C_ExecuteUbergraph_POI_WI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(POI_WI_C_ExecuteUbergraph_POI_WI, K2Node_Event_IsDesignTime) == 0x000014, "Member 'POI_WI_C_ExecuteUbergraph_POI_WI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(POI_WI_C_ExecuteUbergraph_POI_WI, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'POI_WI_C_ExecuteUbergraph_POI_WI::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function POI_WI.POI_WI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct POI_WI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(POI_WI_C_PreConstruct) == 0x000001, "Wrong alignment on POI_WI_C_PreConstruct");
static_assert(sizeof(POI_WI_C_PreConstruct) == 0x000001, "Wrong size on POI_WI_C_PreConstruct");
static_assert(offsetof(POI_WI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'POI_WI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function POI_WI.POI_WI_C.UpdateDistance
// 0x0008 (0x0008 - 0x0000)
struct POI_WI_C_UpdateDistance final
{
public:
	bool                                          CallFunc_CanUpdateDistance_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Get_Distance_To_Player_in_Meters_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(POI_WI_C_UpdateDistance) == 0x000004, "Wrong alignment on POI_WI_C_UpdateDistance");
static_assert(sizeof(POI_WI_C_UpdateDistance) == 0x000008, "Wrong size on POI_WI_C_UpdateDistance");
static_assert(offsetof(POI_WI_C_UpdateDistance, CallFunc_CanUpdateDistance_ReturnValue) == 0x000000, "Member 'POI_WI_C_UpdateDistance::CallFunc_CanUpdateDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WI_C_UpdateDistance, CallFunc_Get_Distance_To_Player_in_Meters_ReturnValue) == 0x000004, "Member 'POI_WI_C_UpdateDistance::CallFunc_Get_Distance_To_Player_in_Meters_ReturnValue' has a wrong offset!");

// Function POI_WI.POI_WI_C.SetDistanceUIByText
// 0x0018 (0x0018 - 0x0000)
struct POI_WI_C_SetDistanceUIByText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(POI_WI_C_SetDistanceUIByText) == 0x000008, "Wrong alignment on POI_WI_C_SetDistanceUIByText");
static_assert(sizeof(POI_WI_C_SetDistanceUIByText) == 0x000018, "Wrong size on POI_WI_C_SetDistanceUIByText");
static_assert(offsetof(POI_WI_C_SetDistanceUIByText, Text) == 0x000000, "Member 'POI_WI_C_SetDistanceUIByText::Text' has a wrong offset!");

// Function POI_WI.POI_WI_C.SetPOIObject
// 0x0008 (0x0008 - 0x0000)
struct POI_WI_C_SetPOIObject final
{
public:
	class AActor*                                 POI_Object_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(POI_WI_C_SetPOIObject) == 0x000008, "Wrong alignment on POI_WI_C_SetPOIObject");
static_assert(sizeof(POI_WI_C_SetPOIObject) == 0x000008, "Wrong size on POI_WI_C_SetPOIObject");
static_assert(offsetof(POI_WI_C_SetPOIObject, POI_Object_0) == 0x000000, "Member 'POI_WI_C_SetPOIObject::POI_Object_0' has a wrong offset!");

// Function POI_WI.POI_WI_C.SetDistanceUIByDistance
// 0x0078 (0x0078 - 0x0000)
struct POI_WI_C_SetDistanceUIByDistance final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0018)()
};
static_assert(alignof(POI_WI_C_SetDistanceUIByDistance) == 0x000008, "Wrong alignment on POI_WI_C_SetDistanceUIByDistance");
static_assert(sizeof(POI_WI_C_SetDistanceUIByDistance) == 0x000078, "Wrong size on POI_WI_C_SetDistanceUIByDistance");
static_assert(offsetof(POI_WI_C_SetDistanceUIByDistance, Distance) == 0x000000, "Member 'POI_WI_C_SetDistanceUIByDistance::Distance' has a wrong offset!");
static_assert(offsetof(POI_WI_C_SetDistanceUIByDistance, CallFunc_Round_ReturnValue) == 0x000004, "Member 'POI_WI_C_SetDistanceUIByDistance::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WI_C_SetDistanceUIByDistance, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'POI_WI_C_SetDistanceUIByDistance::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WI_C_SetDistanceUIByDistance, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'POI_WI_C_SetDistanceUIByDistance::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(POI_WI_C_SetDistanceUIByDistance, K2Node_MakeArray_Array) == 0x000050, "Member 'POI_WI_C_SetDistanceUIByDistance::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(POI_WI_C_SetDistanceUIByDistance, CallFunc_Format_ReturnValue) == 0x000060, "Member 'POI_WI_C_SetDistanceUIByDistance::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function POI_WI.POI_WI_C.UpdateIcon
// 0x0088 (0x0088 - 0x0000)
struct POI_WI_C_UpdateIcon final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(POI_WI_C_UpdateIcon) == 0x000008, "Wrong alignment on POI_WI_C_UpdateIcon");
static_assert(sizeof(POI_WI_C_UpdateIcon) == 0x000088, "Wrong size on POI_WI_C_UpdateIcon");
static_assert(offsetof(POI_WI_C_UpdateIcon, InBrush) == 0x000000, "Member 'POI_WI_C_UpdateIcon::InBrush' has a wrong offset!");

// Function POI_WI.POI_WI_C.Get Distance To Player in Meters
// 0x0040 (0x0040 - 0x0000)
struct POI_WI_C_Get_Distance_To_Player_in_Meters final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController*                   CallFunc_Get_SCT_Player_Controller_Match_SCTPlayerController_MatchBP; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(POI_WI_C_Get_Distance_To_Player_in_Meters) == 0x000008, "Wrong alignment on POI_WI_C_Get_Distance_To_Player_in_Meters");
static_assert(sizeof(POI_WI_C_Get_Distance_To_Player_in_Meters) == 0x000040, "Wrong size on POI_WI_C_Get_Distance_To_Player_in_Meters");
static_assert(offsetof(POI_WI_C_Get_Distance_To_Player_in_Meters, ReturnValue) == 0x000000, "Member 'POI_WI_C_Get_Distance_To_Player_in_Meters::ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WI_C_Get_Distance_To_Player_in_Meters, CallFunc_Get_SCT_Player_Controller_Match_SCTPlayerController_MatchBP) == 0x000008, "Member 'POI_WI_C_Get_Distance_To_Player_in_Meters::CallFunc_Get_SCT_Player_Controller_Match_SCTPlayerController_MatchBP' has a wrong offset!");
static_assert(offsetof(POI_WI_C_Get_Distance_To_Player_in_Meters, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'POI_WI_C_Get_Distance_To_Player_in_Meters::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WI_C_Get_Distance_To_Player_in_Meters, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'POI_WI_C_Get_Distance_To_Player_in_Meters::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WI_C_Get_Distance_To_Player_in_Meters, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'POI_WI_C_Get_Distance_To_Player_in_Meters::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(POI_WI_C_Get_Distance_To_Player_in_Meters, CallFunc_Vector_Distance_ReturnValue) == 0x000034, "Member 'POI_WI_C_Get_Distance_To_Player_in_Meters::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WI_C_Get_Distance_To_Player_in_Meters, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'POI_WI_C_Get_Distance_To_Player_in_Meters::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function POI_WI.POI_WI_C.CanUpdateDistance
// 0x0018 (0x0018 - 0x0000)
struct POI_WI_C_CanUpdateDistance final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(POI_WI_C_CanUpdateDistance) == 0x000008, "Wrong alignment on POI_WI_C_CanUpdateDistance");
static_assert(sizeof(POI_WI_C_CanUpdateDistance) == 0x000018, "Wrong size on POI_WI_C_CanUpdateDistance");
static_assert(offsetof(POI_WI_C_CanUpdateDistance, ReturnValue) == 0x000000, "Member 'POI_WI_C_CanUpdateDistance::ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WI_C_CanUpdateDistance, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000008, "Member 'POI_WI_C_CanUpdateDistance::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WI_C_CanUpdateDistance, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'POI_WI_C_CanUpdateDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WI_C_CanUpdateDistance, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'POI_WI_C_CanUpdateDistance::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(POI_WI_C_CanUpdateDistance, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'POI_WI_C_CanUpdateDistance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

