#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: POI_WI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass POI_WI.POI_WI_C
// 0x00C8 (0x0328 - 0x0260)
class UPOI_WI_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasHolder;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DistanceText;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_79;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 POI_Object;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            IconBrush;                                         // 0x02A0(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_POI_WI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void UpdateDistance();
	void SetDistanceUIByText(const class FText& Text);
	void SetPOIObject(class AActor* POI_Object_0);
	void SetDistanceUIByDistance(float Distance);
	void UpdateIcon(const struct FSlateBrush& InBrush);

	float Get_Distance_To_Player_in_Meters() const;
	bool CanUpdateDistance() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"POI_WI_C">();
	}
	static class UPOI_WI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPOI_WI_C>();
	}
};
static_assert(alignof(UPOI_WI_C) == 0x000008, "Wrong alignment on UPOI_WI_C");
static_assert(sizeof(UPOI_WI_C) == 0x000328, "Wrong size on UPOI_WI_C");
static_assert(offsetof(UPOI_WI_C, UberGraphFrame) == 0x000260, "Member 'UPOI_WI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPOI_WI_C, FadeIn) == 0x000268, "Member 'UPOI_WI_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UPOI_WI_C, CanvasHolder) == 0x000270, "Member 'UPOI_WI_C::CanvasHolder' has a wrong offset!");
static_assert(offsetof(UPOI_WI_C, DistanceText) == 0x000278, "Member 'UPOI_WI_C::DistanceText' has a wrong offset!");
static_assert(offsetof(UPOI_WI_C, Icon) == 0x000280, "Member 'UPOI_WI_C::Icon' has a wrong offset!");
static_assert(offsetof(UPOI_WI_C, Image) == 0x000288, "Member 'UPOI_WI_C::Image' has a wrong offset!");
static_assert(offsetof(UPOI_WI_C, Image_79) == 0x000290, "Member 'UPOI_WI_C::Image_79' has a wrong offset!");
static_assert(offsetof(UPOI_WI_C, POI_Object) == 0x000298, "Member 'UPOI_WI_C::POI_Object' has a wrong offset!");
static_assert(offsetof(UPOI_WI_C, IconBrush) == 0x0002A0, "Member 'UPOI_WI_C::IconBrush' has a wrong offset!");

}

