#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RegionSelectedNotificationWI

#include "Basic.hpp"

#include "VivoxImpl_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function RegionSelectedNotificationWI.RegionSelectedNotificationWI_C.ExecuteUbergraph_RegionSelectedNotificationWI
// 0x0048 (0x0048 - 0x0000)
struct RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UVivoxLocalPlayer*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVivoxLocalPlayer*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoginRegion                                  K2Node_CustomEvent_Region;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ELoginRegion Region)>          K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AClientEntryPC*                         CallFunc_GetMainMenuPlayerController_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVivoxLocalPlayer*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegionSelectionAllowed_ReturnValue;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI) == 0x000008, "Wrong alignment on RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI");
static_assert(sizeof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI) == 0x000048, "Wrong size on RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, EntryPoint) == 0x000000, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, Temp_bool_Variable) == 0x000004, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, Temp_byte_Variable) == 0x000005, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, Temp_byte_Variable_1) == 0x000006, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000010, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, K2Node_CustomEvent_Region) == 0x000018, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::K2Node_CustomEvent_Region' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, CallFunc_GetMainMenuPlayerController_ReturnValue) == 0x000030, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::CallFunc_GetMainMenuPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000038, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, CallFunc_RegionSelectionAllowed_ReturnValue) == 0x000041, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::CallFunc_RegionSelectionAllowed_ReturnValue' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI, K2Node_Select_Default) == 0x000042, "Member 'RegionSelectedNotificationWI_C_ExecuteUbergraph_RegionSelectedNotificationWI::K2Node_Select_Default' has a wrong offset!");

// Function RegionSelectedNotificationWI.RegionSelectedNotificationWI_C.OnLogin
// 0x0001 (0x0001 - 0x0000)
struct RegionSelectedNotificationWI_C_OnLogin final
{
public:
	ELoginRegion                                  Region;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RegionSelectedNotificationWI_C_OnLogin) == 0x000001, "Wrong alignment on RegionSelectedNotificationWI_C_OnLogin");
static_assert(sizeof(RegionSelectedNotificationWI_C_OnLogin) == 0x000001, "Wrong size on RegionSelectedNotificationWI_C_OnLogin");
static_assert(offsetof(RegionSelectedNotificationWI_C_OnLogin, Region) == 0x000000, "Member 'RegionSelectedNotificationWI_C_OnLogin::Region' has a wrong offset!");

// Function RegionSelectedNotificationWI.RegionSelectedNotificationWI_C.UpdateNotificationText
// 0x0038 (0x0038 - 0x0000)
struct RegionSelectedNotificationWI_C_UpdateNotificationText final
{
public:
	ELoginRegion                                  Region;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoginRegion                                  Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0020(0x0018)()
};
static_assert(alignof(RegionSelectedNotificationWI_C_UpdateNotificationText) == 0x000008, "Wrong alignment on RegionSelectedNotificationWI_C_UpdateNotificationText");
static_assert(sizeof(RegionSelectedNotificationWI_C_UpdateNotificationText) == 0x000038, "Wrong size on RegionSelectedNotificationWI_C_UpdateNotificationText");
static_assert(offsetof(RegionSelectedNotificationWI_C_UpdateNotificationText, Region) == 0x000000, "Member 'RegionSelectedNotificationWI_C_UpdateNotificationText::Region' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_UpdateNotificationText, Temp_byte_Variable) == 0x000001, "Member 'RegionSelectedNotificationWI_C_UpdateNotificationText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_UpdateNotificationText, Temp_text_Variable) == 0x000008, "Member 'RegionSelectedNotificationWI_C_UpdateNotificationText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(RegionSelectedNotificationWI_C_UpdateNotificationText, K2Node_Select_Default) == 0x000020, "Member 'RegionSelectedNotificationWI_C_UpdateNotificationText::K2Node_Select_Default' has a wrong offset!");

}

