#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReportButtonWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ReportButtonWI.ReportButtonWI_C.ExecuteUbergraph_ReportButtonWI
// 0x0048 (0x0048 - 0x0000)
struct ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UReportPlayerWI_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UReportPlayerWI_C*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0030(0x0008)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0040(0x0008)(NoDestructor)
};
static_assert(alignof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI) == 0x000008, "Wrong alignment on ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI");
static_assert(sizeof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI) == 0x000048, "Wrong size on ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, EntryPoint) == 0x000000, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000008, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, K2Node_Event_IsDesignTime) == 0x000018, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, CallFunc_Array_Get_Item) == 0x000020, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, K2Node_Event_InFocusEvent_1) == 0x000030, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI, K2Node_Event_InFocusEvent) == 0x000040, "Member 'ReportButtonWI_C_ExecuteUbergraph_ReportButtonWI::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function ReportButtonWI.ReportButtonWI_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct ReportButtonWI_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(ReportButtonWI_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on ReportButtonWI_C_OnRemovedFromFocusPath");
static_assert(sizeof(ReportButtonWI_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on ReportButtonWI_C_OnRemovedFromFocusPath");
static_assert(offsetof(ReportButtonWI_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'ReportButtonWI_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function ReportButtonWI.ReportButtonWI_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct ReportButtonWI_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(ReportButtonWI_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on ReportButtonWI_C_OnAddedToFocusPath");
static_assert(sizeof(ReportButtonWI_C_OnAddedToFocusPath) == 0x000008, "Wrong size on ReportButtonWI_C_OnAddedToFocusPath");
static_assert(offsetof(ReportButtonWI_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'ReportButtonWI_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function ReportButtonWI.ReportButtonWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ReportButtonWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReportButtonWI_C_PreConstruct) == 0x000001, "Wrong alignment on ReportButtonWI_C_PreConstruct");
static_assert(sizeof(ReportButtonWI_C_PreConstruct) == 0x000001, "Wrong size on ReportButtonWI_C_PreConstruct");
static_assert(offsetof(ReportButtonWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ReportButtonWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ReportButtonWI.ReportButtonWI_C.GetNavigationWidget
// 0x0008 (0x0008 - 0x0000)
struct ReportButtonWI_C_GetNavigationWidget final
{
public:
	class UWidget*                                NavigationWidget;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReportButtonWI_C_GetNavigationWidget) == 0x000008, "Wrong alignment on ReportButtonWI_C_GetNavigationWidget");
static_assert(sizeof(ReportButtonWI_C_GetNavigationWidget) == 0x000008, "Wrong size on ReportButtonWI_C_GetNavigationWidget");
static_assert(offsetof(ReportButtonWI_C_GetNavigationWidget, NavigationWidget) == 0x000000, "Member 'ReportButtonWI_C_GetNavigationWidget::NavigationWidget' has a wrong offset!");

// Function ReportButtonWI.ReportButtonWI_C.SetNavigationForDirection
// 0x0010 (0x0010 - 0x0000)
struct ReportButtonWI_C_SetNavigationForDirection final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                WidgetTarget;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReportButtonWI_C_SetNavigationForDirection) == 0x000008, "Wrong alignment on ReportButtonWI_C_SetNavigationForDirection");
static_assert(sizeof(ReportButtonWI_C_SetNavigationForDirection) == 0x000010, "Wrong size on ReportButtonWI_C_SetNavigationForDirection");
static_assert(offsetof(ReportButtonWI_C_SetNavigationForDirection, Direction) == 0x000000, "Member 'ReportButtonWI_C_SetNavigationForDirection::Direction' has a wrong offset!");
static_assert(offsetof(ReportButtonWI_C_SetNavigationForDirection, WidgetTarget) == 0x000008, "Member 'ReportButtonWI_C_SetNavigationForDirection::WidgetTarget' has a wrong offset!");

}

