#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReportPlayerWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"
#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReportPlayerWI.ReportPlayerWI_C
// 0x0130 (0x03B0 - 0x0280)
class UReportPlayerWI_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       FadeBG;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ThankYou;                                          // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Background;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BorderPart1;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButtonForLinkWI_C*                     ButtonCancel;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButtonForLinkWI_C*                     ButtonSend;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              CancelButton;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasMovable;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Base;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBoxString_Reason2;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DescriptionBG;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DescriptionBottomImage;                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DescriptionLeftImage;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DescriptionRightImage;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DescriptionTopImage;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_154;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackground;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageThanks;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTopBackground;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTopBackground_1;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 MultiLineEditableText_Description;                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ComboBoxWI_C*                       ReasonComboBox;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              SendButton;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TailImage;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPlayerName;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextThanks;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Cooldown;                                          // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           Ak;                                                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DisplayName;                                       // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class Ubp_wi_EndScreen_Score_Entry_C*         EndScoreEntry;                                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   TextToSend;                                        // 0x0380(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 ReportedUserID;                                    // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PlayerId;                                          // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ReportPlayerWI(int32 EntryPoint);
	void BndEvt__ReportPlayerWI_CancelButton_K2Node_ComponentBoundEvent_6_OnButtonState__DelegateSignature();
	void BndEvt__ReportPlayerWI_SendButton_K2Node_ComponentBoundEvent_0_OnButtonState__DelegateSignature();
	void BndEvt__ReportPlayerWI_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnOpening__DelegateSignature();
	void BndEvt__ReportPlayerWI_ReasonComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void PressedEscape();
	void Destruct();
	void BndEvt__MultiLineEditableText_233_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void Construct();
	void Send_Report(const class FText& Description);
	void BndEvt__ButtonSend_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature();
	void BndEvt__ButtonForLinkWI_1_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature();
	void OnSuccess_1E089E9246337B4E242FB2873E6DBB5F(int32 Code, const class FString& Message);
	void OnError_1E089E9246337B4E242FB2873E6DBB5F(int32 Code, const class FString& Message);
	void SetReplyCosmetics(const class FText& InText, const struct FLinearColor& InColorAndOpacity);
	class UWidget* OnSubmissionButtonNavigated(EUINavigation Navigation_0);
	class UWidget* OnTextBlockNavigated(EUINavigation Navigation_0);
	class UWidget* OnReportedReasonNavigated(EUINavigation Navigation_0);
	class UWidget* OnNavigateFromSendToCancel(EUINavigation Navigation_0);
	class UWidget* OnNavigateFromCancelToSend(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReportPlayerWI_C">();
	}
	static class UReportPlayerWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReportPlayerWI_C>();
	}
};
static_assert(alignof(UReportPlayerWI_C) == 0x000008, "Wrong alignment on UReportPlayerWI_C");
static_assert(sizeof(UReportPlayerWI_C) == 0x0003B0, "Wrong size on UReportPlayerWI_C");
static_assert(offsetof(UReportPlayerWI_C, UberGraphFrame) == 0x000280, "Member 'UReportPlayerWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, FadeBG) == 0x000288, "Member 'UReportPlayerWI_C::FadeBG' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, ThankYou) == 0x000290, "Member 'UReportPlayerWI_C::ThankYou' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, Border_Background) == 0x000298, "Member 'UReportPlayerWI_C::Border_Background' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, BorderPart1) == 0x0002A0, "Member 'UReportPlayerWI_C::BorderPart1' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, ButtonCancel) == 0x0002A8, "Member 'UReportPlayerWI_C::ButtonCancel' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, ButtonSend) == 0x0002B0, "Member 'UReportPlayerWI_C::ButtonSend' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, CancelButton) == 0x0002B8, "Member 'UReportPlayerWI_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, CanvasMovable) == 0x0002C0, "Member 'UReportPlayerWI_C::CanvasMovable' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, CanvasPanel_Base) == 0x0002C8, "Member 'UReportPlayerWI_C::CanvasPanel_Base' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, ComboBoxString_Reason2) == 0x0002D0, "Member 'UReportPlayerWI_C::ComboBoxString_Reason2' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, DescriptionBG) == 0x0002D8, "Member 'UReportPlayerWI_C::DescriptionBG' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, DescriptionBottomImage) == 0x0002E0, "Member 'UReportPlayerWI_C::DescriptionBottomImage' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, DescriptionLeftImage) == 0x0002E8, "Member 'UReportPlayerWI_C::DescriptionLeftImage' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, DescriptionRightImage) == 0x0002F0, "Member 'UReportPlayerWI_C::DescriptionRightImage' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, DescriptionTopImage) == 0x0002F8, "Member 'UReportPlayerWI_C::DescriptionTopImage' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, Image_154) == 0x000300, "Member 'UReportPlayerWI_C::Image_154' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, ImageBackground) == 0x000308, "Member 'UReportPlayerWI_C::ImageBackground' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, ImageThanks) == 0x000310, "Member 'UReportPlayerWI_C::ImageThanks' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, ImageTopBackground) == 0x000318, "Member 'UReportPlayerWI_C::ImageTopBackground' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, ImageTopBackground_1) == 0x000320, "Member 'UReportPlayerWI_C::ImageTopBackground_1' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, MultiLineEditableText_Description) == 0x000328, "Member 'UReportPlayerWI_C::MultiLineEditableText_Description' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, ReasonComboBox) == 0x000330, "Member 'UReportPlayerWI_C::ReasonComboBox' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, SendButton) == 0x000338, "Member 'UReportPlayerWI_C::SendButton' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, TailImage) == 0x000340, "Member 'UReportPlayerWI_C::TailImage' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, TextPlayerName) == 0x000348, "Member 'UReportPlayerWI_C::TextPlayerName' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, TextThanks) == 0x000350, "Member 'UReportPlayerWI_C::TextThanks' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, Cooldown) == 0x000358, "Member 'UReportPlayerWI_C::Cooldown' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, Ak) == 0x000360, "Member 'UReportPlayerWI_C::Ak' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, DisplayName) == 0x000368, "Member 'UReportPlayerWI_C::DisplayName' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, EndScoreEntry) == 0x000378, "Member 'UReportPlayerWI_C::EndScoreEntry' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, TextToSend) == 0x000380, "Member 'UReportPlayerWI_C::TextToSend' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, ReportedUserID) == 0x000398, "Member 'UReportPlayerWI_C::ReportedUserID' has a wrong offset!");
static_assert(offsetof(UReportPlayerWI_C, PlayerId) == 0x0003A8, "Member 'UReportPlayerWI_C::PlayerId' has a wrong offset!");

}

