#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoombaRoamingSCTBP

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.ExecuteUbergraph_RoombaRoamingSCTBP
// 0x02B8 (0x02B8 - 0x0000)
struct RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FFCTCloudCustomizationVruumba          K2Node_CustomEvent_Payload_1;                      // 0x0048(0x0030)()
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTCloudCustomizationVruumba& Payload, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	struct FFCTCloudCustomizationVruumba          K2Node_CustomEvent_Payload;                        // 0x00A0(0x0030)()
	int32                                         K2Node_CustomEvent_Code;                           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTCloudCustomizationVruumba& Payload, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTCloudCustomizationVruumba          Temp_struct_Variable_2;                            // 0x0110(0x0030)()
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x016C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01F8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserId_ReturnValue;                    // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAccelByteVruumbaCustomizationSettingsCallbackProxy* CallFunc_GetVruumbaCustomizationSettingsByUserId_ReturnValue; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConnected_ReturnValue;                  // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP) == 0x000008, "Wrong alignment on RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP");
static_assert(sizeof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP) == 0x0002B8, "Wrong size on RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, EntryPoint) == 0x000000, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, Temp_struct_Variable) == 0x000008, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, Temp_delegate_Variable) == 0x000018, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, Temp_struct_Variable_1) == 0x000028, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, Temp_delegate_Variable_1) == 0x000038, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, K2Node_CustomEvent_Payload_1) == 0x000048, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, K2Node_CustomEvent_Code_1) == 0x000078, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, K2Node_CustomEvent_Message_1) == 0x000080, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, K2Node_CustomEvent_Payload) == 0x0000A0, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, K2Node_CustomEvent_Code) == 0x0000D0, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, K2Node_CustomEvent_Message) == 0x0000D8, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E8, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, Temp_string_Variable) == 0x0000F8, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, Temp_int_Variable) == 0x000108, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, Temp_struct_Variable_2) == 0x000110, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000140, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000148, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000149, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_VLerp_ReturnValue) == 0x00014C, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_RLerp_ReturnValue) == 0x000158, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_PostAkEvent_ReturnValue) == 0x000164, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_PostAkEvent_ReturnValue_1) == 0x000168, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00016C, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0001F8, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_GetUserId_ReturnValue) == 0x000288, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_GetUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_GetVruumbaCustomizationSettingsByUserId_ReturnValue) == 0x000298, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_GetVruumbaCustomizationSettingsByUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_IsValid_ReturnValue) == 0x0002A0, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, CallFunc_IsConnected_ReturnValue) == 0x0002A1, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::CallFunc_IsConnected_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002A4, "Member 'RoombaRoamingSCTBP_C_ExecuteUbergraph_RoombaRoamingSCTBP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.OnSuccess_711655824DB10DC7EA8A4A94806BFE22
// 0x0048 (0x0048 - 0x0000)
struct RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22 final
{
public:
	struct FFCTCloudCustomizationVruumba          Payload;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Code;                                              // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22) == 0x000008, "Wrong alignment on RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22");
static_assert(sizeof(RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22) == 0x000048, "Wrong size on RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22");
static_assert(offsetof(RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22, Payload) == 0x000000, "Member 'RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22::Payload' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22, Code) == 0x000030, "Member 'RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22::Code' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22, Message) == 0x000038, "Member 'RoombaRoamingSCTBP_C_OnSuccess_711655824DB10DC7EA8A4A94806BFE22::Message' has a wrong offset!");

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.OnError_711655824DB10DC7EA8A4A94806BFE22
// 0x0048 (0x0048 - 0x0000)
struct RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22 final
{
public:
	struct FFCTCloudCustomizationVruumba          Payload;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Code;                                              // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22) == 0x000008, "Wrong alignment on RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22");
static_assert(sizeof(RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22) == 0x000048, "Wrong size on RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22");
static_assert(offsetof(RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22, Payload) == 0x000000, "Member 'RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22::Payload' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22, Code) == 0x000030, "Member 'RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22::Code' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22, Message) == 0x000038, "Member 'RoombaRoamingSCTBP_C_OnError_711655824DB10DC7EA8A4A94806BFE22::Message' has a wrong offset!");

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.UpdateTimelineDuration
// 0x0018 (0x0018 - 0x0000)
struct RoombaRoamingSCTBP_C_UpdateTimelineDuration final
{
public:
	class UTimelineComponent*                     Timeline;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RoombaRoamingSCTBP_C_UpdateTimelineDuration) == 0x000008, "Wrong alignment on RoombaRoamingSCTBP_C_UpdateTimelineDuration");
static_assert(sizeof(RoombaRoamingSCTBP_C_UpdateTimelineDuration) == 0x000018, "Wrong size on RoombaRoamingSCTBP_C_UpdateTimelineDuration");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateTimelineDuration, Timeline) == 0x000000, "Member 'RoombaRoamingSCTBP_C_UpdateTimelineDuration::Timeline' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateTimelineDuration, Duration) == 0x000008, "Member 'RoombaRoamingSCTBP_C_UpdateTimelineDuration::Duration' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateTimelineDuration, CallFunc_FMax_ReturnValue) == 0x00000C, "Member 'RoombaRoamingSCTBP_C_UpdateTimelineDuration::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateTimelineDuration, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'RoombaRoamingSCTBP_C_UpdateTimelineDuration::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.UpdateTargetLocation
// 0x0014 (0x0014 - 0x0000)
struct RoombaRoamingSCTBP_C_UpdateTargetLocation final
{
public:
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RoombaRoamingSCTBP_C_UpdateTargetLocation) == 0x000004, "Wrong alignment on RoombaRoamingSCTBP_C_UpdateTargetLocation");
static_assert(sizeof(RoombaRoamingSCTBP_C_UpdateTargetLocation) == 0x000014, "Wrong size on RoombaRoamingSCTBP_C_UpdateTargetLocation");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateTargetLocation, CallFunc_Vector_Distance_ReturnValue) == 0x000000, "Member 'RoombaRoamingSCTBP_C_UpdateTargetLocation::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateTargetLocation, CallFunc_Array_Get_Item) == 0x000004, "Member 'RoombaRoamingSCTBP_C_UpdateTargetLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateTargetLocation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'RoombaRoamingSCTBP_C_UpdateTargetLocation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.UpdateTargetRotation
// 0x0018 (0x0018 - 0x0000)
struct RoombaRoamingSCTBP_C_UpdateTargetRotation final
{
public:
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RoombaRoamingSCTBP_C_UpdateTargetRotation) == 0x000004, "Wrong alignment on RoombaRoamingSCTBP_C_UpdateTargetRotation");
static_assert(sizeof(RoombaRoamingSCTBP_C_UpdateTargetRotation) == 0x000018, "Wrong size on RoombaRoamingSCTBP_C_UpdateTargetRotation");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateTargetRotation, CallFunc_Array_Get_Item) == 0x000000, "Member 'RoombaRoamingSCTBP_C_UpdateTargetRotation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateTargetRotation, CallFunc_FindLookAtRotation_ReturnValue) == 0x00000C, "Member 'RoombaRoamingSCTBP_C_UpdateTargetRotation::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.UpdateDestination
// 0x0014 (0x0014 - 0x0000)
struct RoombaRoamingSCTBP_C_UpdateDestination final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RoombaRoamingSCTBP_C_UpdateDestination) == 0x000004, "Wrong alignment on RoombaRoamingSCTBP_C_UpdateDestination");
static_assert(sizeof(RoombaRoamingSCTBP_C_UpdateDestination) == 0x000014, "Wrong size on RoombaRoamingSCTBP_C_UpdateDestination");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateDestination, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'RoombaRoamingSCTBP_C_UpdateDestination::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateDestination, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'RoombaRoamingSCTBP_C_UpdateDestination::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateDestination, Temp_int_Variable) == 0x000008, "Member 'RoombaRoamingSCTBP_C_UpdateDestination::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateDestination, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'RoombaRoamingSCTBP_C_UpdateDestination::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateDestination, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'RoombaRoamingSCTBP_C_UpdateDestination::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.SetAntenna
// 0x0170 (0x0170 - 0x0000)
struct RoombaRoamingSCTBP_C_SetAntenna final
{
public:
	class FString                                 AntennaName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVruumbaAnimatedMeshCustomizationItemTableRow CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0088)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x00DC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(RoombaRoamingSCTBP_C_SetAntenna) == 0x000010, "Wrong alignment on RoombaRoamingSCTBP_C_SetAntenna");
static_assert(sizeof(RoombaRoamingSCTBP_C_SetAntenna) == 0x000170, "Wrong size on RoombaRoamingSCTBP_C_SetAntenna");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetAntenna, AntennaName) == 0x000000, "Member 'RoombaRoamingSCTBP_C_SetAntenna::AntennaName' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetAntenna, CallFunc_Conv_StringToName_ReturnValue) == 0x000010, "Member 'RoombaRoamingSCTBP_C_SetAntenna::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetAntenna, CallFunc_GetSocketTransform_ReturnValue) == 0x000020, "Member 'RoombaRoamingSCTBP_C_SetAntenna::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetAntenna, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'RoombaRoamingSCTBP_C_SetAntenna::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetAntenna, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D8, "Member 'RoombaRoamingSCTBP_C_SetAntenna::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetAntenna, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0000DC, "Member 'RoombaRoamingSCTBP_C_SetAntenna::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.SetBody
// 0x00C0 (0x00C0 - 0x0000)
struct RoombaRoamingSCTBP_C_SetBody final
{
public:
	class FString                                 BodyName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVruumbaSkeletalMeshCustomizationItemTableRow CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0080)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RoombaRoamingSCTBP_C_SetBody) == 0x000008, "Wrong alignment on RoombaRoamingSCTBP_C_SetBody");
static_assert(sizeof(RoombaRoamingSCTBP_C_SetBody) == 0x0000C0, "Wrong size on RoombaRoamingSCTBP_C_SetBody");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetBody, BodyName) == 0x000000, "Member 'RoombaRoamingSCTBP_C_SetBody::BodyName' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetBody, CallFunc_Conv_StringToName_ReturnValue) == 0x000010, "Member 'RoombaRoamingSCTBP_C_SetBody::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetBody, Temp_int_Array_Index_Variable) == 0x000018, "Member 'RoombaRoamingSCTBP_C_SetBody::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetBody, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'RoombaRoamingSCTBP_C_SetBody::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetBody, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A0, "Member 'RoombaRoamingSCTBP_C_SetBody::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetBody, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'RoombaRoamingSCTBP_C_SetBody::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetBody, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'RoombaRoamingSCTBP_C_SetBody::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetBody, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'RoombaRoamingSCTBP_C_SetBody::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetBody, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'RoombaRoamingSCTBP_C_SetBody::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetBody, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'RoombaRoamingSCTBP_C_SetBody::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.UpdateVruumbaCustomization
// 0x0020 (0x0020 - 0x0000)
struct RoombaRoamingSCTBP_C_UpdateVruumbaCustomization final
{
public:
	class FString                                 BodyName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AntennaName;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(RoombaRoamingSCTBP_C_UpdateVruumbaCustomization) == 0x000008, "Wrong alignment on RoombaRoamingSCTBP_C_UpdateVruumbaCustomization");
static_assert(sizeof(RoombaRoamingSCTBP_C_UpdateVruumbaCustomization) == 0x000020, "Wrong size on RoombaRoamingSCTBP_C_UpdateVruumbaCustomization");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateVruumbaCustomization, BodyName) == 0x000000, "Member 'RoombaRoamingSCTBP_C_UpdateVruumbaCustomization::BodyName' has a wrong offset!");
static_assert(offsetof(RoombaRoamingSCTBP_C_UpdateVruumbaCustomization, AntennaName) == 0x000010, "Member 'RoombaRoamingSCTBP_C_UpdateVruumbaCustomization::AntennaName' has a wrong offset!");

// Function RoombaRoamingSCTBP.RoombaRoamingSCTBP_C.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct RoombaRoamingSCTBP_C_SetVisibility final
{
public:
	bool                                          bVisibility;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RoombaRoamingSCTBP_C_SetVisibility) == 0x000001, "Wrong alignment on RoombaRoamingSCTBP_C_SetVisibility");
static_assert(sizeof(RoombaRoamingSCTBP_C_SetVisibility) == 0x000001, "Wrong size on RoombaRoamingSCTBP_C_SetVisibility");
static_assert(offsetof(RoombaRoamingSCTBP_C_SetVisibility, bVisibility) == 0x000000, "Member 'RoombaRoamingSCTBP_C_SetVisibility::bVisibility' has a wrong offset!");

}

