#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoundedBGBoxWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RoundedBGBoxWI.RoundedBGBoxWI_C
// 0x0078 (0x02D8 - 0x0260)
class URoundedBGBoxWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Background;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Foreground;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ForegroundImage;                                   // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            ForegroundTint;                                    // 0x0280(0x0028)(Edit, BlueprintVisible)
	class UTexture2D*                             BackgroundImage;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            BackgroundTint;                                    // 0x02B0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_RoundedBGBoxWI(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RoundedBGBoxWI_C">();
	}
	static class URoundedBGBoxWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoundedBGBoxWI_C>();
	}
};
static_assert(alignof(URoundedBGBoxWI_C) == 0x000008, "Wrong alignment on URoundedBGBoxWI_C");
static_assert(sizeof(URoundedBGBoxWI_C) == 0x0002D8, "Wrong size on URoundedBGBoxWI_C");
static_assert(offsetof(URoundedBGBoxWI_C, UberGraphFrame) == 0x000260, "Member 'URoundedBGBoxWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URoundedBGBoxWI_C, Background) == 0x000268, "Member 'URoundedBGBoxWI_C::Background' has a wrong offset!");
static_assert(offsetof(URoundedBGBoxWI_C, Foreground) == 0x000270, "Member 'URoundedBGBoxWI_C::Foreground' has a wrong offset!");
static_assert(offsetof(URoundedBGBoxWI_C, ForegroundImage) == 0x000278, "Member 'URoundedBGBoxWI_C::ForegroundImage' has a wrong offset!");
static_assert(offsetof(URoundedBGBoxWI_C, ForegroundTint) == 0x000280, "Member 'URoundedBGBoxWI_C::ForegroundTint' has a wrong offset!");
static_assert(offsetof(URoundedBGBoxWI_C, BackgroundImage) == 0x0002A8, "Member 'URoundedBGBoxWI_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(URoundedBGBoxWI_C, BackgroundTint) == 0x0002B0, "Member 'URoundedBGBoxWI_C::BackgroundTint' has a wrong offset!");

}

