#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_TutorialContent

#include "Basic.hpp"

#include "E_tutorialtypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_TutorialContent.s_TutorialContent
// 0x0050 (0x0050 - 0x0000)
struct FS_TutorialContent final
{
public:
	E_tutorialtypes                               TutorialType_17_B08F50BF4BF2E483316E16980BA10191;  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HeadlineText_4_9122309C47164889132412A93B776761;   // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FText                                   BodyText_19_785FED424D637B08F79D61A6997310DA;      // 0x0020(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Image_10_8331843B4186D426FE9072B965C1BEAF;         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BackgroundImage_11_7B3906D841AB90BC5D07C2B43D46A771; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ExplainerImage_22_D69FC6184D8CFB72678396A9B2EA0A23; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_TutorialContent) == 0x000008, "Wrong alignment on FS_TutorialContent");
static_assert(sizeof(FS_TutorialContent) == 0x000050, "Wrong size on FS_TutorialContent");
static_assert(offsetof(FS_TutorialContent, TutorialType_17_B08F50BF4BF2E483316E16980BA10191) == 0x000000, "Member 'FS_TutorialContent::TutorialType_17_B08F50BF4BF2E483316E16980BA10191' has a wrong offset!");
static_assert(offsetof(FS_TutorialContent, HeadlineText_4_9122309C47164889132412A93B776761) == 0x000008, "Member 'FS_TutorialContent::HeadlineText_4_9122309C47164889132412A93B776761' has a wrong offset!");
static_assert(offsetof(FS_TutorialContent, BodyText_19_785FED424D637B08F79D61A6997310DA) == 0x000020, "Member 'FS_TutorialContent::BodyText_19_785FED424D637B08F79D61A6997310DA' has a wrong offset!");
static_assert(offsetof(FS_TutorialContent, Image_10_8331843B4186D426FE9072B965C1BEAF) == 0x000038, "Member 'FS_TutorialContent::Image_10_8331843B4186D426FE9072B965C1BEAF' has a wrong offset!");
static_assert(offsetof(FS_TutorialContent, BackgroundImage_11_7B3906D841AB90BC5D07C2B43D46A771) == 0x000040, "Member 'FS_TutorialContent::BackgroundImage_11_7B3906D841AB90BC5D07C2B43D46A771' has a wrong offset!");
static_assert(offsetof(FS_TutorialContent, ExplainerImage_22_D69FC6184D8CFB72678396A9B2EA0A23) == 0x000048, "Member 'FS_TutorialContent::ExplainerImage_22_D69FC6184D8CFB72678396A9B2EA0A23' has a wrong offset!");

}

