#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScannerDisplayWI

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ScannerDisplayWI.ScannerDisplayWI_C.ExecuteUbergraph_ScannerDisplayWI
// 0x0148 (0x0148 - 0x0000)
struct ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_In;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0058(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0070(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0088(0x0018)()
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x00A8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x00C0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x00D8(0x0018)()
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00F8(0x0018)()
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_CustomEvent_AkEvent;                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0130(0x0018)(ConstParm)
};
static_assert(alignof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI) == 0x000008, "Wrong alignment on ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI");
static_assert(sizeof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI) == 0x000148, "Wrong size on ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, EntryPoint) == 0x000000, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, Temp_int_Variable) == 0x000004, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, Temp_struct_Variable) == 0x000018, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, Temp_delegate_Variable) == 0x000030, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, K2Node_Event_IsDesignTime) == 0x000040, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, K2Node_CustomEvent_In) == 0x000041, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::K2Node_CustomEvent_In' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000048, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_MakeLiteralText_ReturnValue) == 0x000058, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000070, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000088, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000A0, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_MakeLiteralText_ReturnValue_3) == 0x0000A8, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_MakeLiteralText_ReturnValue_4) == 0x0000C0, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_MakeLiteralText_ReturnValue_5) == 0x0000D8, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000F0, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, K2Node_Select_Default) == 0x0000F8, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000110, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, K2Node_CustomEvent_AkEvent) == 0x000120, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::K2Node_CustomEvent_AkEvent' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, Temp_bool_Variable) == 0x000128, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, CallFunc_PostAkEvent_ReturnValue) == 0x00012C, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI, K2Node_Select_Default_1) == 0x000130, "Member 'ScannerDisplayWI_C_ExecuteUbergraph_ScannerDisplayWI::K2Node_Select_Default_1' has a wrong offset!");

// Function ScannerDisplayWI.ScannerDisplayWI_C.Audio Post Event
// 0x0008 (0x0008 - 0x0000)
struct ScannerDisplayWI_C_Audio_Post_Event final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScannerDisplayWI_C_Audio_Post_Event) == 0x000008, "Wrong alignment on ScannerDisplayWI_C_Audio_Post_Event");
static_assert(sizeof(ScannerDisplayWI_C_Audio_Post_Event) == 0x000008, "Wrong size on ScannerDisplayWI_C_Audio_Post_Event");
static_assert(offsetof(ScannerDisplayWI_C_Audio_Post_Event, AkEvent) == 0x000000, "Member 'ScannerDisplayWI_C_Audio_Post_Event::AkEvent' has a wrong offset!");

// Function ScannerDisplayWI.ScannerDisplayWI_C.fade
// 0x0001 (0x0001 - 0x0000)
struct ScannerDisplayWI_C_Fade final
{
public:
	bool                                          In;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScannerDisplayWI_C_Fade) == 0x000001, "Wrong alignment on ScannerDisplayWI_C_Fade");
static_assert(sizeof(ScannerDisplayWI_C_Fade) == 0x000001, "Wrong size on ScannerDisplayWI_C_Fade");
static_assert(offsetof(ScannerDisplayWI_C_Fade, In) == 0x000000, "Member 'ScannerDisplayWI_C_Fade::In' has a wrong offset!");

// Function ScannerDisplayWI.ScannerDisplayWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ScannerDisplayWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScannerDisplayWI_C_PreConstruct) == 0x000001, "Wrong alignment on ScannerDisplayWI_C_PreConstruct");
static_assert(sizeof(ScannerDisplayWI_C_PreConstruct) == 0x000001, "Wrong size on ScannerDisplayWI_C_PreConstruct");
static_assert(offsetof(ScannerDisplayWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ScannerDisplayWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ScannerDisplayWI.ScannerDisplayWI_C.AddPlayerEntry
// 0x0040 (0x0040 - 0x0000)
struct ScannerDisplayWI_C_AddPlayerEntry final
{
public:
	class FText                                   CharacterName;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         Padding_0;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassengerLogEntryWI_C*                 CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScannerDisplayWI_C_AddPlayerEntry) == 0x000008, "Wrong alignment on ScannerDisplayWI_C_AddPlayerEntry");
static_assert(sizeof(ScannerDisplayWI_C_AddPlayerEntry) == 0x000040, "Wrong size on ScannerDisplayWI_C_AddPlayerEntry");
static_assert(offsetof(ScannerDisplayWI_C_AddPlayerEntry, CharacterName) == 0x000000, "Member 'ScannerDisplayWI_C_AddPlayerEntry::CharacterName' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_AddPlayerEntry, Padding_0) == 0x000018, "Member 'ScannerDisplayWI_C_AddPlayerEntry::Padding_0' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_AddPlayerEntry, CallFunc_Create_ReturnValue) == 0x000020, "Member 'ScannerDisplayWI_C_AddPlayerEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_AddPlayerEntry, K2Node_MakeStruct_Margin) == 0x000028, "Member 'ScannerDisplayWI_C_AddPlayerEntry::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ScannerDisplayWI_C_AddPlayerEntry, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000038, "Member 'ScannerDisplayWI_C_AddPlayerEntry::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

}

