#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreDetailsBoxWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScoreDetailsBoxWI.ScoreDetailsBoxWI_C
// 0x0040 (0x02A0 - 0x0260)
class UScoreDetailsBoxWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Image;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_60;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Entries;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Category;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0288(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_ScoreDetailsBoxWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScoreDetailsBoxWI_C">();
	}
	static class UScoreDetailsBoxWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoreDetailsBoxWI_C>();
	}
};
static_assert(alignof(UScoreDetailsBoxWI_C) == 0x000008, "Wrong alignment on UScoreDetailsBoxWI_C");
static_assert(sizeof(UScoreDetailsBoxWI_C) == 0x0002A0, "Wrong size on UScoreDetailsBoxWI_C");
static_assert(offsetof(UScoreDetailsBoxWI_C, UberGraphFrame) == 0x000260, "Member 'UScoreDetailsBoxWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScoreDetailsBoxWI_C, Image) == 0x000268, "Member 'UScoreDetailsBoxWI_C::Image' has a wrong offset!");
static_assert(offsetof(UScoreDetailsBoxWI_C, Image_60) == 0x000270, "Member 'UScoreDetailsBoxWI_C::Image_60' has a wrong offset!");
static_assert(offsetof(UScoreDetailsBoxWI_C, ScrollBox_Entries) == 0x000278, "Member 'UScoreDetailsBoxWI_C::ScrollBox_Entries' has a wrong offset!");
static_assert(offsetof(UScoreDetailsBoxWI_C, Text_Category) == 0x000280, "Member 'UScoreDetailsBoxWI_C::Text_Category' has a wrong offset!");
static_assert(offsetof(UScoreDetailsBoxWI_C, Text) == 0x000288, "Member 'UScoreDetailsBoxWI_C::Text' has a wrong offset!");

}

