#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCT_AnimBpSCT

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "MovementDirection_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "TurnAnims_structs.hpp"
#include "MovementMode_structs.hpp"
#include "PivotParams_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "IdleEntryState_structs.hpp"
#include "Stance_structs.hpp"
#include "LocomotionState_structs.hpp"
#include "Gait_structs.hpp"
#include "E_Emotes_structs.hpp"
#include "E_ItemAnimation_structs.hpp"
#include "E_interactionAnim_structs.hpp"
#include "E_interactionAnimState_structs.hpp"
#include "RPC_Enum_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SCT_AnimBpSCT.SCT_AnimBpSCT_C
// 0x10CA0 (0x10F60 - 0x02C0)
class USCT_AnimBpSCT_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x02C8(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x02F0(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_171;                // 0x03A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_170;                // 0x03C8(0x0028)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x03F0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_112;                     // 0x0480(0x0030)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x04B0(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_98;                   // 0x0560(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_97;                   // 0x05E0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_111;                     // 0x0660(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_25;                     // 0x0690(0x00B0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x0740(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x0848(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0950(0x0108)()
	uint8                                         Pad_A58[0x8];                                      // 0x0A58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_2;                         // 0x0A60(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0C40(0x01E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x0E20(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0F28(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x1030(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x1050(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x1070(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x1090(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x10B0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x11B8(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x12C0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x12E8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x13F0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x14F8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1600(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1708(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1810(0x0108)()
	uint8                                         Pad_1918[0x8];                                     // 0x1918(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x1920(0x01E0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1B00(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1B20(0x0108)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x1C28(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x1CC8(0x0028)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x1CF0(0x0650)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_36;                  // 0x2340(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_96;                   // 0x23E0(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x2460(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x2480(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_35;                  // 0x24A0(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_21;                 // 0x2540(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_95;                   // 0x2600(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_34;                  // 0x2680(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x2720(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x2748(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x2790(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_169;                // 0x27B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_168;                // 0x27D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_167;                // 0x2800(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_166;                // 0x2828(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_94;                   // 0x2850(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_110;                     // 0x28D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_93;                   // 0x2900(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_109;                     // 0x2980(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_92;                   // 0x29B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_108;                     // 0x2A30(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x2A60(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_107;                     // 0x2A88(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_24;                     // 0x2AB8(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_33;                  // 0x2B68(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_20;                 // 0x2C08(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_91;                   // 0x2CC8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_106;                     // 0x2D48(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_23;                     // 0x2D78(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_32;                  // 0x2E28(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2EC8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_165;                // 0x2EE8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_90;                   // 0x2F10(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_105;                     // 0x2F90(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_89;                   // 0x2FC0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_104;                     // 0x3040(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_22;                     // 0x3070(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_31;                  // 0x3120(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_164;                // 0x31C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_163;                // 0x31E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_162;                // 0x3210(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_161;                // 0x3238(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_160;                // 0x3260(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_159;                // 0x3288(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_158;                // 0x32B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_157;                // 0x32D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_156;                // 0x3300(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_155;                // 0x3328(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_154;                // 0x3350(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_153;                // 0x3378(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_152;                // 0x33A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_151;                // 0x33C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_150;                // 0x33F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_149;                // 0x3418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_148;                // 0x3440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_147;                // 0x3468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_146;                // 0x3490(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_145;                // 0x34B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_144;                // 0x34E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_143;                // 0x3508(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_142;                // 0x3530(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_141;                // 0x3558(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_140;                // 0x3580(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_139;                // 0x35A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_138;                // 0x35D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_137;                // 0x35F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_136;                // 0x3620(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_135;                // 0x3648(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_134;                // 0x3670(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_133;                // 0x3698(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_132;                // 0x36C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_131;                // 0x36E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_130;                // 0x3710(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_129;                // 0x3738(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_128;                // 0x3760(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_127;                // 0x3788(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_88;                   // 0x37B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_103;                     // 0x3830(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_87;                   // 0x3860(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_102;                     // 0x38E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_86;                   // 0x3910(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_101;                     // 0x3990(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_85;                   // 0x39C0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_100;                     // 0x3A40(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_84;                   // 0x3A70(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_99;                      // 0x3AF0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_83;                   // 0x3B20(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_98;                      // 0x3BA0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_82;                   // 0x3BD0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_97;                      // 0x3C50(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_81;                   // 0x3C80(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_96;                      // 0x3D00(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_80;                   // 0x3D30(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_95;                      // 0x3DB0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x3DE0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_94;                      // 0x3E08(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_79;                   // 0x3E38(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_93;                      // 0x3EB8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_78;                   // 0x3EE8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_92;                      // 0x3F68(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_77;                   // 0x3F98(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_91;                      // 0x4018(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_76;                   // 0x4048(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_90;                      // 0x40C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_75;                   // 0x40F8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_89;                      // 0x4178(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_74;                   // 0x41A8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_88;                      // 0x4228(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_73;                   // 0x4258(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_87;                      // 0x42D8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_72;                   // 0x4308(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86;                      // 0x4388(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_71;                   // 0x43B8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_85;                      // 0x4438(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_70;                   // 0x4468(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84;                      // 0x44E8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_69;                   // 0x4518(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_83;                      // 0x4598(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68;                   // 0x45C8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_82;                      // 0x4648(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x4678(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_81;                      // 0x46F8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x4728(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_80;                      // 0x47A8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_21;                     // 0x47D8(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_19;                 // 0x4888(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_30;                  // 0x4948(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0x49E8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x4B40(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x4B68(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_29;                  // 0x4CC0(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x4D60(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_126;                // 0x4EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_125;                // 0x4EE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_124;                // 0x4F08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_123;                // 0x4F30(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x4F58(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79;                      // 0x4FD8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x5008(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78;                      // 0x5088(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x50B8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77;                      // 0x5138(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x5168(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x5190(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_20;                     // 0x51C0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_28;                  // 0x5270(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_18;                 // 0x5310(0x00C0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_8;                     // 0x53D0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_122;                // 0x5498(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_121;                // 0x54C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_120;                // 0x54E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x5510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x5538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x5560(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x5588(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x5608(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x5638(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x56B8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x56E8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x5768(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x5798(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x5818(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x5848(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x5870(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_19;                     // 0x58A0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_27;                  // 0x5950(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_17;                 // 0x59F0(0x00C0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x5AB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x5AD8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x5B00(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x5BC8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x5C48(0x0030)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_2;                      // 0x5C78(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x5CF0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x5DB8(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_26;                  // 0x5E38(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_25;                  // 0x5ED8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x5F78(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_18;                     // 0x5FA8(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x6058(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x60D8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x6108(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_24;                  // 0x61B8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x6258(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_23;                  // 0x6280(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0x6320(0x00C0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x63E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x6408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x6430(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x6458(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0x64D8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x6508(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0x6530(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x6560(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0x65E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x6610(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0x6690(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0x66C0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_22;                  // 0x6770(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x6810(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x6838(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x6990(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x69B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x69E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0x6A08(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x6A30(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0x6AB0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x6AE0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0x6B60(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x6B90(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0x6C10(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x6C40(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0x6C68(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0x6C98(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_21;                  // 0x6D48(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_20;                  // 0x6DE8(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x6E88(0x00C0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0x6F48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0x6F70(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x6F98(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0x7018(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x7048(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0x7070(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0x70A0(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x7150(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_19;                  // 0x7210(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_18;                  // 0x72B0(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x7350(0x00C0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0x7410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x7438(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x7460(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0x7488(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x74B8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0x7538(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0x7568(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_17;                  // 0x7618(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x76B8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0x7738(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0x7768(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0x7818(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_14;                 // 0x78B8(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_13;                 // 0x79A0(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0x7A88(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0x7AB8(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x7B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x7B90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x7BB8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0x7BE0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x7C10(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0x7C90(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0x7CC0(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x7D70(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0x7E30(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0x7ED0(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x7F70(0x00C0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x8030(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x8058(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x8080(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x80A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x80D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x80F8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x8120(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0x81A0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x81D0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0x8250(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x8280(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0x8300(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x8330(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0x8358(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x8388(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x8438(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0x84B8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x84E8(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0x8598(0x00A0)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_1;                      // 0x8638(0x0078)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x86B0(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0x8728(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0x87C8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x87F8(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x88A8(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x8948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x8970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x8998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x89C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x89E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x8A10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0x8A38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0x8A60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0x8A88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0x8AB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0x8AD8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x8B00(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0x8B80(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x8BB0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0x8C30(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x8C60(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0x8CE0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x8D10(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0x8D90(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x8DC0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0x8E40(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x8E70(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x8EF0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x8F20(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x8FA0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x8FD0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x8FF8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x9028(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x90D8(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x9198(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x9238(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x92F8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x9398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0x93C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0x93E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0x9410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0x9438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0x9460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0x9488(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x94B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x9530(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x9560(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x95E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x9610(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x9690(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x96C0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x96E8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x9718(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x97C8(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x9868(0x00C0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x9928(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x99C8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x99F8(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x9AA8(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x9B48(0x00C0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x9C08(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x9CC8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x9D10(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x9DB0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x9E50(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x9EF0(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x9FB0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0xA108(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0xA130(0x00A0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0xA1D0(0x0650)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xA820(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0xA840(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0xA998(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0xA9C0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0xAB18(0x0158)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0xAC70(0x00C0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0xAD30(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0xADF0(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0xAE18(0x0190)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0xAFA8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0xAFD0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0xB128(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0xB280(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0xB2A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0xB2D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0xB2F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0xB320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0xB348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0xB370(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0xB398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0xB3C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0xB3E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0xB410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0xB438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0xB460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0xB488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0xB4B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0xB4D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0xB500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0xB528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0xB550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0xB578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0xB5A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0xB5C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0xB5F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0xB618(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0xB698(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0xB6C8(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0xB748(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0xB810(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0xB890(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0xB950(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0xB9D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0xBA00(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0xBA80(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0xBB00(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0xBBC8(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0xBC48(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0xBD08(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0xBD38(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_12;                 // 0xBE00(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0xBEE8(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0xBFB0(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0xC000(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0xC080(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0xC148(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0xC1C8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_11;                 // 0xC1F8(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0xC2E0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0xC3A8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0xC428(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0xC458(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0xC480(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0xC4A8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0xC4D0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0xC550(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0xC580(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0xC600(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0xC6A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0xC6E8(0x0080)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0xC768(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0xC818(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0xC898(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0xC960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0xC988(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0xC9B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0xC9D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0xCA00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0xCA28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0xCA50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0xCA78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0xCAA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0xCAC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0xCAF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0xCB18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0xCB40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0xCB68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0xCB90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0xCBB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0xCBE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0xCC08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0xCC30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0xCC58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0xCC80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0xCCA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0xCCD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0xCCF8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0xCD20(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0xCDA0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0xCDD0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0xCE50(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0xCE80(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0xCF00(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0xCF30(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0xD018(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0xD048(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0xD0C8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0xD0F8(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0xD1E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0xD210(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0xD238(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0xD2B8(0x0030)()
