#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCTGameMode_MatchBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SCTGameMode_MatchBP.SCTGameMode_MatchBP_C
// 0x0040 (0x04B0 - 0x0470)
class ASCTGameMode_MatchBP_C final : public ASCTGameMode_Match
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CheatDisableEndMatch;                              // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EndMatchDispatch;                                  // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAgendaGenericEvent*                    EndGameEvent;                                      // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoloScoreRowName;                                  // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoloScoreRowName_0;                                // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EndMatchDispatch__DelegateSignature(EEndConditions End_Condition);
	void ExecuteUbergraph_SCTGameMode_MatchBP(int32 EntryPoint);
	void Max_Oxygen();
	void Keep_Oxygen_Maxed();
	void K2_OnSetMatchState(class FName NewState);
	void K2_OnCharacterDestiny(class AHumanoidCharacter* HumanoidCharacter, class AController* Controller, const struct FDestiny& Destiny, bool IsPersonoid);
	void GiveScore(class FName ScoreName, class ASCTPlayerState* PlayerState);
	void K2_OnLogout(class AController* ExitingController);
	void ReceiveBeginPlay();
	void Do_End_Match_with_Condition(EEndConditions End_Condition);
	bool GetOnlyPersonoidsAlive();
	bool GetOnlyOneResidentAlive();
	void ScoreOnlyPersonoidsRemain();
	void ScoreCAINShutDown(bool PersonoidPresent);
	void GiveEndScores(EEndConditions Selection);
	void ScoreAllVotesYes(bool PersonoidPresent);
	void ScoreOneResidentRemains();
	void UnpossessAll();
	void InactivateAll();
	void CallEndGameEvent();
	void GiveAgendaScores();
	void GiveThumbsVoteScore();
	void AddScoreBasedOnDownVotes();
	void AddScoreBasedOnUpVotes();
	void SpawnRoomba(class AController* Controller);
	void GetAliveTemp(TArray<class ACharacter*>* AlivePlayers);
	void UpdateWinStatistics(EEndConditions EndCondition);
	void GiveRaceScores();
	void AddTroestepraemie(bool GrantToPersonoids);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SCTGameMode_MatchBP_C">();
	}
	static class ASCTGameMode_MatchBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASCTGameMode_MatchBP_C>();
	}
};
static_assert(alignof(ASCTGameMode_MatchBP_C) == 0x000008, "Wrong alignment on ASCTGameMode_MatchBP_C");
static_assert(sizeof(ASCTGameMode_MatchBP_C) == 0x0004B0, "Wrong size on ASCTGameMode_MatchBP_C");
static_assert(offsetof(ASCTGameMode_MatchBP_C, UberGraphFrame) == 0x000470, "Member 'ASCTGameMode_MatchBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASCTGameMode_MatchBP_C, DefaultSceneRoot) == 0x000478, "Member 'ASCTGameMode_MatchBP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ASCTGameMode_MatchBP_C, CheatDisableEndMatch) == 0x000480, "Member 'ASCTGameMode_MatchBP_C::CheatDisableEndMatch' has a wrong offset!");
static_assert(offsetof(ASCTGameMode_MatchBP_C, EndMatchDispatch) == 0x000488, "Member 'ASCTGameMode_MatchBP_C::EndMatchDispatch' has a wrong offset!");
static_assert(offsetof(ASCTGameMode_MatchBP_C, EndGameEvent) == 0x000498, "Member 'ASCTGameMode_MatchBP_C::EndGameEvent' has a wrong offset!");
static_assert(offsetof(ASCTGameMode_MatchBP_C, SoloScoreRowName) == 0x0004A0, "Member 'ASCTGameMode_MatchBP_C::SoloScoreRowName' has a wrong offset!");
static_assert(offsetof(ASCTGameMode_MatchBP_C, SoloScoreRowName_0) == 0x0004A8, "Member 'ASCTGameMode_MatchBP_C::SoloScoreRowName_0' has a wrong offset!");

}

