#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCTGameState_MatchBP

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "E_LevelVersion_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.OnLevelVersionChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SCTGameState_MatchBP_C_OnLevelVersionChanged__DelegateSignature final
{
public:
	E_LevelVersion                                NewLevelVersion;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTGameState_MatchBP_C_OnLevelVersionChanged__DelegateSignature) == 0x000001, "Wrong alignment on SCTGameState_MatchBP_C_OnLevelVersionChanged__DelegateSignature");
static_assert(sizeof(SCTGameState_MatchBP_C_OnLevelVersionChanged__DelegateSignature) == 0x000001, "Wrong size on SCTGameState_MatchBP_C_OnLevelVersionChanged__DelegateSignature");
static_assert(offsetof(SCTGameState_MatchBP_C_OnLevelVersionChanged__DelegateSignature, NewLevelVersion) == 0x000000, "Member 'SCTGameState_MatchBP_C_OnLevelVersionChanged__DelegateSignature::NewLevelVersion' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.ExecuteUbergraph_SCTGameState_MatchBP
// 0x00B8 (0x00B8 - 0x0000)
struct SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchEndData                          K2Node_Event_endData;                              // 0x0008(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASCTPlayerState_MatchBP_C*>      CallFunc_GetPlayerStatesSCT_SCT_Match_PlayerStates; // 0x0030(0x0010)(ReferenceParm)
	class Ubp_wi_EndScreen2_C*                    CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerController_MatchBP_C*         K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTGameMode_Match*                     K2Node_DynamicCast_AsSCTGame_Mode_Match;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumPlayers_ReturnValue;                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP) == 0x000008, "Wrong alignment on SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP");
static_assert(sizeof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP) == 0x0000B8, "Wrong size on SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, EntryPoint) == 0x000000, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, K2Node_Event_endData) == 0x000008, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::K2Node_Event_endData' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, Temp_int_Variable) == 0x000020, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_GetPlayerStatesSCT_SCT_Match_PlayerStates) == 0x000030, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_GetPlayerStatesSCT_SCT_Match_PlayerStates' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_Create_ReturnValue) == 0x000040, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000048, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_HasAuthority_ReturnValue_1) == 0x000050, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, K2Node_DynamicCast_AsCharacter) == 0x000058, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_GetPlayerController_ReturnValue_1) == 0x000068, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_GetGameMode_ReturnValue) == 0x000070, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP) == 0x000078, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, K2Node_DynamicCast_AsSCTGame_Mode_Match) == 0x000088, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::K2Node_DynamicCast_AsSCTGame_Mode_Match' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_GetNumPlayers_ReturnValue) == 0x000094, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_GetNumPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00009C, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x00009D, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B0, "Member 'SCTGameState_MatchBP_C_ExecuteUbergraph_SCTGameState_MatchBP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.MatchEnded
// 0x0018 (0x0018 - 0x0000)
struct SCTGameState_MatchBP_C_MatchEnded final
{
public:
	struct FMatchEndData                          EndData;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SCTGameState_MatchBP_C_MatchEnded) == 0x000008, "Wrong alignment on SCTGameState_MatchBP_C_MatchEnded");
static_assert(sizeof(SCTGameState_MatchBP_C_MatchEnded) == 0x000018, "Wrong size on SCTGameState_MatchBP_C_MatchEnded");
static_assert(offsetof(SCTGameState_MatchBP_C_MatchEnded, EndData) == 0x000000, "Member 'SCTGameState_MatchBP_C_MatchEnded::EndData' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.CreateIntroWidget
// 0x0060 (0x0060 - 0x0000)
struct SCTGameState_MatchBP_C_CreateIntroWidget final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCharacterWI_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCharacterWI_C*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldDisableIntroSequence_ReturnValue;   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFirstLevel_ReturnValue;                 // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SCTGameState_MatchBP_C_CreateIntroWidget) == 0x000008, "Wrong alignment on SCTGameState_MatchBP_C_CreateIntroWidget");
static_assert(sizeof(SCTGameState_MatchBP_C_CreateIntroWidget) == 0x000060, "Wrong size on SCTGameState_MatchBP_C_CreateIntroWidget");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, Temp_bool_IsClosed_Variable) == 0x00000C, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, CallFunc_Array_Get_Item) == 0x000020, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000030, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000038, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, Temp_bool_Has_Been_Initd_Variable) == 0x000041, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, CallFunc_ShouldDisableIntroSequence_ReturnValue) == 0x000042, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::CallFunc_ShouldDisableIntroSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, CallFunc_IsFirstLevel_ReturnValue) == 0x000043, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::CallFunc_IsFirstLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000048, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000050, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateIntroWidget, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'SCTGameState_MatchBP_C_CreateIntroWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.InitializeClientOnly
// 0x0018 (0x0018 - 0x0000)
struct SCTGameState_MatchBP_C_InitializeClientOnly final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTGameState_MatchBP_C_InitializeClientOnly) == 0x000008, "Wrong alignment on SCTGameState_MatchBP_C_InitializeClientOnly");
static_assert(sizeof(SCTGameState_MatchBP_C_InitializeClientOnly) == 0x000018, "Wrong size on SCTGameState_MatchBP_C_InitializeClientOnly");
static_assert(offsetof(SCTGameState_MatchBP_C_InitializeClientOnly, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'SCTGameState_MatchBP_C_InitializeClientOnly::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_InitializeClientOnly, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'SCTGameState_MatchBP_C_InitializeClientOnly::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.InitializeServerOnly
// 0x0030 (0x0030 - 0x0000)
struct SCTGameState_MatchBP_C_InitializeServerOnly final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEmergencyMeetingLevelLoad_C*>   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmergencyMeetingLevelLoad_C*           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SCTGameState_MatchBP_C_InitializeServerOnly) == 0x000008, "Wrong alignment on SCTGameState_MatchBP_C_InitializeServerOnly");
static_assert(sizeof(SCTGameState_MatchBP_C_InitializeServerOnly) == 0x000030, "Wrong size on SCTGameState_MatchBP_C_InitializeServerOnly");
static_assert(offsetof(SCTGameState_MatchBP_C_InitializeServerOnly, Temp_int_Variable) == 0x000000, "Member 'SCTGameState_MatchBP_C_InitializeServerOnly::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_InitializeServerOnly, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'SCTGameState_MatchBP_C_InitializeServerOnly::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_InitializeServerOnly, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'SCTGameState_MatchBP_C_InitializeServerOnly::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_InitializeServerOnly, CallFunc_Array_Get_Item) == 0x000020, "Member 'SCTGameState_MatchBP_C_InitializeServerOnly::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_InitializeServerOnly, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'SCTGameState_MatchBP_C_InitializeServerOnly::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_InitializeServerOnly, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00002C, "Member 'SCTGameState_MatchBP_C_InitializeServerOnly::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_InitializeServerOnly, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'SCTGameState_MatchBP_C_InitializeServerOnly::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.Set Level Version
// 0x0001 (0x0001 - 0x0000)
struct SCTGameState_MatchBP_C_Set_Level_Version final
{
public:
	E_LevelVersion                                LevelVersion_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTGameState_MatchBP_C_Set_Level_Version) == 0x000001, "Wrong alignment on SCTGameState_MatchBP_C_Set_Level_Version");
static_assert(sizeof(SCTGameState_MatchBP_C_Set_Level_Version) == 0x000001, "Wrong size on SCTGameState_MatchBP_C_Set_Level_Version");
static_assert(offsetof(SCTGameState_MatchBP_C_Set_Level_Version, LevelVersion_0) == 0x000000, "Member 'SCTGameState_MatchBP_C_Set_Level_Version::LevelVersion_0' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.BindToLevelVoting
// 0x0030 (0x0030 - 0x0000)
struct SCTGameState_MatchBP_C_BindToLevelVoting final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FSelectedLevelData& SelectedLevel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float ServerTimeoutTime)>      K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(SCTGameState_MatchBP_C_BindToLevelVoting) == 0x000004, "Wrong alignment on SCTGameState_MatchBP_C_BindToLevelVoting");
static_assert(sizeof(SCTGameState_MatchBP_C_BindToLevelVoting) == 0x000030, "Wrong size on SCTGameState_MatchBP_C_BindToLevelVoting");
static_assert(offsetof(SCTGameState_MatchBP_C_BindToLevelVoting, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'SCTGameState_MatchBP_C_BindToLevelVoting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_BindToLevelVoting, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'SCTGameState_MatchBP_C_BindToLevelVoting::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_BindToLevelVoting, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'SCTGameState_MatchBP_C_BindToLevelVoting::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.CreateLevelVoteWidget
// 0x0038 (0x0038 - 0x0000)
struct SCTGameState_MatchBP_C_CreateLevelVoteWidget final
{
public:
	float                                         ServerTimeoutTime;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UModal*                                 CallFunc_GetModal_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelVotingWI_C*                       K2Node_DynamicCast_AsLevel_Voting_WI;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SCTGameState_MatchBP_C_CreateLevelVoteWidget) == 0x000008, "Wrong alignment on SCTGameState_MatchBP_C_CreateLevelVoteWidget");
static_assert(sizeof(SCTGameState_MatchBP_C_CreateLevelVoteWidget) == 0x000038, "Wrong size on SCTGameState_MatchBP_C_CreateLevelVoteWidget");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateLevelVoteWidget, ServerTimeoutTime) == 0x000000, "Member 'SCTGameState_MatchBP_C_CreateLevelVoteWidget::ServerTimeoutTime' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateLevelVoteWidget, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'SCTGameState_MatchBP_C_CreateLevelVoteWidget::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateLevelVoteWidget, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000008, "Member 'SCTGameState_MatchBP_C_CreateLevelVoteWidget::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateLevelVoteWidget, CallFunc_GetModal_ReturnValue) == 0x000010, "Member 'SCTGameState_MatchBP_C_CreateLevelVoteWidget::CallFunc_GetModal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateLevelVoteWidget, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller_1) == 0x000018, "Member 'SCTGameState_MatchBP_C_CreateLevelVoteWidget::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateLevelVoteWidget, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'SCTGameState_MatchBP_C_CreateLevelVoteWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateLevelVoteWidget, K2Node_DynamicCast_AsLevel_Voting_WI) == 0x000028, "Member 'SCTGameState_MatchBP_C_CreateLevelVoteWidget::K2Node_DynamicCast_AsLevel_Voting_WI' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_CreateLevelVoteWidget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SCTGameState_MatchBP_C_CreateLevelVoteWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.OnFinalLevelSelected
// 0x0078 (0x0078 - 0x0000)
struct SCTGameState_MatchBP_C_OnFinalLevelSelected final
{
public:
	struct FSelectedLevelData                     SelectedLevel;                                     // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UModal*                                 CallFunc_GetModal_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelVotingWI_C*                       K2Node_DynamicCast_AsLevel_Voting_WI;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SCTGameState_MatchBP_C_OnFinalLevelSelected) == 0x000008, "Wrong alignment on SCTGameState_MatchBP_C_OnFinalLevelSelected");
static_assert(sizeof(SCTGameState_MatchBP_C_OnFinalLevelSelected) == 0x000078, "Wrong size on SCTGameState_MatchBP_C_OnFinalLevelSelected");
static_assert(offsetof(SCTGameState_MatchBP_C_OnFinalLevelSelected, SelectedLevel) == 0x000000, "Member 'SCTGameState_MatchBP_C_OnFinalLevelSelected::SelectedLevel' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_OnFinalLevelSelected, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000058, "Member 'SCTGameState_MatchBP_C_OnFinalLevelSelected::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_OnFinalLevelSelected, CallFunc_GetModal_ReturnValue) == 0x000060, "Member 'SCTGameState_MatchBP_C_OnFinalLevelSelected::CallFunc_GetModal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_OnFinalLevelSelected, K2Node_DynamicCast_AsLevel_Voting_WI) == 0x000068, "Member 'SCTGameState_MatchBP_C_OnFinalLevelSelected::K2Node_DynamicCast_AsLevel_Voting_WI' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_OnFinalLevelSelected, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'SCTGameState_MatchBP_C_OnFinalLevelSelected::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.LevelOptionsChanged
// 0x0028 (0x0028 - 0x0000)
struct SCTGameState_MatchBP_C_LevelOptionsChanged final
{
public:
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UModal*                                 CallFunc_GetModal_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelVotingWI_C*                       K2Node_DynamicCast_AsLevel_Voting_WI;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SCTGameState_MatchBP_C_LevelOptionsChanged) == 0x000008, "Wrong alignment on SCTGameState_MatchBP_C_LevelOptionsChanged");
static_assert(sizeof(SCTGameState_MatchBP_C_LevelOptionsChanged) == 0x000028, "Wrong size on SCTGameState_MatchBP_C_LevelOptionsChanged");
static_assert(offsetof(SCTGameState_MatchBP_C_LevelOptionsChanged, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000000, "Member 'SCTGameState_MatchBP_C_LevelOptionsChanged::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_LevelOptionsChanged, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'SCTGameState_MatchBP_C_LevelOptionsChanged::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_LevelOptionsChanged, CallFunc_GetModal_ReturnValue) == 0x000010, "Member 'SCTGameState_MatchBP_C_LevelOptionsChanged::CallFunc_GetModal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_LevelOptionsChanged, K2Node_DynamicCast_AsLevel_Voting_WI) == 0x000018, "Member 'SCTGameState_MatchBP_C_LevelOptionsChanged::K2Node_DynamicCast_AsLevel_Voting_WI' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_LevelOptionsChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SCTGameState_MatchBP_C_LevelOptionsChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_LevelOptionsChanged, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'SCTGameState_MatchBP_C_LevelOptionsChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SCTGameState_MatchBP.SCTGameState_MatchBP_C.ResidentsWin
// 0x0003 (0x0003 - 0x0000)
struct SCTGameState_MatchBP_C_ResidentsWin final
{
public:
	EEndConditions                                NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SCTGameState_MatchBP_C_ResidentsWin) == 0x000001, "Wrong alignment on SCTGameState_MatchBP_C_ResidentsWin");
static_assert(sizeof(SCTGameState_MatchBP_C_ResidentsWin) == 0x000003, "Wrong size on SCTGameState_MatchBP_C_ResidentsWin");
static_assert(offsetof(SCTGameState_MatchBP_C_ResidentsWin, NewParam) == 0x000000, "Member 'SCTGameState_MatchBP_C_ResidentsWin::NewParam' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ResidentsWin, Return) == 0x000001, "Member 'SCTGameState_MatchBP_C_ResidentsWin::Return' has a wrong offset!");
static_assert(offsetof(SCTGameState_MatchBP_C_ResidentsWin, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'SCTGameState_MatchBP_C_ResidentsWin::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

