#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerRoomManagerSCT

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function ServerRoomManagerSCT.ServerRoomManagerSCT_C.ExecuteUbergraph_ServerRoomManagerSCT
// 0x0200 (0x0200 - 0x0000)
struct ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x004C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_Character_3;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Character_2;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOverlappingCharacters_Amount;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACAIN_EndButton_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x00F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAIN_EndButton_C*                      CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_Character_1;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTGameMode_MatchBP_C*                 CallFunc_GetGameModeMatchSCT_AsSCTGame_Mode_Match_BP; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumAlivePlayers_ReturnValue;           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumAlivePlayers_ReturnValue_1;         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmountOfInteractingActorsOnEndButton_ReturnValue; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmountOfInteractingActorsOnEndButton_ReturnValue_1; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class ACharacter* Character)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IISolveable_C>         K2Node_DynamicCast_AsISolveable;                   // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_General_C*                      K2Node_DynamicCast_AsButton_General;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACharacter* Character)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACAINServer_C*>                  CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x01D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAINServer_C*                          CallFunc_Array_Get_Item_2;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_6;               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT) == 0x000008, "Wrong alignment on ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT");
static_assert(sizeof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT) == 0x000200, "Wrong size on ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, EntryPoint) == 0x000000, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::EntryPoint' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_bool_IsClosed_Variable_1) == 0x000010, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_bool_Has_Been_Initd_Variable) == 0x000011, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_bool_IsClosed_Variable_2) == 0x000012, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_delegate_Variable) == 0x000014, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_HasAuthority_ReturnValue) == 0x000024, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_struct_Variable) == 0x000028, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_HasAuthority_ReturnValue_1) == 0x000038, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_HasAuthority_ReturnValue_2) == 0x000040, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_int_Variable) == 0x000044, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_delegate_Variable_1) == 0x00004C, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_HasAuthority_ReturnValue_3) == 0x00005C, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_struct_Variable_1) == 0x000060, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_HasAuthority_ReturnValue_4) == 0x000070, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_CustomEvent_Character_3) == 0x000078, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_CustomEvent_Character_3' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_CustomEvent_Character_2) == 0x000080, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_CustomEvent_Character_2' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GetDisplayName_ReturnValue) == 0x000088, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GetDisplayName_ReturnValue_1) == 0x000098, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A8, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B8, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000CC, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x0000E0, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000E9, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GetOverlappingCharacters_Amount) == 0x0000EC, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GetOverlappingCharacters_Amount' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000F0, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Greater_IntInt_ReturnValue) == 0x000100, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_CustomEvent_Character_1) == 0x000118, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_CustomEvent_Character) == 0x000120, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_bool_Has_Been_Initd_Variable_2) == 0x000128, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GetGameModeMatchSCT_AsSCTGame_Mode_Match_BP) == 0x000130, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GetGameModeMatchSCT_AsSCTGame_Mode_Match_BP' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Subtract_IntInt_ReturnValue) == 0x000138, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Add_IntInt_ReturnValue_2) == 0x00013C, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000140, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000141, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_int_Loop_Counter_Variable) == 0x000144, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Less_IntInt_ReturnValue) == 0x000148, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Add_IntInt_ReturnValue_3) == 0x00014C, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GetNumAlivePlayers_ReturnValue) == 0x000150, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GetNumAlivePlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000154, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GetNumAlivePlayers_ReturnValue_1) == 0x000158, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GetNumAlivePlayers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GetAmountOfInteractingActorsOnEndButton_ReturnValue) == 0x00015C, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GetAmountOfInteractingActorsOnEndButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GetAmountOfInteractingActorsOnEndButton_ReturnValue_1) == 0x000160, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GetAmountOfInteractingActorsOnEndButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000164, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000165, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_bool_Has_Been_Initd_Variable_3) == 0x000166, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, Temp_bool_IsClosed_Variable_3) == 0x000167, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_CreateDelegate_OutputDelegate) == 0x000168, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_DynamicCast_AsISolveable) == 0x000178, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_DynamicCast_AsISolveable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_DynamicCast_bSuccess_1) == 0x000188, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_DynamicCast_AsButton_General) == 0x000190, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_DynamicCast_AsButton_General' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_DynamicCast_bSuccess_2) == 0x000198, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_DynamicCast_AsICharacter_SCT) == 0x0001A0, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_DynamicCast_bSuccess_3) == 0x0001B0, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_PostAkEvent_ReturnValue) == 0x0001B4, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001B8, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001C8, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_HasAuthority_ReturnValue_5) == 0x0001CC, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x0001D0, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0001E0, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001E4, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001E8, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_Array_Get_Item_2) == 0x0001F0, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_HasAuthority_ReturnValue_6) == 0x0001F8, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_HasAuthority_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x0001F9, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT, CallFunc_BooleanAND_ReturnValue) == 0x0001FA, "Member 'ServerRoomManagerSCT_C_ExecuteUbergraph_ServerRoomManagerSCT::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ServerRoomManagerSCT.ServerRoomManagerSCT_C.Proxy_NotHeld
// 0x0008 (0x0008 - 0x0000)
struct ServerRoomManagerSCT_C_Proxy_NotHeld final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerRoomManagerSCT_C_Proxy_NotHeld) == 0x000008, "Wrong alignment on ServerRoomManagerSCT_C_Proxy_NotHeld");
static_assert(sizeof(ServerRoomManagerSCT_C_Proxy_NotHeld) == 0x000008, "Wrong size on ServerRoomManagerSCT_C_Proxy_NotHeld");
static_assert(offsetof(ServerRoomManagerSCT_C_Proxy_NotHeld, Character) == 0x000000, "Member 'ServerRoomManagerSCT_C_Proxy_NotHeld::Character' has a wrong offset!");

// Function ServerRoomManagerSCT.ServerRoomManagerSCT_C.Proxy_OnHeld
// 0x0008 (0x0008 - 0x0000)
struct ServerRoomManagerSCT_C_Proxy_OnHeld final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerRoomManagerSCT_C_Proxy_OnHeld) == 0x000008, "Wrong alignment on ServerRoomManagerSCT_C_Proxy_OnHeld");
static_assert(sizeof(ServerRoomManagerSCT_C_Proxy_OnHeld) == 0x000008, "Wrong size on ServerRoomManagerSCT_C_Proxy_OnHeld");
static_assert(offsetof(ServerRoomManagerSCT_C_Proxy_OnHeld, Character) == 0x000000, "Member 'ServerRoomManagerSCT_C_Proxy_OnHeld::Character' has a wrong offset!");

// Function ServerRoomManagerSCT.ServerRoomManagerSCT_C.A Shut Down Button Was Released
// 0x0008 (0x0008 - 0x0000)
struct ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Released final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Released) == 0x000008, "Wrong alignment on ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Released");
static_assert(sizeof(ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Released) == 0x000008, "Wrong size on ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Released");
static_assert(offsetof(ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Released, Character) == 0x000000, "Member 'ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Released::Character' has a wrong offset!");

// Function ServerRoomManagerSCT.ServerRoomManagerSCT_C.A Shut Down Button Was Held
// 0x0008 (0x0008 - 0x0000)
struct ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Held final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Held) == 0x000008, "Wrong alignment on ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Held");
static_assert(sizeof(ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Held) == 0x000008, "Wrong size on ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Held");
static_assert(offsetof(ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Held, Character) == 0x000000, "Member 'ServerRoomManagerSCT_C_A_Shut_Down_Button_Was_Held::Character' has a wrong offset!");

// Function ServerRoomManagerSCT.ServerRoomManagerSCT_C.UpdateStatusLights
// 0x0038 (0x0038 - 0x0000)
struct ServerRoomManagerSCT_C_UpdateStatusLights final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AServerroomStatusLights_SCT_C*>  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AServerroomStatusLights_SCT_C*          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerRoomManagerSCT_C_UpdateStatusLights) == 0x000008, "Wrong alignment on ServerRoomManagerSCT_C_UpdateStatusLights");
static_assert(sizeof(ServerRoomManagerSCT_C_UpdateStatusLights) == 0x000038, "Wrong size on ServerRoomManagerSCT_C_UpdateStatusLights");
static_assert(offsetof(ServerRoomManagerSCT_C_UpdateStatusLights, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ServerRoomManagerSCT_C_UpdateStatusLights::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_UpdateStatusLights, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ServerRoomManagerSCT_C_UpdateStatusLights::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_UpdateStatusLights, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ServerRoomManagerSCT_C_UpdateStatusLights::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_UpdateStatusLights, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'ServerRoomManagerSCT_C_UpdateStatusLights::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_UpdateStatusLights, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ServerRoomManagerSCT_C_UpdateStatusLights::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_UpdateStatusLights, CallFunc_Array_Get_Item) == 0x000028, "Member 'ServerRoomManagerSCT_C_UpdateStatusLights::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_UpdateStatusLights, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'ServerRoomManagerSCT_C_UpdateStatusLights::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ServerRoomManagerSCT.ServerRoomManagerSCT_C.PermaFixRepairedServers
// 0x0038 (0x0038 - 0x0000)
struct ServerRoomManagerSCT_C_PermaFixRepairedServers final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACAINServer_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAINServer_C*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerRoomManagerSCT_C_PermaFixRepairedServers) == 0x000008, "Wrong alignment on ServerRoomManagerSCT_C_PermaFixRepairedServers");
static_assert(sizeof(ServerRoomManagerSCT_C_PermaFixRepairedServers) == 0x000038, "Wrong size on ServerRoomManagerSCT_C_PermaFixRepairedServers");
static_assert(offsetof(ServerRoomManagerSCT_C_PermaFixRepairedServers, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ServerRoomManagerSCT_C_PermaFixRepairedServers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_PermaFixRepairedServers, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ServerRoomManagerSCT_C_PermaFixRepairedServers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_PermaFixRepairedServers, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ServerRoomManagerSCT_C_PermaFixRepairedServers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_PermaFixRepairedServers, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'ServerRoomManagerSCT_C_PermaFixRepairedServers::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_PermaFixRepairedServers, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ServerRoomManagerSCT_C_PermaFixRepairedServers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_PermaFixRepairedServers, CallFunc_Array_Get_Item) == 0x000028, "Member 'ServerRoomManagerSCT_C_PermaFixRepairedServers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_PermaFixRepairedServers, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'ServerRoomManagerSCT_C_PermaFixRepairedServers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ServerRoomManagerSCT.ServerRoomManagerSCT_C.Update Server Status Widget
// 0x00A0 (0x00A0 - 0x0000)
struct ServerRoomManagerSCT_C_Update_Server_Status_Widget final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWi_Showdown_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	class UWi_Showdown_C*                         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0060(0x0018)()
	TArray<class UKeycardObjectiveWI_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeycardObjectiveWI_C*                  CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerRoomManagerSCT_C_Update_Server_Status_Widget) == 0x000008, "Wrong alignment on ServerRoomManagerSCT_C_Update_Server_Status_Widget");
static_assert(sizeof(ServerRoomManagerSCT_C_Update_Server_Status_Widget) == 0x0000A0, "Wrong size on ServerRoomManagerSCT_C_Update_Server_Status_Widget");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Array_Get_Item) == 0x000048, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Conv_IntToString_ReturnValue) == 0x000050, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000060, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000078, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_Update_Server_Status_Widget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000098, "Member 'ServerRoomManagerSCT_C_Update_Server_Status_Widget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function ServerRoomManagerSCT.ServerRoomManagerSCT_C.GetIsAnyPersonoidAlive
// 0x000C (0x000C - 0x0000)
struct ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumAlivePersonoids_ReturnValue;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive) == 0x000004, "Wrong alignment on ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive");
static_assert(sizeof(ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive) == 0x00000C, "Wrong size on ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive");
static_assert(offsetof(ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive, ReturnValue) == 0x000000, "Member 'ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive::ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive, CallFunc_GetNumAlivePersonoids_ReturnValue) == 0x000004, "Member 'ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive::CallFunc_GetNumAlivePersonoids_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'ServerRoomManagerSCT_C_GetIsAnyPersonoidAlive::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function ServerRoomManagerSCT.ServerRoomManagerSCT_C.GetAmountOfInteractingActorsOnEndButton
// 0x0008 (0x0008 - 0x0000)
struct ServerRoomManagerSCT_C_GetAmountOfInteractingActorsOnEndButton final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerRoomManagerSCT_C_GetAmountOfInteractingActorsOnEndButton) == 0x000004, "Wrong alignment on ServerRoomManagerSCT_C_GetAmountOfInteractingActorsOnEndButton");
static_assert(sizeof(ServerRoomManagerSCT_C_GetAmountOfInteractingActorsOnEndButton) == 0x000008, "Wrong size on ServerRoomManagerSCT_C_GetAmountOfInteractingActorsOnEndButton");
static_assert(offsetof(ServerRoomManagerSCT_C_GetAmountOfInteractingActorsOnEndButton, ReturnValue) == 0x000000, "Member 'ServerRoomManagerSCT_C_GetAmountOfInteractingActorsOnEndButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerRoomManagerSCT_C_GetAmountOfInteractingActorsOnEndButton, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'ServerRoomManagerSCT_C_GetAmountOfInteractingActorsOnEndButton::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

}

