#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerRoomManagerSCT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ServerRoomManagerSCT.ServerRoomManagerSCT_C
// 0x0078 (0x0298 - 0x0220)
class AServerRoomManagerSCT_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UAkComponent*                           Ak;                                                // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class APawn*>                          HoldingCharacters;                                 // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ACAIN_Collider_C*                       CAIN_Collider;                                     // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PersonoidIsAmongst;                                // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InitialActiveServers;                              // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Activatable2Amount;                                // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Activatable1Amount;                                // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Activatable1;                                      // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Elevator;                                          // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ServersReparied;                                   // 0x0270(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAIN_EndButton_C*                      CAINEndButton;                                     // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACAINServer_C*>                  ServerRoomServers;                                 // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         SecondaryObjRepaired;                              // 0x0290(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ServerRoomManagerSCT(int32 EntryPoint);
	void Secondary_Objective_Reparied();
	void Set_Amount_Of_Active_Servers();
	void Cosmetic_Milestone_1_reached();
	void Cosmetic_Progressing();
	void Server_Sabotaged();
	void Server_Repaired();
	void Proxy_NotHeld(class ACharacter* Character);
	void Proxy_OnHeld(class ACharacter* Character);
	void A_Shut_Down_Button_Was_Released(class ACharacter* Character);
	void A_Shut_Down_Button_Was_Held(class ACharacter* Character);
	void ReceiveBeginPlay();
	void UpdateStatusLights();
	void PermaFixRepairedServers();
	void Update_Server_Status_Widget();
	bool GetIsAnyPersonoidAlive();
	int32 GetAmountOfInteractingActorsOnEndButton();
	void OnRep_Complete();
	void OnRep_ServersReparied();
	void OnRep_SecondaryObjRepaired();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ServerRoomManagerSCT_C">();
	}
	static class AServerRoomManagerSCT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AServerRoomManagerSCT_C>();
	}
};
static_assert(alignof(AServerRoomManagerSCT_C) == 0x000008, "Wrong alignment on AServerRoomManagerSCT_C");
static_assert(sizeof(AServerRoomManagerSCT_C) == 0x000298, "Wrong size on AServerRoomManagerSCT_C");
static_assert(offsetof(AServerRoomManagerSCT_C, UberGraphFrame) == 0x000220, "Member 'AServerRoomManagerSCT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, Ak) == 0x000228, "Member 'AServerRoomManagerSCT_C::Ak' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, DefaultSceneRoot) == 0x000230, "Member 'AServerRoomManagerSCT_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, HoldingCharacters) == 0x000238, "Member 'AServerRoomManagerSCT_C::HoldingCharacters' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, CAIN_Collider) == 0x000248, "Member 'AServerRoomManagerSCT_C::CAIN_Collider' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, Debug) == 0x000250, "Member 'AServerRoomManagerSCT_C::Debug' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, PersonoidIsAmongst) == 0x000251, "Member 'AServerRoomManagerSCT_C::PersonoidIsAmongst' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, InitialActiveServers) == 0x000254, "Member 'AServerRoomManagerSCT_C::InitialActiveServers' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, Activatable2Amount) == 0x000258, "Member 'AServerRoomManagerSCT_C::Activatable2Amount' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, Activatable1Amount) == 0x00025C, "Member 'AServerRoomManagerSCT_C::Activatable1Amount' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, Activatable1) == 0x000260, "Member 'AServerRoomManagerSCT_C::Activatable1' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, Elevator) == 0x000268, "Member 'AServerRoomManagerSCT_C::Elevator' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, ServersReparied) == 0x000270, "Member 'AServerRoomManagerSCT_C::ServersReparied' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, CAINEndButton) == 0x000278, "Member 'AServerRoomManagerSCT_C::CAINEndButton' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, ServerRoomServers) == 0x000280, "Member 'AServerRoomManagerSCT_C::ServerRoomServers' has a wrong offset!");
static_assert(offsetof(AServerRoomManagerSCT_C, SecondaryObjRepaired) == 0x000290, "Member 'AServerRoomManagerSCT_C::SecondaryObjRepaired' has a wrong offset!");

}

