#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsKeybindingWI_Axis

#include "Basic.hpp"

#include "SettingsKeybindingWI_classes.hpp"
#include "Engine_structs.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsKeybindingWI_Axis.SettingsKeybindingWI_Axis_C
// 0x0060 (0x0330 - 0x02D0)
class USettingsKeybindingWI_Axis_C final : public USettingsKeybindingWI_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SettingsKeybindingWI_Axis_C;        // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FInputInformationAxis                  Info;                                              // 0x02D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UInputSettingsAxesSubComponent*         Input_Settings;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SettingsKeybindingWI_Axis(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetKeyboardData();
	void OnSetKeyboardKey(const struct FInputChord& Chord);
	void Initialize(const struct FInputInformationAxis& Info_0, class UInputSettingsAxesSubComponent* Setting, class FName SettingsName_0);
	void ResetKeyboard();

	void CanBind(const struct FInputChord& Chord, bool* Value) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsKeybindingWI_Axis_C">();
	}
	static class USettingsKeybindingWI_Axis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsKeybindingWI_Axis_C>();
	}
};
static_assert(alignof(USettingsKeybindingWI_Axis_C) == 0x000008, "Wrong alignment on USettingsKeybindingWI_Axis_C");
static_assert(sizeof(USettingsKeybindingWI_Axis_C) == 0x000330, "Wrong size on USettingsKeybindingWI_Axis_C");
static_assert(offsetof(USettingsKeybindingWI_Axis_C, UberGraphFrame_SettingsKeybindingWI_Axis_C) == 0x0002D0, "Member 'USettingsKeybindingWI_Axis_C::UberGraphFrame_SettingsKeybindingWI_Axis_C' has a wrong offset!");
static_assert(offsetof(USettingsKeybindingWI_Axis_C, Info) == 0x0002D8, "Member 'USettingsKeybindingWI_Axis_C::Info' has a wrong offset!");
static_assert(offsetof(USettingsKeybindingWI_Axis_C, Input_Settings) == 0x000328, "Member 'USettingsKeybindingWI_Axis_C::Input_Settings' has a wrong offset!");

}

