#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsInputViewBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsInputViewBP.SettingsInputViewBP_C
// 0x0058 (0x02B8 - 0x0260)
class USettingsInputViewBP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UVerticalBox*                           VerticalBox_73;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 InputSettings;                                     // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserInputSettingsBP_C*                 Settings;                                          // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UInputSettingsActionSubComponent*       ActionSettings;                                    // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettingsToggleSubComponent*       ToggleSettings;                                    // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettingsAxesSubComponent*         AxisSettings;                                      // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SettingsName;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSettingChanged;                                  // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasInitialized;                                    // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnSettingChanged__DelegateSignature();
	void ExecuteUbergraph_SettingsInputViewBP(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Destruct();
	void OnInitialLoadComplete();
	void Construct();
	void Add_Action_Entry(const struct FInputInformation& ActionEntry);
	void GetSettings(class UUserInputSettingsBP_C** AsUser_Input_Settings_BP);
	void OnStateChanged();
	void Populate_Action_View();
	void ClearView();
	void InitializeUI();
	void CacheActionComponent();
	void Populate_Axis_View();
	void CacheAxisComponent();
	void CacheSubcomponents();
	void Add_Axis_Entry(const struct FInputInformationAxis& AxisEntry, class FName SettingsName_0);
	void Add_Toggle_Entry(const struct FInputInformationToggle& ToggleEntry, class FName SettingsName_0);
	void Populate_Toggle_View();
	void CacheToggleComponent();
	void OnChildChanged();
	void Reset_All();
	void PopulateViews();
	void PopulateFloatSliders();
	void AddSpacer();
	void CreateFloatSliderEntry(class FName SerializationKey, const struct FInputInformationFloatSlider& Info);
	void OnAnyFloatValueChanged(float Value);
	void OnSaveFloatValueWithChange(float Value);

	void IsGamepadActive(bool* Value) const;
	void IsLastControllerTypeGamepad(bool* Value) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsInputViewBP_C">();
	}
	static class USettingsInputViewBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsInputViewBP_C>();
	}
};
static_assert(alignof(USettingsInputViewBP_C) == 0x000008, "Wrong alignment on USettingsInputViewBP_C");
static_assert(sizeof(USettingsInputViewBP_C) == 0x0002B8, "Wrong size on USettingsInputViewBP_C");
static_assert(offsetof(USettingsInputViewBP_C, UberGraphFrame) == 0x000260, "Member 'USettingsInputViewBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsInputViewBP_C, VerticalBox_73) == 0x000268, "Member 'USettingsInputViewBP_C::VerticalBox_73' has a wrong offset!");
static_assert(offsetof(USettingsInputViewBP_C, InputSettings) == 0x000270, "Member 'USettingsInputViewBP_C::InputSettings' has a wrong offset!");
static_assert(offsetof(USettingsInputViewBP_C, Settings) == 0x000278, "Member 'USettingsInputViewBP_C::Settings' has a wrong offset!");
static_assert(offsetof(USettingsInputViewBP_C, ActionSettings) == 0x000280, "Member 'USettingsInputViewBP_C::ActionSettings' has a wrong offset!");
static_assert(offsetof(USettingsInputViewBP_C, ToggleSettings) == 0x000288, "Member 'USettingsInputViewBP_C::ToggleSettings' has a wrong offset!");
static_assert(offsetof(USettingsInputViewBP_C, AxisSettings) == 0x000290, "Member 'USettingsInputViewBP_C::AxisSettings' has a wrong offset!");
static_assert(offsetof(USettingsInputViewBP_C, SettingsName) == 0x000298, "Member 'USettingsInputViewBP_C::SettingsName' has a wrong offset!");
static_assert(offsetof(USettingsInputViewBP_C, OnSettingChanged) == 0x0002A0, "Member 'USettingsInputViewBP_C::OnSettingChanged' has a wrong offset!");
static_assert(offsetof(USettingsInputViewBP_C, HasInitialized) == 0x0002B0, "Member 'USettingsInputViewBP_C::HasInitialized' has a wrong offset!");

}

