#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsInputViewBP

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function SettingsInputViewBP.SettingsInputViewBP_C.ExecuteUbergraph_SettingsInputViewBP
// 0x00E0 (0x00E0 - 0x0000)
struct SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputInformation>              K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class USaveControllerGIS*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInitialLoadComplete_ReturnValue;       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputInformation                      CallFunc_Array_Get_Item;                           // 0x0030(0x0070)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class UUserInputSettingsBP_C*                 CallFunc_GetSettings_AsUser_Input_Settings_BP;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP");
static_assert(sizeof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP) == 0x0000E0, "Wrong size on SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, EntryPoint) == 0x000000, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, K2Node_MakeArray_Array) == 0x000008, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, CallFunc_GetInitialLoadComplete_ReturnValue) == 0x000024, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::CallFunc_GetInitialLoadComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, Temp_int_Array_Index_Variable) == 0x000028, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, CallFunc_Array_Get_Item) == 0x000030, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, CallFunc_GetSettings_AsUser_Input_Settings_BP) == 0x0000B0, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::CallFunc_GetSettings_AsUser_Input_Settings_BP' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, CallFunc_GetGameInstance_ReturnValue) == 0x0000B8, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, K2Node_DynamicCast_AsSCTGame_Instance) == 0x0000C0, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::K2Node_DynamicCast_AsSCTGame_Instance' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, CallFunc_Add_IntInt_ReturnValue) == 0x0000D4, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP, K2Node_Event_IsDesignTime) == 0x0000D8, "Member 'SettingsInputViewBP_C_ExecuteUbergraph_SettingsInputViewBP::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SettingsInputViewBP_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_PreConstruct) == 0x000001, "Wrong alignment on SettingsInputViewBP_C_PreConstruct");
static_assert(sizeof(SettingsInputViewBP_C_PreConstruct) == 0x000001, "Wrong size on SettingsInputViewBP_C_PreConstruct");
static_assert(offsetof(SettingsInputViewBP_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SettingsInputViewBP_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.Add Action Entry
// 0x0090 (0x0090 - 0x0000)
struct SettingsInputViewBP_C_Add_Action_Entry final
{
public:
	struct FInputInformation                      ActionEntry;                                       // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class USettingsKeybindingWI_Action_C*         CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsInputViewBP_C_Add_Action_Entry) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_Add_Action_Entry");
static_assert(sizeof(SettingsInputViewBP_C_Add_Action_Entry) == 0x000090, "Wrong size on SettingsInputViewBP_C_Add_Action_Entry");
static_assert(offsetof(SettingsInputViewBP_C_Add_Action_Entry, ActionEntry) == 0x000000, "Member 'SettingsInputViewBP_C_Add_Action_Entry::ActionEntry' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Action_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'SettingsInputViewBP_C_Add_Action_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Action_Entry, CallFunc_Create_ReturnValue) == 0x000080, "Member 'SettingsInputViewBP_C_Add_Action_Entry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Action_Entry, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000088, "Member 'SettingsInputViewBP_C_Add_Action_Entry::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.GetSettings
// 0x0028 (0x0028 - 0x0000)
struct SettingsInputViewBP_C_GetSettings final
{
public:
	class UUserInputSettingsBP_C*                 AsUser_Input_Settings_BP;                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UUserSettingsGIS*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USettingsObject*                        CallFunc_GetSetting_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserInputSettingsBP_C*                 K2Node_DynamicCast_AsUser_Input_Settings_BP;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_GetSettings) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_GetSettings");
static_assert(sizeof(SettingsInputViewBP_C_GetSettings) == 0x000028, "Wrong size on SettingsInputViewBP_C_GetSettings");
static_assert(offsetof(SettingsInputViewBP_C_GetSettings, AsUser_Input_Settings_BP) == 0x000000, "Member 'SettingsInputViewBP_C_GetSettings::AsUser_Input_Settings_BP' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_GetSettings, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'SettingsInputViewBP_C_GetSettings::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_GetSettings, CallFunc_GetSetting_ReturnValue) == 0x000010, "Member 'SettingsInputViewBP_C_GetSettings::CallFunc_GetSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_GetSettings, K2Node_DynamicCast_AsUser_Input_Settings_BP) == 0x000018, "Member 'SettingsInputViewBP_C_GetSettings::K2Node_DynamicCast_AsUser_Input_Settings_BP' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_GetSettings, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SettingsInputViewBP_C_GetSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.Populate Action View
// 0x00A0 (0x00A0 - 0x0000)
struct SettingsInputViewBP_C_Populate_Action_View final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputInformation>              CallFunc_GetRebindableActions_ReturnValue;         // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputInformation                      CallFunc_Array_Get_Item;                           // 0x0028(0x0070)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_Populate_Action_View) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_Populate_Action_View");
static_assert(sizeof(SettingsInputViewBP_C_Populate_Action_View) == 0x0000A0, "Wrong size on SettingsInputViewBP_C_Populate_Action_View");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Action_View, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SettingsInputViewBP_C_Populate_Action_View::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Action_View, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SettingsInputViewBP_C_Populate_Action_View::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Action_View, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SettingsInputViewBP_C_Populate_Action_View::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Action_View, CallFunc_GetRebindableActions_ReturnValue) == 0x000010, "Member 'SettingsInputViewBP_C_Populate_Action_View::CallFunc_GetRebindableActions_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Action_View, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SettingsInputViewBP_C_Populate_Action_View::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Action_View, CallFunc_Array_Get_Item) == 0x000028, "Member 'SettingsInputViewBP_C_Populate_Action_View::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Action_View, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'SettingsInputViewBP_C_Populate_Action_View::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.InitializeUI
// 0x0010 (0x0010 - 0x0000)
struct SettingsInputViewBP_C_InitializeUI final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_InitializeUI) == 0x000004, "Wrong alignment on SettingsInputViewBP_C_InitializeUI");
static_assert(sizeof(SettingsInputViewBP_C_InitializeUI) == 0x000010, "Wrong size on SettingsInputViewBP_C_InitializeUI");
static_assert(offsetof(SettingsInputViewBP_C_InitializeUI, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'SettingsInputViewBP_C_InitializeUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.CacheActionComponent
// 0x0018 (0x0018 - 0x0000)
struct SettingsInputViewBP_C_CacheActionComponent final
{
public:
	class UInputSettingsSubComponent*             CallFunc_GetSubComponent_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettingsActionSubComponent*       K2Node_DynamicCast_AsInput_Settings_Action_Sub_Component; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_CacheActionComponent) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_CacheActionComponent");
static_assert(sizeof(SettingsInputViewBP_C_CacheActionComponent) == 0x000018, "Wrong size on SettingsInputViewBP_C_CacheActionComponent");
static_assert(offsetof(SettingsInputViewBP_C_CacheActionComponent, CallFunc_GetSubComponent_ReturnValue) == 0x000000, "Member 'SettingsInputViewBP_C_CacheActionComponent::CallFunc_GetSubComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_CacheActionComponent, K2Node_DynamicCast_AsInput_Settings_Action_Sub_Component) == 0x000008, "Member 'SettingsInputViewBP_C_CacheActionComponent::K2Node_DynamicCast_AsInput_Settings_Action_Sub_Component' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_CacheActionComponent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SettingsInputViewBP_C_CacheActionComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.Populate Axis View
// 0x0080 (0x0080 - 0x0000)
struct SettingsInputViewBP_C_Populate_Axis_View final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetRebindableAxesKeys_ReturnValue;        // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputInformationAxis                  CallFunc_GetInformation_ReturnValue;               // 0x0030(0x0050)()
};
static_assert(alignof(SettingsInputViewBP_C_Populate_Axis_View) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_Populate_Axis_View");
static_assert(sizeof(SettingsInputViewBP_C_Populate_Axis_View) == 0x000080, "Wrong size on SettingsInputViewBP_C_Populate_Axis_View");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Axis_View, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SettingsInputViewBP_C_Populate_Axis_View::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Axis_View, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SettingsInputViewBP_C_Populate_Axis_View::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Axis_View, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SettingsInputViewBP_C_Populate_Axis_View::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Axis_View, CallFunc_GetRebindableAxesKeys_ReturnValue) == 0x000010, "Member 'SettingsInputViewBP_C_Populate_Axis_View::CallFunc_GetRebindableAxesKeys_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Axis_View, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SettingsInputViewBP_C_Populate_Axis_View::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Axis_View, CallFunc_Array_Get_Item) == 0x000024, "Member 'SettingsInputViewBP_C_Populate_Axis_View::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Axis_View, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'SettingsInputViewBP_C_Populate_Axis_View::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Axis_View, CallFunc_GetInformation_ReturnValue) == 0x000030, "Member 'SettingsInputViewBP_C_Populate_Axis_View::CallFunc_GetInformation_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.CacheAxisComponent
// 0x0018 (0x0018 - 0x0000)
struct SettingsInputViewBP_C_CacheAxisComponent final
{
public:
	class UInputSettingsSubComponent*             CallFunc_GetSubComponent_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettingsAxesSubComponent*         K2Node_DynamicCast_AsInput_Settings_Axes_Sub_Component; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_CacheAxisComponent) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_CacheAxisComponent");
static_assert(sizeof(SettingsInputViewBP_C_CacheAxisComponent) == 0x000018, "Wrong size on SettingsInputViewBP_C_CacheAxisComponent");
static_assert(offsetof(SettingsInputViewBP_C_CacheAxisComponent, CallFunc_GetSubComponent_ReturnValue) == 0x000000, "Member 'SettingsInputViewBP_C_CacheAxisComponent::CallFunc_GetSubComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_CacheAxisComponent, K2Node_DynamicCast_AsInput_Settings_Axes_Sub_Component) == 0x000008, "Member 'SettingsInputViewBP_C_CacheAxisComponent::K2Node_DynamicCast_AsInput_Settings_Axes_Sub_Component' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_CacheAxisComponent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SettingsInputViewBP_C_CacheAxisComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.Add Axis Entry
// 0x0078 (0x0078 - 0x0000)
struct SettingsInputViewBP_C_Add_Axis_Entry final
{
public:
	struct FInputInformationAxis                  AxisEntry;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   SettingsName_0;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class USettingsKeybindingWI_Axis_C*           CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsInputViewBP_C_Add_Axis_Entry) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_Add_Axis_Entry");
static_assert(sizeof(SettingsInputViewBP_C_Add_Axis_Entry) == 0x000078, "Wrong size on SettingsInputViewBP_C_Add_Axis_Entry");
static_assert(offsetof(SettingsInputViewBP_C_Add_Axis_Entry, AxisEntry) == 0x000000, "Member 'SettingsInputViewBP_C_Add_Axis_Entry::AxisEntry' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Axis_Entry, SettingsName_0) == 0x000050, "Member 'SettingsInputViewBP_C_Add_Axis_Entry::SettingsName_0' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Axis_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'SettingsInputViewBP_C_Add_Axis_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Axis_Entry, CallFunc_Create_ReturnValue) == 0x000068, "Member 'SettingsInputViewBP_C_Add_Axis_Entry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Axis_Entry, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000070, "Member 'SettingsInputViewBP_C_Add_Axis_Entry::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.Add Toggle Entry
// 0x0060 (0x0060 - 0x0000)
struct SettingsInputViewBP_C_Add_Toggle_Entry final
{
public:
	struct FInputInformationToggle                ToggleEntry;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   SettingsName_0;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class USettingsKeybindingWI_Toggle_C*         CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsInputViewBP_C_Add_Toggle_Entry) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_Add_Toggle_Entry");
static_assert(sizeof(SettingsInputViewBP_C_Add_Toggle_Entry) == 0x000060, "Wrong size on SettingsInputViewBP_C_Add_Toggle_Entry");
static_assert(offsetof(SettingsInputViewBP_C_Add_Toggle_Entry, ToggleEntry) == 0x000000, "Member 'SettingsInputViewBP_C_Add_Toggle_Entry::ToggleEntry' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Toggle_Entry, SettingsName_0) == 0x000038, "Member 'SettingsInputViewBP_C_Add_Toggle_Entry::SettingsName_0' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Toggle_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'SettingsInputViewBP_C_Add_Toggle_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Toggle_Entry, CallFunc_Create_ReturnValue) == 0x000050, "Member 'SettingsInputViewBP_C_Add_Toggle_Entry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Add_Toggle_Entry, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000058, "Member 'SettingsInputViewBP_C_Add_Toggle_Entry::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.Populate Toggle View
// 0x0068 (0x0068 - 0x0000)
struct SettingsInputViewBP_C_Populate_Toggle_View final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetRebindableToggleKeys_ReturnValue;      // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputInformationToggle                CallFunc_GetInformation_ReturnValue;               // 0x0030(0x0038)()
};
static_assert(alignof(SettingsInputViewBP_C_Populate_Toggle_View) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_Populate_Toggle_View");
static_assert(sizeof(SettingsInputViewBP_C_Populate_Toggle_View) == 0x000068, "Wrong size on SettingsInputViewBP_C_Populate_Toggle_View");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Toggle_View, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SettingsInputViewBP_C_Populate_Toggle_View::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Toggle_View, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SettingsInputViewBP_C_Populate_Toggle_View::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Toggle_View, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SettingsInputViewBP_C_Populate_Toggle_View::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Toggle_View, CallFunc_GetRebindableToggleKeys_ReturnValue) == 0x000010, "Member 'SettingsInputViewBP_C_Populate_Toggle_View::CallFunc_GetRebindableToggleKeys_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Toggle_View, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SettingsInputViewBP_C_Populate_Toggle_View::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Toggle_View, CallFunc_Array_Get_Item) == 0x000024, "Member 'SettingsInputViewBP_C_Populate_Toggle_View::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Toggle_View, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'SettingsInputViewBP_C_Populate_Toggle_View::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_Populate_Toggle_View, CallFunc_GetInformation_ReturnValue) == 0x000030, "Member 'SettingsInputViewBP_C_Populate_Toggle_View::CallFunc_GetInformation_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.CacheToggleComponent
// 0x0018 (0x0018 - 0x0000)
struct SettingsInputViewBP_C_CacheToggleComponent final
{
public:
	class UInputSettingsSubComponent*             CallFunc_GetSubComponent_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettingsToggleSubComponent*       K2Node_DynamicCast_AsInput_Settings_Toggle_Sub_Component; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_CacheToggleComponent) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_CacheToggleComponent");
static_assert(sizeof(SettingsInputViewBP_C_CacheToggleComponent) == 0x000018, "Wrong size on SettingsInputViewBP_C_CacheToggleComponent");
static_assert(offsetof(SettingsInputViewBP_C_CacheToggleComponent, CallFunc_GetSubComponent_ReturnValue) == 0x000000, "Member 'SettingsInputViewBP_C_CacheToggleComponent::CallFunc_GetSubComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_CacheToggleComponent, K2Node_DynamicCast_AsInput_Settings_Toggle_Sub_Component) == 0x000008, "Member 'SettingsInputViewBP_C_CacheToggleComponent::K2Node_DynamicCast_AsInput_Settings_Toggle_Sub_Component' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_CacheToggleComponent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SettingsInputViewBP_C_CacheToggleComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.PopulateViews
// 0x0002 (0x0002 - 0x0000)
struct SettingsInputViewBP_C_PopulateViews final
{
public:
	bool                                          NewLocalVar_0;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGamepadActive_Value;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_PopulateViews) == 0x000001, "Wrong alignment on SettingsInputViewBP_C_PopulateViews");
static_assert(sizeof(SettingsInputViewBP_C_PopulateViews) == 0x000002, "Wrong size on SettingsInputViewBP_C_PopulateViews");
static_assert(offsetof(SettingsInputViewBP_C_PopulateViews, NewLocalVar_0) == 0x000000, "Member 'SettingsInputViewBP_C_PopulateViews::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_PopulateViews, CallFunc_IsGamepadActive_Value) == 0x000001, "Member 'SettingsInputViewBP_C_PopulateViews::CallFunc_IsGamepadActive_Value' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.PopulateFloatSliders
// 0x0050 (0x0050 - 0x0000)
struct SettingsInputViewBP_C_PopulateFloatSliders final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputInformationFloatSlider           CallFunc_Map_Find_Value;                           // 0x0030(0x0018)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_PopulateFloatSliders) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_PopulateFloatSliders");
static_assert(sizeof(SettingsInputViewBP_C_PopulateFloatSliders) == 0x000050, "Wrong size on SettingsInputViewBP_C_PopulateFloatSliders");
static_assert(offsetof(SettingsInputViewBP_C_PopulateFloatSliders, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SettingsInputViewBP_C_PopulateFloatSliders::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_PopulateFloatSliders, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SettingsInputViewBP_C_PopulateFloatSliders::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_PopulateFloatSliders, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SettingsInputViewBP_C_PopulateFloatSliders::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_PopulateFloatSliders, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'SettingsInputViewBP_C_PopulateFloatSliders::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_PopulateFloatSliders, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SettingsInputViewBP_C_PopulateFloatSliders::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_PopulateFloatSliders, CallFunc_Array_Get_Item) == 0x000024, "Member 'SettingsInputViewBP_C_PopulateFloatSliders::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_PopulateFloatSliders, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'SettingsInputViewBP_C_PopulateFloatSliders::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_PopulateFloatSliders, CallFunc_Map_Find_Value) == 0x000030, "Member 'SettingsInputViewBP_C_PopulateFloatSliders::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_PopulateFloatSliders, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'SettingsInputViewBP_C_PopulateFloatSliders::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.AddSpacer
// 0x0010 (0x0010 - 0x0000)
struct SettingsInputViewBP_C_AddSpacer final
{
public:
	class UCM_InputSpacer_C*                      CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsInputViewBP_C_AddSpacer) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_AddSpacer");
static_assert(sizeof(SettingsInputViewBP_C_AddSpacer) == 0x000010, "Wrong size on SettingsInputViewBP_C_AddSpacer");
static_assert(offsetof(SettingsInputViewBP_C_AddSpacer, CallFunc_Create_ReturnValue) == 0x000000, "Member 'SettingsInputViewBP_C_AddSpacer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_AddSpacer, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000008, "Member 'SettingsInputViewBP_C_AddSpacer::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.CreateFloatSliderEntry
// 0x0040 (0x0040 - 0x0000)
struct SettingsInputViewBP_C_CreateFloatSliderEntry final
{
public:
	class FName                                   SerializationKey;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputInformationFloatSlider           Info;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class USettingsFloatSliderBP_C*               CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Value)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsInputViewBP_C_CreateFloatSliderEntry) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_CreateFloatSliderEntry");
static_assert(sizeof(SettingsInputViewBP_C_CreateFloatSliderEntry) == 0x000040, "Wrong size on SettingsInputViewBP_C_CreateFloatSliderEntry");
static_assert(offsetof(SettingsInputViewBP_C_CreateFloatSliderEntry, SerializationKey) == 0x000000, "Member 'SettingsInputViewBP_C_CreateFloatSliderEntry::SerializationKey' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_CreateFloatSliderEntry, Info) == 0x000008, "Member 'SettingsInputViewBP_C_CreateFloatSliderEntry::Info' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_CreateFloatSliderEntry, CallFunc_Create_ReturnValue) == 0x000020, "Member 'SettingsInputViewBP_C_CreateFloatSliderEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_CreateFloatSliderEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'SettingsInputViewBP_C_CreateFloatSliderEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_CreateFloatSliderEntry, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000038, "Member 'SettingsInputViewBP_C_CreateFloatSliderEntry::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.OnAnyFloatValueChanged
// 0x0004 (0x0004 - 0x0000)
struct SettingsInputViewBP_C_OnAnyFloatValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsInputViewBP_C_OnAnyFloatValueChanged) == 0x000004, "Wrong alignment on SettingsInputViewBP_C_OnAnyFloatValueChanged");
static_assert(sizeof(SettingsInputViewBP_C_OnAnyFloatValueChanged) == 0x000004, "Wrong size on SettingsInputViewBP_C_OnAnyFloatValueChanged");
static_assert(offsetof(SettingsInputViewBP_C_OnAnyFloatValueChanged, Value) == 0x000000, "Member 'SettingsInputViewBP_C_OnAnyFloatValueChanged::Value' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.OnSaveFloatValueWithChange
// 0x0020 (0x0020 - 0x0000)
struct SettingsInputViewBP_C_OnSaveFloatValueWithChange final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserSettingsGIS*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_OnSaveFloatValueWithChange) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_OnSaveFloatValueWithChange");
static_assert(sizeof(SettingsInputViewBP_C_OnSaveFloatValueWithChange) == 0x000020, "Wrong size on SettingsInputViewBP_C_OnSaveFloatValueWithChange");
static_assert(offsetof(SettingsInputViewBP_C_OnSaveFloatValueWithChange, Value) == 0x000000, "Member 'SettingsInputViewBP_C_OnSaveFloatValueWithChange::Value' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_OnSaveFloatValueWithChange, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'SettingsInputViewBP_C_OnSaveFloatValueWithChange::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_OnSaveFloatValueWithChange, CallFunc_GetGameUserSettings_ReturnValue) == 0x000010, "Member 'SettingsInputViewBP_C_OnSaveFloatValueWithChange::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_OnSaveFloatValueWithChange, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SettingsInputViewBP_C_OnSaveFloatValueWithChange::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.IsGamepadActive
// 0x0004 (0x0004 - 0x0000)
struct SettingsInputViewBP_C_IsGamepadActive final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLastControllerTypeGamepad_Value;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_IsGamepadActive) == 0x000001, "Wrong alignment on SettingsInputViewBP_C_IsGamepadActive");
static_assert(sizeof(SettingsInputViewBP_C_IsGamepadActive) == 0x000004, "Wrong size on SettingsInputViewBP_C_IsGamepadActive");
static_assert(offsetof(SettingsInputViewBP_C_IsGamepadActive, Value) == 0x000000, "Member 'SettingsInputViewBP_C_IsGamepadActive::Value' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_IsGamepadActive, CallFunc_IsConsolePlatform_ReturnValue) == 0x000001, "Member 'SettingsInputViewBP_C_IsGamepadActive::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_IsGamepadActive, CallFunc_IsLastControllerTypeGamepad_Value) == 0x000002, "Member 'SettingsInputViewBP_C_IsGamepadActive::CallFunc_IsLastControllerTypeGamepad_Value' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_IsGamepadActive, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'SettingsInputViewBP_C_IsGamepadActive::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function SettingsInputViewBP.SettingsInputViewBP_C.IsLastControllerTypeGamepad
// 0x0020 (0x0020 - 0x0000)
struct SettingsInputViewBP_C_IsLastControllerTypeGamepad final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESCTControllerType                            CallFunc_GetLastControllerType_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsInputViewBP_C_IsLastControllerTypeGamepad) == 0x000008, "Wrong alignment on SettingsInputViewBP_C_IsLastControllerTypeGamepad");
static_assert(sizeof(SettingsInputViewBP_C_IsLastControllerTypeGamepad) == 0x000020, "Wrong size on SettingsInputViewBP_C_IsLastControllerTypeGamepad");
static_assert(offsetof(SettingsInputViewBP_C_IsLastControllerTypeGamepad, Value) == 0x000000, "Member 'SettingsInputViewBP_C_IsLastControllerTypeGamepad::Value' has a wrong offset!");
static_assert(offsetof(SettingsInputViewBP_C_IsLastControllerTypeGamepad, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'SettingsInputViewBP_C_IsLastControllerTypeGamepad::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
