#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShortcutKeyInteractionComponent

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function ShortcutKeyInteractionComponent.ShortcutKeyInteractionComponent_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct ShortcutKeyInteractionComponent_C_Initialize final
{
public:
	class AKeySocket3in1BP_C*                     Owner_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShortcutKeyInteractionComponent_C_Initialize) == 0x000008, "Wrong alignment on ShortcutKeyInteractionComponent_C_Initialize");
static_assert(sizeof(ShortcutKeyInteractionComponent_C_Initialize) == 0x000008, "Wrong size on ShortcutKeyInteractionComponent_C_Initialize");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_Initialize, Owner_0) == 0x000000, "Member 'ShortcutKeyInteractionComponent_C_Initialize::Owner_0' has a wrong offset!");

// Function ShortcutKeyInteractionComponent.ShortcutKeyInteractionComponent_C.CanActivate
// 0x0048 (0x0048 - 0x0000)
struct ShortcutKeyInteractionComponent_C_CanActivate final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPower*                                 CallFunc_TryGetPowerFromType_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShortcutKeyInteractionComponent_C_CanActivate) == 0x000008, "Wrong alignment on ShortcutKeyInteractionComponent_C_CanActivate");
static_assert(sizeof(ShortcutKeyInteractionComponent_C_CanActivate) == 0x000048, "Wrong size on ShortcutKeyInteractionComponent_C_CanActivate");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_CanActivate, Payload) == 0x000000, "Member 'ShortcutKeyInteractionComponent_C_CanActivate::Payload' has a wrong offset!");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_CanActivate, ReturnValue) == 0x000030, "Member 'ShortcutKeyInteractionComponent_C_CanActivate::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_CanActivate, CallFunc_TryGetPowerFromType_ReturnValue) == 0x000038, "Member 'ShortcutKeyInteractionComponent_C_CanActivate::CallFunc_TryGetPowerFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_CanActivate, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'ShortcutKeyInteractionComponent_C_CanActivate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ShortcutKeyInteractionComponent.ShortcutKeyInteractionComponent_C.OwnerHasEquippedKeycard
// 0x0008 (0x0008 - 0x0000)
struct ShortcutKeyInteractionComponent_C_OwnerHasEquippedKeycard final
{
public:
	class UShortcutKeyGA_C*                       ShortcutKey;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShortcutKeyInteractionComponent_C_OwnerHasEquippedKeycard) == 0x000008, "Wrong alignment on ShortcutKeyInteractionComponent_C_OwnerHasEquippedKeycard");
static_assert(sizeof(ShortcutKeyInteractionComponent_C_OwnerHasEquippedKeycard) == 0x000008, "Wrong size on ShortcutKeyInteractionComponent_C_OwnerHasEquippedKeycard");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_OwnerHasEquippedKeycard, ShortcutKey) == 0x000000, "Member 'ShortcutKeyInteractionComponent_C_OwnerHasEquippedKeycard::ShortcutKey' has a wrong offset!");

// Function ShortcutKeyInteractionComponent.ShortcutKeyInteractionComponent_C.GetInactiveContextDescription
// 0x0078 (0x0078 - 0x0000)
struct ShortcutKeyInteractionComponent_C_GetInactiveContextDescription final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	class FText                                   ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetInactiveContextDescription_ReturnValue; // 0x0048(0x0018)()
	class UPower*                                 CallFunc_TryGetPowerFromType_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShortcutKeyGA_C*                       K2Node_DynamicCast_AsShortcut_Key_GA;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShortcutKeyInteractionComponent_C_GetInactiveContextDescription) == 0x000008, "Wrong alignment on ShortcutKeyInteractionComponent_C_GetInactiveContextDescription");
static_assert(sizeof(ShortcutKeyInteractionComponent_C_GetInactiveContextDescription) == 0x000078, "Wrong size on ShortcutKeyInteractionComponent_C_GetInactiveContextDescription");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_GetInactiveContextDescription, Payload) == 0x000000, "Member 'ShortcutKeyInteractionComponent_C_GetInactiveContextDescription::Payload' has a wrong offset!");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_GetInactiveContextDescription, ReturnValue) == 0x000030, "Member 'ShortcutKeyInteractionComponent_C_GetInactiveContextDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_GetInactiveContextDescription, CallFunc_GetInactiveContextDescription_ReturnValue) == 0x000048, "Member 'ShortcutKeyInteractionComponent_C_GetInactiveContextDescription::CallFunc_GetInactiveContextDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_GetInactiveContextDescription, CallFunc_TryGetPowerFromType_ReturnValue) == 0x000060, "Member 'ShortcutKeyInteractionComponent_C_GetInactiveContextDescription::CallFunc_TryGetPowerFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_GetInactiveContextDescription, K2Node_DynamicCast_AsShortcut_Key_GA) == 0x000068, "Member 'ShortcutKeyInteractionComponent_C_GetInactiveContextDescription::K2Node_DynamicCast_AsShortcut_Key_GA' has a wrong offset!");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_GetInactiveContextDescription, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'ShortcutKeyInteractionComponent_C_GetInactiveContextDescription::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShortcutKeyInteractionComponent_C_GetInactiveContextDescription, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'ShortcutKeyInteractionComponent_C_GetInactiveContextDescription::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

