#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SkillWI.SkillWI_C
// 0x0048 (0x02A8 - 0x0260)
class USkillWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 BG;                                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HoriBox_Skills;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_109;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Linebottom;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URoundedBGBoxWI_C*                      RoundedBGBoxWI;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SkillWI(int32 EntryPoint);
	void OnCustomSettingsApplied(const struct FCustomGameSettings& CustomSettings);
	void Clear_And_Add_Skills();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkillWI_C">();
	}
	static class USkillWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillWI_C>();
	}
};
static_assert(alignof(USkillWI_C) == 0x000008, "Wrong alignment on USkillWI_C");
static_assert(sizeof(USkillWI_C) == 0x0002A8, "Wrong size on USkillWI_C");
static_assert(offsetof(USkillWI_C, UberGraphFrame) == 0x000260, "Member 'USkillWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USkillWI_C, BG) == 0x000268, "Member 'USkillWI_C::BG' has a wrong offset!");
static_assert(offsetof(USkillWI_C, HoriBox_Skills) == 0x000270, "Member 'USkillWI_C::HoriBox_Skills' has a wrong offset!");
static_assert(offsetof(USkillWI_C, Image) == 0x000278, "Member 'USkillWI_C::Image' has a wrong offset!");
static_assert(offsetof(USkillWI_C, Image_1) == 0x000280, "Member 'USkillWI_C::Image_1' has a wrong offset!");
static_assert(offsetof(USkillWI_C, Image_2) == 0x000288, "Member 'USkillWI_C::Image_2' has a wrong offset!");
static_assert(offsetof(USkillWI_C, Image_109) == 0x000290, "Member 'USkillWI_C::Image_109' has a wrong offset!");
static_assert(offsetof(USkillWI_C, Linebottom) == 0x000298, "Member 'USkillWI_C::Linebottom' has a wrong offset!");
static_assert(offsetof(USkillWI_C, RoundedBGBoxWI) == 0x0002A0, "Member 'USkillWI_C::RoundedBGBoxWI' has a wrong offset!");

}

