#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SliderWI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function SliderWI.SliderWI_C.ValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SliderWI_C_ValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SliderWI_C_ValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on SliderWI_C_ValueChanged__DelegateSignature");
static_assert(sizeof(SliderWI_C_ValueChanged__DelegateSignature) == 0x000004, "Wrong size on SliderWI_C_ValueChanged__DelegateSignature");
static_assert(offsetof(SliderWI_C_ValueChanged__DelegateSignature, Value) == 0x000000, "Member 'SliderWI_C_ValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function SliderWI.SliderWI_C.OnRelease__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SliderWI_C_OnRelease__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SliderWI_C_OnRelease__DelegateSignature) == 0x000004, "Wrong alignment on SliderWI_C_OnRelease__DelegateSignature");
static_assert(sizeof(SliderWI_C_OnRelease__DelegateSignature) == 0x000004, "Wrong size on SliderWI_C_OnRelease__DelegateSignature");
static_assert(offsetof(SliderWI_C_OnRelease__DelegateSignature, Value) == 0x000000, "Member 'SliderWI_C_OnRelease__DelegateSignature::Value' has a wrong offset!");

// Function SliderWI.SliderWI_C.ExecuteUbergraph_SliderWI
// 0x00A8 (0x00A8 - 0x0000)
struct SliderWI_C_ExecuteUbergraph_SliderWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0080(0x0018)()
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SliderWI_C_ExecuteUbergraph_SliderWI) == 0x000008, "Wrong alignment on SliderWI_C_ExecuteUbergraph_SliderWI");
static_assert(sizeof(SliderWI_C_ExecuteUbergraph_SliderWI) == 0x0000A8, "Wrong size on SliderWI_C_ExecuteUbergraph_SliderWI");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, EntryPoint) == 0x000000, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, Temp_struct_Variable) == 0x000008, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, Temp_delegate_Variable) == 0x000018, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, Temp_struct_Variable_1) == 0x000028, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, Temp_delegate_Variable_1) == 0x000038, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_PostAkEvent_ReturnValue) == 0x00005C, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000060, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, K2Node_ComponentBoundEvent_Value) == 0x000068, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_PostAkEvent_ReturnValue_1) == 0x00006C, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_GetValue_ReturnValue) == 0x000070, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, K2Node_Event_IsDesignTime) == 0x000074, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_GetValue_ReturnValue_1) == 0x000078, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_Conv_FloatToText_ReturnValue) == 0x000080, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000098, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SliderWI_C_ExecuteUbergraph_SliderWI, CallFunc_MakeVector2D_ReturnValue) == 0x0000A0, "Member 'SliderWI_C_ExecuteUbergraph_SliderWI::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function SliderWI.SliderWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SliderWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SliderWI_C_PreConstruct) == 0x000001, "Wrong alignment on SliderWI_C_PreConstruct");
static_assert(sizeof(SliderWI_C_PreConstruct) == 0x000001, "Wrong size on SliderWI_C_PreConstruct");
static_assert(offsetof(SliderWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SliderWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SliderWI.SliderWI_C.BndEvt__Slider_1_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SliderWI_C_BndEvt__Slider_1_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SliderWI_C_BndEvt__Slider_1_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SliderWI_C_BndEvt__Slider_1_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(SliderWI_C_BndEvt__Slider_1_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SliderWI_C_BndEvt__Slider_1_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(SliderWI_C_BndEvt__Slider_1_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'SliderWI_C_BndEvt__Slider_1_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

}

