#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartCountdownWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StartCountdownWI.StartCountdownWI_C
// 0x0030 (0x0290 - 0x0260)
class UStartCountdownWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       In;                                                // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Linebottom;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Linetop;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Count;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ServerStartTime;                                   // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HasPlayedImminentStartSound;                       // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_StartCountdownWI(int32 EntryPoint);
	void Destruct();
	void About_To_Start();
	void Count_Down();
	void Construct();
	float GetTimeToNextSecond();

	int32 GetSecondsLeft() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StartCountdownWI_C">();
	}
	static class UStartCountdownWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartCountdownWI_C>();
	}
};
static_assert(alignof(UStartCountdownWI_C) == 0x000008, "Wrong alignment on UStartCountdownWI_C");
static_assert(sizeof(UStartCountdownWI_C) == 0x000290, "Wrong size on UStartCountdownWI_C");
static_assert(offsetof(UStartCountdownWI_C, UberGraphFrame) == 0x000260, "Member 'UStartCountdownWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStartCountdownWI_C, In) == 0x000268, "Member 'UStartCountdownWI_C::In' has a wrong offset!");
static_assert(offsetof(UStartCountdownWI_C, Linebottom) == 0x000270, "Member 'UStartCountdownWI_C::Linebottom' has a wrong offset!");
static_assert(offsetof(UStartCountdownWI_C, Linetop) == 0x000278, "Member 'UStartCountdownWI_C::Linetop' has a wrong offset!");
static_assert(offsetof(UStartCountdownWI_C, Text_Count) == 0x000280, "Member 'UStartCountdownWI_C::Text_Count' has a wrong offset!");
static_assert(offsetof(UStartCountdownWI_C, ServerStartTime) == 0x000288, "Member 'UStartCountdownWI_C::ServerStartTime' has a wrong offset!");
static_assert(offsetof(UStartCountdownWI_C, HasPlayedImminentStartSound) == 0x00028C, "Member 'UStartCountdownWI_C::HasPlayedImminentStartSound' has a wrong offset!");

}

