#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_AAS_SpawnArrayData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_AAS_SpawnArrayData.Struct_AAS_SpawnArrayData
// 0x01A0 (0x01A0 - 0x0000)
struct FStruct_AAS_SpawnArrayData final
{
public:
	TMap<int32, int32>                            DataToInstanceIndex_5_153047BA402BA024480541BF83BA4AD6; // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<int32, int32>                            InstanceToDataIndex_10_5BC2B60148EBB646EB9FEE9504AADCB2; // 0x0050(0x0050)(Edit, BlueprintVisible)
	TMap<int32, int32>                            ObjectToDataIndex_15_996905034E9518A2A553C98A8A0D75BB; // 0x00A0(0x0050)(Edit, BlueprintVisible)
	TMap<int32, int32>                            DataToObjectIndex_17_E2A364C04AD2C4DFF9F979A26F9333CC; // 0x00F0(0x0050)(Edit, BlueprintVisible)
	TMap<int32, class AActor*>                    ObjectIndexToActor_20_11C9A191423869BE81E33383F817FFD6; // 0x0140(0x0050)(Edit, BlueprintVisible)
	TArray<int32>                                 InstanceIndexToAsteroidID_36_A1AE2B9E4F02445B188AAB97A340301D; // 0x0190(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_AAS_SpawnArrayData) == 0x000008, "Wrong alignment on FStruct_AAS_SpawnArrayData");
static_assert(sizeof(FStruct_AAS_SpawnArrayData) == 0x0001A0, "Wrong size on FStruct_AAS_SpawnArrayData");
static_assert(offsetof(FStruct_AAS_SpawnArrayData, DataToInstanceIndex_5_153047BA402BA024480541BF83BA4AD6) == 0x000000, "Member 'FStruct_AAS_SpawnArrayData::DataToInstanceIndex_5_153047BA402BA024480541BF83BA4AD6' has a wrong offset!");
static_assert(offsetof(FStruct_AAS_SpawnArrayData, InstanceToDataIndex_10_5BC2B60148EBB646EB9FEE9504AADCB2) == 0x000050, "Member 'FStruct_AAS_SpawnArrayData::InstanceToDataIndex_10_5BC2B60148EBB646EB9FEE9504AADCB2' has a wrong offset!");
static_assert(offsetof(FStruct_AAS_SpawnArrayData, ObjectToDataIndex_15_996905034E9518A2A553C98A8A0D75BB) == 0x0000A0, "Member 'FStruct_AAS_SpawnArrayData::ObjectToDataIndex_15_996905034E9518A2A553C98A8A0D75BB' has a wrong offset!");
static_assert(offsetof(FStruct_AAS_SpawnArrayData, DataToObjectIndex_17_E2A364C04AD2C4DFF9F979A26F9333CC) == 0x0000F0, "Member 'FStruct_AAS_SpawnArrayData::DataToObjectIndex_17_E2A364C04AD2C4DFF9F979A26F9333CC' has a wrong offset!");
static_assert(offsetof(FStruct_AAS_SpawnArrayData, ObjectIndexToActor_20_11C9A191423869BE81E33383F817FFD6) == 0x000140, "Member 'FStruct_AAS_SpawnArrayData::ObjectIndexToActor_20_11C9A191423869BE81E33383F817FFD6' has a wrong offset!");
static_assert(offsetof(FStruct_AAS_SpawnArrayData, InstanceIndexToAsteroidID_36_A1AE2B9E4F02445B188AAB97A340301D) == 0x000190, "Member 'FStruct_AAS_SpawnArrayData::InstanceIndexToAsteroidID_36_A1AE2B9E4F02445B188AAB97A340301D' has a wrong offset!");

}

