#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextChatWindowWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TextChatWindowWI.TextChatWindowWI_C
// 0x00F0 (0x0350 - 0x0260)
class UTextChatWindowWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UOverlay*                               AllChannelContainer;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonImageAll;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonImagePersonoid;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ChannelTabs;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ChatLog;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControllerIconHelperWI_C*              ControllerIconHelperWIAll;                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControllerIconHelperWI_C*              ControllerIconHelperWIPersonoid;                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EmphasizedAllChatTextBlock;                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EmphasizedAllChatTextBlock_1;                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EmphasizedPersonoidChatTextBlock;                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EmphasizedPersonoidChatTextBlock_1;                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadTextAll;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadTextPersonoid;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PersonoidChannelContainer;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PersonoidText;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_100;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TextChatBackground;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          TextInput;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextChatComponent_C*                   TextChatComponent;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         GeneralFadeTarget;                                 // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BackGroundFadeTarget;                              // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmphasizedTextFadeTarget;                          // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveChannel;                                     // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfChannels;                                  // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Available_Chanels;                                 // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             BlackBackground;                                   // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CreamBackground;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasGameEnded;                                     // 0x0338(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PersonoidMessageText;                              // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TextChatWindowWI(int32 EntryPoint);
	void BndEvt__TextChatWindowWI_TextInput_K2Node_ComponentBoundEvent_9_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__TextChatWindowWI_ControllerIconHelperWIPersonoid_K2Node_ComponentBoundEvent_8_OnShowControllerKeyText__DelegateSignature(const class FText& Text);
	void BndEvt__TextChatWindowWI_ControllerIconHelperWIPersonoid_K2Node_ComponentBoundEvent_7_OnShowControllerKeyIcon__DelegateSignature(class UTexture2D* Icon);
	void BndEvt__TextChatWindowWI_ControllerIconHelperWIPersonoid_K2Node_ComponentBoundEvent_6_OnShowControllerKeyIcon__DelegateSignature(class UTexture2D* Icon);
	void BndEvt__TextChatWindowWI_ControllerIconHelperWIPersonoid_K2Node_ComponentBoundEvent_5_OnResetControllerKey__DelegateSignature();
	void BndEvt__TextChatWindowWI_ControllerIconHelperWIAll_K2Node_ComponentBoundEvent_4_OnShowControllerKeyText__DelegateSignature(const class FText& Text);
	void BndEvt__TextChatWindowWI_ControllerIconHelperWIAll_K2Node_ComponentBoundEvent_3_OnShowControllerKeyIcon__DelegateSignature(class UTexture2D* Icon);
	void BndEvt__TextChatWindowWI_ControllerIconHelperWIAll_K2Node_ComponentBoundEvent_2_OnShowControllerKeyIcon__DelegateSignature(class UTexture2D* Icon);
	void BndEvt__TextChatWindowWI_ControllerIconHelperWIAll_K2Node_ComponentBoundEvent_1_OnResetControllerKey__DelegateSignature();
	void ClearFadeOutTimer();
	void TimerFade();
	void RetriggerableFadeOut();
	void FadeOut();
	void FadeCompleted();
	void FadeIn();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__TextInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void Initialize();
	void StartTypingInAllChat();
	void StartTypingInPersonoidChat();
	void EndTyping();
	void AddTextMessage(const class FText& Text, uint8 TextType, const struct FLinearColor& SenderIdentificationColor);
	void UpdateFade();
	void SetChatHistoryBackgroundColor(int32 ActiveChannel_0);
	void PlayerFateChanged(EFate Fate);
	void MatchEnded(const struct FMatchEndData& MatchEndData);
	void Set_Available_Channels();
	void SetActiveChannel(int32 ActiveChannel_0, bool* Succesful);
	void OnRep_bHasGameEnded();
	void GetKeyFromInputActionName(class FName Input_Action_Name, class FText* Key);
	class FText Get_EmphasizedAllChatTextBlock();
	class FText Get_EmphasizedPersonoidChatTextBlock();
	void UpdateChannelButtonVisuals();
	void SetAllChatRenderOpacity(float InOpacity);
	void SetPersonoidChatRenderOpacity(float InOpacity);
	void SetDeadEndgameChatRenderOpacity(float InOpacity);
	void InvertRenderOpacityForTabs(float Opacity, class UWidget* Target);
	void CreateEmphasizedAllChatText(const class FText& KeyText, class FText* EmphasizedText);
	void CreateEmphasizedPersonoidChatText(const class FText& KeyText, class FText* EmphasizedText);
	void Clamp_Number_Of_Messages(int32 MaxNumberOfMessages);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TextChatWindowWI_C">();
	}
	static class UTextChatWindowWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextChatWindowWI_C>();
	}
};
static_assert(alignof(UTextChatWindowWI_C) == 0x000008, "Wrong alignment on UTextChatWindowWI_C");
static_assert(sizeof(UTextChatWindowWI_C) == 0x000350, "Wrong size on UTextChatWindowWI_C");
static_assert(offsetof(UTextChatWindowWI_C, UberGraphFrame) == 0x000260, "Member 'UTextChatWindowWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, AllChannelContainer) == 0x000268, "Member 'UTextChatWindowWI_C::AllChannelContainer' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, ButtonImageAll) == 0x000270, "Member 'UTextChatWindowWI_C::ButtonImageAll' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, ButtonImagePersonoid) == 0x000278, "Member 'UTextChatWindowWI_C::ButtonImagePersonoid' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, ChannelTabs) == 0x000280, "Member 'UTextChatWindowWI_C::ChannelTabs' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, ChatLog) == 0x000288, "Member 'UTextChatWindowWI_C::ChatLog' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, ControllerIconHelperWIAll) == 0x000290, "Member 'UTextChatWindowWI_C::ControllerIconHelperWIAll' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, ControllerIconHelperWIPersonoid) == 0x000298, "Member 'UTextChatWindowWI_C::ControllerIconHelperWIPersonoid' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, EmphasizedAllChatTextBlock) == 0x0002A0, "Member 'UTextChatWindowWI_C::EmphasizedAllChatTextBlock' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, EmphasizedAllChatTextBlock_1) == 0x0002A8, "Member 'UTextChatWindowWI_C::EmphasizedAllChatTextBlock_1' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, EmphasizedPersonoidChatTextBlock) == 0x0002B0, "Member 'UTextChatWindowWI_C::EmphasizedPersonoidChatTextBlock' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, EmphasizedPersonoidChatTextBlock_1) == 0x0002B8, "Member 'UTextChatWindowWI_C::EmphasizedPersonoidChatTextBlock_1' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, GamepadTextAll) == 0x0002C0, "Member 'UTextChatWindowWI_C::GamepadTextAll' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, GamepadTextPersonoid) == 0x0002C8, "Member 'UTextChatWindowWI_C::GamepadTextPersonoid' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, PersonoidChannelContainer) == 0x0002D0, "Member 'UTextChatWindowWI_C::PersonoidChannelContainer' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, PersonoidText) == 0x0002D8, "Member 'UTextChatWindowWI_C::PersonoidText' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, SafeZone_100) == 0x0002E0, "Member 'UTextChatWindowWI_C::SafeZone_100' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, TextChatBackground) == 0x0002E8, "Member 'UTextChatWindowWI_C::TextChatBackground' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, TextInput) == 0x0002F0, "Member 'UTextChatWindowWI_C::TextInput' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, TextChatComponent) == 0x0002F8, "Member 'UTextChatWindowWI_C::TextChatComponent' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, GeneralFadeTarget) == 0x000300, "Member 'UTextChatWindowWI_C::GeneralFadeTarget' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, BackGroundFadeTarget) == 0x000304, "Member 'UTextChatWindowWI_C::BackGroundFadeTarget' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, EmphasizedTextFadeTarget) == 0x000308, "Member 'UTextChatWindowWI_C::EmphasizedTextFadeTarget' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, ActiveChannel) == 0x00030C, "Member 'UTextChatWindowWI_C::ActiveChannel' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, NumberOfChannels) == 0x000310, "Member 'UTextChatWindowWI_C::NumberOfChannels' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, Available_Chanels) == 0x000318, "Member 'UTextChatWindowWI_C::Available_Chanels' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, BlackBackground) == 0x000328, "Member 'UTextChatWindowWI_C::BlackBackground' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, CreamBackground) == 0x000330, "Member 'UTextChatWindowWI_C::CreamBackground' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, bHasGameEnded) == 0x000338, "Member 'UTextChatWindowWI_C::bHasGameEnded' has a wrong offset!");
static_assert(offsetof(UTextChatWindowWI_C, PersonoidMessageText) == 0x000340, "Member 'UTextChatWindowWI_C::PersonoidMessageText' has a wrong offset!");

}

