#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThreatLevel

#include "Basic.hpp"


namespace SDK::Params
{

// Function ThreatLevel.ThreatLevel_C.Initialize
// 0x0028 (0x0028 - 0x0000)
struct ThreatLevel_C_Initialize final
{
public:
	class UThumbsVoteInfoComponent*               ThumbsVoteInfoComponent;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ThreatLevel_C_Initialize) == 0x000008, "Wrong alignment on ThreatLevel_C_Initialize");
static_assert(sizeof(ThreatLevel_C_Initialize) == 0x000028, "Wrong size on ThreatLevel_C_Initialize");
static_assert(offsetof(ThreatLevel_C_Initialize, ThumbsVoteInfoComponent) == 0x000000, "Member 'ThreatLevel_C_Initialize::ThumbsVoteInfoComponent' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ThreatLevel_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_Initialize, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'ThreatLevel_C_Initialize::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function ThreatLevel.ThreatLevel_C.UpdateThreatLevel
// 0x00E8 (0x00E8 - 0x0000)
struct ThreatLevel_C_UpdateThreatLevel final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT_2; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory_2; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT_3; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory_3; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState*                        CallFunc_GetSCTPlayerState_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTGameState*                          CallFunc_Get_SCT_Game_State_Game_State;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State_1;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State_2;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_2;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThreatLevel_C_UpdateThreatLevel) == 0x000008, "Wrong alignment on ThreatLevel_C_UpdateThreatLevel");
static_assert(sizeof(ThreatLevel_C_UpdateThreatLevel) == 0x0000E8, "Wrong size on ThreatLevel_C_UpdateThreatLevel");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ThreatLevel_C_UpdateThreatLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ThreatLevel_C_UpdateThreatLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000010, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000018, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1) == 0x000020, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_GetSCT_Player_Character_CharacterInventory_1) == 0x000028, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_GetSCT_Player_Character_CharacterInventory_1' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_GetSCT_Player_Character_AsCharacter_SCT_2) == 0x000030, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_GetSCT_Player_Character_AsCharacter_SCT_2' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_GetSCT_Player_Character_CharacterInventory_2) == 0x000038, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_GetSCT_Player_Character_CharacterInventory_2' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_Array_Contains_ReturnValue) == 0x000040, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_GetSCT_Player_Character_AsCharacter_SCT_3) == 0x000048, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_GetSCT_Player_Character_AsCharacter_SCT_3' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_GetSCT_Player_Character_CharacterInventory_3) == 0x000050, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_GetSCT_Player_Character_CharacterInventory_3' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_GetSCTPlayerState_ReturnValue) == 0x000058, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_GetSCTPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_Array_Contains_ReturnValue_1) == 0x000060, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000061, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_Get_SCT_Game_State_Game_State) == 0x000068, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_Get_SCT_Game_State_Game_State' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_Array_Get_Item) == 0x000078, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'ThreatLevel_C_UpdateThreatLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_AsSCTPlayer_State) == 0x000088, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_AsSCTPlayer_State' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_AsSCTPlayer_State_1) == 0x000098, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_AsSCTPlayer_State_1' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x0000A8, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x0000B8, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_AsSCTPlayer_State_2) == 0x0000C8, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_AsSCTPlayer_State_2' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_bSuccess_4) == 0x0000D0, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_AsCharacter_SCTBP_2) == 0x0000D8, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_AsCharacter_SCTBP_2' has a wrong offset!");
static_assert(offsetof(ThreatLevel_C_UpdateThreatLevel, K2Node_DynamicCast_bSuccess_5) == 0x0000E0, "Member 'ThreatLevel_C_UpdateThreatLevel::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

}

