#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThumbsVotingHelpIconsWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function ThumbsVotingHelpIconsWI.ThumbsVotingHelpIconsWI_C.ExecuteUbergraph_ThumbsVotingHelpIconsWI
// 0x0028 (0x0028 - 0x0000)
struct ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_ComponentBoundEvent_Icon_1;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_ComponentBoundEvent_Icon;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI) == 0x000008, "Wrong alignment on ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI");
static_assert(sizeof(ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI) == 0x000028, "Wrong size on ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI");
static_assert(offsetof(ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI, EntryPoint) == 0x000000, "Member 'ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI, K2Node_ComponentBoundEvent_Icon_1) == 0x000008, "Member 'ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI::K2Node_ComponentBoundEvent_Icon_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI, K2Node_Event_IsDesignTime) == 0x000011, "Member 'ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI, K2Node_ComponentBoundEvent_Icon) == 0x000018, "Member 'ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI::K2Node_ComponentBoundEvent_Icon' has a wrong offset!");
static_assert(offsetof(ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'ThumbsVotingHelpIconsWI_C_ExecuteUbergraph_ThumbsVotingHelpIconsWI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function ThumbsVotingHelpIconsWI.ThumbsVotingHelpIconsWI_C.BndEvt__ThumbsVotingHelpIconsWI_RightControllerIconHelperWI_K2Node_ComponentBoundEvent_3_OnShowControllerKeyIcon__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_RightControllerIconHelperWI_K2Node_ComponentBoundEvent_3_OnShowControllerKeyIcon__DelegateSignature final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_RightControllerIconHelperWI_K2Node_ComponentBoundEvent_3_OnShowControllerKeyIcon__DelegateSignature) == 0x000008, "Wrong alignment on ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_RightControllerIconHelperWI_K2Node_ComponentBoundEvent_3_OnShowControllerKeyIcon__DelegateSignature");
static_assert(sizeof(ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_RightControllerIconHelperWI_K2Node_ComponentBoundEvent_3_OnShowControllerKeyIcon__DelegateSignature) == 0x000008, "Wrong size on ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_RightControllerIconHelperWI_K2Node_ComponentBoundEvent_3_OnShowControllerKeyIcon__DelegateSignature");
static_assert(offsetof(ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_RightControllerIconHelperWI_K2Node_ComponentBoundEvent_3_OnShowControllerKeyIcon__DelegateSignature, Icon) == 0x000000, "Member 'ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_RightControllerIconHelperWI_K2Node_ComponentBoundEvent_3_OnShowControllerKeyIcon__DelegateSignature::Icon' has a wrong offset!");

// Function ThumbsVotingHelpIconsWI.ThumbsVotingHelpIconsWI_C.BndEvt__ThumbsVotingHelpIconsWI_LeftControllerIconHelperWI_K2Node_ComponentBoundEvent_1_OnShowControllerKeyIcon__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_LeftControllerIconHelperWI_K2Node_ComponentBoundEvent_1_OnShowControllerKeyIcon__DelegateSignature final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_LeftControllerIconHelperWI_K2Node_ComponentBoundEvent_1_OnShowControllerKeyIcon__DelegateSignature) == 0x000008, "Wrong alignment on ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_LeftControllerIconHelperWI_K2Node_ComponentBoundEvent_1_OnShowControllerKeyIcon__DelegateSignature");
static_assert(sizeof(ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_LeftControllerIconHelperWI_K2Node_ComponentBoundEvent_1_OnShowControllerKeyIcon__DelegateSignature) == 0x000008, "Wrong size on ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_LeftControllerIconHelperWI_K2Node_ComponentBoundEvent_1_OnShowControllerKeyIcon__DelegateSignature");
static_assert(offsetof(ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_LeftControllerIconHelperWI_K2Node_ComponentBoundEvent_1_OnShowControllerKeyIcon__DelegateSignature, Icon) == 0x000000, "Member 'ThumbsVotingHelpIconsWI_C_BndEvt__ThumbsVotingHelpIconsWI_LeftControllerIconHelperWI_K2Node_ComponentBoundEvent_1_OnShowControllerKeyIcon__DelegateSignature::Icon' has a wrong offset!");

// Function ThumbsVotingHelpIconsWI.ThumbsVotingHelpIconsWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ThumbsVotingHelpIconsWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingHelpIconsWI_C_PreConstruct) == 0x000001, "Wrong alignment on ThumbsVotingHelpIconsWI_C_PreConstruct");
static_assert(sizeof(ThumbsVotingHelpIconsWI_C_PreConstruct) == 0x000001, "Wrong size on ThumbsVotingHelpIconsWI_C_PreConstruct");
static_assert(offsetof(ThumbsVotingHelpIconsWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ThumbsVotingHelpIconsWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

