#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThumbsVotingHelpIconsWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ThumbsVotingHelpIconsWI.ThumbsVotingHelpIconsWI_C
// 0x0058 (0x02B8 - 0x0260)
class UThumbsVotingHelpIconsWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UTextBlock*                             HelpTextBox;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControllerIconHelperWI_C*              LeftControllerIconHelperWI;                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftImage;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControllerIconHelperWI_C*              RightControllerIconHelperWI;                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightImage;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   LeftActionMapping;                                 // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   RightActionMapping;                                // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   HelpText;                                          // 0x02A0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_ThumbsVotingHelpIconsWI(int32 EntryPoint);
	void BndEvt__ThumbsVotingHelpIconsWI_RightControllerIconHelperWI_K2Node_ComponentBoundEvent_3_OnShowControllerKeyIcon__DelegateSignature(class UTexture2D* Icon);
	void BndEvt__ThumbsVotingHelpIconsWI_RightControllerIconHelperWI_K2Node_ComponentBoundEvent_2_OnResetControllerKey__DelegateSignature();
	void BndEvt__ThumbsVotingHelpIconsWI_LeftControllerIconHelperWI_K2Node_ComponentBoundEvent_1_OnShowControllerKeyIcon__DelegateSignature(class UTexture2D* Icon);
	void BndEvt__ThumbsVotingHelpIconsWI_LeftControllerIconHelperWI_K2Node_ComponentBoundEvent_0_OnResetControllerKey__DelegateSignature();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void UpdateDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ThumbsVotingHelpIconsWI_C">();
	}
	static class UThumbsVotingHelpIconsWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThumbsVotingHelpIconsWI_C>();
	}
};
static_assert(alignof(UThumbsVotingHelpIconsWI_C) == 0x000008, "Wrong alignment on UThumbsVotingHelpIconsWI_C");
static_assert(sizeof(UThumbsVotingHelpIconsWI_C) == 0x0002B8, "Wrong size on UThumbsVotingHelpIconsWI_C");
static_assert(offsetof(UThumbsVotingHelpIconsWI_C, UberGraphFrame) == 0x000260, "Member 'UThumbsVotingHelpIconsWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UThumbsVotingHelpIconsWI_C, HelpTextBox) == 0x000268, "Member 'UThumbsVotingHelpIconsWI_C::HelpTextBox' has a wrong offset!");
static_assert(offsetof(UThumbsVotingHelpIconsWI_C, LeftControllerIconHelperWI) == 0x000270, "Member 'UThumbsVotingHelpIconsWI_C::LeftControllerIconHelperWI' has a wrong offset!");
static_assert(offsetof(UThumbsVotingHelpIconsWI_C, LeftImage) == 0x000278, "Member 'UThumbsVotingHelpIconsWI_C::LeftImage' has a wrong offset!");
static_assert(offsetof(UThumbsVotingHelpIconsWI_C, RightControllerIconHelperWI) == 0x000280, "Member 'UThumbsVotingHelpIconsWI_C::RightControllerIconHelperWI' has a wrong offset!");
static_assert(offsetof(UThumbsVotingHelpIconsWI_C, RightImage) == 0x000288, "Member 'UThumbsVotingHelpIconsWI_C::RightImage' has a wrong offset!");
static_assert(offsetof(UThumbsVotingHelpIconsWI_C, LeftActionMapping) == 0x000290, "Member 'UThumbsVotingHelpIconsWI_C::LeftActionMapping' has a wrong offset!");
static_assert(offsetof(UThumbsVotingHelpIconsWI_C, RightActionMapping) == 0x000298, "Member 'UThumbsVotingHelpIconsWI_C::RightActionMapping' has a wrong offset!");
static_assert(offsetof(UThumbsVotingHelpIconsWI_C, HelpText) == 0x0002A0, "Member 'UThumbsVotingHelpIconsWI_C::HelpText' has a wrong offset!");

}

