#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrashCompactorBP

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function TrashCompactorBP.TrashCompactorBP_C.ExecuteUbergraph_TrashCompactorBP
// 0x02E8 (0x02E8 - 0x0000)
struct TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(class ACharacterSCTBP_C* CarriedCorpse)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0050(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_1;              // 0x0080(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload;                // 0x00B0(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0108(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_CarriedCorpse;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x01B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCarryCorpseGA_C*                       CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryCorpseGA; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryingCharacter; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCarryCorpseGA_C*                       CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryCorpseGA_1; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryingCharacter_1; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0234(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0248(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0258(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP) == 0x000008, "Wrong alignment on TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP");
static_assert(sizeof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP) == 0x0002E8, "Wrong size on TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, EntryPoint) == 0x000000, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, Temp_struct_Variable) == 0x000008, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, Temp_delegate_Variable) == 0x000028, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_HasAuthority_ReturnValue) == 0x000038, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_Lerp_ReturnValue) == 0x00003C, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_MakeRotator_ReturnValue) == 0x000040, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_HasAuthority_ReturnValue_1) == 0x00004C, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, Temp_delegate_Variable_1) == 0x000050, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_HasAuthority_ReturnValue_2) == 0x000060, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, Temp_struct_Variable_1) == 0x000068, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_HasAuthority_ReturnValue_3) == 0x000078, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_payload_1) == 0x000080, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_payload_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_payload) == 0x0000B0, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_payload' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_wasCancelled) == 0x0000E0, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_wasCancelled' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_PostAkEvent_ReturnValue) == 0x0000E4, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000E8, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000F0, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000F8, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000100, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_bFromSweep) == 0x000104, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_SweepResult) == 0x000108, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_CustomEvent_CarriedCorpse) == 0x000198, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_CustomEvent_CarriedCorpse' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_GetOwner_ReturnValue) == 0x0001A0, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x0001A8, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0001B4, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryCorpseGA) == 0x0001C0, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryCorpseGA' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryingCharacter) == 0x0001C8, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryingCharacter' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_IsValid_ReturnValue) == 0x0001D0, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001D8, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_OtherActor) == 0x0001E0, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_OtherComp) == 0x0001E8, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001F0, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_GetOwner_ReturnValue_1) == 0x0001F8, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000200, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_DynamicCast_bSuccess_1) == 0x000208, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryCorpseGA_1) == 0x000210, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryCorpseGA_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryingCharacter_1) == 0x000218, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_Get_Carry_Corpse_GAFrom_Character_CarryingCharacter_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_PostAkEvent_ReturnValue_1) == 0x000220, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_IsValid_ReturnValue_1) == 0x000224, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_DynamicCast_AsCharacter) == 0x000228, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, K2Node_DynamicCast_bSuccess_2) == 0x000230, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, Temp_delegate_Variable_2) == 0x000234, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, Temp_struct_Variable_2) == 0x000248, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000258, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP, CallFunc_PostAkEvent_ReturnValue_2) == 0x0002E4, "Member 'TrashCompactorBP_C_ExecuteUbergraph_TrashCompactorBP::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.On_Release Corpse
// 0x0008 (0x0008 - 0x0000)
struct TrashCompactorBP_C_On_Release_Corpse final
{
public:
	class ACharacterSCTBP_C*                      CarriedCorpse;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrashCompactorBP_C_On_Release_Corpse) == 0x000008, "Wrong alignment on TrashCompactorBP_C_On_Release_Corpse");
static_assert(sizeof(TrashCompactorBP_C_On_Release_Corpse) == 0x000008, "Wrong size on TrashCompactorBP_C_On_Release_Corpse");
static_assert(offsetof(TrashCompactorBP_C_On_Release_Corpse, CarriedCorpse) == 0x000000, "Member 'TrashCompactorBP_C_On_Release_Corpse::CarriedCorpse' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_Box_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature");
static_assert(sizeof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature) == 0x000038, "Wrong size on TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature, Payload) == 0x000000, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature::Payload' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature, WasCancelled) == 0x000030, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature::WasCancelled' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature");
static_assert(sizeof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature");
static_assert(offsetof(TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'TrashCompactorBP_C_BndEvt__TrashCompactorBP_OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct TrashCompactorBP_C_UserConstructionScript final
{
public:
	TScriptInterface<class IInteractionSubComponentInterface> CallFunc_AddSubComponent_component_CastInput;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(TrashCompactorBP_C_UserConstructionScript) == 0x000008, "Wrong alignment on TrashCompactorBP_C_UserConstructionScript");
static_assert(sizeof(TrashCompactorBP_C_UserConstructionScript) == 0x000010, "Wrong size on TrashCompactorBP_C_UserConstructionScript");
static_assert(offsetof(TrashCompactorBP_C_UserConstructionScript, CallFunc_AddSubComponent_component_CastInput) == 0x000000, "Member 'TrashCompactorBP_C_UserConstructionScript::CallFunc_AddSubComponent_component_CastInput' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.Set ActivatingActor and Inventory from Payload
// 0x0030 (0x0030 - 0x0000)
struct TrashCompactorBP_C_Set_ActivatingActor_and_Inventory_from_Payload final
{
public:
	struct FInteractionPayload                    InteractionPayload;                                // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TrashCompactorBP_C_Set_ActivatingActor_and_Inventory_from_Payload) == 0x000008, "Wrong alignment on TrashCompactorBP_C_Set_ActivatingActor_and_Inventory_from_Payload");
static_assert(sizeof(TrashCompactorBP_C_Set_ActivatingActor_and_Inventory_from_Payload) == 0x000030, "Wrong size on TrashCompactorBP_C_Set_ActivatingActor_and_Inventory_from_Payload");
static_assert(offsetof(TrashCompactorBP_C_Set_ActivatingActor_and_Inventory_from_Payload, InteractionPayload) == 0x000000, "Member 'TrashCompactorBP_C_Set_ActivatingActor_and_Inventory_from_Payload::InteractionPayload' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.RemoveOxygenPotionStack
// 0x0010 (0x0010 - 0x0000)
struct TrashCompactorBP_C_RemoveOxygenPotionStack final
{
public:
	class UPower*                                 CallFunc_TryGetPowerFromType_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemovePowerStacks_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrashCompactorBP_C_RemoveOxygenPotionStack) == 0x000008, "Wrong alignment on TrashCompactorBP_C_RemoveOxygenPotionStack");
static_assert(sizeof(TrashCompactorBP_C_RemoveOxygenPotionStack) == 0x000010, "Wrong size on TrashCompactorBP_C_RemoveOxygenPotionStack");
static_assert(offsetof(TrashCompactorBP_C_RemoveOxygenPotionStack, CallFunc_TryGetPowerFromType_ReturnValue) == 0x000000, "Member 'TrashCompactorBP_C_RemoveOxygenPotionStack::CallFunc_TryGetPowerFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_RemoveOxygenPotionStack, CallFunc_RemovePowerStacks_ReturnValue) == 0x000008, "Member 'TrashCompactorBP_C_RemoveOxygenPotionStack::CallFunc_RemovePowerStacks_ReturnValue' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.Get Carry Corpse GAFrom Character
// 0x0098 (0x0098 - 0x0000)
struct TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character final
{
public:
	class ACharacterSCT*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCarryCorpseGA_C*                       CarryCorpseGA;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CarryingCharacter;                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSkillDetails>                  CallFunc_GetAllSkills_ReturnValue;                 // 0x0020(0x0010)(ReferenceParm)
	struct FSkillDetails                          CallFunc_Array_Get_Item;                           // 0x0030(0x0050)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCarryCorpseGA_C*                       K2Node_DynamicCast_AsCarry_Corpse_GA;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character) == 0x000008, "Wrong alignment on TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character");
static_assert(sizeof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character) == 0x000098, "Wrong size on TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, Character) == 0x000000, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::Character' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, CarryCorpseGA) == 0x000008, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::CarryCorpseGA' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, CarryingCharacter) == 0x000010, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::CarryingCharacter' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, Temp_int_Array_Index_Variable) == 0x000018, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, CallFunc_GetAllSkills_ReturnValue) == 0x000020, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::CallFunc_GetAllSkills_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, CallFunc_Array_Get_Item) == 0x000030, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, K2Node_DynamicCast_AsCarry_Corpse_GA) == 0x000088, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::K2Node_DynamicCast_AsCarry_Corpse_GA' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, CallFunc_Less_IntInt_ReturnValue) == 0x000091, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'TrashCompactorBP_C_Get_Carry_Corpse_GAFrom_Character::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.RenderXray
// 0x0010 (0x0010 - 0x0000)
struct TrashCompactorBP_C_RenderXray final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrashCompactorBP_C_RenderXray) == 0x000004, "Wrong alignment on TrashCompactorBP_C_RenderXray");
static_assert(sizeof(TrashCompactorBP_C_RenderXray) == 0x000010, "Wrong size on TrashCompactorBP_C_RenderXray");
static_assert(offsetof(TrashCompactorBP_C_RenderXray, On) == 0x000000, "Member 'TrashCompactorBP_C_RenderXray::On' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_RenderXray, Temp_bool_Variable) == 0x000001, "Member 'TrashCompactorBP_C_RenderXray::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_RenderXray, Temp_int_Variable) == 0x000004, "Member 'TrashCompactorBP_C_RenderXray::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_RenderXray, Temp_int_Variable_1) == 0x000008, "Member 'TrashCompactorBP_C_RenderXray::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_RenderXray, K2Node_Select_Default) == 0x00000C, "Member 'TrashCompactorBP_C_RenderXray::K2Node_Select_Default' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.ScoreForCompactingCorpse
// 0x0030 (0x0030 - 0x0000)
struct TrashCompactorBP_C_ScoreForCompactingCorpse final
{
public:
	class ACharacter*                             CompactedCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CharacterHolding;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFactionInfoInterface> K2Node_DynamicCast_AsFaction_Info_Interface;       // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPersonoid_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrashCompactorBP_C_ScoreForCompactingCorpse) == 0x000008, "Wrong alignment on TrashCompactorBP_C_ScoreForCompactingCorpse");
static_assert(sizeof(TrashCompactorBP_C_ScoreForCompactingCorpse) == 0x000030, "Wrong size on TrashCompactorBP_C_ScoreForCompactingCorpse");
static_assert(offsetof(TrashCompactorBP_C_ScoreForCompactingCorpse, CompactedCharacter) == 0x000000, "Member 'TrashCompactorBP_C_ScoreForCompactingCorpse::CompactedCharacter' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ScoreForCompactingCorpse, CharacterHolding) == 0x000008, "Member 'TrashCompactorBP_C_ScoreForCompactingCorpse::CharacterHolding' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ScoreForCompactingCorpse, Temp_bool_Variable) == 0x000010, "Member 'TrashCompactorBP_C_ScoreForCompactingCorpse::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ScoreForCompactingCorpse, K2Node_DynamicCast_AsFaction_Info_Interface) == 0x000018, "Member 'TrashCompactorBP_C_ScoreForCompactingCorpse::K2Node_DynamicCast_AsFaction_Info_Interface' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ScoreForCompactingCorpse, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'TrashCompactorBP_C_ScoreForCompactingCorpse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_ScoreForCompactingCorpse, CallFunc_IsPersonoid_ReturnValue) == 0x000029, "Member 'TrashCompactorBP_C_ScoreForCompactingCorpse::CallFunc_IsPersonoid_ReturnValue' has a wrong offset!");

// Function TrashCompactorBP.TrashCompactorBP_C.HasAliveCharacterInside
// 0x0078 (0x0078 - 0x0000)
struct TrashCompactorBP_C_HasAliveCharacterInside final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         L_AliveActors;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           Temp_object_Variable;                              // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAliveBPI_Alive;                         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrashCompactorBP_C_HasAliveCharacterInside) == 0x000008, "Wrong alignment on TrashCompactorBP_C_HasAliveCharacterInside");
static_assert(sizeof(TrashCompactorBP_C_HasAliveCharacterInside) == 0x000078, "Wrong size on TrashCompactorBP_C_HasAliveCharacterInside");
static_assert(offsetof(TrashCompactorBP_C_HasAliveCharacterInside, Return) == 0x000000, "Member 'TrashCompactorBP_C_HasAliveCharacterInside::Return' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_HasAliveCharacterInside, L_AliveActors) == 0x000008, "Member 'TrashCompactorBP_C_HasAliveCharacterInside::L_AliveActors' has a wrong offset!");
static_assert(offsetof(TrashCompactorBP_C_HasAliveCharacterInside, Temp_int_Array_Index_Variable) == 0x000018, "Member 'TrashCompactorBP_C_HasAliveCharacterInside::Temp_int_Array_Index_Variable' has a wrong offset!");
