#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrophyStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct TrophyStruct.TrophyStruct
// 0x0038 (0x0038 - 0x0000)
struct FTrophyStruct final
{
public:
	class FText                                   FriendlyName_9_9942A474477553EFAB3907988D424C20;   // 0x0000(0x0018)(Edit, BlueprintVisible)
	class UClass*                                 TrophyBP_15_0F6FAA6241A2B4D631449B940E5609AE;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description_20_3FE8AF61403F2EDC20427398EF916B5F;   // 0x0020(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(FTrophyStruct) == 0x000008, "Wrong alignment on FTrophyStruct");
static_assert(sizeof(FTrophyStruct) == 0x000038, "Wrong size on FTrophyStruct");
static_assert(offsetof(FTrophyStruct, FriendlyName_9_9942A474477553EFAB3907988D424C20) == 0x000000, "Member 'FTrophyStruct::FriendlyName_9_9942A474477553EFAB3907988D424C20' has a wrong offset!");
static_assert(offsetof(FTrophyStruct, TrophyBP_15_0F6FAA6241A2B4D631449B940E5609AE) == 0x000018, "Member 'FTrophyStruct::TrophyBP_15_0F6FAA6241A2B4D631449B940E5609AE' has a wrong offset!");
static_assert(offsetof(FTrophyStruct, Description_20_3FE8AF61403F2EDC20427398EF916B5F) == 0x000020, "Member 'FTrophyStruct::Description_20_3FE8AF61403F2EDC20427398EF916B5F' has a wrong offset!");

}

