#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TurnInPlace_AnimNotifyState

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TurnInPlace_AnimNotifyState.TurnInPlace_AnimNotifyState_C
// 0x0018 (0x0048 - 0x0030)
class UTurnInPlace_AnimNotifyState_C final : public UAnimNotifyState
{
public:
	class UCurveFloat*                            RotationCurveAsset;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRightTurn;                                       // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TurnInPlace_AnimNotifyState_C">();
	}
	static class UTurnInPlace_AnimNotifyState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTurnInPlace_AnimNotifyState_C>();
	}
};
static_assert(alignof(UTurnInPlace_AnimNotifyState_C) == 0x000008, "Wrong alignment on UTurnInPlace_AnimNotifyState_C");
static_assert(sizeof(UTurnInPlace_AnimNotifyState_C) == 0x000048, "Wrong size on UTurnInPlace_AnimNotifyState_C");
static_assert(offsetof(UTurnInPlace_AnimNotifyState_C, RotationCurveAsset) == 0x000030, "Member 'UTurnInPlace_AnimNotifyState_C::RotationCurveAsset' has a wrong offset!");
static_assert(offsetof(UTurnInPlace_AnimNotifyState_C, Montage) == 0x000038, "Member 'UTurnInPlace_AnimNotifyState_C::Montage' has a wrong offset!");
static_assert(offsetof(UTurnInPlace_AnimNotifyState_C, IsRightTurn) == 0x000040, "Member 'UTurnInPlace_AnimNotifyState_C::IsRightTurn' has a wrong offset!");

}

