#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnlockedItemsWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UnlockedItemsWI.UnlockedItemsWI_C
// 0x0050 (0x02B0 - 0x0260)
class UUnlockedItemsWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Show;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             GridPanel_153;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             DoneShowing;                                       // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FPlayerCustomizationItemTableRow> ItemsUnlocked;                                     // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Count;                                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         In_Column;                                         // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColummSplitThreshold;                              // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DoneShowing__DelegateSignature();
	void ExecuteUbergraph_UnlockedItemsWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Show_Next_Unlocked();
	void Show_Unlocked(const TArray<struct FPlayerCustomizationItemTableRow>& ItemsToUnlock);
	void SetColummAndRowForPanel(class UPanelSlot* PanelSlot, int32 Count_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UnlockedItemsWI_C">();
	}
	static class UUnlockedItemsWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnlockedItemsWI_C>();
	}
};
static_assert(alignof(UUnlockedItemsWI_C) == 0x000008, "Wrong alignment on UUnlockedItemsWI_C");
static_assert(sizeof(UUnlockedItemsWI_C) == 0x0002B0, "Wrong size on UUnlockedItemsWI_C");
static_assert(offsetof(UUnlockedItemsWI_C, UberGraphFrame) == 0x000260, "Member 'UUnlockedItemsWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUnlockedItemsWI_C, Show) == 0x000268, "Member 'UUnlockedItemsWI_C::Show' has a wrong offset!");
static_assert(offsetof(UUnlockedItemsWI_C, GridPanel_153) == 0x000270, "Member 'UUnlockedItemsWI_C::GridPanel_153' has a wrong offset!");
static_assert(offsetof(UUnlockedItemsWI_C, Title) == 0x000278, "Member 'UUnlockedItemsWI_C::Title' has a wrong offset!");
static_assert(offsetof(UUnlockedItemsWI_C, DoneShowing) == 0x000280, "Member 'UUnlockedItemsWI_C::DoneShowing' has a wrong offset!");
static_assert(offsetof(UUnlockedItemsWI_C, ItemsUnlocked) == 0x000290, "Member 'UUnlockedItemsWI_C::ItemsUnlocked' has a wrong offset!");
static_assert(offsetof(UUnlockedItemsWI_C, Count) == 0x0002A0, "Member 'UUnlockedItemsWI_C::Count' has a wrong offset!");
static_assert(offsetof(UUnlockedItemsWI_C, In_Column) == 0x0002A4, "Member 'UUnlockedItemsWI_C::In_Column' has a wrong offset!");
static_assert(offsetof(UUnlockedItemsWI_C, ColummSplitThreshold) == 0x0002A8, "Member 'UUnlockedItemsWI_C::ColummSplitThreshold' has a wrong offset!");

}

