#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnlockedItemsEntryWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UnlockedItemsEntryWI.UnlockedItemsEntryWI_C.ExecuteUbergraph_UnlockedItemsEntryWI
// 0x0098 (0x0098 - 0x0000)
struct UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0008(0x0088)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI) == 0x000008, "Wrong alignment on UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI");
static_assert(sizeof(UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI) == 0x000098, "Wrong size on UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI");
static_assert(offsetof(UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI, EntryPoint) == 0x000000, "Member 'UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI, K2Node_MakeStruct_SlateBrush) == 0x000008, "Member 'UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI, CallFunc_PlayAnimation_ReturnValue) == 0x000090, "Member 'UnlockedItemsEntryWI_C_ExecuteUbergraph_UnlockedItemsEntryWI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

