#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnlockedItemsWI

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UnlockedItemsWI.UnlockedItemsWI_C.ExecuteUbergraph_UnlockedItemsWI
// 0x0098 (0x0098 - 0x0000)
struct UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnlockedItemsEntryWI_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnlockedItemsEntryWI_C*                CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlayerCustomizationItemTableRow> K2Node_CustomEvent_ItemsToUnlock;                  // 0x0030(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI) == 0x000008, "Wrong alignment on UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI");
static_assert(sizeof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI) == 0x000098, "Wrong size on UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, EntryPoint) == 0x000000, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, Temp_int_Variable) == 0x000018, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, Temp_int_Variable_1) == 0x000024, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, Temp_int_Variable_2) == 0x000028, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, K2Node_CustomEvent_ItemsToUnlock) == 0x000030, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::K2Node_CustomEvent_ItemsToUnlock' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_GetDisplayName_ReturnValue) == 0x000048, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00005C, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, K2Node_Event_IsDesignTime) == 0x00005D, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_PlayAnimationForward_ReturnValue) == 0x000078, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_Add_IntInt_ReturnValue_2) == 0x000080, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_AddChild_ReturnValue) == 0x000088, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI, CallFunc_AddChild_ReturnValue_1) == 0x000090, "Member 'UnlockedItemsWI_C_ExecuteUbergraph_UnlockedItemsWI::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function UnlockedItemsWI.UnlockedItemsWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UnlockedItemsWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UnlockedItemsWI_C_PreConstruct) == 0x000001, "Wrong alignment on UnlockedItemsWI_C_PreConstruct");
static_assert(sizeof(UnlockedItemsWI_C_PreConstruct) == 0x000001, "Wrong size on UnlockedItemsWI_C_PreConstruct");
static_assert(offsetof(UnlockedItemsWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UnlockedItemsWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UnlockedItemsWI.UnlockedItemsWI_C.Show Unlocked
// 0x0010 (0x0010 - 0x0000)
struct UnlockedItemsWI_C_Show_Unlocked final
{
public:
	TArray<struct FPlayerCustomizationItemTableRow> ItemsToUnlock;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UnlockedItemsWI_C_Show_Unlocked) == 0x000008, "Wrong alignment on UnlockedItemsWI_C_Show_Unlocked");
static_assert(sizeof(UnlockedItemsWI_C_Show_Unlocked) == 0x000010, "Wrong size on UnlockedItemsWI_C_Show_Unlocked");
static_assert(offsetof(UnlockedItemsWI_C_Show_Unlocked, ItemsToUnlock) == 0x000000, "Member 'UnlockedItemsWI_C_Show_Unlocked::ItemsToUnlock' has a wrong offset!");

// Function UnlockedItemsWI.UnlockedItemsWI_C.SetColummAndRowForPanel
// 0x0040 (0x0040 - 0x0000)
struct UnlockedItemsWI_C_SetColummAndRowForPanel final
{
public:
	class UPanelSlot*                             PanelSlot;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              K2Node_DynamicCast_AsGrid_Slot;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UnlockedItemsWI_C_SetColummAndRowForPanel) == 0x000008, "Wrong alignment on UnlockedItemsWI_C_SetColummAndRowForPanel");
static_assert(sizeof(UnlockedItemsWI_C_SetColummAndRowForPanel) == 0x000040, "Wrong size on UnlockedItemsWI_C_SetColummAndRowForPanel");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, PanelSlot) == 0x000000, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::PanelSlot' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, Count_0) == 0x000008, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::Count_0' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, Temp_bool_Variable) == 0x00000C, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, K2Node_DynamicCast_AsGrid_Slot) == 0x000018, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::K2Node_DynamicCast_AsGrid_Slot' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, Temp_bool_Variable_1) == 0x000021, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, Temp_int_Variable) == 0x000024, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, Temp_int_Variable_1) == 0x000028, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000030, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, K2Node_Select_Default) == 0x000034, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UnlockedItemsWI_C_SetColummAndRowForPanel, K2Node_Select_Default_1) == 0x000038, "Member 'UnlockedItemsWI_C_SetColummAndRowForPanel::K2Node_Select_Default_1' has a wrong offset!");

}

