#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserInputSettingsBP

#include "Basic.hpp"

#include "SCT_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UserInputSettingsBP.UserInputSettingsBP_C
// 0x0020 (0x0268 - 0x0248)
class UUserInputSettingsBP_C final : public UUserInputSettings
{
public:
	class FName                                   InvertYName;                                       // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InvertXName;                                       // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CameraYName;                                       // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CameraXName;                                       // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Get_Invert_Scale(class FName EntryName, float* Output);
	void Set_Camera_Inversion(class FName CameraInputName, class FName InversionName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UserInputSettingsBP_C">();
	}
	static class UUserInputSettingsBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserInputSettingsBP_C>();
	}
};
static_assert(alignof(UUserInputSettingsBP_C) == 0x000008, "Wrong alignment on UUserInputSettingsBP_C");
static_assert(sizeof(UUserInputSettingsBP_C) == 0x000268, "Wrong size on UUserInputSettingsBP_C");
static_assert(offsetof(UUserInputSettingsBP_C, InvertYName) == 0x000248, "Member 'UUserInputSettingsBP_C::InvertYName' has a wrong offset!");
static_assert(offsetof(UUserInputSettingsBP_C, InvertXName) == 0x000250, "Member 'UUserInputSettingsBP_C::InvertXName' has a wrong offset!");
static_assert(offsetof(UUserInputSettingsBP_C, CameraYName) == 0x000258, "Member 'UUserInputSettingsBP_C::CameraYName' has a wrong offset!");
static_assert(offsetof(UUserInputSettingsBP_C, CameraXName) == 0x000260, "Member 'UUserInputSettingsBP_C::CameraXName' has a wrong offset!");

}

