#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UtilityControllerFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function UtilityControllerFunctionLibrary.UtilityControllerFunctionLibrary_C.Get ROS Puzzle
// 0x0038 (0x0038 - 0x0000)
struct UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        ROS_Puzzle_Component;                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetROSController_ROSController_Actor;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIRunOnServerController_C> K2Node_DynamicCast_AsIRun_on_Server_Controller;    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_GetROSPuzzle_ROS_Puzzle_Component;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle) == 0x000008, "Wrong alignment on UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle");
static_assert(sizeof(UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle) == 0x000038, "Wrong size on UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle, __WorldContext) == 0x000000, "Member 'UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle, ROS_Puzzle_Component) == 0x000008, "Member 'UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle::ROS_Puzzle_Component' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle, CallFunc_GetROSController_ROSController_Actor) == 0x000010, "Member 'UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle::CallFunc_GetROSController_ROSController_Actor' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle, K2Node_DynamicCast_AsIRun_on_Server_Controller) == 0x000018, "Member 'UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle::K2Node_DynamicCast_AsIRun_on_Server_Controller' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle, CallFunc_GetROSPuzzle_ROS_Puzzle_Component) == 0x000030, "Member 'UtilityControllerFunctionLibrary_C_Get_ROS_Puzzle::CallFunc_GetROSPuzzle_ROS_Puzzle_Component' has a wrong offset!");

// Function UtilityControllerFunctionLibrary.UtilityControllerFunctionLibrary_C.Get Modall Window Manager
// 0x0020 (0x0020 - 0x0000)
struct UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubpc_ac_ModalWindowManager_C*           ModalWindowManagerComponent;                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubpc_ac_ModalWindowManager_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager) == 0x000008, "Wrong alignment on UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager");
static_assert(sizeof(UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager) == 0x000020, "Wrong size on UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager, __WorldContext) == 0x000000, "Member 'UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager, ModalWindowManagerComponent) == 0x000008, "Member 'UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager::ModalWindowManagerComponent' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'UtilityControllerFunctionLibrary_C_Get_Modall_Window_Manager::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function UtilityControllerFunctionLibrary.UtilityControllerFunctionLibrary_C.GetROSController
// 0x0050 (0x0050 - 0x0000)
struct UtilityControllerFunctionLibrary_C_GetROSController final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ROSController_Actor;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0010(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilityControllerFunctionLibrary_C_GetROSController) == 0x000008, "Wrong alignment on UtilityControllerFunctionLibrary_C_GetROSController");
static_assert(sizeof(UtilityControllerFunctionLibrary_C_GetROSController) == 0x000050, "Wrong size on UtilityControllerFunctionLibrary_C_GetROSController");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, __WorldContext) == 0x000000, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, ROSController_Actor) == 0x000008, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::ROSController_Actor' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000010, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, CallFunc_Array_Get_Item) == 0x000038, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000049, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityControllerFunctionLibrary_C_GetROSController, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'UtilityControllerFunctionLibrary_C_GetROSController::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

