#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VivoxMuteWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VivoxImpl_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VivoxMuteWI.VivoxMuteWI_C
// 0x0040 (0x02B0 - 0x0270)
class UVivoxMuteWI_C final : public UVivoxMuteUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UButton*                                Button_MuteToggle;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MuteOff;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MuteOn;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_MuteImage;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture*                               MuteOff;                                           // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               MuteOn;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           SCTPlayerState;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VivoxMuteWI(int32 EntryPoint);
	void BndEvt__Button_MuteToggle_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void OnMuteChanged(bool IsMuted_0);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetButtonImage(bool IsMuted_0);

	void GetMuteImage(bool IsMuted_0, class UTexture** Return) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VivoxMuteWI_C">();
	}
	static class UVivoxMuteWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVivoxMuteWI_C>();
	}
};
static_assert(alignof(UVivoxMuteWI_C) == 0x000008, "Wrong alignment on UVivoxMuteWI_C");
static_assert(sizeof(UVivoxMuteWI_C) == 0x0002B0, "Wrong size on UVivoxMuteWI_C");
static_assert(offsetof(UVivoxMuteWI_C, UberGraphFrame) == 0x000270, "Member 'UVivoxMuteWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVivoxMuteWI_C, Button_MuteToggle) == 0x000278, "Member 'UVivoxMuteWI_C::Button_MuteToggle' has a wrong offset!");
static_assert(offsetof(UVivoxMuteWI_C, Image_MuteOff) == 0x000280, "Member 'UVivoxMuteWI_C::Image_MuteOff' has a wrong offset!");
static_assert(offsetof(UVivoxMuteWI_C, Image_MuteOn) == 0x000288, "Member 'UVivoxMuteWI_C::Image_MuteOn' has a wrong offset!");
static_assert(offsetof(UVivoxMuteWI_C, WidgetSwitcher_MuteImage) == 0x000290, "Member 'UVivoxMuteWI_C::WidgetSwitcher_MuteImage' has a wrong offset!");
static_assert(offsetof(UVivoxMuteWI_C, MuteOff) == 0x000298, "Member 'UVivoxMuteWI_C::MuteOff' has a wrong offset!");
static_assert(offsetof(UVivoxMuteWI_C, MuteOn) == 0x0002A0, "Member 'UVivoxMuteWI_C::MuteOn' has a wrong offset!");
static_assert(offsetof(UVivoxMuteWI_C, SCTPlayerState) == 0x0002A8, "Member 'UVivoxMuteWI_C::SCTPlayerState' has a wrong offset!");

}

