#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoteGivenWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoteGivenWI.VoteGivenWI_C
// 0x0028 (0x0288 - 0x0260)
class UVoteGivenWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       ButtonVoted;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 VoteGiven;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VoteGivenFrame;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               VoteGivenGroup;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VoteGivenWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetVoted();
	void SetUnvoted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoteGivenWI_C">();
	}
	static class UVoteGivenWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteGivenWI_C>();
	}
};
static_assert(alignof(UVoteGivenWI_C) == 0x000008, "Wrong alignment on UVoteGivenWI_C");
static_assert(sizeof(UVoteGivenWI_C) == 0x000288, "Wrong size on UVoteGivenWI_C");
static_assert(offsetof(UVoteGivenWI_C, UberGraphFrame) == 0x000260, "Member 'UVoteGivenWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoteGivenWI_C, ButtonVoted) == 0x000268, "Member 'UVoteGivenWI_C::ButtonVoted' has a wrong offset!");
static_assert(offsetof(UVoteGivenWI_C, VoteGiven) == 0x000270, "Member 'UVoteGivenWI_C::VoteGiven' has a wrong offset!");
static_assert(offsetof(UVoteGivenWI_C, VoteGivenFrame) == 0x000278, "Member 'UVoteGivenWI_C::VoteGivenFrame' has a wrong offset!");
static_assert(offsetof(UVoteGivenWI_C, VoteGivenGroup) == 0x000280, "Member 'UVoteGivenWI_C::VoteGivenGroup' has a wrong offset!");

}

