#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VruumbaPreviewerAnimationTrackSCTBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function VruumbaPreviewerAnimationTrackSCTBP.VruumbaPreviewerAnimationTrackSCTBP_C.ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP
// 0x0038 (0x0038 - 0x0000)
struct VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVruumbaPreviewTrackAnimBP_C*           K2Node_DynamicCast_AsVruumba_Preview_Track_Anim_BP; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVruumbaPreviewTrackAnimBP_C*           K2Node_DynamicCast_AsVruumba_Preview_Track_Anim_BP_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP) == 0x000008, "Wrong alignment on VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP");
static_assert(sizeof(VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP) == 0x000038, "Wrong size on VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP");
static_assert(offsetof(VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP, EntryPoint) == 0x000000, "Member 'VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP, K2Node_DynamicCast_AsVruumba_Preview_Track_Anim_BP) == 0x000010, "Member 'VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP::K2Node_DynamicCast_AsVruumba_Preview_Track_Anim_BP' has a wrong offset!");
static_assert(offsetof(VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000020, "Member 'VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP, K2Node_DynamicCast_AsVruumba_Preview_Track_Anim_BP_1) == 0x000028, "Member 'VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP::K2Node_DynamicCast_AsVruumba_Preview_Track_Anim_BP_1' has a wrong offset!");
static_assert(offsetof(VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'VruumbaPreviewerAnimationTrackSCTBP_C_ExecuteUbergraph_VruumbaPreviewerAnimationTrackSCTBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

