#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VruumbaSpeedBooster

#include "Basic.hpp"


namespace SDK::Params
{

// Function VruumbaSpeedBooster.VruumbaSpeedBooster_C.CheckPointCleared__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct VruumbaSpeedBooster_C_CheckPointCleared__DelegateSignature final
{
public:
	int32                                         NextCheckPoint;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VruumbaSpeedBooster_C_CheckPointCleared__DelegateSignature) == 0x000004, "Wrong alignment on VruumbaSpeedBooster_C_CheckPointCleared__DelegateSignature");
static_assert(sizeof(VruumbaSpeedBooster_C_CheckPointCleared__DelegateSignature) == 0x000004, "Wrong size on VruumbaSpeedBooster_C_CheckPointCleared__DelegateSignature");
static_assert(offsetof(VruumbaSpeedBooster_C_CheckPointCleared__DelegateSignature, NextCheckPoint) == 0x000000, "Member 'VruumbaSpeedBooster_C_CheckPointCleared__DelegateSignature::NextCheckPoint' has a wrong offset!");

// Function VruumbaSpeedBooster.VruumbaSpeedBooster_C.ExecuteUbergraph_VruumbaSpeedBooster
// 0x0038 (0x0038 - 0x0000)
struct VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVruumbaSCTBP_C*                        K2Node_DynamicCast_AsVruumba_SCTBP;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster) == 0x000008, "Wrong alignment on VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster");
static_assert(sizeof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster) == 0x000038, "Wrong size on VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, EntryPoint) == 0x000000, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::EntryPoint' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, K2Node_DynamicCast_AsVruumba_SCTBP) == 0x000028, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::K2Node_DynamicCast_AsVruumba_SCTBP' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, CallFunc_IsLocallyControlled_ReturnValue) == 0x000031, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster, Temp_bool_IsClosed_Variable) == 0x000032, "Member 'VruumbaSpeedBooster_C_ExecuteUbergraph_VruumbaSpeedBooster::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function VruumbaSpeedBooster.VruumbaSpeedBooster_C.BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'VruumbaSpeedBooster_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

}

