#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_MenuCarousel_Item

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_MenuCarousel_Item.WI_MenuCarousel_Item_C.ExecuteUbergraph_WI_MenuCarousel_Item
// 0x0058 (0x0058 - 0x0000)
struct WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      K2Node_CustomEvent_Texture_1;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      K2Node_CustomEvent_Texture;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture2DDynamic* Texture)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture2DDynamic*                      Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture2DDynamic* Texture)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UAsyncTaskDownloadImage*                CallFunc_DownloadImage_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item) == 0x000008, "Wrong alignment on WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item");
static_assert(sizeof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item) == 0x000058, "Wrong size on WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item");
static_assert(offsetof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item, EntryPoint) == 0x000000, "Member 'WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item, K2Node_CustomEvent_Texture_1) == 0x000008, "Member 'WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item::K2Node_CustomEvent_Texture_1' has a wrong offset!");
static_assert(offsetof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item, K2Node_CustomEvent_Texture) == 0x000010, "Member 'WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item, Temp_object_Variable) == 0x000028, "Member 'WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item, CallFunc_BreakVector2D_X) == 0x000030, "Member 'WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item, CallFunc_BreakVector2D_Y) == 0x000034, "Member 'WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item, CallFunc_DownloadImage_ReturnValue) == 0x000048, "Member 'WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item::CallFunc_DownloadImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WI_MenuCarousel_Item_C_ExecuteUbergraph_WI_MenuCarousel_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WI_MenuCarousel_Item.WI_MenuCarousel_Item_C.OnSuccess_A1A0D1B2476DAB043B251394FDB12910
// 0x0008 (0x0008 - 0x0000)
struct WI_MenuCarousel_Item_C_OnSuccess_A1A0D1B2476DAB043B251394FDB12910 final
{
public:
	class UTexture2DDynamic*                      Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MenuCarousel_Item_C_OnSuccess_A1A0D1B2476DAB043B251394FDB12910) == 0x000008, "Wrong alignment on WI_MenuCarousel_Item_C_OnSuccess_A1A0D1B2476DAB043B251394FDB12910");
static_assert(sizeof(WI_MenuCarousel_Item_C_OnSuccess_A1A0D1B2476DAB043B251394FDB12910) == 0x000008, "Wrong size on WI_MenuCarousel_Item_C_OnSuccess_A1A0D1B2476DAB043B251394FDB12910");
static_assert(offsetof(WI_MenuCarousel_Item_C_OnSuccess_A1A0D1B2476DAB043B251394FDB12910, Texture) == 0x000000, "Member 'WI_MenuCarousel_Item_C_OnSuccess_A1A0D1B2476DAB043B251394FDB12910::Texture' has a wrong offset!");

// Function WI_MenuCarousel_Item.WI_MenuCarousel_Item_C.OnFail_A1A0D1B2476DAB043B251394FDB12910
// 0x0008 (0x0008 - 0x0000)
struct WI_MenuCarousel_Item_C_OnFail_A1A0D1B2476DAB043B251394FDB12910 final
{
public:
	class UTexture2DDynamic*                      Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MenuCarousel_Item_C_OnFail_A1A0D1B2476DAB043B251394FDB12910) == 0x000008, "Wrong alignment on WI_MenuCarousel_Item_C_OnFail_A1A0D1B2476DAB043B251394FDB12910");
static_assert(sizeof(WI_MenuCarousel_Item_C_OnFail_A1A0D1B2476DAB043B251394FDB12910) == 0x000008, "Wrong size on WI_MenuCarousel_Item_C_OnFail_A1A0D1B2476DAB043B251394FDB12910");
static_assert(offsetof(WI_MenuCarousel_Item_C_OnFail_A1A0D1B2476DAB043B251394FDB12910, Texture) == 0x000000, "Member 'WI_MenuCarousel_Item_C_OnFail_A1A0D1B2476DAB043B251394FDB12910::Texture' has a wrong offset!");

}

