#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_MenuCarousel_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_MenuCarousel_Item.WI_MenuCarousel_Item_C
// 0x0070 (0x02D0 - 0x0260)
class UWI_MenuCarousel_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class USizeBox*                               ItemSizeBox;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MessageBackground;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MessageText;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x0280(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FVector2D                              ParentSize;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 MessageBackgroundUrl;                              // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 MessageLink;                                       // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ItemBrushSet;                                      // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ItemBrushSet__DelegateSignature();
	void ExecuteUbergraph_WI_MenuCarousel_Item(int32 EntryPoint);
	void UpdateBackgroundImage();
	void Construct();
	void OnSuccess_A1A0D1B2476DAB043B251394FDB12910(class UTexture2DDynamic* Texture);
	void OnFail_A1A0D1B2476DAB043B251394FDB12910(class UTexture2DDynamic* Texture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_MenuCarousel_Item_C">();
	}
	static class UWI_MenuCarousel_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_MenuCarousel_Item_C>();
	}
};
static_assert(alignof(UWI_MenuCarousel_Item_C) == 0x000008, "Wrong alignment on UWI_MenuCarousel_Item_C");
static_assert(sizeof(UWI_MenuCarousel_Item_C) == 0x0002D0, "Wrong size on UWI_MenuCarousel_Item_C");
static_assert(offsetof(UWI_MenuCarousel_Item_C, UberGraphFrame) == 0x000260, "Member 'UWI_MenuCarousel_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_Item_C, ItemSizeBox) == 0x000268, "Member 'UWI_MenuCarousel_Item_C::ItemSizeBox' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_Item_C, MessageBackground) == 0x000270, "Member 'UWI_MenuCarousel_Item_C::MessageBackground' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_Item_C, MessageText) == 0x000278, "Member 'UWI_MenuCarousel_Item_C::MessageText' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_Item_C, Message) == 0x000280, "Member 'UWI_MenuCarousel_Item_C::Message' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_Item_C, ParentSize) == 0x000298, "Member 'UWI_MenuCarousel_Item_C::ParentSize' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_Item_C, MessageBackgroundUrl) == 0x0002A0, "Member 'UWI_MenuCarousel_Item_C::MessageBackgroundUrl' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_Item_C, MessageLink) == 0x0002B0, "Member 'UWI_MenuCarousel_Item_C::MessageLink' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_Item_C, ItemBrushSet) == 0x0002C0, "Member 'UWI_MenuCarousel_Item_C::ItemBrushSet' has a wrong offset!");

}

