#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_MenuCarousel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_MenuCarousel.WI_MenuCarousel_C
// 0x0078 (0x02D8 - 0x0260)
class UWI_MenuCarousel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UButton*                                ActiveLink;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              CM_ClickableSubTitleWI;                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ItemDots;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LinkScaleBox;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             MessageScroller;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWI_MenuCarousel_Item_C*>        ItemWidgets;                                       // 0x0290(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         SelectedItem;                                      // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChangeDelay;                                       // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             AllServiceMessagesLoaded;                          // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector2D                              SizeBoxSize;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWI_MenuCarousel_Item_Dot_C*>    ItemDotList;                                       // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           AutoSwapTimer;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void AllServiceMessagesLoaded__DelegateSignature();
	void ExecuteUbergraph_WI_MenuCarousel(int32 EntryPoint);
	void OnConnectionFailed(int32 StatusCode, const class FString& Reason, bool WasClean);
	void OnDotClicked(int32 DotIndex);
	void OnGamepadPressed();
	void FirstBrushSet();
	void OnClientLoggedIn();
	void BndEvt__WI_MenuCarousel_ActiveLink_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnSuccess_6179390042E29A628F440C96606BBEAF(const TArray<struct FFCTServiceMessage>& AllServiceMessages, int32 Code, const class FString& Message);
	void OnError_6179390042E29A628F440C96606BBEAF(const TArray<struct FFCTServiceMessage>& AllServiceMessages, int32 Code, const class FString& Message);
	void ChangeToNextServiceMessage();
	void GetSelectedItemDot(class UWI_MenuCarousel_Item_Dot_C** Output);
	void ChangeToPreviousServiceMessage();
	void SetSelectedItem();
	void SetAutoSwapTimer();
	void ValidateAndClearTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_MenuCarousel_C">();
	}
	static class UWI_MenuCarousel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_MenuCarousel_C>();
	}
};
static_assert(alignof(UWI_MenuCarousel_C) == 0x000008, "Wrong alignment on UWI_MenuCarousel_C");
static_assert(sizeof(UWI_MenuCarousel_C) == 0x0002D8, "Wrong size on UWI_MenuCarousel_C");
static_assert(offsetof(UWI_MenuCarousel_C, UberGraphFrame) == 0x000260, "Member 'UWI_MenuCarousel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ActiveLink) == 0x000268, "Member 'UWI_MenuCarousel_C::ActiveLink' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, CM_ClickableSubTitleWI) == 0x000270, "Member 'UWI_MenuCarousel_C::CM_ClickableSubTitleWI' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ItemDots) == 0x000278, "Member 'UWI_MenuCarousel_C::ItemDots' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, LinkScaleBox) == 0x000280, "Member 'UWI_MenuCarousel_C::LinkScaleBox' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, MessageScroller) == 0x000288, "Member 'UWI_MenuCarousel_C::MessageScroller' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ItemWidgets) == 0x000290, "Member 'UWI_MenuCarousel_C::ItemWidgets' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, SelectedItem) == 0x0002A0, "Member 'UWI_MenuCarousel_C::SelectedItem' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ChangeDelay) == 0x0002A4, "Member 'UWI_MenuCarousel_C::ChangeDelay' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, AllServiceMessagesLoaded) == 0x0002A8, "Member 'UWI_MenuCarousel_C::AllServiceMessagesLoaded' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, SizeBoxSize) == 0x0002B8, "Member 'UWI_MenuCarousel_C::SizeBoxSize' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ItemDotList) == 0x0002C0, "Member 'UWI_MenuCarousel_C::ItemDotList' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, AutoSwapTimer) == 0x0002D0, "Member 'UWI_MenuCarousel_C::AutoSwapTimer' has a wrong offset!");

}

