#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PassengerLog

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_PassengerLog.WI_PassengerLog_C.ExecuteUbergraph_WI_PassengerLog
// 0x00D0 (0x00D0 - 0x0000)
struct WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0050(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0068(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x00B0(0x001C)(NoDestructor)
};
static_assert(alignof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog) == 0x000008, "Wrong alignment on WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog");
static_assert(sizeof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog) == 0x0000D0, "Wrong size on WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, EntryPoint) == 0x000000, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000020, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000038, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000050, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000068, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_PlayAnimation_ReturnValue_1) == 0x000088, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_GetViewportSize_ReturnValue) == 0x000090, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_BreakVector2D_X) == 0x000098, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_BreakVector2D_Y) == 0x00009C, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A0, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000A4, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, CallFunc_MakeVector2D_ReturnValue) == 0x0000A8, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog, K2Node_MakeStruct_WidgetTransform) == 0x0000B0, "Member 'WI_PassengerLog_C_ExecuteUbergraph_WI_PassengerLog::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");

}

