#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldInteractableWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WorldInteractableWI.WorldInteractableWI_C
// 0x0060 (0x02C0 - 0x0260)
class UWorldInteractableWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCanvasPanel*                           Canvas_Location;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Vertical_EntryContainer;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UContextStaticMeshComponent*            ContextStaticMesh;                                 // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FBoundContextSpec                      SpecActor;                                         // 0x0280(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_WorldInteractableWI(int32 EntryPoint);
	void Add_Entry(const struct FKey& Key, class UPower* Power);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void GetSpecDescriptionAndKey(class FText* Description, class FText* Key);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WorldInteractableWI_C">();
	}
	static class UWorldInteractableWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldInteractableWI_C>();
	}
};
static_assert(alignof(UWorldInteractableWI_C) == 0x000008, "Wrong alignment on UWorldInteractableWI_C");
static_assert(sizeof(UWorldInteractableWI_C) == 0x0002C0, "Wrong size on UWorldInteractableWI_C");
static_assert(offsetof(UWorldInteractableWI_C, UberGraphFrame) == 0x000260, "Member 'UWorldInteractableWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWorldInteractableWI_C, Canvas_Location) == 0x000268, "Member 'UWorldInteractableWI_C::Canvas_Location' has a wrong offset!");
static_assert(offsetof(UWorldInteractableWI_C, Vertical_EntryContainer) == 0x000270, "Member 'UWorldInteractableWI_C::Vertical_EntryContainer' has a wrong offset!");
static_assert(offsetof(UWorldInteractableWI_C, ContextStaticMesh) == 0x000278, "Member 'UWorldInteractableWI_C::ContextStaticMesh' has a wrong offset!");
static_assert(offsetof(UWorldInteractableWI_C, SpecActor) == 0x000280, "Member 'UWorldInteractableWI_C::SpecActor' has a wrong offset!");

}

