#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldInteractableWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WorldInteractableWI.WorldInteractableWI_C.ExecuteUbergraph_WorldInteractableWI
// 0x00C8 (0x00C8 - 0x0000)
struct WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_CustomEvent_Key;                            // 0x0078(0x0018)(HasGetValueTypeHash)
	class UPower*                                 K2Node_CustomEvent_Power;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableEntryWI_C*                 CallFunc_Create_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI) == 0x000008, "Wrong alignment on WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI");
static_assert(sizeof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI) == 0x0000C8, "Wrong size on WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, EntryPoint) == 0x000000, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, K2Node_Event_MyGeometry) == 0x000004, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000044, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x000064, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x00006C, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000070, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, K2Node_CustomEvent_Key) == 0x000078, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::K2Node_CustomEvent_Key' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, K2Node_CustomEvent_Power) == 0x000090, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::K2Node_CustomEvent_Power' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_GetPlayerController_ReturnValue_1) == 0x000098, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_GetViewportScale_ReturnValue) == 0x0000A0, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_Create_ReturnValue) == 0x0000A8, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x0000B4, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000C0, "Member 'WorldInteractableWI_C_ExecuteUbergraph_WorldInteractableWI::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WorldInteractableWI.WorldInteractableWI_C.Add Entry
// 0x0020 (0x0020 - 0x0000)
struct WorldInteractableWI_C_Add_Entry final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UPower*                                 Power;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldInteractableWI_C_Add_Entry) == 0x000008, "Wrong alignment on WorldInteractableWI_C_Add_Entry");
static_assert(sizeof(WorldInteractableWI_C_Add_Entry) == 0x000020, "Wrong size on WorldInteractableWI_C_Add_Entry");
static_assert(offsetof(WorldInteractableWI_C_Add_Entry, Key) == 0x000000, "Member 'WorldInteractableWI_C_Add_Entry::Key' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_Add_Entry, Power) == 0x000018, "Member 'WorldInteractableWI_C_Add_Entry::Power' has a wrong offset!");

// Function WorldInteractableWI.WorldInteractableWI_C.Tick
// 0x003C (0x003C - 0x0000)
struct WorldInteractableWI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldInteractableWI_C_Tick) == 0x000004, "Wrong alignment on WorldInteractableWI_C_Tick");
static_assert(sizeof(WorldInteractableWI_C_Tick) == 0x00003C, "Wrong size on WorldInteractableWI_C_Tick");
static_assert(offsetof(WorldInteractableWI_C_Tick, MyGeometry) == 0x000000, "Member 'WorldInteractableWI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_Tick, InDeltaTime) == 0x000038, "Member 'WorldInteractableWI_C_Tick::InDeltaTime' has a wrong offset!");

// Function WorldInteractableWI.WorldInteractableWI_C.GetSpecDescriptionAndKey
// 0x0060 (0x0060 - 0x0000)
struct WorldInteractableWI_C_GetSpecDescriptionAndKey final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   Key;                                               // 0x0018(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0048(0x0018)()
};
static_assert(alignof(WorldInteractableWI_C_GetSpecDescriptionAndKey) == 0x000008, "Wrong alignment on WorldInteractableWI_C_GetSpecDescriptionAndKey");
static_assert(sizeof(WorldInteractableWI_C_GetSpecDescriptionAndKey) == 0x000060, "Wrong size on WorldInteractableWI_C_GetSpecDescriptionAndKey");
static_assert(offsetof(WorldInteractableWI_C_GetSpecDescriptionAndKey, Description) == 0x000000, "Member 'WorldInteractableWI_C_GetSpecDescriptionAndKey::Description' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_GetSpecDescriptionAndKey, Key) == 0x000018, "Member 'WorldInteractableWI_C_GetSpecDescriptionAndKey::Key' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_GetSpecDescriptionAndKey, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WorldInteractableWI_C_GetSpecDescriptionAndKey::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldInteractableWI_C_GetSpecDescriptionAndKey, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000048, "Member 'WorldInteractableWI_C_GetSpecDescriptionAndKey::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");

}

