#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccelByteUe4Sdk

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JsonUtilities_structs.hpp"


namespace SDK
{

// Enum AccelByteUe4Sdk.EAccelByteItemCurrencyType
// NumValues: 0x0004
enum class EAccelByteItemCurrencyType : uint8
{
	NONE                                     = 0,
	REAL                                     = 1,
	VIRTUAL                                  = 2,
	EAccelByteItemCurrencyType_MAX           = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteItemType
// NumValues: 0x000A
enum class EAccelByteItemType : uint8
{
	NONE                                     = 0,
	APP                                      = 1,
	COINS                                    = 2,
	INGAMEITEM                               = 3,
	BUNDLE                                   = 4,
	CODE                                     = 5,
	SUBSCRIPTION                             = 6,
	SEASON                                   = 7,
	MEDIA                                    = 8,
	EAccelByteItemType_MAX                   = 9,
};

// Enum AccelByteUe4Sdk.EAccelByteItemStatus
// NumValues: 0x0004
enum class EAccelByteItemStatus : uint8
{
	NONE                                     = 0,
	ACTIVE                                   = 1,
	INACTIVE                                 = 2,
	EAccelByteItemStatus_MAX                 = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteEntitlementType
// NumValues: 0x0004
enum class EAccelByteEntitlementType : uint8
{
	NONE                                     = 0,
	DURABLE                                  = 1,
	CONSUMABLE                               = 2,
	EAccelByteEntitlementType_MAX            = 3,
};

// Enum AccelByteUe4Sdk.ESetByMetadataRecord
// NumValues: 0x0004
enum class ESetByMetadataRecord : uint8
{
	NONE                                     = 0,
	SERVER                                   = 1,
	CLIENT                                   = 2,
	ESetByMetadataRecord_MAX                 = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteCurrencyType
// NumValues: 0x0004
enum class EAccelByteCurrencyType : uint8
{
	NONE                                     = 0,
	REAL                                     = 1,
	VIRTUAL                                  = 2,
	EAccelByteCurrencyType_MAX               = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteAppType
// NumValues: 0x0006
enum class EAccelByteAppType : uint8
{
	NONE                                     = 0,
	GAME                                     = 1,
	SOFTWARE                                 = 2,
	DLC                                      = 3,
	DEMO                                     = 4,
	EAccelByteAppType_MAX                    = 5,
};

// Enum AccelByteUe4Sdk.EAccelByteEntitlementSource
// NumValues: 0x000B
enum class EAccelByteEntitlementSource : uint8
{
	NONE                                     = 0,
	PURCHASE                                 = 1,
	IAP                                      = 2,
	PROMOTION                                = 3,
	ACHIEVEMENT                              = 4,
	REFERRAL_BONUS                           = 5,
	REDEEM_CODE                              = 6,
	REWARD                                   = 7,
	GIFT                                     = 8,
	OTHER                                    = 9,
	EAccelByteEntitlementSource_MAX          = 10,
};

// Enum AccelByteUe4Sdk.EAccelByteEntitlementStatus
// NumValues: 0x0006
enum class EAccelByteEntitlementStatus : uint8
{
	NONE                                     = 0,
	ACTIVE                                   = 1,
	INACTIVE                                 = 2,
	CONSUMED                                 = 3,
	REVOKED                                  = 4,
	EAccelByteEntitlementStatus_MAX          = 5,
};

// Enum AccelByteUe4Sdk.EAccelByteEntitlementClass
// NumValues: 0x0006
enum class EAccelByteEntitlementClass : uint8
{
	NONE                                     = 0,
	APP                                      = 1,
	ENTITLEMENT                              = 2,
	CODE                                     = 3,
	MEDIA                                    = 4,
	EAccelByteEntitlementClass_MAX           = 5,
};

// Enum AccelByteUe4Sdk.ERelationshipStatusCode
// NumValues: 0x0005
enum class ERelationshipStatusCode : uint8
{
	Friend                                   = 3,
	Incoming                                 = 2,
	Outgoing                                 = 1,
	NotFriend                                = 0,
	ERelationshipStatusCode_MAX              = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteGroupType
// NumValues: 0x0005
enum class EAccelByteGroupType : uint8
{
	NONE                                     = 0,
	OPEN                                     = 1,
	PUBLIC                                   = 2,
	PRIVATE                                  = 3,
	EAccelByteGroupType_MAX                  = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteRuleCriteria
// NumValues: 0x0004
enum class EAccelByteRuleCriteria : uint8
{
	MINIMUM                                  = 0,
	MAXIMUM                                  = 1,
	EQUAL                                    = 2,
	EAccelByteRuleCriteria_MAX               = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteAllowedAction
// NumValues: 0x0008
enum class EAccelByteAllowedAction : uint8
{
	None                                     = 0,
	CreateGroup                              = 1,
	JoinGroup                                = 2,
	InviteUser                               = 3,
	KickUser                                 = 4,
	LeaveGroup                               = 5,
	ResponseJoinRequest                      = 6,
	EAccelByteAllowedAction_MAX              = 7,
};

// Enum AccelByteUe4Sdk.EAccelByteMatchmakingStatus
// NumValues: 0x0007
enum class EAccelByteMatchmakingStatus : uint8
{
	Unknown                                  = 0,
	Start                                    = 1,
	Timeout                                  = 2,
	Cancel                                   = 3,
	Done                                     = 4,
	Unavailable                              = 5,
	EAccelByteMatchmakingStatus_MAX          = 6,
};

// Enum AccelByteUe4Sdk.EAccelByteOrderStatus
// NumValues: 0x000D
enum class EAccelByteOrderStatus : uint8
{
	NONE                                     = 0,
	INIT                                     = 1,
	CHARGED                                  = 2,
	CHARGEBACK                               = 3,
	CHARGEBACK_REVERSED                      = 4,
	FULFILLED                                = 5,
	FULFILL_FAILED                           = 6,
	REFUNDING                                = 7,
	REFUNDED                                 = 8,
	REFUND_FAILED                            = 9,
	CLOSED                                   = 10,
	DELETED                                  = 11,
	EAccelByteOrderStatus_MAX                = 12,
};

// Enum AccelByteUe4Sdk.EAvailability
// NumValues: 0x0005
enum class EAvailability : uint8
{
	Offline                                  = 0,
	Online                                   = 1,
	Busy                                     = 2,
	Invisible                                = 3,
	EAvailability_MAX                        = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteSeasonPassRewardType
// NumValues: 0x0002
enum class EAccelByteSeasonPassRewardType : uint8
{
	ITEM                                     = 0,
	EAccelByteSeasonPassRewardType_MAX       = 1,
};

// Enum AccelByteUe4Sdk.EAccelByteSeasonPassStatus
// NumValues: 0x0004
enum class EAccelByteSeasonPassStatus : uint8
{
	DRAFT                                    = 0,
	PUBLISHED                                = 1,
	RETIRED                                  = 2,
	EAccelByteSeasonPassStatus_MAX           = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteMatchmakingSessionStatus
// NumValues: 0x0009
enum class EAccelByteMatchmakingSessionStatus : uint8
{
	None                                     = 0,
	Matched                                  = 1,
	Done                                     = 2,
	Cancel                                   = 3,
	Timeout                                  = 4,
	SessionInQueue                           = 5,
	SessionFull                              = 6,
	SessionTimeout                           = 7,
	EAccelByteMatchmakingSessionStatus_MAX   = 8,
};

// Enum AccelByteUe4Sdk.EAccelByteAchievementListSortBy
// NumValues: 0x000B
enum class EAccelByteAchievementListSortBy : uint8
{
	NONE                                     = 0,
	LISTORDER                                = 1,
	LISTORDER_ASC                            = 2,
	LISTORDER_DESC                           = 3,
	CREATED_AT                               = 4,
	CREATED_AT_ASC                           = 5,
	CREATED_AT_DESC                          = 6,
	UPDATED_AT                               = 7,
	UPDATED_AT_ASC                           = 8,
	UPDATED_AT_DESC                          = 9,
	EAccelByteAchievementListSortBy_MAX      = 10,
};

// Enum AccelByteUe4Sdk.EAccelByteItemListSortBy
// NumValues: 0x000D
enum class EAccelByteItemListSortBy : uint8
{
	NONE                                     = 0,
	NAME                                     = 1,
	NAME_DESC                                = 2,
	CREATEDAT                                = 3,
	CREATEDAT_ASC                            = 4,
	CREATEDAT_DESC                           = 5,
	UPDATEDAT                                = 6,
	UPDATEDAT_ASC                            = 7,
	UPDATEDAT_DESC                           = 8,
	DISPLAYORDER                             = 9,
	DISPLAYORDER_ASC                         = 10,
	DISPLAYORDER_DESC                        = 11,
	EAccelByteItemListSortBy_MAX             = 12,
};

// Enum AccelByteUe4Sdk.EAccelByteRewardListSortBy
// NumValues: 0x0008
enum class EAccelByteRewardListSortBy : uint8
{
	NONE                                     = 0,
	NAMESPACE                                = 1,
	NAMESPACE_ASC                            = 2,
	NAMESPACE_DESC                           = 3,
	REWARDCODE                               = 4,
	REWARDCODE_ASC                           = 5,
	REWARDCODE_DESC                          = 6,
	EAccelByteRewardListSortBy_MAX           = 7,
};

// Enum AccelByteUe4Sdk.EAccelByteFileType
// NumValues: 0x0009
enum class EAccelByteFileType : uint8
{
	JPEG                                     = 0,
	JPG                                      = 1,
	PNG                                      = 2,
	BMP                                      = 3,
	GIF                                      = 4,
	MP3                                      = 5,
	BIN                                      = 6,
	WEBP                                     = 7,
	EAccelByteFileType_MAX                   = 8,
};

// Enum AccelByteUe4Sdk.UEnumServerType
// NumValues: 0x0004
enum class EUEnumServerType : uint8
{
	NONE                                     = 0,
	CLOUDSERVER                              = 1,
	LOCALSERVER                              = 2,
	UEnumServerType_MAX                      = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteAgreementPolicyType
// NumValues: 0x0004
enum class EAccelByteAgreementPolicyType : uint8
{
	EMPTY                                    = 0,
	LEGAL_DOCUMENT_TYPE                      = 1,
	MARKETING_PREFERENCE_TYPE                = 2,
	EAccelByteAgreementPolicyType_MAX        = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteWalletTable
// NumValues: 0x000C
enum class EAccelByteWalletTable : uint8
{
	Playstation                              = 0,
	Xbox                                     = 1,
	Steam                                    = 2,
	Epic                                     = 3,
	Stadia                                   = 4,
	IOS                                      = 5,
	GooglePlay                               = 6,
	Twitch                                   = 7,
	System                                   = 8,
	Nintendo                                 = 9,
	Other                                    = 10,
	EAccelByteWalletTable_MAX                = 11,
};

// Enum AccelByteUe4Sdk.EAccelByteWalletAction
// NumValues: 0x0005
enum class EAccelByteWalletAction : uint8
{
	NONE                                     = 0,
	CREDIT                                   = 1,
	PAYMENT                                  = 2,
	DEBIT                                    = 3,
	EAccelByteWalletAction_MAX               = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteSeasonType
// NumValues: 0x0003
enum class EAccelByteSeasonType : uint8
{
	PASS                                     = 0,
	TIER                                     = 1,
	EAccelByteSeasonType_MAX                 = 2,
};

// Enum AccelByteUe4Sdk.EAccelBytePlatformSync
// NumValues: 0x0007
enum class EAccelBytePlatformSync : uint8
{
	STEAM                                    = 0,
	XBOX_LIVE                                = 1,
	PLAYSTATION                              = 2,
	STADIA                                   = 3,
	EPIC_GAMES                               = 4,
	OTHER                                    = 5,
	EAccelBytePlatformSync_MAX               = 6,
};

// Enum AccelByteUe4Sdk.EAccelByteSubscriptionCycle
// NumValues: 0x0005
enum class EAccelByteSubscriptionCycle : uint8
{
	WEEKLY                                   = 0,
	MONTHLY                                  = 1,
	QUARTERLY                                = 2,
	YEARLY                                   = 3,
	EAccelByteSubscriptionCycle_MAX          = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteCreditUserWalletSource
// NumValues: 0x0009
enum class EAccelByteCreditUserWalletSource : uint8
{
	PURCHASE                                 = 0,
	IAP                                      = 1,
	PROMOTION                                = 2,
	ACHIEVEMENT                              = 3,
	REFERRAL_BONUS                           = 4,
	REDEEM_CODE                              = 5,
	REFUND                                   = 6,
	OTHER                                    = 7,
	EAccelByteCreditUserWalletSource_MAX     = 8,
};

// Enum AccelByteUe4Sdk.EAccelByteItemSource
// NumValues: 0x0009
enum class EAccelByteItemSource : uint8
{
	NONE                                     = 0,
	PURCHASE                                 = 1,
	IAP                                      = 2,
	PROMOTION                                = 3,
	ACHIEVEMENT                              = 4,
	REFERRAL_BONUS                           = 5,
	REDEEM_CODE                              = 6,
	OTHER                                    = 7,
	EAccelByteItemSource_MAX                 = 8,
};

// Enum AccelByteUe4Sdk.ESettingsEnvironment
// NumValues: 0x0005
enum class ESettingsEnvironment : uint8
{
	Development                              = 0,
	Certification                            = 1,
	Production                               = 2,
	Default                                  = 3,
	ESettingsEnvironment_MAX                 = 4,
};

// Enum AccelByteUe4Sdk.EAccelBytePaginationType
// NumValues: 0x0004
enum class EAccelBytePaginationType : uint8
{
	FIRST                                    = 0,
	NEXT                                     = 1,
	PREVIOUS                                 = 2,
	EAccelBytePaginationType_MAX             = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteGroupListSortBy
// NumValues: 0x000B
enum class EAccelByteGroupListSortBy : uint8
{
	NONE                                     = 0,
	LISTORDER                                = 1,
	LISTORDER_ASC                            = 2,
	LISTORDER_DESC                           = 3,
	CREATED_AT                               = 4,
	CREATED_AT_ASC                           = 5,
	CREATED_AT_DESC                          = 6,
	UPDATED_AT                               = 7,
	UPDATED_AT_ASC                           = 8,
	UPDATED_AT_DESC                          = 9,
	EAccelByteGroupListSortBy_MAX            = 10,
};

// Enum AccelByteUe4Sdk.EAccelByteLeaderboardTimeFrame
// NumValues: 0x0006
enum class EAccelByteLeaderboardTimeFrame : uint8
{
	ALL_TIME                                 = 0,
	CURRENT_SEASON                           = 1,
	CURRENT_MONTH                            = 2,
	CURRENT_WEEK                             = 3,
	TODAY                                    = 4,
	EAccelByteLeaderboardTimeFrame_MAX       = 5,
};

// Enum AccelByteUe4Sdk.EAccelByteReportingCategory
// NumValues: 0x0003
enum class EAccelByteReportingCategory : uint8
{
	UGC                                      = 0,
	USER                                     = 1,
	EAccelByteReportingCategory_MAX          = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteSeasonPassSource
// NumValues: 0x0003
enum class EAccelByteSeasonPassSource : uint8
{
	SWEAT                                    = 0,
	PAID_FOR                                 = 1,
	EAccelByteSeasonPassSource_MAX           = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteSeasonPassStrategyMethod
// NumValues: 0x0003
enum class EAccelByteSeasonPassStrategyMethod : uint8
{
	NONE                                     = 0,
	CURRENCY                                 = 1,
	EAccelByteSeasonPassStrategyMethod_MAX   = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteSessionType
// NumValues: 0x0004
enum class EAccelByteSessionType : uint8
{
	NONE                                     = 0,
	P2p                                      = 1,
	Dedicated                                = 2,
	EAccelByteSessionType_MAX                = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteStatisticStatus
// NumValues: 0x0003
enum class EAccelByteStatisticStatus : uint8
{
	INIT                                     = 0,
	TIED                                     = 1,
	EAccelByteStatisticStatus_MAX            = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteStatisticSetBy
// NumValues: 0x0003
enum class EAccelByteStatisticSetBy : uint8
{
	CLIENT                                   = 0,
	SERVER                                   = 1,
	EAccelByteStatisticSetBy_MAX             = 2,
};

// Enum AccelByteUe4Sdk.EVerificationContext
// NumValues: 0x0004
enum class EVerificationContext : uint8
{
	UserAccountRegistration                  = 0,
	UpdateEmailAddress                       = 1,
	UpgradeHeadlessAccount                   = 2,
	EVerificationContext_MAX                 = 3,
};

// Enum AccelByteUe4Sdk.EBanReason
// NumValues: 0x000D
enum class EBanReason : uint8
{
	VIOLENCE                                 = 0,
	HARASSMENT                               = 1,
	HATEFUL_CONDUCT                          = 2,
	OFFENSIVE_USERNAME                       = 3,
	IMPERSONATION                            = 4,
	MALICIOUS_CONTENT                        = 5,
	SEXUALLY_SUGGESTIVE                      = 6,
	SEXUAL_VIOLENCE                          = 7,
	EXTREME_VIOLENCE                         = 8,
	UNDERAGE_USER                            = 9,
	CHEATING                                 = 10,
	TOS_VIOLATION                            = 11,
	EBanReason_MAX                           = 12,
};

// Enum AccelByteUe4Sdk.EBanType
// NumValues: 0x0009
enum class EBanType : uint8
{
	LOGIN                                    = 0,
	CHAT_SEND                                = 1,
	CHAT_ALL                                 = 2,
	ORDER_AND_PAYMENT                        = 3,
	STATISTIC                                = 4,
	LEADERBOARD                              = 5,
	MATCHMAKING                              = 6,
	UGC_CREATE_UPDATE                        = 7,
	EBanType_MAX                             = 8,
};

// Enum AccelByteUe4Sdk.EAccelByteSearchType
// NumValues: 0x0004
enum class EAccelByteSearchType : uint8
{
	ALL                                      = 0,
	DISPLAYNAME                              = 1,
	USERNAME                                 = 2,
	EAccelByteSearchType_MAX                 = 3,
};

// Enum AccelByteUe4Sdk.EAccelBytePlatformType
// NumValues: 0x0015
enum class EAccelBytePlatformType : uint8
{
	Steam                                    = 0,
	PS4                                      = 1,
	PS4CrossGen                              = 2,
	PS5                                      = 3,
	Live                                     = 4,
	Google                                   = 5,
	Apple                                    = 6,
	Facebook                                 = 7,
	Android                                  = 8,
	IOS                                      = 9,
	Device                                   = 10,
	Twitch                                   = 11,
	Oculus                                   = 12,
	Twitter                                  = 13,
	EpicGames                                = 14,
	Stadia                                   = 15,
	AwsCognito                               = 16,
	Discord                                  = 17,
	Nintendo                                 = 18,
	SnapChat                                 = 19,
	EAccelBytePlatformType_MAX               = 20,
};

// Enum AccelByteUe4Sdk.EAccelByteLoginAuthFactorType
// NumValues: 0x0003
enum class EAccelByteLoginAuthFactorType : uint8
{
	Authenticator                            = 0,
	BackupCode                               = 1,
	EAccelByteLoginAuthFactorType_MAX        = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteUploadCategory
// NumValues: 0x0003
enum class EAccelByteUploadCategory : uint8
{
	DEFAULT                                  = 0,
	REPORTING                                = 1,
	EAccelByteUploadCategory_MAX             = 2,
};

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsUserAchievement
// 0x0088 (0x0088 - 0x0000)
struct FAccelByteModelsUserAchievement final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Name;                                              // 0x0010(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 AchievementCode;                                   // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AchievedAt;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LatestValue;                                       // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Status;                                            // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsUserAchievement) == 0x000008, "Wrong alignment on FAccelByteModelsUserAchievement");
static_assert(sizeof(FAccelByteModelsUserAchievement) == 0x000088, "Wrong size on FAccelByteModelsUserAchievement");
static_assert(offsetof(FAccelByteModelsUserAchievement, ID) == 0x000000, "Member 'FAccelByteModelsUserAchievement::ID' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsUserAchievement, Name) == 0x000010, "Member 'FAccelByteModelsUserAchievement::Name' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsUserAchievement, AchievementCode) == 0x000060, "Member 'FAccelByteModelsUserAchievement::AchievementCode' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsUserAchievement, AchievedAt) == 0x000070, "Member 'FAccelByteModelsUserAchievement::AchievedAt' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsUserAchievement, LatestValue) == 0x000080, "Member 'FAccelByteModelsUserAchievement::LatestValue' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsUserAchievement, Status) == 0x000084, "Member 'FAccelByteModelsUserAchievement::Status' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsAchievementIcon
// 0x0020 (0x0020 - 0x0000)
struct FAccelByteModelsAchievementIcon final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Slug;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsAchievementIcon) == 0x000008, "Wrong alignment on FAccelByteModelsAchievementIcon");
static_assert(sizeof(FAccelByteModelsAchievementIcon) == 0x000020, "Wrong size on FAccelByteModelsAchievementIcon");
static_assert(offsetof(FAccelByteModelsAchievementIcon, URL) == 0x000000, "Member 'FAccelByteModelsAchievementIcon::URL' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsAchievementIcon, Slug) == 0x000010, "Member 'FAccelByteModelsAchievementIcon::Slug' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsPublicAchievement
// 0x00B0 (0x00B0 - 0x0000)
struct FAccelByteModelsPublicAchievement final
{
public:
	class FString                                 AchievementCode;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Namespace;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAccelByteModelsAchievementIcon> LockedIcons;                                       // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAccelByteModelsAchievementIcon> UnlockedIcons;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          Hidden;                                            // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ListOrder;                                         // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          Incremental;                                       // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GoalValue;                                         // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StatCode;                                          // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CreatedAt;                                         // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UpdatedAt;                                         // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsPublicAchievement) == 0x000008, "Wrong alignment on FAccelByteModelsPublicAchievement");
static_assert(sizeof(FAccelByteModelsPublicAchievement) == 0x0000B0, "Wrong size on FAccelByteModelsPublicAchievement");
static_assert(offsetof(FAccelByteModelsPublicAchievement, AchievementCode) == 0x000000, "Member 'FAccelByteModelsPublicAchievement::AchievementCode' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, Namespace) == 0x000010, "Member 'FAccelByteModelsPublicAchievement::Namespace' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, Name) == 0x000020, "Member 'FAccelByteModelsPublicAchievement::Name' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, Description) == 0x000030, "Member 'FAccelByteModelsPublicAchievement::Description' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, LockedIcons) == 0x000040, "Member 'FAccelByteModelsPublicAchievement::LockedIcons' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, UnlockedIcons) == 0x000050, "Member 'FAccelByteModelsPublicAchievement::UnlockedIcons' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, Hidden) == 0x000060, "Member 'FAccelByteModelsPublicAchievement::Hidden' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, ListOrder) == 0x000064, "Member 'FAccelByteModelsPublicAchievement::ListOrder' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, Tags) == 0x000068, "Member 'FAccelByteModelsPublicAchievement::Tags' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, Incremental) == 0x000078, "Member 'FAccelByteModelsPublicAchievement::Incremental' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, GoalValue) == 0x00007C, "Member 'FAccelByteModelsPublicAchievement::GoalValue' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, StatCode) == 0x000080, "Member 'FAccelByteModelsPublicAchievement::StatCode' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, CreatedAt) == 0x000090, "Member 'FAccelByteModelsPublicAchievement::CreatedAt' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicAchievement, UpdatedAt) == 0x0000A0, "Member 'FAccelByteModelsPublicAchievement::UpdatedAt' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsPaging
// 0x0040 (0x0040 - 0x0000)
struct FAccelByteModelsPaging final
{
public:
	class FString                                 First;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Last;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Next;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Previous;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsPaging) == 0x000008, "Wrong alignment on FAccelByteModelsPaging");
static_assert(sizeof(FAccelByteModelsPaging) == 0x000040, "Wrong size on FAccelByteModelsPaging");
static_assert(offsetof(FAccelByteModelsPaging, First) == 0x000000, "Member 'FAccelByteModelsPaging::First' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPaging, Last) == 0x000010, "Member 'FAccelByteModelsPaging::Last' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPaging, Next) == 0x000020, "Member 'FAccelByteModelsPaging::Next' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPaging, Previous) == 0x000030, "Member 'FAccelByteModelsPaging::Previous' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsPaginatedPublicAchievement
// 0x0050 (0x0050 - 0x0000)
struct FAccelByteModelsPaginatedPublicAchievement final
{
public:
	TArray<struct FAccelByteModelsPublicAchievement> Data;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FAccelByteModelsPaging                 Paging;                                            // 0x0010(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsPaginatedPublicAchievement) == 0x000008, "Wrong alignment on FAccelByteModelsPaginatedPublicAchievement");
static_assert(sizeof(FAccelByteModelsPaginatedPublicAchievement) == 0x000050, "Wrong size on FAccelByteModelsPaginatedPublicAchievement");
static_assert(offsetof(FAccelByteModelsPaginatedPublicAchievement, Data) == 0x000000, "Member 'FAccelByteModelsPaginatedPublicAchievement::Data' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPaginatedPublicAchievement, Paging) == 0x000010, "Member 'FAccelByteModelsPaginatedPublicAchievement::Paging' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsEntitlementSummary
// 0x0070 (0x0070 - 0x0000)
struct FAccelByteModelsEntitlementSummary final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Namespace;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteEntitlementClass                    Clazz;                                             // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteEntitlementType                     Type;                                              // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Stackable;                                         // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StackedUseCount;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StackedQuantity;                                   // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CreatedAt;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GrantedCode;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsEntitlementSummary) == 0x000008, "Wrong alignment on FAccelByteModelsEntitlementSummary");
static_assert(sizeof(FAccelByteModelsEntitlementSummary) == 0x000070, "Wrong size on FAccelByteModelsEntitlementSummary");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, ID) == 0x000000, "Member 'FAccelByteModelsEntitlementSummary::ID' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, ItemId) == 0x000010, "Member 'FAccelByteModelsEntitlementSummary::ItemId' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, Namespace) == 0x000020, "Member 'FAccelByteModelsEntitlementSummary::Namespace' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, UserId) == 0x000030, "Member 'FAccelByteModelsEntitlementSummary::UserId' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, Clazz) == 0x000040, "Member 'FAccelByteModelsEntitlementSummary::Clazz' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, Type) == 0x000041, "Member 'FAccelByteModelsEntitlementSummary::Type' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, Stackable) == 0x000042, "Member 'FAccelByteModelsEntitlementSummary::Stackable' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, StackedUseCount) == 0x000044, "Member 'FAccelByteModelsEntitlementSummary::StackedUseCount' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, StackedQuantity) == 0x000048, "Member 'FAccelByteModelsEntitlementSummary::StackedQuantity' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, CreatedAt) == 0x000050, "Member 'FAccelByteModelsEntitlementSummary::CreatedAt' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementSummary, GrantedCode) == 0x000060, "Member 'FAccelByteModelsEntitlementSummary::GrantedCode' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsCancelFriendsResponse
// 0x0010 (0x0010 - 0x0000)
struct FAccelByteModelsCancelFriendsResponse final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsCancelFriendsResponse) == 0x000008, "Wrong alignment on FAccelByteModelsCancelFriendsResponse");
static_assert(sizeof(FAccelByteModelsCancelFriendsResponse) == 0x000010, "Wrong size on FAccelByteModelsCancelFriendsResponse");
static_assert(offsetof(FAccelByteModelsCancelFriendsResponse, Code) == 0x000000, "Member 'FAccelByteModelsCancelFriendsResponse::Code' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsCountInfo
// 0x000C (0x000C - 0x0000)
struct FAccelByteModelsCountInfo final
{
public:
	int32                                         NumberOfAchievements;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfHiddenAchievements;                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfVisibleAchievements;                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsCountInfo) == 0x000004, "Wrong alignment on FAccelByteModelsCountInfo");
static_assert(sizeof(FAccelByteModelsCountInfo) == 0x00000C, "Wrong size on FAccelByteModelsCountInfo");
static_assert(offsetof(FAccelByteModelsCountInfo, NumberOfAchievements) == 0x000000, "Member 'FAccelByteModelsCountInfo::NumberOfAchievements' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsCountInfo, NumberOfHiddenAchievements) == 0x000004, "Member 'FAccelByteModelsCountInfo::NumberOfHiddenAchievements' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsCountInfo, NumberOfVisibleAchievements) == 0x000008, "Member 'FAccelByteModelsCountInfo::NumberOfVisibleAchievements' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsPlatformSyncMobileGoogleResponse
// 0x0001 (0x0001 - 0x0000)
struct FAccelByteModelsPlatformSyncMobileGoogleResponse final
{
public:
	bool                                          NeedConsume;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsPlatformSyncMobileGoogleResponse) == 0x000001, "Wrong alignment on FAccelByteModelsPlatformSyncMobileGoogleResponse");
static_assert(sizeof(FAccelByteModelsPlatformSyncMobileGoogleResponse) == 0x000001, "Wrong size on FAccelByteModelsPlatformSyncMobileGoogleResponse");
static_assert(offsetof(FAccelByteModelsPlatformSyncMobileGoogleResponse, NeedConsume) == 0x000000, "Member 'FAccelByteModelsPlatformSyncMobileGoogleResponse::NeedConsume' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsPublicGameProfileInfo
// 0x0040 (0x0040 - 0x0000)
struct FAccelByteModelsPublicGameProfileInfo final
{
public:
	class FString                                 ProfileId;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Namespace;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfileName;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AvatarUrl;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsPublicGameProfileInfo) == 0x000008, "Wrong alignment on FAccelByteModelsPublicGameProfileInfo");
static_assert(sizeof(FAccelByteModelsPublicGameProfileInfo) == 0x000040, "Wrong size on FAccelByteModelsPublicGameProfileInfo");
static_assert(offsetof(FAccelByteModelsPublicGameProfileInfo, ProfileId) == 0x000000, "Member 'FAccelByteModelsPublicGameProfileInfo::ProfileId' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicGameProfileInfo, Namespace) == 0x000010, "Member 'FAccelByteModelsPublicGameProfileInfo::Namespace' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicGameProfileInfo, ProfileName) == 0x000020, "Member 'FAccelByteModelsPublicGameProfileInfo::ProfileName' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicGameProfileInfo, AvatarUrl) == 0x000030, "Member 'FAccelByteModelsPublicGameProfileInfo::AvatarUrl' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsPublicGameProfile
// 0x0020 (0x0020 - 0x0000)
struct FAccelByteModelsPublicGameProfile final
{
public:
	TArray<struct FAccelByteModelsPublicGameProfileInfo> GameProfiles;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsPublicGameProfile) == 0x000008, "Wrong alignment on FAccelByteModelsPublicGameProfile");
static_assert(sizeof(FAccelByteModelsPublicGameProfile) == 0x000020, "Wrong size on FAccelByteModelsPublicGameProfile");
static_assert(offsetof(FAccelByteModelsPublicGameProfile, GameProfiles) == 0x000000, "Member 'FAccelByteModelsPublicGameProfile::GameProfiles' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPublicGameProfile, UserId) == 0x000010, "Member 'FAccelByteModelsPublicGameProfile::UserId' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.PlatformLink
// 0x0090 (0x0090 - 0x0000)
struct FPlatformLink final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EmailAddress;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LinkedAt;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Namespace;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OriginNamespace;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlatformId;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlatformUserId;                                    // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AccountGroup;                                      // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlatformLink) == 0x000008, "Wrong alignment on FPlatformLink");
static_assert(sizeof(FPlatformLink) == 0x000090, "Wrong size on FPlatformLink");
static_assert(offsetof(FPlatformLink, DisplayName) == 0x000000, "Member 'FPlatformLink::DisplayName' has a wrong offset!");
static_assert(offsetof(FPlatformLink, EmailAddress) == 0x000010, "Member 'FPlatformLink::EmailAddress' has a wrong offset!");
static_assert(offsetof(FPlatformLink, LinkedAt) == 0x000020, "Member 'FPlatformLink::LinkedAt' has a wrong offset!");
static_assert(offsetof(FPlatformLink, Namespace) == 0x000030, "Member 'FPlatformLink::Namespace' has a wrong offset!");
static_assert(offsetof(FPlatformLink, OriginNamespace) == 0x000040, "Member 'FPlatformLink::OriginNamespace' has a wrong offset!");
static_assert(offsetof(FPlatformLink, PlatformId) == 0x000050, "Member 'FPlatformLink::PlatformId' has a wrong offset!");
static_assert(offsetof(FPlatformLink, PlatformUserId) == 0x000060, "Member 'FPlatformLink::PlatformUserId' has a wrong offset!");
static_assert(offsetof(FPlatformLink, UserId) == 0x000070, "Member 'FPlatformLink::UserId' has a wrong offset!");
static_assert(offsetof(FPlatformLink, AccountGroup) == 0x000080, "Member 'FPlatformLink::AccountGroup' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsEntitlementOwnership
// 0x0010 (0x0010 - 0x0000)
struct FAccelByteModelsEntitlementOwnership final
{
public:
	bool                                          Owned;                                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              EndDate;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsEntitlementOwnership) == 0x000008, "Wrong alignment on FAccelByteModelsEntitlementOwnership");
static_assert(sizeof(FAccelByteModelsEntitlementOwnership) == 0x000010, "Wrong size on FAccelByteModelsEntitlementOwnership");
static_assert(offsetof(FAccelByteModelsEntitlementOwnership, Owned) == 0x000000, "Member 'FAccelByteModelsEntitlementOwnership::Owned' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsEntitlementOwnership, EndDate) == 0x000008, "Member 'FAccelByteModelsEntitlementOwnership::EndDate' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.PartyPromoteLeaderRequest
// 0x0010 (0x0010 - 0x0000)
struct FPartyPromoteLeaderRequest final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPartyPromoteLeaderRequest) == 0x000008, "Wrong alignment on FPartyPromoteLeaderRequest");
static_assert(sizeof(FPartyPromoteLeaderRequest) == 0x000010, "Wrong size on FPartyPromoteLeaderRequest");
static_assert(offsetof(FPartyPromoteLeaderRequest, UserId) == 0x000000, "Member 'FPartyPromoteLeaderRequest::UserId' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.ResetPasswordRequest
// 0x0030 (0x0030 - 0x0000)
struct FResetPasswordRequest final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EmailAddress;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewPassword;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FResetPasswordRequest) == 0x000008, "Wrong alignment on FResetPasswordRequest");
static_assert(sizeof(FResetPasswordRequest) == 0x000030, "Wrong size on FResetPasswordRequest");
static_assert(offsetof(FResetPasswordRequest, Code) == 0x000000, "Member 'FResetPasswordRequest::Code' has a wrong offset!");
static_assert(offsetof(FResetPasswordRequest, EmailAddress) == 0x000010, "Member 'FResetPasswordRequest::EmailAddress' has a wrong offset!");
static_assert(offsetof(FResetPasswordRequest, NewPassword) == 0x000020, "Member 'FResetPasswordRequest::NewPassword' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsMultiLanguageAchievement
// 0x0130 (0x0130 - 0x0000)
struct FAccelByteModelsMultiLanguageAchievement final
{
public:
	class FString                                 AchievementCode;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Namespace;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Name;                                              // 0x0020(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Description;                                       // 0x0070(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FAccelByteModelsAchievementIcon> LockedIcons;                                       // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAccelByteModelsAchievementIcon> UnlockedIcons;                                     // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          Hidden;                                            // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ListOrder;                                         // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          Incremental;                                       // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GoalValue;                                         // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StatCode;                                          // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CreatedAt;                                         // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UpdatedAt;                                         // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsMultiLanguageAchievement) == 0x000008, "Wrong alignment on FAccelByteModelsMultiLanguageAchievement");
static_assert(sizeof(FAccelByteModelsMultiLanguageAchievement) == 0x000130, "Wrong size on FAccelByteModelsMultiLanguageAchievement");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, AchievementCode) == 0x000000, "Member 'FAccelByteModelsMultiLanguageAchievement::AchievementCode' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, Namespace) == 0x000010, "Member 'FAccelByteModelsMultiLanguageAchievement::Namespace' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, Name) == 0x000020, "Member 'FAccelByteModelsMultiLanguageAchievement::Name' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, Description) == 0x000070, "Member 'FAccelByteModelsMultiLanguageAchievement::Description' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, LockedIcons) == 0x0000C0, "Member 'FAccelByteModelsMultiLanguageAchievement::LockedIcons' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, UnlockedIcons) == 0x0000D0, "Member 'FAccelByteModelsMultiLanguageAchievement::UnlockedIcons' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, Hidden) == 0x0000E0, "Member 'FAccelByteModelsMultiLanguageAchievement::Hidden' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, ListOrder) == 0x0000E4, "Member 'FAccelByteModelsMultiLanguageAchievement::ListOrder' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, Tags) == 0x0000E8, "Member 'FAccelByteModelsMultiLanguageAchievement::Tags' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, Incremental) == 0x0000F8, "Member 'FAccelByteModelsMultiLanguageAchievement::Incremental' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, GoalValue) == 0x0000FC, "Member 'FAccelByteModelsMultiLanguageAchievement::GoalValue' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, StatCode) == 0x000100, "Member 'FAccelByteModelsMultiLanguageAchievement::StatCode' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, CreatedAt) == 0x000110, "Member 'FAccelByteModelsMultiLanguageAchievement::CreatedAt' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsMultiLanguageAchievement, UpdatedAt) == 0x000120, "Member 'FAccelByteModelsMultiLanguageAchievement::UpdatedAt' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsAttributes
// 0x0040 (0x0040 - 0x0000)
struct FAccelByteModelsAttributes final
{
public:
	class FString                                 ServerId;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CharacterId;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CharacterName;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsAttributes) == 0x000008, "Wrong alignment on FAccelByteModelsAttributes");
static_assert(sizeof(FAccelByteModelsAttributes) == 0x000040, "Wrong size on FAccelByteModelsAttributes");
static_assert(offsetof(FAccelByteModelsAttributes, ServerId) == 0x000000, "Member 'FAccelByteModelsAttributes::ServerId' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsAttributes, ServerName) == 0x000010, "Member 'FAccelByteModelsAttributes::ServerName' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsAttributes, CharacterId) == 0x000020, "Member 'FAccelByteModelsAttributes::CharacterId' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsAttributes, CharacterName) == 0x000030, "Member 'FAccelByteModelsAttributes::CharacterName' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.Permission
// 0x0040 (0x0040 - 0x0000)
struct FPermission final
{
public:
	int32                                         Action;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
