#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimComponent_SCT

#include "Basic.hpp"

#include "Gait_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_interactionAnimState_structs.hpp"
#include "E_interactionAnim_structs.hpp"
#include "MovementMode_structs.hpp"
#include "Stance_structs.hpp"
#include "InteractionAnim_structs.hpp"
#include "CardinalDirection_structs.hpp"
#include "PivotParams_structs.hpp"
#include "IdleEntryState_structs.hpp"
#include "RPC_Enum_structs.hpp"
#include "E_ItemAnimation_structs.hpp"


namespace SDK::Params
{

// Function AnimComponent_SCT.AnimComponent_SCT_C.ExecuteUbergraph_AnimComponent_SCT
// 0x04B0 (0x04B0 - 0x0000)
struct AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	MovementMode::EMovementMode                   K2Node_Event_NewMovementMode_1;                    // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGait                                         K2Node_Event_NewGait;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PoseName;                             // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_FaceDown;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPivotParams                           K2Node_Event_PivotParameters;                      // 0x0028(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_TurnInPlaceMontage;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ShouldTurnInPlace;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_TurningInPlace;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_TurningRight;                         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EIdleEntryState                               K2Node_Event_IdleEntryState;                       // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanRotate_CanRotate;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateRotationRate_ReturnValue;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateRotationRate_ReturnValue_1;      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_LookingDirectionWithOffset_TargetRotation; // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InputValue_1;                         // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InputValue;                           // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingRootMotion_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_TargetLocation;                       // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Direction;                            // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_1;                   // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_2;                   // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable;                               // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Aiming;                               // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_Event_AimType;                              // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_EmoteID;                              // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERPC_Enum                                     K2Node_Event_RPC;                                  // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_EnableRotationOverride;               // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_177[0x1];                                      // 0x0177(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Event_Rotation;                             // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_186[0x2];                                      // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_ToRagdoll;                            // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_OptionalImpulse;                      // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Force;                                // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_ShouldSprint;                         // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x01A0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EStance                                       K2Node_Event_NewStance;                            // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Engine::EMovementMode                         K2Node_Event_PrevMovementMode;                     // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Engine::EMovementMode                         K2Node_Event_NewMovementMode;                      // 0x022E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_PrevCustomMode;                       // 0x022F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_NewCustomMode;                        // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Event_AddAmount;                            // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_ItemAnimation                               K2Node_CustomEvent_Animation_1;                    // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_ItemAnimation                               K2Node_CustomEvent_Animation;                      // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USCT_AnimBpSCT_C*                       K2Node_DynamicCast_AsSCT_Anim_Bp_SCT;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0xF];                                      // 0x0271(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0280(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_EnableRotationOverride_4;       // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_CustomEvent_Rotation_4;                     // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_EnableRotationOverride_3;       // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_CustomEvent_Rotation_3;                     // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_EnableRotationOverride_2;       // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_CustomEvent_Rotation_2;                     // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_EnableRotationOverride_1;       // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_CustomEvent_Rotation_1;                     // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_316[0xA];                                      // 0x0316(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_LaunchTransform_1;              // 0x0320(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_CustomEvent_LaunchTransform;                // 0x0350(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Aiming;                         // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_CustomEvent_AimType;                        // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383[0x1];                                      // 0x0383(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ToRagdoll_1;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_NewVel;                         // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NewLocation;                    // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_NewRotation;                    // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_3;                   // 0x03B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x03CC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_CustomEvent_EmoteID_1;                      // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_EmoteID;                        // 0x045A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_EnableRotationOverride;         // 0x045B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x045C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_ToRagdoll;                      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_OptionalImpulse;                // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Force;                          // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479[0x3];                                      // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGait                                         K2Node_CustomEvent_NewGait;                        // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48A[0x2];                                      // 0x048A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_MovementInput;                  // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_LookingRotation;                // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT) == 0x000010, "Wrong alignment on AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT");
static_assert(sizeof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT) == 0x0004B0, "Wrong size on AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, EntryPoint) == 0x000000, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_HasAuthority_ReturnValue) == 0x000014, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_IsDedicatedServer_ReturnValue) == 0x000016, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_NewMovementMode_1) == 0x000017, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_NewMovementMode_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_NewGait) == 0x000018, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_NewGait' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_PoseName) == 0x00001C, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_PoseName' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_FaceDown) == 0x000024, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_FaceDown' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_PivotParameters) == 0x000028, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_PivotParameters' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_TurnInPlaceMontage) == 0x000040, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_TurnInPlaceMontage' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_ShouldTurnInPlace) == 0x000048, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_ShouldTurnInPlace' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_TurningInPlace) == 0x000049, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_TurningInPlace' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_TurningRight) == 0x00004A, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_TurningRight' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_IdleEntryState) == 0x00004B, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_IdleEntryState' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_DeltaSeconds) == 0x00004C, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, Temp_bool_Has_Been_Initd_Variable) == 0x000050, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_RandomFloatInRange_ReturnValue) == 0x000054, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000060, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_GetPhysicsLinearVelocity_ReturnValue) == 0x000064, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_GetPhysicsLinearVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_VSizeSquared_ReturnValue) == 0x000070, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_Less_FloatFloat_ReturnValue) == 0x000078, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00007C, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_GetAnimInstance_ReturnValue) == 0x000088, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_DynamicCast_AsIAnim_Bp) == 0x000090, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_CanRotate_CanRotate) == 0x0000A1, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_CanRotate_CanRotate' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, Temp_bool_IsClosed_Variable) == 0x0000A2, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_CalculateRotationRate_ReturnValue) == 0x0000A4, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_CalculateRotationRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_CalculateRotationRate_ReturnValue_1) == 0x0000A8, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_CalculateRotationRate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_LookingDirectionWithOffset_TargetRotation) == 0x0000AC, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_LookingDirectionWithOffset_TargetRotation' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_SelectFloat_ReturnValue) == 0x0000B8, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_HasAuthority_ReturnValue_1) == 0x0000BC, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000BD, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_InputValue_1) == 0x0000BE, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_InputValue_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_InputValue) == 0x0000BF, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_InputValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_Not_PreBool_ReturnValue) == 0x0000C0, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_IsPlayingRootMotion_ReturnValue) == 0x0000C1, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_IsPlayingRootMotion_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_TargetLocation) == 0x0000C4, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_TargetLocation' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_Direction) == 0x0000D0, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_Direction' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_BreakVector_X) == 0x0000DC, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_BreakVector_Y) == 0x0000E0, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_BreakVector_Z) == 0x0000E4, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_BreakRotator_Roll) == 0x0000E8, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_BreakRotator_Pitch) == 0x0000EC, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_BreakRotator_Yaw) == 0x0000F0, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_MakeRotator_ReturnValue) == 0x0000F4, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_MakeRotator_ReturnValue_1) == 0x000100, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_Enable) == 0x000140, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_DynamicCast_AsIAnim_Bp_1) == 0x000148, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_DynamicCast_AsIAnim_Bp_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_DynamicCast_AsIAnim_Bp_2) == 0x000160, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_DynamicCast_AsIAnim_Bp_2' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_DynamicCast_bSuccess_2) == 0x000170, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_Enable) == 0x000171, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_Enable' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_Aiming) == 0x000172, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_Aiming' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_AimType) == 0x000173, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_AimType' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_EmoteID) == 0x000174, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_EmoteID' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_RPC) == 0x000175, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_RPC' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_EnableRotationOverride) == 0x000176, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_EnableRotationOverride' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_Rotation) == 0x000178, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_Rotation' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_SwitchEnum_CmpSuccess_1) == 0x000184, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_HasAuthority_ReturnValue_2) == 0x000185, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, Temp_int_Variable) == 0x000188, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_SwitchEnum_CmpSuccess_2) == 0x00018C, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00018D, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_ToRagdoll) == 0x00018E, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_ToRagdoll' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_OptionalImpulse) == 0x000190, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_OptionalImpulse' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_Force) == 0x00019C, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_Force' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_ShouldSprint) == 0x00019D, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_ShouldSprint' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_Hit) == 0x0001A0, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_NewStance) == 0x00022C, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_NewStance' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_PrevMovementMode) == 0x00022D, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_PrevMovementMode' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_NewMovementMode) == 0x00022E, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_NewMovementMode' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_PrevCustomMode) == 0x00022F, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_PrevCustomMode' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_NewCustomMode) == 0x000230, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_NewCustomMode' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_SwitchEnum_CmpSuccess_3) == 0x000231, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_Event_AddAmount) == 0x000234, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_Event_AddAmount' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000240, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_HasAuthority_ReturnValue_3) == 0x000244, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_Animation_1) == 0x000245, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_Animation_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CreateDelegate_OutputDelegate_1) == 0x000248, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000258, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_SwitchEnum_CmpSuccess_4) == 0x000260, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_Animation) == 0x000261, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_Animation' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_DynamicCast_AsSCT_Anim_Bp_SCT) == 0x000268, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_DynamicCast_AsSCT_Anim_Bp_SCT' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_DynamicCast_bSuccess_3) == 0x000270, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_GetTransform_ReturnValue) == 0x000280, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_BreakTransform_Location) == 0x0002B0, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_BreakTransform_Rotation) == 0x0002BC, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_BreakTransform_Scale) == 0x0002C8, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_EnableRotationOverride_4) == 0x0002D4, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_EnableRotationOverride_4' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_Rotation_4) == 0x0002D8, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_Rotation_4' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_EnableRotationOverride_3) == 0x0002E4, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_EnableRotationOverride_3' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_Rotation_3) == 0x0002E8, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_Rotation_3' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_EnableRotationOverride_2) == 0x0002F4, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_EnableRotationOverride_2' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_Rotation_2) == 0x0002F8, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_Rotation_2' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_EnableRotationOverride_1) == 0x000304, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_EnableRotationOverride_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_Rotation_1) == 0x000308, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_Rotation_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_SwitchEnum_CmpSuccess_5) == 0x000314, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_SwitchEnum_CmpSuccess_6) == 0x000315, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_SwitchEnum_CmpSuccess_6' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_LaunchTransform_1) == 0x000320, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_LaunchTransform_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_LaunchTransform) == 0x000350, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_LaunchTransform' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_Aiming) == 0x000380, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_Aiming' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_AimType) == 0x000381, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_AimType' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000382, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_GetComponentVelocity_ReturnValue) == 0x000384, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_ToRagdoll_1) == 0x000390, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_ToRagdoll_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_NewVel) == 0x000394, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_NewVel' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_NewLocation) == 0x0003A0, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_NewLocation' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_NewRotation) == 0x0003AC, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_NewRotation' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_DynamicCast_AsIAnim_Bp_3) == 0x0003B8, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_DynamicCast_AsIAnim_Bp_3' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_DynamicCast_bSuccess_4) == 0x0003C8, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x0003CC, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000458, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_EmoteID_1) == 0x000459, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_EmoteID_1' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_EmoteID) == 0x00045A, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_EmoteID' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_EnableRotationOverride) == 0x00045B, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_EnableRotationOverride' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_Rotation) == 0x00045C, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_ToRagdoll) == 0x000468, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_ToRagdoll' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_OptionalImpulse) == 0x00046C, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_OptionalImpulse' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_Force) == 0x000478, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_Force' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_Add_VectorVector_ReturnValue) == 0x00047C, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000488, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_NewGait) == 0x000489, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_NewGait' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_MovementInput) == 0x00048C, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_MovementInput' has a wrong offset!");
static_assert(offsetof(AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT, K2Node_CustomEvent_LookingRotation) == 0x000498, "Member 'AnimComponent_SCT_C_ExecuteUbergraph_AnimComponent_SCT::K2Node_CustomEvent_LookingRotation' has a wrong offset!");

// Function AnimComponent_SCT.AnimComponent_SCT_C.ServerMovementTransform
// 0x0018 (0x0018 - 0x0000)
struct AnimComponent_SCT_C_ServerMovementTransform final
{
public:
