#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelByteRedeemCodeWidget

#include "Basic.hpp"

#include "AccelByteUe4Sdk_structs.hpp"


namespace SDK::Params
{

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.ExecuteUbergraph_BP_AccelByteRedeemCodeWidget
// 0x04F8 (0x04F8 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGame_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalUserRecords_C*                    K2Node_DynamicCast_AsLocal_User_Records;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Code_2;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsEntitlementPagingSlicedResult K2Node_CustomEvent_Entitlements;                   // 0x0070(0x0050)()
	int32                                         K2Node_CustomEvent_Code;                           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FAccelByteModelsEntitlementPagingSlicedResult& Entitlements, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_1;                            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsEntitlementPagingSlicedResult Temp_struct_Variable;                              // 0x0100(0x0050)()
	class UFCTQueryEntitlementsCallbackProxy*     CallFunc_QueryUserEntitlements_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsEntitlementInfo        CallFunc_Array_Get_Item;                           // 0x0178(0x0248)()
	bool                                          CallFunc_IsEntitlementFoundInLocalData_ReturnValue; // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3[0x1];                                      // 0x03C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x03C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_4;                 // 0x03D8(0x0018)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x03F0(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x0418(0x0018)(ConstParm)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0438(0x0018)(ConstParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0458(0x0018)(ConstParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0474(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_CustomizationGender_C*>      CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0488(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_CustomizationGender_C*              CallFunc_Array_Get_Item_1;                         // 0x0498(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x04B0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTRedeemCodeCallbackProxy*            CallFunc_RedeemCode_ReturnValue;                   // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Code_3;                         // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget) == 0x0004F8, "Wrong size on BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, EntryPoint) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_LoadGame_ReturnValue) == 0x000008, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_LoadGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_DynamicCast_AsLocal_User_Records) == 0x000010, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_DynamicCast_AsLocal_User_Records' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CustomEvent_Code_2) == 0x00001C, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CustomEvent_Code_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CustomEvent_Message_2) == 0x000020, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_SaveGame_ReturnValue) == 0x000030, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_SaveGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, Temp_string_Variable) == 0x000038, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, Temp_int_Variable) == 0x000048, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CustomEvent_Code_1) == 0x00004C, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CustomEvent_Message_1) == 0x000050, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CustomEvent_Entitlements) == 0x000070, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CustomEvent_Entitlements' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CustomEvent_Code) == 0x0000C0, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CustomEvent_Message) == 0x0000C8, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, Temp_string_Variable_1) == 0x0000E8, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, Temp_int_Variable_1) == 0x0000F8, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, Temp_struct_Variable) == 0x000100, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_QueryUserEntitlements_ReturnValue) == 0x000150, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_QueryUserEntitlements_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Array_Length_ReturnValue) == 0x00015C, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, Temp_int_Loop_Counter_Variable) == 0x000160, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000164, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000168, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, Temp_bool_True_if_break_was_hit_Variable) == 0x00016C, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, Temp_int_Array_Index_Variable) == 0x000170, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Array_Get_Item) == 0x000178, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_IsEntitlementFoundInLocalData_ReturnValue) == 0x0003C0, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_IsEntitlementFoundInLocalData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Not_PreBool_ReturnValue) == 0x0003C1, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_BooleanAND_ReturnValue) == 0x0003C2, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003C4, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_ComponentBoundEvent_Text_4) == 0x0003D8, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_ComponentBoundEvent_Text_4' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_ComponentBoundEvent_Text_3) == 0x0003F0, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_ComponentBoundEvent_Text_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000408, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_ComponentBoundEvent_Text_2) == 0x000418, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_ComponentBoundEvent_Text_2' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Len_ReturnValue) == 0x000430, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_ComponentBoundEvent_Text_1) == 0x000438, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000450, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_ComponentBoundEvent_Text) == 0x000458, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, Temp_int_Array_Index_Variable_1) == 0x000470, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x000474, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000488, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Array_Get_Item_1) == 0x000498, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Array_Length_ReturnValue_1) == 0x0004A0, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, Temp_int_Loop_Counter_Variable_1) == 0x0004A4, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x0004A8, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004AC, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_GetText_ReturnValue) == 0x0004B0, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0004C8, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_RedeemCode_ReturnValue) == 0x0004D8, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_RedeemCode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, CallFunc_IsValid_ReturnValue_1) == 0x0004E0, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CustomEvent_Code_3) == 0x0004E4, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CustomEvent_Code_3' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget, K2Node_CustomEvent_Message_3) == 0x0004E8, "Member 'BP_AccelByteRedeemCodeWidget_C_ExecuteUbergraph_BP_AccelByteRedeemCodeWidget::K2Node_CustomEvent_Message_3' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.BndEvt__EditableTextBoxRedeemCode_1to4_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_1to4_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_1to4_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_1to4_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_1to4_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_1to4_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_1to4_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_1to4_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.BndEvt__EditableTextBoxRedeemCode_5to8_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_5to8_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_5to8_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_5to8_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_5to8_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_5to8_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_5to8_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_5to8_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.BndEvt__EditableTextBoxRedeemCode_9-12_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_9Minus12_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_9Minus12_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_9Minus12_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_9Minus12_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_9Minus12_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_9Minus12_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_9Minus12_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.BndEvt__EditableTextBoxRedeemCode_13-16_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_13Minus16_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_13Minus16_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_13Minus16_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_13Minus16_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_13Minus16_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_13Minus16_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_13Minus16_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.BndEvt__EditableTextBoxRedeemCode_17-20_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_17Minus20_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_17Minus20_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_17Minus20_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_17Minus20_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_17Minus20_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_17Minus20_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_BndEvt__EditableTextBoxRedeemCode_17Minus20_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.OnSuccess_20DF576E4D796A56159675B366C7785C
// 0x0068 (0x0068 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C final
{
public:
	struct FAccelByteModelsEntitlementPagingSlicedResult Entitlements;                                      // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Code;                                              // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C) == 0x000068, "Wrong size on BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C, Entitlements) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C::Entitlements' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C, Code) == 0x000050, "Member 'BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C::Code' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C, Message) == 0x000058, "Member 'BP_AccelByteRedeemCodeWidget_C_OnSuccess_20DF576E4D796A56159675B366C7785C::Message' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.OnFail_20DF576E4D796A56159675B366C7785C
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_OnFail_20DF576E4D796A56159675B366C7785C final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_OnFail_20DF576E4D796A56159675B366C7785C) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_OnFail_20DF576E4D796A56159675B366C7785C");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_OnFail_20DF576E4D796A56159675B366C7785C) == 0x000018, "Wrong size on BP_AccelByteRedeemCodeWidget_C_OnFail_20DF576E4D796A56159675B366C7785C");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_OnFail_20DF576E4D796A56159675B366C7785C, Code) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_OnFail_20DF576E4D796A56159675B366C7785C::Code' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_OnFail_20DF576E4D796A56159675B366C7785C, Message) == 0x000008, "Member 'BP_AccelByteRedeemCodeWidget_C_OnFail_20DF576E4D796A56159675B366C7785C::Message' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.OnSuccess_72B38833490B7AB975448F8F4B1A5438
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_OnSuccess_72B38833490B7AB975448F8F4B1A5438 final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_OnSuccess_72B38833490B7AB975448F8F4B1A5438) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_OnSuccess_72B38833490B7AB975448F8F4B1A5438");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_OnSuccess_72B38833490B7AB975448F8F4B1A5438) == 0x000018, "Wrong size on BP_AccelByteRedeemCodeWidget_C_OnSuccess_72B38833490B7AB975448F8F4B1A5438");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_OnSuccess_72B38833490B7AB975448F8F4B1A5438, Code) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_OnSuccess_72B38833490B7AB975448F8F4B1A5438::Code' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_OnSuccess_72B38833490B7AB975448F8F4B1A5438, Message) == 0x000008, "Member 'BP_AccelByteRedeemCodeWidget_C_OnSuccess_72B38833490B7AB975448F8F4B1A5438::Message' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.OnFail_72B38833490B7AB975448F8F4B1A5438
// 0x0018 (0x0018 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_OnFail_72B38833490B7AB975448F8F4B1A5438 final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_OnFail_72B38833490B7AB975448F8F4B1A5438) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_OnFail_72B38833490B7AB975448F8F4B1A5438");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_OnFail_72B38833490B7AB975448F8F4B1A5438) == 0x000018, "Wrong size on BP_AccelByteRedeemCodeWidget_C_OnFail_72B38833490B7AB975448F8F4B1A5438");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_OnFail_72B38833490B7AB975448F8F4B1A5438, Code) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_OnFail_72B38833490B7AB975448F8F4B1A5438::Code' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_OnFail_72B38833490B7AB975448F8F4B1A5438, Message) == 0x000008, "Member 'BP_AccelByteRedeemCodeWidget_C_OnFail_72B38833490B7AB975448F8F4B1A5438::Message' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.UpdateRedeemCodeTextBoxText
// 0x0040 (0x0040 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UEditableTextBox*                       NextTextBox;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEditableTextBox*                       CurrentTextBox;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText) == 0x000040, "Wrong size on BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText, InText) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText::InText' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText, NextTextBox) == 0x000018, "Member 'BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText::NextTextBox' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText, CurrentTextBox) == 0x000020, "Member 'BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText::CurrentTextBox' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText, CallFunc_Len_ReturnValue) == 0x000038, "Member 'BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BP_AccelByteRedeemCodeWidget_C_UpdateRedeemCodeTextBoxText::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AccelByteRedeemCodeWidget.BP_AccelByteRedeemCodeWidget_C.RemoveExcessTextBoxChars
// 0x0058 (0x0058 - 0x0000)
struct BP_AccelByteRedeemCodeWidget_C_RemoveExcessTextBoxChars final
{
public:
	class UEditableTextBox*                       RedeemCodeTextBox;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
};
static_assert(alignof(BP_AccelByteRedeemCodeWidget_C_RemoveExcessTextBoxChars) == 0x000008, "Wrong alignment on BP_AccelByteRedeemCodeWidget_C_RemoveExcessTextBoxChars");
static_assert(sizeof(BP_AccelByteRedeemCodeWidget_C_RemoveExcessTextBoxChars) == 0x000058, "Wrong size on BP_AccelByteRedeemCodeWidget_C_RemoveExcessTextBoxChars");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_RemoveExcessTextBoxChars, RedeemCodeTextBox) == 0x000000, "Member 'BP_AccelByteRedeemCodeWidget_C_RemoveExcessTextBoxChars::RedeemCodeTextBox' has a wrong offset!");
static_assert(offsetof(BP_AccelByteRedeemCodeWidget_C_RemoveExcessTextBoxChars, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'BP_AccelByteRedeemCodeWidget_C_RemoveExcessTextBoxChars::CallFunc_GetText_ReturnValue' has a wrong offset!");
