#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelBytePreloaderWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AccelBytePreloaderWidget.BP_AccelBytePreloaderWidget_C.ExecuteUbergraph_BP_AccelBytePreloaderWidget
// 0x00D0 (0x00D0 - 0x0000)
struct BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AccelByteNotConnectedWidget_C*      CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnected_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConnected_ReturnValue_1;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget) == 0x000008, "Wrong alignment on BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget");
static_assert(sizeof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget) == 0x0000D0, "Wrong size on BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, EntryPoint) == 0x000000, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000048, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000068, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000070, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000078, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000080, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_Create_ReturnValue) == 0x000088, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_Conv_IntToString_ReturnValue) == 0x000090, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A0, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B0, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x0000C0, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_IsConnected_ReturnValue) == 0x0000C8, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_IsConnected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget, CallFunc_IsConnected_ReturnValue_1) == 0x0000C9, "Member 'BP_AccelBytePreloaderWidget_C_ExecuteUbergraph_BP_AccelBytePreloaderWidget::CallFunc_IsConnected_ReturnValue_1' has a wrong offset!");

}

