#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_ac_TableLight_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bp_ac_TableLight_01.bp_ac_TableLight_01_C
// 0x0018 (0x0238 - 0x0220)
class Abp_ac_TableLight_01_C final : public AActor
{
public:
	class USpotLightComponent*                    SpotLight;                                         // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_ac_TableLight_01_C">();
	}
	static class Abp_ac_TableLight_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abp_ac_TableLight_01_C>();
	}
};
static_assert(alignof(Abp_ac_TableLight_01_C) == 0x000008, "Wrong alignment on Abp_ac_TableLight_01_C");
static_assert(sizeof(Abp_ac_TableLight_01_C) == 0x000238, "Wrong size on Abp_ac_TableLight_01_C");
static_assert(offsetof(Abp_ac_TableLight_01_C, SpotLight) == 0x000220, "Member 'Abp_ac_TableLight_01_C::SpotLight' has a wrong offset!");
static_assert(offsetof(Abp_ac_TableLight_01_C, PointLight) == 0x000228, "Member 'Abp_ac_TableLight_01_C::PointLight' has a wrong offset!");
static_assert(offsetof(Abp_ac_TableLight_01_C, StaticMesh) == 0x000230, "Member 'Abp_ac_TableLight_01_C::StaticMesh' has a wrong offset!");

}

