#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelByteRegisterWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelByteRegisterWidget.BP_AccelByteRegisterWidget_C
// 0x0168 (0x03C8 - 0x0260)
class UBP_AccelByteRegisterWidget_C final : public UFCTAccelByteAuthenticationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCheckBox*                              AgeCheckBox;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BodyBG;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CompleteRegistrationButton;                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ConfirmAgeError;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ConfirmAgeErrorTextBox;                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Container;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DisplayNameError;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DisplayNameErrorText;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EmailError;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EmailErrorText;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EnterEmailTextBox;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EnterPasswordTextBox;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBG;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_263;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              KeepUsernameCheckbox;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LoginButton;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PasswordError;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PasswordErrorText_1;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PlayAsGuestButton;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       ReenterEmailTextBox;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       ReenterPasswordTextBox;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RegisterBox;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AccelByteRegisterConfirmedWidget_C* RegisterConfirmed;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_5;                                       // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_6;                                       // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       UserNameTextBox;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerificationError;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VerifyErrorText;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClose;                                           // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           FCTColor;                                          // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInfoIsGood;                                       // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSendVerificationCode;                            // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBackToLogin;                                     // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           LoginTextColor;                                    // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GuestTextColor;                                    // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnClose__DelegateSignature();
	void OnSendVerificationCode__DelegateSignature(const class FString& DisplayName, const class FString& Email, const class FString& Password);
	void OnBackToLogin__DelegateSignature();
	void ExecuteUbergraph_BP_AccelByteRegisterWidget(int32 EntryPoint);
	void BndEvt__BP_AccelByteRegisterWidget_AgeCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__LoginButton_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__LoginButton_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__LoginButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__KeepUsernameCheckbox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__CompleteRegistrationButton_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__PlayAsGuestButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void OnSuccess_BA35C05048A87F35424259AA85EDFCC7(const struct FAccountUserData& Result, const class FString& Message, int32 Code);
	void OnError_BA35C05048A87F35424259AA85EDFCC7(const class FString& Message, int32 Code);
	void OnSuccess_7ABCB2AB4DE6822731B88CBE6957D8A5(const class FString& Result, int32 Code);
	void OnError_7ABCB2AB4DE6822731B88CBE6957D8A5(const class FString& Result, int32 Code);
	void OnSuccess_EBE150A54A45320110E72DA4D10B9F48(const class FString& Result, int32 Code);
	void OnError_EBE150A54A45320110E72DA4D10B9F48(const class FString& Result, int32 Code);
	void OnSuccess_27F7195245B523606805B8BF1431B28C(const class FString& Result, int32 Code);
	void OnError_27F7195245B523606805B8BF1431B28C(const class FString& Result, int32 Code);
	void OnSuccess_37484B9B46D5AF04A96CA09E4DC0B157(const class FString& Result, int32 Code);
	void OnError_37484B9B46D5AF04A96CA09E4DC0B157(const class FString& Result, int32 Code);
	void OnSuccess_AE04DCEE41C8360F9BA1F78B28EB2223(const struct FPagedPublicUsersInfo& UsersInfo);
	void OnFail_AE04DCEE41C8360F9BA1F78B28EB2223(int32 Code, const class FString& Message);
	void Set_New_Day_Count();
	void GetDisplayNameInputString(class FString* OutDisplayName);
	void GetPasswordInputString(class FString* OutPassword);
	void GetFormattedBirthDate(class FString* OutBirthDate);
	void Get_Appended_Date_Column(class UComboBoxString* Date, class FString* OutMonth);
	void GetEmailInputString(class FString* OutEmail);
	void Init(const class FString& Country);
	void UserNameAvailable(const class FString& DisplayName, TArray<struct FPublicUserInfo>& UserQuery, bool* NameAvailable);
	void SetErrorMessage(class UTextBlock* TextWidget, const class FText& ErrorText);
	void ValidatePasswordInput();
	void SetErrorMessageWithErrorCode(class UTextBlock* TextWidget, int32 ErrorCode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelByteRegisterWidget_C">();
	}
	static class UBP_AccelByteRegisterWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelByteRegisterWidget_C>();
	}
};
static_assert(alignof(UBP_AccelByteRegisterWidget_C) == 0x000008, "Wrong alignment on UBP_AccelByteRegisterWidget_C");
static_assert(sizeof(UBP_AccelByteRegisterWidget_C) == 0x0003C8, "Wrong size on UBP_AccelByteRegisterWidget_C");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, UberGraphFrame) == 0x000260, "Member 'UBP_AccelByteRegisterWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, AgeCheckBox) == 0x000268, "Member 'UBP_AccelByteRegisterWidget_C::AgeCheckBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, BodyBG) == 0x000270, "Member 'UBP_AccelByteRegisterWidget_C::BodyBG' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, CompleteRegistrationButton) == 0x000278, "Member 'UBP_AccelByteRegisterWidget_C::CompleteRegistrationButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, ConfirmAgeError) == 0x000280, "Member 'UBP_AccelByteRegisterWidget_C::ConfirmAgeError' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, ConfirmAgeErrorTextBox) == 0x000288, "Member 'UBP_AccelByteRegisterWidget_C::ConfirmAgeErrorTextBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, Container) == 0x000290, "Member 'UBP_AccelByteRegisterWidget_C::Container' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, DisplayNameError) == 0x000298, "Member 'UBP_AccelByteRegisterWidget_C::DisplayNameError' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, DisplayNameErrorText) == 0x0002A0, "Member 'UBP_AccelByteRegisterWidget_C::DisplayNameErrorText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, EmailError) == 0x0002A8, "Member 'UBP_AccelByteRegisterWidget_C::EmailError' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, EmailErrorText) == 0x0002B0, "Member 'UBP_AccelByteRegisterWidget_C::EmailErrorText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, EnterEmailTextBox) == 0x0002B8, "Member 'UBP_AccelByteRegisterWidget_C::EnterEmailTextBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, EnterPasswordTextBox) == 0x0002C0, "Member 'UBP_AccelByteRegisterWidget_C::EnterPasswordTextBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, HeaderBG) == 0x0002C8, "Member 'UBP_AccelByteRegisterWidget_C::HeaderBG' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, Image_5) == 0x0002D0, "Member 'UBP_AccelByteRegisterWidget_C::Image_5' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, Image_6) == 0x0002D8, "Member 'UBP_AccelByteRegisterWidget_C::Image_6' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, Image_263) == 0x0002E0, "Member 'UBP_AccelByteRegisterWidget_C::Image_263' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, KeepUsernameCheckbox) == 0x0002E8, "Member 'UBP_AccelByteRegisterWidget_C::KeepUsernameCheckbox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, LoginButton) == 0x0002F0, "Member 'UBP_AccelByteRegisterWidget_C::LoginButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, PasswordError) == 0x0002F8, "Member 'UBP_AccelByteRegisterWidget_C::PasswordError' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, PasswordErrorText_1) == 0x000300, "Member 'UBP_AccelByteRegisterWidget_C::PasswordErrorText_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, PlayAsGuestButton) == 0x000308, "Member 'UBP_AccelByteRegisterWidget_C::PlayAsGuestButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, ReenterEmailTextBox) == 0x000310, "Member 'UBP_AccelByteRegisterWidget_C::ReenterEmailTextBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, ReenterPasswordTextBox) == 0x000318, "Member 'UBP_AccelByteRegisterWidget_C::ReenterPasswordTextBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, RegisterBox) == 0x000320, "Member 'UBP_AccelByteRegisterWidget_C::RegisterBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, RegisterConfirmed) == 0x000328, "Member 'UBP_AccelByteRegisterWidget_C::RegisterConfirmed' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, TextBlock_5) == 0x000330, "Member 'UBP_AccelByteRegisterWidget_C::TextBlock_5' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, TextBlock_6) == 0x000338, "Member 'UBP_AccelByteRegisterWidget_C::TextBlock_6' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, UserNameTextBox) == 0x000340, "Member 'UBP_AccelByteRegisterWidget_C::UserNameTextBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, VerificationError) == 0x000348, "Member 'UBP_AccelByteRegisterWidget_C::VerificationError' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, VerifyErrorText) == 0x000350, "Member 'UBP_AccelByteRegisterWidget_C::VerifyErrorText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, WidgetSwitcher_0) == 0x000358, "Member 'UBP_AccelByteRegisterWidget_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, OnClose) == 0x000360, "Member 'UBP_AccelByteRegisterWidget_C::OnClose' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, FCTColor) == 0x000370, "Member 'UBP_AccelByteRegisterWidget_C::FCTColor' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, bInfoIsGood) == 0x000380, "Member 'UBP_AccelByteRegisterWidget_C::bInfoIsGood' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, OnSendVerificationCode) == 0x000388, "Member 'UBP_AccelByteRegisterWidget_C::OnSendVerificationCode' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, OnBackToLogin) == 0x000398, "Member 'UBP_AccelByteRegisterWidget_C::OnBackToLogin' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, LoginTextColor) == 0x0003A8, "Member 'UBP_AccelByteRegisterWidget_C::LoginTextColor' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteRegisterWidget_C, GuestTextColor) == 0x0003B8, "Member 'UBP_AccelByteRegisterWidget_C::GuestTextColor' has a wrong offset!");

}

