#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelBytePartyUserCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelBytePartyUserCard.BP_AccelBytePartyUserCard_C
// 0x0080 (0x02E8 - 0x0268)
class UBP_AccelBytePartyUserCard_C final : public UPartyMemberCardUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UOverlay*                               AltAvatarOverlay;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AltAvatarTextBlock;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        AvatarSwitcher;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_77;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_123;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelText;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainAvatarOverlay;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlatformIcon_C*                     PlatformIconWidget;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UserNameText;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 UserId;                                            // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AccelBytePartyUserCard(int32 EntryPoint);
	void Initialize(const class FString& UserId_0, const class FString& Username, bool IsPartyLeader);
	void OnSuccess_8C88B5DD48589BED33D195A600A62014(const struct FFCTPlatformPlayerInfo& PlatformInfo, int32 Code, const class FString& Message);
	void OnError_8C88B5DD48589BED33D195A600A62014(const struct FFCTPlatformPlayerInfo& PlatformInfo, int32 Code, const class FString& Message);
	void OnSuccess_B24BA4A448AF67C9DD5A93B60FC04454(const struct FSimpleUserData& UserData);
	void OnFail_B24BA4A448AF67C9DD5A93B60FC04454(int32 Code, const class FString& Message);
	void OnSuccess_5D1EFB1E4BAE81E5010024AE230E13AD(const struct FFCTPublicPlayerData& Payload, int32 Code, const class FString& Message);
	void OnError_5D1EFB1E4BAE81E5010024AE230E13AD(int32 Code, const class FString& Message);
	void SetPartyLeaderIconState(const class FString& LeaderId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelBytePartyUserCard_C">();
	}
	static class UBP_AccelBytePartyUserCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelBytePartyUserCard_C>();
	}
};
static_assert(alignof(UBP_AccelBytePartyUserCard_C) == 0x000008, "Wrong alignment on UBP_AccelBytePartyUserCard_C");
static_assert(sizeof(UBP_AccelBytePartyUserCard_C) == 0x0002E8, "Wrong size on UBP_AccelBytePartyUserCard_C");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, UberGraphFrame) == 0x000268, "Member 'UBP_AccelBytePartyUserCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, AltAvatarOverlay) == 0x000270, "Member 'UBP_AccelBytePartyUserCard_C::AltAvatarOverlay' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, AltAvatarTextBlock) == 0x000278, "Member 'UBP_AccelBytePartyUserCard_C::AltAvatarTextBlock' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, AvatarSwitcher) == 0x000280, "Member 'UBP_AccelBytePartyUserCard_C::AvatarSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, Background) == 0x000288, "Member 'UBP_AccelBytePartyUserCard_C::Background' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, Image) == 0x000290, "Member 'UBP_AccelBytePartyUserCard_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, Image_1) == 0x000298, "Member 'UBP_AccelBytePartyUserCard_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, Image_2) == 0x0002A0, "Member 'UBP_AccelBytePartyUserCard_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, Image_77) == 0x0002A8, "Member 'UBP_AccelBytePartyUserCard_C::Image_77' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, Image_123) == 0x0002B0, "Member 'UBP_AccelBytePartyUserCard_C::Image_123' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, LevelText) == 0x0002B8, "Member 'UBP_AccelBytePartyUserCard_C::LevelText' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, MainAvatarOverlay) == 0x0002C0, "Member 'UBP_AccelBytePartyUserCard_C::MainAvatarOverlay' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, PlatformIconWidget) == 0x0002C8, "Member 'UBP_AccelBytePartyUserCard_C::PlatformIconWidget' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, UserNameText) == 0x0002D0, "Member 'UBP_AccelBytePartyUserCard_C::UserNameText' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyUserCard_C, UserId) == 0x0002D8, "Member 'UBP_AccelBytePartyUserCard_C::UserId' has a wrong offset!");

}

