#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelBytePreviewUserCardTooltip

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelBytePreviewUserCardTooltip.BP_AccelBytePreviewUserCardTooltip_C
// 0x0030 (0x0290 - 0x0260)
class UBP_AccelBytePreviewUserCardTooltip_C final : public UUserWidget
{
public:
	class UImage*                                 Image;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_40;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_171;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelBytePreviewUserCardTooltip_C">();
	}
	static class UBP_AccelBytePreviewUserCardTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelBytePreviewUserCardTooltip_C>();
	}
};
static_assert(alignof(UBP_AccelBytePreviewUserCardTooltip_C) == 0x000008, "Wrong alignment on UBP_AccelBytePreviewUserCardTooltip_C");
static_assert(sizeof(UBP_AccelBytePreviewUserCardTooltip_C) == 0x000290, "Wrong size on UBP_AccelBytePreviewUserCardTooltip_C");
static_assert(offsetof(UBP_AccelBytePreviewUserCardTooltip_C, Image) == 0x000260, "Member 'UBP_AccelBytePreviewUserCardTooltip_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCardTooltip_C, Image_1) == 0x000268, "Member 'UBP_AccelBytePreviewUserCardTooltip_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCardTooltip_C, Image_2) == 0x000270, "Member 'UBP_AccelBytePreviewUserCardTooltip_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCardTooltip_C, Image_3) == 0x000278, "Member 'UBP_AccelBytePreviewUserCardTooltip_C::Image_3' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCardTooltip_C, Image_40) == 0x000280, "Member 'UBP_AccelBytePreviewUserCardTooltip_C::Image_40' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePreviewUserCardTooltip_C, Image_171) == 0x000288, "Member 'UBP_AccelBytePreviewUserCardTooltip_C::Image_171' has a wrong offset!");

}

