#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelBytePartyInvitePopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelBytePartyInvitePopup.BP_AccelBytePartyInvitePopup_C
// 0x00D8 (0x0338 - 0x0260)
class UBP_AccelBytePartyInvitePopup_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_ClickableSubTitleWI_C*              AcceptClickable;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                AcceptFriendButton;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AcceptMessage;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AcceptText;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AcceptText_1;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ContextSwitcher;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_74;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InviteContainer;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InvitedToPartyText;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              RejectClickable;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RejectFriendButton;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SendersDisplayNameText;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 SendersDisplayNameString;                          // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 PartyId;                                           // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 InvitationToken;                                   // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           AnimTimerHandle;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_AccelBytePartyMemberList_C*         PartyMemberList;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class FString>                         UsersWhoInvitedFromSameParty;                      // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnJoinedParty;                                     // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnJoinedParty__DelegateSignature();
	void ExecuteUbergraph_BP_AccelBytePartyInvitePopup(int32 EntryPoint);
	void BndEvt__BP_AccelBytePartyInvitePopup_RejectClickable_K2Node_ComponentBoundEvent_3_OnButtonState__DelegateSignature();
	void BndEvt__BP_AccelBytePartyInvitePopup_AcceptClickable_K2Node_ComponentBoundEvent_2_OnButtonState__DelegateSignature();
	void OnAnimate();
	void BndEvt__RejectFriendButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void OnSuccess_8F0B99DB4712334D908EE19C4720463E();
	void OnFail_8F0B99DB4712334D908EE19C4720463E();
	void OnSuccess_AB3C97334A01CCDA40811D966D220256();
	void OnFail_AB3C97334A01CCDA40811D966D220256();
	void UpdateSendersText(const class FString& NewSender);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelBytePartyInvitePopup_C">();
	}
	static class UBP_AccelBytePartyInvitePopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelBytePartyInvitePopup_C>();
	}
};
static_assert(alignof(UBP_AccelBytePartyInvitePopup_C) == 0x000008, "Wrong alignment on UBP_AccelBytePartyInvitePopup_C");
static_assert(sizeof(UBP_AccelBytePartyInvitePopup_C) == 0x000338, "Wrong size on UBP_AccelBytePartyInvitePopup_C");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, UberGraphFrame) == 0x000260, "Member 'UBP_AccelBytePartyInvitePopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, AcceptClickable) == 0x000268, "Member 'UBP_AccelBytePartyInvitePopup_C::AcceptClickable' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, AcceptFriendButton) == 0x000270, "Member 'UBP_AccelBytePartyInvitePopup_C::AcceptFriendButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, AcceptMessage) == 0x000278, "Member 'UBP_AccelBytePartyInvitePopup_C::AcceptMessage' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, AcceptText) == 0x000280, "Member 'UBP_AccelBytePartyInvitePopup_C::AcceptText' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, AcceptText_1) == 0x000288, "Member 'UBP_AccelBytePartyInvitePopup_C::AcceptText_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, ContextSwitcher) == 0x000290, "Member 'UBP_AccelBytePartyInvitePopup_C::ContextSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, Image) == 0x000298, "Member 'UBP_AccelBytePartyInvitePopup_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, Image_1) == 0x0002A0, "Member 'UBP_AccelBytePartyInvitePopup_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, Image_74) == 0x0002A8, "Member 'UBP_AccelBytePartyInvitePopup_C::Image_74' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, InviteContainer) == 0x0002B0, "Member 'UBP_AccelBytePartyInvitePopup_C::InviteContainer' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, InvitedToPartyText) == 0x0002B8, "Member 'UBP_AccelBytePartyInvitePopup_C::InvitedToPartyText' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, RejectClickable) == 0x0002C0, "Member 'UBP_AccelBytePartyInvitePopup_C::RejectClickable' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, RejectFriendButton) == 0x0002C8, "Member 'UBP_AccelBytePartyInvitePopup_C::RejectFriendButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, SendersDisplayNameText) == 0x0002D0, "Member 'UBP_AccelBytePartyInvitePopup_C::SendersDisplayNameText' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, SendersDisplayNameString) == 0x0002D8, "Member 'UBP_AccelBytePartyInvitePopup_C::SendersDisplayNameString' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, PartyId) == 0x0002E8, "Member 'UBP_AccelBytePartyInvitePopup_C::PartyId' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, InvitationToken) == 0x0002F8, "Member 'UBP_AccelBytePartyInvitePopup_C::InvitationToken' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, AnimTimerHandle) == 0x000308, "Member 'UBP_AccelBytePartyInvitePopup_C::AnimTimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, PartyMemberList) == 0x000310, "Member 'UBP_AccelBytePartyInvitePopup_C::PartyMemberList' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, UsersWhoInvitedFromSameParty) == 0x000318, "Member 'UBP_AccelBytePartyInvitePopup_C::UsersWhoInvitedFromSameParty' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyInvitePopup_C, OnJoinedParty) == 0x000328, "Member 'UBP_AccelBytePartyInvitePopup_C::OnJoinedParty' has a wrong offset!");

}

