#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelByteLoginWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "SCT_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelByteLoginWidget.BP_AccelByteLoginWidget_C
// 0x0408 (0x0668 - 0x0260)
class UBP_AccelByteLoginWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UTextBlock*                             AchievementsSync;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BodyBG;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BodyBG_1;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AccelByteRegisterConfirmedWidget_C* BP_AccelByteRegisterConfirmedWidget;               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ContinueAsGuestText;                               // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EnterEmailTextBox;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EnterPasswordTextBox;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EntitlementsSync;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ForgotPasswordButton;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ForgotPasswordText;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FriendsSync;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBG;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBG_1;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_200;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_414;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LoginButton;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LoginButton_1;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LoginError;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LoginErrorText;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LoginMessagingWidget;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LoginStatusText;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LoginWidget;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PlayAsGuestButton;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ProfileSync;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RegisterButton;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StatsSync;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClose;                                           // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnRegisterNewUser;                                 // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           GuestTextColor;                                    // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TextAnimTimerHandle;                               // 0x0390(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFCTUserAccountMergerPayload           MergePayload;                                      // 0x0398(0x02A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MergingTries;                                      // 0x0638(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CurrentText;                                       // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnNeedsVerification;                               // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           ForgotPasswordColor;                               // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnClose__DelegateSignature();
	void OnRegisterNewUser__DelegateSignature();
	void OnNeedsVerification__DelegateSignature();
	void ExecuteUbergraph_BP_AccelByteLoginWidget(int32 EntryPoint);
	void Construct();
	void BndEvt__BP_AccelByteLoginWidget_ForgotPasswordButton_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__BP_AccelByteLoginWidget_ForgotPasswordButton_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_AccelByteLoginWidget_ForgotPasswordButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_AccelByteLoginWidget_ForgotPasswordButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void OnReconnected();
	void OnMergeAccount();
	void StartSyncAnimation(class UTextBlock* InCurrentText);
	void FadeUpText();
	void BndEvt__PlayAsGuestButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void FadeDownText();
	void BndEvt__CompleteRegistrationButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__RegisterButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void InitializeLoginAnimation();
	void EndAnimation();
	void BndEvt__PlayAsGuestButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__PlayAsGuestButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void OnSuccess_5C37504346B28BE8BDA754BC27DF654B(const class FString& Result, int32 Code);
	void OnError_5C37504346B28BE8BDA754BC27DF654B(const class FString& Result, int32 Code);
	void OnSuccess_EC8E21024747438DC9E5FAA12B8E764A(const class FString& Result, int32 Code);
	void OnError_EC8E21024747438DC9E5FAA12B8E764A(const class FString& Result, int32 Code);
	void OnSuccess_ACFC722540E73891C7B876AB5F6D02B2(const class FString& Result, int32 Code);
	void OnError_ACFC722540E73891C7B876AB5F6D02B2(const class FString& Result, int32 Code);
	void OnSuccess_BB49AE1E410051CB5837E5A718D38B6F(const struct FAccountUserData& Result, const class FString& Message, int32 Code);
	void OnError_BB49AE1E410051CB5837E5A718D38B6F(const class FString& Message, int32 Code);
	void OnSuccess_59654AFD4000A2758A8C468DBFBF7EB3(const class FString& Result, int32 Code);
	void OnError_59654AFD4000A2758A8C468DBFBF7EB3(const class FString& Result, int32 Code);
	void GetPasswordInputString(class FString* OutPassword);
	void GetEmailInputString(class FString* OutEmail);
	void Set_Error_Message(class UTextBlock* TextWidget, const class FText& ErrorText);
	void TextFadeAnimate(float TargetAlpha, bool* bIsComplete);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelByteLoginWidget_C">();
	}
	static class UBP_AccelByteLoginWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelByteLoginWidget_C>();
	}
};
static_assert(alignof(UBP_AccelByteLoginWidget_C) == 0x000008, "Wrong alignment on UBP_AccelByteLoginWidget_C");
static_assert(sizeof(UBP_AccelByteLoginWidget_C) == 0x000668, "Wrong size on UBP_AccelByteLoginWidget_C");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, UberGraphFrame) == 0x000260, "Member 'UBP_AccelByteLoginWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, AchievementsSync) == 0x000268, "Member 'UBP_AccelByteLoginWidget_C::AchievementsSync' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, BodyBG) == 0x000270, "Member 'UBP_AccelByteLoginWidget_C::BodyBG' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, BodyBG_1) == 0x000278, "Member 'UBP_AccelByteLoginWidget_C::BodyBG_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, BP_AccelByteRegisterConfirmedWidget) == 0x000280, "Member 'UBP_AccelByteLoginWidget_C::BP_AccelByteRegisterConfirmedWidget' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, ContinueAsGuestText) == 0x000288, "Member 'UBP_AccelByteLoginWidget_C::ContinueAsGuestText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, EnterEmailTextBox) == 0x000290, "Member 'UBP_AccelByteLoginWidget_C::EnterEmailTextBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, EnterPasswordTextBox) == 0x000298, "Member 'UBP_AccelByteLoginWidget_C::EnterPasswordTextBox' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, EntitlementsSync) == 0x0002A0, "Member 'UBP_AccelByteLoginWidget_C::EntitlementsSync' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, ForgotPasswordButton) == 0x0002A8, "Member 'UBP_AccelByteLoginWidget_C::ForgotPasswordButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, ForgotPasswordText) == 0x0002B0, "Member 'UBP_AccelByteLoginWidget_C::ForgotPasswordText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, FriendsSync) == 0x0002B8, "Member 'UBP_AccelByteLoginWidget_C::FriendsSync' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, HeaderBG) == 0x0002C0, "Member 'UBP_AccelByteLoginWidget_C::HeaderBG' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, HeaderBG_1) == 0x0002C8, "Member 'UBP_AccelByteLoginWidget_C::HeaderBG_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, Image) == 0x0002D0, "Member 'UBP_AccelByteLoginWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, Image_1) == 0x0002D8, "Member 'UBP_AccelByteLoginWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, Image_2) == 0x0002E0, "Member 'UBP_AccelByteLoginWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, Image_6) == 0x0002E8, "Member 'UBP_AccelByteLoginWidget_C::Image_6' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, Image_200) == 0x0002F0, "Member 'UBP_AccelByteLoginWidget_C::Image_200' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, Image_414) == 0x0002F8, "Member 'UBP_AccelByteLoginWidget_C::Image_414' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, LoginButton) == 0x000300, "Member 'UBP_AccelByteLoginWidget_C::LoginButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, LoginButton_1) == 0x000308, "Member 'UBP_AccelByteLoginWidget_C::LoginButton_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, LoginError) == 0x000310, "Member 'UBP_AccelByteLoginWidget_C::LoginError' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, LoginErrorText) == 0x000318, "Member 'UBP_AccelByteLoginWidget_C::LoginErrorText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, LoginMessagingWidget) == 0x000320, "Member 'UBP_AccelByteLoginWidget_C::LoginMessagingWidget' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, LoginStatusText) == 0x000328, "Member 'UBP_AccelByteLoginWidget_C::LoginStatusText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, LoginWidget) == 0x000330, "Member 'UBP_AccelByteLoginWidget_C::LoginWidget' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, PlayAsGuestButton) == 0x000338, "Member 'UBP_AccelByteLoginWidget_C::PlayAsGuestButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, ProfileSync) == 0x000340, "Member 'UBP_AccelByteLoginWidget_C::ProfileSync' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, RegisterButton) == 0x000348, "Member 'UBP_AccelByteLoginWidget_C::RegisterButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, StatsSync) == 0x000350, "Member 'UBP_AccelByteLoginWidget_C::StatsSync' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, Switcher) == 0x000358, "Member 'UBP_AccelByteLoginWidget_C::Switcher' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, OnClose) == 0x000360, "Member 'UBP_AccelByteLoginWidget_C::OnClose' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, OnRegisterNewUser) == 0x000370, "Member 'UBP_AccelByteLoginWidget_C::OnRegisterNewUser' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, GuestTextColor) == 0x000380, "Member 'UBP_AccelByteLoginWidget_C::GuestTextColor' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, TextAnimTimerHandle) == 0x000390, "Member 'UBP_AccelByteLoginWidget_C::TextAnimTimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, MergePayload) == 0x000398, "Member 'UBP_AccelByteLoginWidget_C::MergePayload' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, MergingTries) == 0x000638, "Member 'UBP_AccelByteLoginWidget_C::MergingTries' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, CurrentText) == 0x000640, "Member 'UBP_AccelByteLoginWidget_C::CurrentText' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, OnNeedsVerification) == 0x000648, "Member 'UBP_AccelByteLoginWidget_C::OnNeedsVerification' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteLoginWidget_C, ForgotPasswordColor) == 0x000658, "Member 'UBP_AccelByteLoginWidget_C::ForgotPasswordColor' has a wrong offset!");

}

