#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AquaticInteraction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AquaticInteraction.BP_AquaticInteraction_C.GetTransform
// 0x00C0 (0x00C0 - 0x0000)
struct BP_AquaticInteraction_C_GetTransform final
{
public:
	class ABP_AquaticSurface_C*                   Surface;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Fade;                                              // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticInteraction_C_GetTransform) == 0x000010, "Wrong alignment on BP_AquaticInteraction_C_GetTransform");
static_assert(sizeof(BP_AquaticInteraction_C_GetTransform) == 0x0000C0, "Wrong size on BP_AquaticInteraction_C_GetTransform");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, Surface) == 0x000000, "Member 'BP_AquaticInteraction_C_GetTransform::Surface' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, Location) == 0x000008, "Member 'BP_AquaticInteraction_C_GetTransform::Location' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, Rotation) == 0x000014, "Member 'BP_AquaticInteraction_C_GetTransform::Rotation' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, Fade) == 0x000020, "Member 'BP_AquaticInteraction_C_GetTransform::Fade' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_X) == 0x000070, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_Y) == 0x000074, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_Z) == 0x000078, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakTransform_Location) == 0x00007C, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakTransform_Scale) == 0x000094, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_X_1) == 0x0000A0, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_Y_1) == 0x0000A4, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_Z_1) == 0x0000A8, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000AC, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_Abs_ReturnValue) == 0x0000B0, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_MapRangeClamped_ReturnValue) == 0x0000B4, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

}

