#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelBytePartyEmptyUserCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelBytePartyEmptyUserCard.BP_AccelBytePartyEmptyUserCard_C
// 0x0048 (0x02A8 - 0x0260)
class UBP_AccelBytePartyEmptyUserCard_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Image;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_106;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InviteUserButton;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnInviteFriendsClicked;                            // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnInviteFriendsClicked__DelegateSignature();
	void ExecuteUbergraph_BP_AccelBytePartyEmptyUserCard(int32 EntryPoint);
	void BndEvt__InviteUserButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelBytePartyEmptyUserCard_C">();
	}
	static class UBP_AccelBytePartyEmptyUserCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelBytePartyEmptyUserCard_C>();
	}
};
static_assert(alignof(UBP_AccelBytePartyEmptyUserCard_C) == 0x000008, "Wrong alignment on UBP_AccelBytePartyEmptyUserCard_C");
static_assert(sizeof(UBP_AccelBytePartyEmptyUserCard_C) == 0x0002A8, "Wrong size on UBP_AccelBytePartyEmptyUserCard_C");
static_assert(offsetof(UBP_AccelBytePartyEmptyUserCard_C, UberGraphFrame) == 0x000260, "Member 'UBP_AccelBytePartyEmptyUserCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyEmptyUserCard_C, Image) == 0x000268, "Member 'UBP_AccelBytePartyEmptyUserCard_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyEmptyUserCard_C, Image_1) == 0x000270, "Member 'UBP_AccelBytePartyEmptyUserCard_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyEmptyUserCard_C, Image_2) == 0x000278, "Member 'UBP_AccelBytePartyEmptyUserCard_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyEmptyUserCard_C, Image_3) == 0x000280, "Member 'UBP_AccelBytePartyEmptyUserCard_C::Image_3' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyEmptyUserCard_C, Image_106) == 0x000288, "Member 'UBP_AccelBytePartyEmptyUserCard_C::Image_106' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyEmptyUserCard_C, InviteUserButton) == 0x000290, "Member 'UBP_AccelBytePartyEmptyUserCard_C::InviteUserButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelBytePartyEmptyUserCard_C, OnInviteFriendsClicked) == 0x000298, "Member 'UBP_AccelBytePartyEmptyUserCard_C::OnInviteFriendsClicked' has a wrong offset!");

}

