#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AquaticSimulation

#include "Basic.hpp"

#include "BS_AquaticInteraction_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BS_AquaticInteractionData_structs.hpp"


namespace SDK::Params
{

// Function BP_AquaticSimulation.BP_AquaticSimulation_C.ExecuteUbergraph_BP_AquaticSimulation
// 0x0090 (0x0090 - 0x0000)
struct BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ABP_AquaticSurface_C*             Temp_object_Variable;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocal_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_NewRenderTarget_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_NewRenderTarget_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_NewRenderTarget_ReturnValue_2;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextureRenderTarget2D*>         K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsLocal_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             CallFunc_GetWorldOriginLocation_ReturnValue;       // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnWorldOriginChanged_Update;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetRenderTarget_HeightRT;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation) == 0x000008, "Wrong alignment on BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation");
static_assert(sizeof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation) == 0x000090, "Wrong size on BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, EntryPoint) == 0x000000, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, Temp_object_Variable) == 0x000008, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_Array_RemoveItem_ReturnValue) == 0x000014, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000024, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_IsLocal_ReturnValue) == 0x00002C, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_IsLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_NewRenderTarget_ReturnValue) == 0x000030, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_NewRenderTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_NewRenderTarget_ReturnValue_1) == 0x000038, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_NewRenderTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_NewRenderTarget_ReturnValue_2) == 0x000040, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_NewRenderTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, K2Node_MakeArray_Array) == 0x000048, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_IsLocal_ReturnValue_1) == 0x000058, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_IsLocal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_GetWorldOriginLocation_ReturnValue) == 0x00005C, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_GetWorldOriginLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_OnWorldOriginChanged_Update) == 0x000068, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_OnWorldOriginChanged_Update' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_GetRenderTarget_HeightRT) == 0x000080, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_GetRenderTarget_HeightRT' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000088, "Member 'BP_AquaticSimulation_C_ExecuteUbergraph_BP_AquaticSimulation::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_AquaticSimulation.BP_AquaticSimulation_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AquaticSimulation_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticSimulation_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AquaticSimulation_C_ReceiveTick");
static_assert(sizeof(BP_AquaticSimulation_C_ReceiveTick) == 0x000004, "Wrong size on BP_AquaticSimulation_C_ReceiveTick");
static_assert(offsetof(BP_AquaticSimulation_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AquaticSimulation_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AquaticSimulation.BP_AquaticSimulation_C.UserConstructionScript
// 0x0210 (0x0210 - 0x0000)
struct BP_AquaticSimulation_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0024(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_5;            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x010C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_AquaticSurface_C*                   CallFunc_Array_Get_Item;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_6;            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_7;            // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_8;            // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_9;            // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_10;           // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_11;           // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_12;           // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticSimulation_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_AquaticSimulation_C_UserConstructionScript");
static_assert(sizeof(BP_AquaticSimulation_C_UserConstructionScript) == 0x000210, "Wrong size on BP_AquaticSimulation_C_UserConstructionScript");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_AquaticSimulation_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00000C, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000020, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000024, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Round_ReturnValue) == 0x0000B0, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x0000B4, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0000B8, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Round_ReturnValue_1) == 0x0000BC, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x0000C4, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_FTrunc_ReturnValue) == 0x0000C8, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000CC, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D0, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_4) == 0x0000DC, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0000E0, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_5) == 0x0000E4, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_FTrunc_ReturnValue_1) == 0x0000E8, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000EC, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x0000F0, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000FC, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_2) == 0x000100, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x00010C, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000198, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_6) == 0x0001A4, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_7) == 0x0001A8, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_3) == 0x0001AC, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_FMin_ReturnValue) == 0x0001B8, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0001BC, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_8) == 0x0001C0, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0001C4, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_9) == 0x0001C8, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x0001CC, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_10) == 0x0001D0, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x0001D4, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x0001D8, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_MakeVector2D_ReturnValue) == 0x0001DC, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_11) == 0x0001E4, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0001E8, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_12) == 0x0001F0, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_5) == 0x0001F4, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x0001F8, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000200, "Member 'BP_AquaticSimulation_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000204, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000208, "Member 'BP_AquaticSimulation_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_AquaticSimulation.BP_AquaticSimulation_C.GetRenderTarget
// 0x0030 (0x0030 - 0x0000)
struct BP_AquaticSimulation_C_GetRenderTarget final
{
public:
	int32                                         NumFramesOld;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 HeightRT;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 NewLocalVar_0;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticSimulation_C_GetRenderTarget) == 0x000008, "Wrong alignment on BP_AquaticSimulation_C_GetRenderTarget");
static_assert(sizeof(BP_AquaticSimulation_C_GetRenderTarget) == 0x000030, "Wrong size on BP_AquaticSimulation_C_GetRenderTarget");
static_assert(offsetof(BP_AquaticSimulation_C_GetRenderTarget, NumFramesOld) == 0x000000, "Member 'BP_AquaticSimulation_C_GetRenderTarget::NumFramesOld' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_GetRenderTarget, HeightRT) == 0x000008, "Member 'BP_AquaticSimulation_C_GetRenderTarget::HeightRT' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_GetRenderTarget, NewLocalVar_0) == 0x000010, "Member 'BP_AquaticSimulation_C_GetRenderTarget::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_GetRenderTarget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_AquaticSimulation_C_GetRenderTarget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_GetRenderTarget, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_AquaticSimulation_C_GetRenderTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_GetRenderTarget, CallFunc_Percent_IntInt_ReturnValue) == 0x000020, "Member 'BP_AquaticSimulation_C_GetRenderTarget::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_GetRenderTarget, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_AquaticSimulation_C_GetRenderTarget::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_AquaticSimulation.BP_AquaticSimulation_C.UpdateInteraction
// 0x00E8 (0x00E8 - 0x0000)
struct BP_AquaticSimulation_C_UpdateInteraction final
{
public:
	class UCanvas*                                Canvas;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ScreenSize;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Interaction;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewInterationRotation;                             // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ForceFade;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewInteractionLocation;                            // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateInteractionTime_Draw;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2DSquared_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTransform_Location;                    // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetTransform_Rotation;                    // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTransform_Fade;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AquaticSimulation_C_UpdateInteraction) == 0x000008, "Wrong alignment on BP_AquaticSimulation_C_UpdateInteraction");
static_assert(sizeof(BP_AquaticSimulation_C_UpdateInteraction) == 0x0000E8, "Wrong size on BP_AquaticSimulation_C_UpdateInteraction");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, Canvas) == 0x000000, "Member 'BP_AquaticSimulation_C_UpdateInteraction::Canvas' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, ScreenSize) == 0x000008, "Member 'BP_AquaticSimulation_C_UpdateInteraction::ScreenSize' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, Interaction) == 0x000010, "Member 'BP_AquaticSimulation_C_UpdateInteraction::Interaction' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, DeltaTime) == 0x000014, "Member 'BP_AquaticSimulation_C_UpdateInteraction::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, NewInterationRotation) == 0x000018, "Member 'BP_AquaticSimulation_C_UpdateInteraction::NewInterationRotation' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, ForceFade) == 0x000024, "Member 'BP_AquaticSimulation_C_UpdateInteraction::ForceFade' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, NewInteractionLocation) == 0x000028, "Member 'BP_AquaticSimulation_C_UpdateInteraction::NewInteractionLocation' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_UpdateInteractionTime_Draw) == 0x000034, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_UpdateInteractionTime_Draw' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000035, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_RandomUnitVector_ReturnValue) == 0x000038, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000044, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00004C, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000050, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_VSize2DSquared_ReturnValue) == 0x000058, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_VSize2DSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Less_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000060, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x00006C, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_BreakRotator_Roll) == 0x000084, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_BreakRotator_Pitch) == 0x000088, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_BreakRotator_Yaw) == 0x00008C, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000090, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Abs_ReturnValue) == 0x00009C, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_VSize_ReturnValue) == 0x0000A0, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Abs_ReturnValue_1) == 0x0000A4, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Abs_ReturnValue_2) == 0x0000AC, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000B4, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000B8, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000BC, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_GetTransform_Location) == 0x0000C0, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_GetTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_GetTransform_Rotation) == 0x0000CC, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_GetTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_GetTransform_Fade) == 0x0000D8, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_GetTransform_Fade' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_FClamp_ReturnValue) == 0x0000DC, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000E0, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_UpdateInteraction, CallFunc_IsValid_ReturnValue) == 0x0000E4, "Member 'BP_AquaticSimulation_C_UpdateInteraction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AquaticSimulation.BP_AquaticSimulation_C.AddInteractionActor
// 0x00C0 (0x00C0 - 0x0000)
struct BP_AquaticSimulation_C_AddInteractionActor final
{
public:
	class ABP_AquaticSurface_C*                   InteractionSurface;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_AquaticInteraction_C*>       CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AquaticInteraction_C*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocal_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTransform_Location;                    // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetTransform_Rotation;                    // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTransform_Fade;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_AquaticInteraction                 K2Node_MakeStruct_BS_AquaticInteraction;           // 0x0060(0x0058)(IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticSimulation_C_AddInteractionActor) == 0x000008, "Wrong alignment on BP_AquaticSimulation_C_AddInteractionActor");
static_assert(sizeof(BP_AquaticSimulation_C_AddInteractionActor) == 0x0000C0, "Wrong size on BP_AquaticSimulation_C_AddInteractionActor");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, InteractionSurface) == 0x000000, "Member 'BP_AquaticSimulation_C_AddInteractionActor::InteractionSurface' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, Target) == 0x000008, "Member 'BP_AquaticSimulation_C_AddInteractionActor::Target' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_AquaticSimulation_C_AddInteractionActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_AquaticSimulation_C_AddInteractionActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_IsLocal_ReturnValue) == 0x000040, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_IsLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_GetTransform_Location) == 0x000044, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_GetTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_GetTransform_Rotation) == 0x000050, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_GetTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_GetTransform_Fade) == 0x00005C, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_GetTransform_Fade' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, K2Node_MakeStruct_BS_AquaticInteraction) == 0x000060, "Member 'BP_AquaticSimulation_C_AddInteractionActor::K2Node_MakeStruct_BS_AquaticInteraction' has a wrong offset!");
static_assert(offsetof(BP_AquaticSimulation_C_AddInteractionActor, CallFunc_Array_Add_ReturnValue) == 0x0000B8, "Member 'BP_AquaticSimulation_C_AddInteractionActor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_AquaticSimulation.BP_AquaticSimulation_C.RemoveInteractionActor
// 0x0050 (0x0050 - 0x0000)
struct BP_AquaticSimulation_C_RemoveInteractionActor final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RemoveIndex;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_AquaticInteraction_C*>       CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_AquaticInteraction_C*               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
