#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccelByteGameSetting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AccelByteGameSetting.BP_AccelByteGameSetting_C
// 0x0058 (0x02B8 - 0x0260)
class UBP_AccelByteGameSetting_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UTextBlock*                             Email;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_73;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_262;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NotRegisteredButton;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        RegisterState;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Username;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnOpenVersusEvilRegisterDialog;                    // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnOpenVersusEvilRegisterDialog__DelegateSignature();
	void ExecuteUbergraph_BP_AccelByteGameSetting(int32 EntryPoint);
	void OnPlayerHasRegistered();
	void OnSetRegistrationUI();
	void BndEvt__Button_218_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void OnSuccess_4A2869D14A8007B7DFFF148B70E95FE3(const struct FAccountUserData& Result, const class FString& Message, int32 Code);
	void OnError_4A2869D14A8007B7DFFF148B70E95FE3(const class FString& Message, int32 Code);
	void OnSuccess_F1016D56483EAC7C94175FBC2290B815(const struct FAccountUserData& Result, const class FString& Message, int32 Code);
	void OnError_F1016D56483EAC7C94175FBC2290B815(const class FString& Message, int32 Code);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AccelByteGameSetting_C">();
	}
	static class UBP_AccelByteGameSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AccelByteGameSetting_C>();
	}
};
static_assert(alignof(UBP_AccelByteGameSetting_C) == 0x000008, "Wrong alignment on UBP_AccelByteGameSetting_C");
static_assert(sizeof(UBP_AccelByteGameSetting_C) == 0x0002B8, "Wrong size on UBP_AccelByteGameSetting_C");
static_assert(offsetof(UBP_AccelByteGameSetting_C, UberGraphFrame) == 0x000260, "Member 'UBP_AccelByteGameSetting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteGameSetting_C, Email) == 0x000268, "Member 'UBP_AccelByteGameSetting_C::Email' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteGameSetting_C, Image) == 0x000270, "Member 'UBP_AccelByteGameSetting_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteGameSetting_C, Image_1) == 0x000278, "Member 'UBP_AccelByteGameSetting_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteGameSetting_C, Image_73) == 0x000280, "Member 'UBP_AccelByteGameSetting_C::Image_73' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteGameSetting_C, Image_262) == 0x000288, "Member 'UBP_AccelByteGameSetting_C::Image_262' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteGameSetting_C, NotRegisteredButton) == 0x000290, "Member 'UBP_AccelByteGameSetting_C::NotRegisteredButton' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteGameSetting_C, RegisterState) == 0x000298, "Member 'UBP_AccelByteGameSetting_C::RegisterState' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteGameSetting_C, Username) == 0x0002A0, "Member 'UBP_AccelByteGameSetting_C::Username' has a wrong offset!");
static_assert(offsetof(UBP_AccelByteGameSetting_C, OnOpenVersusEvilRegisterDialog) == 0x0002A8, "Member 'UBP_AccelByteGameSetting_C::OnOpenVersusEvilRegisterDialog' has a wrong offset!");

}

