#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AchievementRecentUnlocksPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AchievementRecentUnlocksPanel.BP_AchievementRecentUnlocksPanel_C.InitializeAchievement
// 0x0050 (0x0050 - 0x0000)
struct BP_AchievementRecentUnlocksPanel_C_InitializeAchievement final
{
public:
	class UFCTAchievement*                        Achievement;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0038(0x0018)()
};
static_assert(alignof(BP_AchievementRecentUnlocksPanel_C_InitializeAchievement) == 0x000008, "Wrong alignment on BP_AchievementRecentUnlocksPanel_C_InitializeAchievement");
static_assert(sizeof(BP_AchievementRecentUnlocksPanel_C_InitializeAchievement) == 0x000050, "Wrong size on BP_AchievementRecentUnlocksPanel_C_InitializeAchievement");
static_assert(offsetof(BP_AchievementRecentUnlocksPanel_C_InitializeAchievement, Achievement) == 0x000000, "Member 'BP_AchievementRecentUnlocksPanel_C_InitializeAchievement::Achievement' has a wrong offset!");
static_assert(offsetof(BP_AchievementRecentUnlocksPanel_C_InitializeAchievement, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'BP_AchievementRecentUnlocksPanel_C_InitializeAchievement::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AchievementRecentUnlocksPanel_C_InitializeAchievement, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000020, "Member 'BP_AchievementRecentUnlocksPanel_C_InitializeAchievement::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AchievementRecentUnlocksPanel_C_InitializeAchievement, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000038, "Member 'BP_AchievementRecentUnlocksPanel_C_InitializeAchievement::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");

}

