#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AchievementRecentUnlocksPanel

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AchievementRecentUnlocksPanel.BP_AchievementRecentUnlocksPanel_C
// 0x0038 (0x0298 - 0x0260)
class UBP_AchievementRecentUnlocksPanel_C final : public UUserWidget
{
public:
	class UTextBlock*                             AchievedOnDate;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AchievementDescription;                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AchievementName;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InitializeAchievement(class UFCTAchievement* Achievement);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AchievementRecentUnlocksPanel_C">();
	}
	static class UBP_AchievementRecentUnlocksPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AchievementRecentUnlocksPanel_C>();
	}
};
static_assert(alignof(UBP_AchievementRecentUnlocksPanel_C) == 0x000008, "Wrong alignment on UBP_AchievementRecentUnlocksPanel_C");
static_assert(sizeof(UBP_AchievementRecentUnlocksPanel_C) == 0x000298, "Wrong size on UBP_AchievementRecentUnlocksPanel_C");
static_assert(offsetof(UBP_AchievementRecentUnlocksPanel_C, AchievedOnDate) == 0x000260, "Member 'UBP_AchievementRecentUnlocksPanel_C::AchievedOnDate' has a wrong offset!");
static_assert(offsetof(UBP_AchievementRecentUnlocksPanel_C, AchievementDescription) == 0x000268, "Member 'UBP_AchievementRecentUnlocksPanel_C::AchievementDescription' has a wrong offset!");
static_assert(offsetof(UBP_AchievementRecentUnlocksPanel_C, AchievementName) == 0x000270, "Member 'UBP_AchievementRecentUnlocksPanel_C::AchievementName' has a wrong offset!");
static_assert(offsetof(UBP_AchievementRecentUnlocksPanel_C, Image) == 0x000278, "Member 'UBP_AchievementRecentUnlocksPanel_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_AchievementRecentUnlocksPanel_C, Image_1) == 0x000280, "Member 'UBP_AchievementRecentUnlocksPanel_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_AchievementRecentUnlocksPanel_C, Image_2) == 0x000288, "Member 'UBP_AchievementRecentUnlocksPanel_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBP_AchievementRecentUnlocksPanel_C, Image_32) == 0x000290, "Member 'UBP_AchievementRecentUnlocksPanel_C::Image_32' has a wrong offset!");

}

