#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationAppearancePresetWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CustomizationAppearancePresetWidget.BP_CustomizationAppearancePresetWidget_C
// 0x0018 (0x0278 - 0x0260)
class UBP_CustomizationAppearancePresetWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Image_791;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             PresetsContainer;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CustomizationAppearancePresetWidget(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void Initialize_Preset_Slots(class UBP_CustomizationGender_C* CustomizationGender);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CustomizationAppearancePresetWidget_C">();
	}
	static class UBP_CustomizationAppearancePresetWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomizationAppearancePresetWidget_C>();
	}
};
static_assert(alignof(UBP_CustomizationAppearancePresetWidget_C) == 0x000008, "Wrong alignment on UBP_CustomizationAppearancePresetWidget_C");
static_assert(sizeof(UBP_CustomizationAppearancePresetWidget_C) == 0x000278, "Wrong size on UBP_CustomizationAppearancePresetWidget_C");
static_assert(offsetof(UBP_CustomizationAppearancePresetWidget_C, UberGraphFrame) == 0x000260, "Member 'UBP_CustomizationAppearancePresetWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationAppearancePresetWidget_C, Image_791) == 0x000268, "Member 'UBP_CustomizationAppearancePresetWidget_C::Image_791' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationAppearancePresetWidget_C, PresetsContainer) == 0x000270, "Member 'UBP_CustomizationAppearancePresetWidget_C::PresetsContainer' has a wrong offset!");

}

