#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_Champagne_Tower

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function bp_Champagne_Tower.bp_Champagne_Tower_C.ExecuteUbergraph_bp_Champagne_Tower
// 0x0030 (0x0030 - 0x0000)
struct bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower) == 0x000008, "Wrong alignment on bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower");
static_assert(sizeof(bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower) == 0x000030, "Wrong size on bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower");
static_assert(offsetof(bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower, EntryPoint) == 0x000000, "Member 'bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower, Temp_struct_Variable) == 0x000008, "Member 'bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower, Temp_delegate_Variable) == 0x000018, "Member 'bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000028, "Member 'bp_Champagne_Tower_C_ExecuteUbergraph_bp_Champagne_Tower::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");

}

