#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationAppearancePresetWidget

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomizationAppearancePresetWidget.BP_CustomizationAppearancePresetWidget_C.ExecuteUbergraph_BP_CustomizationAppearancePresetWidget
// 0x000C (0x000C - 0x0000)
struct BP_CustomizationAppearancePresetWidget_C_ExecuteUbergraph_BP_CustomizationAppearancePresetWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
};
static_assert(alignof(BP_CustomizationAppearancePresetWidget_C_ExecuteUbergraph_BP_CustomizationAppearancePresetWidget) == 0x000004, "Wrong alignment on BP_CustomizationAppearancePresetWidget_C_ExecuteUbergraph_BP_CustomizationAppearancePresetWidget");
static_assert(sizeof(BP_CustomizationAppearancePresetWidget_C_ExecuteUbergraph_BP_CustomizationAppearancePresetWidget) == 0x00000C, "Wrong size on BP_CustomizationAppearancePresetWidget_C_ExecuteUbergraph_BP_CustomizationAppearancePresetWidget");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_ExecuteUbergraph_BP_CustomizationAppearancePresetWidget, EntryPoint) == 0x000000, "Member 'BP_CustomizationAppearancePresetWidget_C_ExecuteUbergraph_BP_CustomizationAppearancePresetWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_ExecuteUbergraph_BP_CustomizationAppearancePresetWidget, K2Node_Event_InFocusEvent) == 0x000004, "Member 'BP_CustomizationAppearancePresetWidget_C_ExecuteUbergraph_BP_CustomizationAppearancePresetWidget::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function BP_CustomizationAppearancePresetWidget.BP_CustomizationAppearancePresetWidget_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_CustomizationAppearancePresetWidget_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_CustomizationAppearancePresetWidget_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on BP_CustomizationAppearancePresetWidget_C_OnAddedToFocusPath");
static_assert(sizeof(BP_CustomizationAppearancePresetWidget_C_OnAddedToFocusPath) == 0x000008, "Wrong size on BP_CustomizationAppearancePresetWidget_C_OnAddedToFocusPath");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'BP_CustomizationAppearancePresetWidget_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function BP_CustomizationAppearancePresetWidget.BP_CustomizationAppearancePresetWidget_C.Initialize Preset Slots
// 0x00E8 (0x00E8 - 0x0000)
struct BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots final
{
public:
	class UBP_CustomizationGender_C*              CustomizationGender;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Column;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Row;                                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetPresetInfo_OutRowNames;                // 0x0018(0x0010)(ReferenceParm)
	class UDataTable*                             CallFunc_GetPresetInfo_DataTable;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPresetInfo_Selected;                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationPreset             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0060)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PresetButton_C*                     CallFunc_Create_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots) == 0x000008, "Wrong alignment on BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots");
static_assert(sizeof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots) == 0x0000E8, "Wrong size on BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CustomizationGender) == 0x000000, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CustomizationGender' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, Column) == 0x000008, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::Column' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, Row) == 0x00000C, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::Row' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_Divide_IntInt_ReturnValue) == 0x000014, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_GetPresetInfo_OutRowNames) == 0x000018, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_GetPresetInfo_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_GetPresetInfo_DataTable) == 0x000028, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_GetPresetInfo_DataTable' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_GetPresetInfo_Selected) == 0x000030, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_GetPresetInfo_Selected' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B0, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_Conv_NameToString_ReturnValue) == 0x0000B8, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_Percent_IntInt_ReturnValue) == 0x0000C8, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_Create_ReturnValue) == 0x0000D0, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, Temp_int_Loop_Counter_Variable) == 0x0000D8, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_Less_IntInt_ReturnValue) == 0x0000DC, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots, CallFunc_Add_IntInt_ReturnValue) == 0x0000E0, "Member 'BP_CustomizationAppearancePresetWidget_C_Initialize_Preset_Slots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

