#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationMaterialsContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CustomizationMaterialsContainer.BP_CustomizationMaterialsContainer_C
// 0x0040 (0x02A0 - 0x0260)
class UBP_CustomizationMaterialsContainer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBP_CustomationMaterialSelector_C*      BP_OptionCustomizationPrimary;                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CustomationMaterialSelector_C*      BP_OptionCustomizationSecondary;                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_64;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopLine;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopLine_1;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnChangeMaterial;                                  // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnChangeMaterial__DelegateSignature(const class FString& OptionName);
	void ExecuteUbergraph_BP_CustomizationMaterialsContainer(int32 EntryPoint);
	void Generate_Style_Options(const struct FPlayerCustomizationItem& CustomizationItem, EPlayerCustomizationGender Gender, EPlayerCustomizationType CustomizationCategory, class UMeshComponent* SelectedMesh);
	void Initialize(EPlayerCustomizationGender InGender, const struct FCloudCustomizationSetting& CustomizationSetting);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CustomizationMaterialsContainer_C">();
	}
	static class UBP_CustomizationMaterialsContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomizationMaterialsContainer_C>();
	}
};
static_assert(alignof(UBP_CustomizationMaterialsContainer_C) == 0x000008, "Wrong alignment on UBP_CustomizationMaterialsContainer_C");
static_assert(sizeof(UBP_CustomizationMaterialsContainer_C) == 0x0002A0, "Wrong size on UBP_CustomizationMaterialsContainer_C");
static_assert(offsetof(UBP_CustomizationMaterialsContainer_C, UberGraphFrame) == 0x000260, "Member 'UBP_CustomizationMaterialsContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMaterialsContainer_C, BP_OptionCustomizationPrimary) == 0x000268, "Member 'UBP_CustomizationMaterialsContainer_C::BP_OptionCustomizationPrimary' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMaterialsContainer_C, BP_OptionCustomizationSecondary) == 0x000270, "Member 'UBP_CustomizationMaterialsContainer_C::BP_OptionCustomizationSecondary' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMaterialsContainer_C, Image_64) == 0x000278, "Member 'UBP_CustomizationMaterialsContainer_C::Image_64' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMaterialsContainer_C, TopLine) == 0x000280, "Member 'UBP_CustomizationMaterialsContainer_C::TopLine' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMaterialsContainer_C, TopLine_1) == 0x000288, "Member 'UBP_CustomizationMaterialsContainer_C::TopLine_1' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMaterialsContainer_C, OnChangeMaterial) == 0x000290, "Member 'UBP_CustomizationMaterialsContainer_C::OnChangeMaterial' has a wrong offset!");

}

