#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationMaterialSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CustomizationMaterialSlot.BP_CustomizationMaterialSlot_C.OnUpdateMaterial__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_CustomizationMaterialSlot_C_OnUpdateMaterial__DelegateSignature final
{
public:
	int32                                         MaterialIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      MaterialOption_0;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMaterialSlot_C_OnUpdateMaterial__DelegateSignature) == 0x000008, "Wrong alignment on BP_CustomizationMaterialSlot_C_OnUpdateMaterial__DelegateSignature");
static_assert(sizeof(BP_CustomizationMaterialSlot_C_OnUpdateMaterial__DelegateSignature) == 0x000010, "Wrong size on BP_CustomizationMaterialSlot_C_OnUpdateMaterial__DelegateSignature");
static_assert(offsetof(BP_CustomizationMaterialSlot_C_OnUpdateMaterial__DelegateSignature, MaterialIndex) == 0x000000, "Member 'BP_CustomizationMaterialSlot_C_OnUpdateMaterial__DelegateSignature::MaterialIndex' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMaterialSlot_C_OnUpdateMaterial__DelegateSignature, MaterialOption_0) == 0x000008, "Member 'BP_CustomizationMaterialSlot_C_OnUpdateMaterial__DelegateSignature::MaterialOption_0' has a wrong offset!");

// Function BP_CustomizationMaterialSlot.BP_CustomizationMaterialSlot_C.ExecuteUbergraph_BP_CustomizationMaterialSlot
// 0x0030 (0x0030 - 0x0000)
struct BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_1;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomationMaterialSelector_C*      K2Node_DynamicCast_AsBP_Customation_Material_Selector; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot) == 0x000008, "Wrong alignment on BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot");
static_assert(sizeof(BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot) == 0x000030, "Wrong size on BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot");
static_assert(offsetof(BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot, EntryPoint) == 0x000000, "Member 'BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000008, "Member 'BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot, CallFunc_GetOuterObject_ReturnValue) == 0x000010, "Member 'BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot, CallFunc_GetOuterObject_ReturnValue_1) == 0x000018, "Member 'BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot::CallFunc_GetOuterObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot, K2Node_DynamicCast_AsBP_Customation_Material_Selector) == 0x000020, "Member 'BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot::K2Node_DynamicCast_AsBP_Customation_Material_Selector' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_CustomizationMaterialSlot_C_ExecuteUbergraph_BP_CustomizationMaterialSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

