#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CustomizationMenu.BP_CustomizationMenu_C
// 0x0218 (0x0500 - 0x02E8)
class UBP_CustomizationMenu_C final : public UCustomizationMenuUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_SubMenuWI_C*                        CM_SubMenuWI;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DisclaimerBG;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DisclaimerBG_1;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_EmoteCustomization_C*               EmoteCustomization;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CustomizationGender_C*              FemaleMenu;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GenderBG;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GenderTopLine;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeritageBG;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeritageTopLine;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_177;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_400;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LayerSelectionWarning;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainCanvas;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CustomizationGender_C*              MaleMenu;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              PreviewItemSubtitle;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              PreviewItemSubtitle_1;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedHeritageBox_1;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedHeritageBox_2;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedHeritageBox_3;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedHeritageBox_4;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedHeritageBox_5;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedHeritageBox_6;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedHeritageBox_10;                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VruumbaCustomizationScrollBox_C*    VruumbaMenu;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_505;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ZoomButton;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnBackClicked;                                     // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_CustomizationGender_C*              CurrentGenderMenu;                                 // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MovementHandle;                                    // 0x03D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             UpdateCustomizationRowSelection;                   // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bTransitioning;                                    // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnTryChangingCustomizationCategory;                // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUpdateClothing;                                  // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnChangeGender;                                    // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector2D                              Focused_GenderTabSize;                             // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Unfocused_GenderTabSize;                           // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AppearanceSettingsClass;                           // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsZoomedIn;                                        // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CurrentMaleSelected;                               // 0x0441(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TempMaleSelected;                                  // 0x0442(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_443[0x5];                                      // 0x0443(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnInitializeSavedCameraName;                       // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UButton*                                CurrentTabButton;                                  // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TabNormalColor;                                    // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FadeTimerHandle;                                   // 0x0470(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNotSaved;                                         // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCanExitMenu;                                     // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnChangeToVruumba;                                 // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnChangeToResident;                                // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnChangeToEmote;                                   // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, BlueprintAssignable, BlueprintCallable)
	class UCM_SubMenuSelectionButtonWI_C*         SubMenuButResident;                                // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         SubMenuButVruumba;                                 // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         SubMenuButEmotes;                                  // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 LastVisitedCameraViewInCustomization;              // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCharactersUpdated;                               // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnBackClicked__DelegateSignature();
	void UpdateCustomizationRowSelection__DelegateSignature();
	void OnTryChangingCustomizationCategory__DelegateSignature();
	void OnUpdateClothing__DelegateSignature(const struct FPlayerCustomizationItem& CustomizationElement);
	void OnChangeGender__DelegateSignature(EPlayerCustomizationGender CustomizationGender);
	void OnInitializeSavedCameraName__DelegateSignature(EPlayerCustomizationGender CustomizationGender);
	void OnCanExitMenu__DelegateSignature();
	void OnChangeToVruumba__DelegateSignature();
	void OnChangeToResident__DelegateSignature();
	void OnChangeToEmote__DelegateSignature();
	void OnCharactersUpdated__DelegateSignature(const struct FFCTCloudCustomizationPayload& CustomizationPayload);
	void ExecuteUbergraph_BP_CustomizationMenu(int32 EntryPoint);
	void BndEvt__BP_CustomizationMenu_PreviewItemSubtitle_K2Node_ComponentBoundEvent_7_OnButtonState__DelegateSignature();
	void BndEvt__BP_CustomizationMenu_PreviewItemSubtitle_1_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature();
	void BndEvt__BP_CustomizationMenu_PreviewItemSubtitle_K2Node_ComponentBoundEvent_0_OnResetControllerKey__DelegateSignature();
	void BndEvt__BP_CustomizationMenu_VruumbaMenu_K2Node_ComponentBoundEvent_4_OnMadeChanges__DelegateSignature();
	void On_Swap_Gender(EPlayerCustomizationGender Gender);
	void On_Navigate_Menu_With_Gamepad(const class FString& Title);
	void DeactivateWidget();
	void ActivateWidget();
	void ChangeToEmotes();
	void ChangeToVruumba();
	void ChangeToResident();
	void BndEvt__BP_CustomizationMenu_MaleMenu_K2Node_ComponentBoundEvent_3_OnChangeGenders__DelegateSignature(EPlayerCustomizationGender Gender);
	void BndEvt__BP_CustomizationMenu_FemaleMenu_K2Node_ComponentBoundEvent_1_OnChangeGenders__DelegateSignature(EPlayerCustomizationGender Gender);
	void SaveCharacter();
	void BndEvt__BP_CustomizationMenu_MaleMenu_K2Node_ComponentBoundEvent_6_OnMadeChanges__DelegateSignature();
	void BndEvt__BP_CustomizationMenu_FemaleMenu_K2Node_ComponentBoundEvent_2_OnMadeChanges__DelegateSignature();
	void OnCheckIfModified();
	void RebuildCustomization();
	void OnVersusEvilAccountLinked();
	void OnGetAchievementInfo(const struct FFCTAchievementList& AchievementList);
	void BndEvt__FemaleMenu_K2Node_ComponentBoundEvent_15_OnHandleChangeCategoryZoom__DelegateSignature();
	void BndEvt__MaleMenu_K2Node_ComponentBoundEvent_14_OnHandleChangeCategoryZoom__DelegateSignature();
	void OnClientLoggedIn();
	void HandleMoveToNewZoomedCamera();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void FadeInLockedWarning();
	void OnFadeOutLockedWarning();
	void OnSuccess_3B8E29E84A5B3451C11404AE43BEB0C8(int32 Code, const class FString& Message);
	void OnFail_3B8E29E84A5B3451C11404AE43BEB0C8(int32 Code, const class FString& Message);
	void OnSuccess_1B4ED71645BD77BE270C3BA15DF0EFAF(const struct FAccountUserData& Result, const class FString& Message, int32 Code);
	void OnError_1B4ED71645BD77BE270C3BA15DF0EFAF(const class FString& Message, int32 Code);
	void OnSuccess_91EDAD8E4AA37381DCED7F9CC612EDD3(const struct FFCTCloudCustomizationPayload& Payload, int32 Code, const class FString& Message);
	void OnError_91EDAD8E4AA37381DCED7F9CC612EDD3(int32 Code, const class FString& Message);
	void OnSuccess_07B832A84311E769A6F6569FC1D7548C(const struct FFCTCloudCustomizationPayload& Payload, int32 Code, const class FString& Message);
	void OnError_07B832A84311E769A6F6569FC1D7548C(int32 Code, const class FString& Message);
	void Set_Tab_State(class UButton* NewCurrentTabButton);
	void IsEquippedClothingUnlocked(bool* IsValidToUse);
	void ShowSaveCosmetics();
	void Get_Current_Category(EPlayerCustomizationType* CurrentCategory);
	void Set_Achievements_List_to_Scrollboxes(const struct FFCTAchievementList& AchievementsList);
	void CreateSubmenu();
	void SetCameraView(const class FString& Selection);
	void Rebuilt_Default_Menu();
	void LeaveCustomizationMenu();
	void MakeCurrentPayload(struct FFCTCloudCustomizationPayload* Payload);
	void Remove_Item_Tooltips();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CustomizationMenu_C">();
	}
	static class UBP_CustomizationMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomizationMenu_C>();
	}
};
static_assert(alignof(UBP_CustomizationMenu_C) == 0x000008, "Wrong alignment on UBP_CustomizationMenu_C");
static_assert(sizeof(UBP_CustomizationMenu_C) == 0x000500, "Wrong size on UBP_CustomizationMenu_C");
static_assert(offsetof(UBP_CustomizationMenu_C, UberGraphFrame) == 0x0002E8, "Member 'UBP_CustomizationMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, CM_SubMenuWI) == 0x0002F0, "Member 'UBP_CustomizationMenu_C::CM_SubMenuWI' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, DisclaimerBG) == 0x0002F8, "Member 'UBP_CustomizationMenu_C::DisclaimerBG' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, DisclaimerBG_1) == 0x000300, "Member 'UBP_CustomizationMenu_C::DisclaimerBG_1' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, EmoteCustomization) == 0x000308, "Member 'UBP_CustomizationMenu_C::EmoteCustomization' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, FemaleMenu) == 0x000310, "Member 'UBP_CustomizationMenu_C::FemaleMenu' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, GenderBG) == 0x000318, "Member 'UBP_CustomizationMenu_C::GenderBG' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, GenderTopLine) == 0x000320, "Member 'UBP_CustomizationMenu_C::GenderTopLine' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, HeritageBG) == 0x000328, "Member 'UBP_CustomizationMenu_C::HeritageBG' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, HeritageTopLine) == 0x000330, "Member 'UBP_CustomizationMenu_C::HeritageTopLine' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, Image_177) == 0x000338, "Member 'UBP_CustomizationMenu_C::Image_177' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, Image_400) == 0x000340, "Member 'UBP_CustomizationMenu_C::Image_400' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, LayerSelectionWarning) == 0x000348, "Member 'UBP_CustomizationMenu_C::LayerSelectionWarning' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, MainCanvas) == 0x000350, "Member 'UBP_CustomizationMenu_C::MainCanvas' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, MaleMenu) == 0x000358, "Member 'UBP_CustomizationMenu_C::MaleMenu' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, PreviewItemSubtitle) == 0x000360, "Member 'UBP_CustomizationMenu_C::PreviewItemSubtitle' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, PreviewItemSubtitle_1) == 0x000368, "Member 'UBP_CustomizationMenu_C::PreviewItemSubtitle_1' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, SelectedHeritageBox_1) == 0x000370, "Member 'UBP_CustomizationMenu_C::SelectedHeritageBox_1' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, SelectedHeritageBox_2) == 0x000378, "Member 'UBP_CustomizationMenu_C::SelectedHeritageBox_2' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, SelectedHeritageBox_3) == 0x000380, "Member 'UBP_CustomizationMenu_C::SelectedHeritageBox_3' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, SelectedHeritageBox_4) == 0x000388, "Member 'UBP_CustomizationMenu_C::SelectedHeritageBox_4' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, SelectedHeritageBox_5) == 0x000390, "Member 'UBP_CustomizationMenu_C::SelectedHeritageBox_5' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, SelectedHeritageBox_6) == 0x000398, "Member 'UBP_CustomizationMenu_C::SelectedHeritageBox_6' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, SelectedHeritageBox_10) == 0x0003A0, "Member 'UBP_CustomizationMenu_C::SelectedHeritageBox_10' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, VruumbaMenu) == 0x0003A8, "Member 'UBP_CustomizationMenu_C::VruumbaMenu' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, WidgetSwitcher_505) == 0x0003B0, "Member 'UBP_CustomizationMenu_C::WidgetSwitcher_505' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, ZoomButton) == 0x0003B8, "Member 'UBP_CustomizationMenu_C::ZoomButton' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, OnBackClicked) == 0x0003C0, "Member 'UBP_CustomizationMenu_C::OnBackClicked' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, CurrentGenderMenu) == 0x0003D0, "Member 'UBP_CustomizationMenu_C::CurrentGenderMenu' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, MovementHandle) == 0x0003D8, "Member 'UBP_CustomizationMenu_C::MovementHandle' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, UpdateCustomizationRowSelection) == 0x0003E0, "Member 'UBP_CustomizationMenu_C::UpdateCustomizationRowSelection' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, bTransitioning) == 0x0003F0, "Member 'UBP_CustomizationMenu_C::bTransitioning' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, OnTryChangingCustomizationCategory) == 0x0003F8, "Member 'UBP_CustomizationMenu_C::OnTryChangingCustomizationCategory' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, OnUpdateClothing) == 0x000408, "Member 'UBP_CustomizationMenu_C::OnUpdateClothing' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, OnChangeGender) == 0x000418, "Member 'UBP_CustomizationMenu_C::OnChangeGender' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, Focused_GenderTabSize) == 0x000428, "Member 'UBP_CustomizationMenu_C::Focused_GenderTabSize' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, Unfocused_GenderTabSize) == 0x000430, "Member 'UBP_CustomizationMenu_C::Unfocused_GenderTabSize' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, AppearanceSettingsClass) == 0x000438, "Member 'UBP_CustomizationMenu_C::AppearanceSettingsClass' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, IsZoomedIn) == 0x000440, "Member 'UBP_CustomizationMenu_C::IsZoomedIn' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, CurrentMaleSelected) == 0x000441, "Member 'UBP_CustomizationMenu_C::CurrentMaleSelected' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, TempMaleSelected) == 0x000442, "Member 'UBP_CustomizationMenu_C::TempMaleSelected' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, OnInitializeSavedCameraName) == 0x000448, "Member 'UBP_CustomizationMenu_C::OnInitializeSavedCameraName' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, CurrentTabButton) == 0x000458, "Member 'UBP_CustomizationMenu_C::CurrentTabButton' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, TabNormalColor) == 0x000460, "Member 'UBP_CustomizationMenu_C::TabNormalColor' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, FadeTimerHandle) == 0x000470, "Member 'UBP_CustomizationMenu_C::FadeTimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, Ak) == 0x000478, "Member 'UBP_CustomizationMenu_C::Ak' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, bNotSaved) == 0x000480, "Member 'UBP_CustomizationMenu_C::bNotSaved' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, OnCanExitMenu) == 0x000488, "Member 'UBP_CustomizationMenu_C::OnCanExitMenu' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, OnChangeToVruumba) == 0x000498, "Member 'UBP_CustomizationMenu_C::OnChangeToVruumba' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, OnChangeToResident) == 0x0004A8, "Member 'UBP_CustomizationMenu_C::OnChangeToResident' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, OnChangeToEmote) == 0x0004B8, "Member 'UBP_CustomizationMenu_C::OnChangeToEmote' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, SubMenuButResident) == 0x0004C8, "Member 'UBP_CustomizationMenu_C::SubMenuButResident' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, SubMenuButVruumba) == 0x0004D0, "Member 'UBP_CustomizationMenu_C::SubMenuButVruumba' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, SubMenuButEmotes) == 0x0004D8, "Member 'UBP_CustomizationMenu_C::SubMenuButEmotes' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, LastVisitedCameraViewInCustomization) == 0x0004E0, "Member 'UBP_CustomizationMenu_C::LastVisitedCameraViewInCustomization' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationMenu_C, OnCharactersUpdated) == 0x0004F0, "Member 'UBP_CustomizationMenu_C::OnCharactersUpdated' has a wrong offset!");

}

