#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationMaterialsContainer

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomizationMaterialsContainer.BP_CustomizationMaterialsContainer_C.OnChangeMaterial__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_CustomizationMaterialsContainer_C_OnChangeMaterial__DelegateSignature final
{
public:
	class FString                                 OptionName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMaterialsContainer_C_OnChangeMaterial__DelegateSignature) == 0x000008, "Wrong alignment on BP_CustomizationMaterialsContainer_C_OnChangeMaterial__DelegateSignature");
static_assert(sizeof(BP_CustomizationMaterialsContainer_C_OnChangeMaterial__DelegateSignature) == 0x000010, "Wrong size on BP_CustomizationMaterialsContainer_C_OnChangeMaterial__DelegateSignature");
static_assert(offsetof(BP_CustomizationMaterialsContainer_C_OnChangeMaterial__DelegateSignature, OptionName) == 0x000000, "Member 'BP_CustomizationMaterialsContainer_C_OnChangeMaterial__DelegateSignature::OptionName' has a wrong offset!");

// Function BP_CustomizationMaterialsContainer.BP_CustomizationMaterialsContainer_C.ExecuteUbergraph_BP_CustomizationMaterialsContainer
// 0x0004 (0x0004 - 0x0000)
struct BP_CustomizationMaterialsContainer_C_ExecuteUbergraph_BP_CustomizationMaterialsContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMaterialsContainer_C_ExecuteUbergraph_BP_CustomizationMaterialsContainer) == 0x000004, "Wrong alignment on BP_CustomizationMaterialsContainer_C_ExecuteUbergraph_BP_CustomizationMaterialsContainer");
static_assert(sizeof(BP_CustomizationMaterialsContainer_C_ExecuteUbergraph_BP_CustomizationMaterialsContainer) == 0x000004, "Wrong size on BP_CustomizationMaterialsContainer_C_ExecuteUbergraph_BP_CustomizationMaterialsContainer");
static_assert(offsetof(BP_CustomizationMaterialsContainer_C_ExecuteUbergraph_BP_CustomizationMaterialsContainer, EntryPoint) == 0x000000, "Member 'BP_CustomizationMaterialsContainer_C_ExecuteUbergraph_BP_CustomizationMaterialsContainer::EntryPoint' has a wrong offset!");

// Function BP_CustomizationMaterialsContainer.BP_CustomizationMaterialsContainer_C.Generate Style Options
// 0x00B8 (0x00B8 - 0x0000)
struct BP_CustomizationMaterialsContainer_C_Generate_Style_Options final
{
public:
	struct FPlayerCustomizationItem               CustomizationItem;                                 // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	EPlayerCustomizationGender                    Gender;                                            // 0x00A8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCustomizationType                      CustomizationCategory;                             // 0x00A9(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         SelectedMesh;                                      // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomizationMaterialsContainer_C_Generate_Style_Options) == 0x000008, "Wrong alignment on BP_CustomizationMaterialsContainer_C_Generate_Style_Options");
static_assert(sizeof(BP_CustomizationMaterialsContainer_C_Generate_Style_Options) == 0x0000B8, "Wrong size on BP_CustomizationMaterialsContainer_C_Generate_Style_Options");
static_assert(offsetof(BP_CustomizationMaterialsContainer_C_Generate_Style_Options, CustomizationItem) == 0x000000, "Member 'BP_CustomizationMaterialsContainer_C_Generate_Style_Options::CustomizationItem' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMaterialsContainer_C_Generate_Style_Options, Gender) == 0x0000A8, "Member 'BP_CustomizationMaterialsContainer_C_Generate_Style_Options::Gender' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMaterialsContainer_C_Generate_Style_Options, CustomizationCategory) == 0x0000A9, "Member 'BP_CustomizationMaterialsContainer_C_Generate_Style_Options::CustomizationCategory' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMaterialsContainer_C_Generate_Style_Options, SelectedMesh) == 0x0000B0, "Member 'BP_CustomizationMaterialsContainer_C_Generate_Style_Options::SelectedMesh' has a wrong offset!");

// Function BP_CustomizationMaterialsContainer.BP_CustomizationMaterialsContainer_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct BP_CustomizationMaterialsContainer_C_Initialize final
{
public:
	EPlayerCustomizationGender                    InGender;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCloudCustomizationSetting             CustomizationSetting;                              // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_CustomizationMaterialsContainer_C_Initialize) == 0x000004, "Wrong alignment on BP_CustomizationMaterialsContainer_C_Initialize");
static_assert(sizeof(BP_CustomizationMaterialsContainer_C_Initialize) == 0x000010, "Wrong size on BP_CustomizationMaterialsContainer_C_Initialize");
static_assert(offsetof(BP_CustomizationMaterialsContainer_C_Initialize, InGender) == 0x000000, "Member 'BP_CustomizationMaterialsContainer_C_Initialize::InGender' has a wrong offset!");
static_assert(offsetof(BP_CustomizationMaterialsContainer_C_Initialize, CustomizationSetting) == 0x000004, "Member 'BP_CustomizationMaterialsContainer_C_Initialize::CustomizationSetting' has a wrong offset!");

}

