#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CeilingLampFlat_Blueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CeilingLampFlat_Blueprint.BP_CeilingLampFlat_Blueprint_C
// 0x0030 (0x0260 - 0x0230)
class ABP_CeilingLampFlat_Blueprint_C final : public AStaticMeshActor
{
public:
	class USpotLightComponent*                    SpotLight;                                         // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         OuterConeAngle;                                    // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InnerConeAngle;                                    // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttenuationRadius;                                 // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temperature;                                       // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor;                                        // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CeilingLampFlat_Blueprint_C">();
	}
	static class ABP_CeilingLampFlat_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CeilingLampFlat_Blueprint_C>();
	}
};
static_assert(alignof(ABP_CeilingLampFlat_Blueprint_C) == 0x000008, "Wrong alignment on ABP_CeilingLampFlat_Blueprint_C");
static_assert(sizeof(ABP_CeilingLampFlat_Blueprint_C) == 0x000260, "Wrong size on ABP_CeilingLampFlat_Blueprint_C");
static_assert(offsetof(ABP_CeilingLampFlat_Blueprint_C, SpotLight) == 0x000230, "Member 'ABP_CeilingLampFlat_Blueprint_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_CeilingLampFlat_Blueprint_C, OuterConeAngle) == 0x000238, "Member 'ABP_CeilingLampFlat_Blueprint_C::OuterConeAngle' has a wrong offset!");
static_assert(offsetof(ABP_CeilingLampFlat_Blueprint_C, InnerConeAngle) == 0x00023C, "Member 'ABP_CeilingLampFlat_Blueprint_C::InnerConeAngle' has a wrong offset!");
static_assert(offsetof(ABP_CeilingLampFlat_Blueprint_C, AttenuationRadius) == 0x000240, "Member 'ABP_CeilingLampFlat_Blueprint_C::AttenuationRadius' has a wrong offset!");
static_assert(offsetof(ABP_CeilingLampFlat_Blueprint_C, Temperature) == 0x000244, "Member 'ABP_CeilingLampFlat_Blueprint_C::Temperature' has a wrong offset!");
static_assert(offsetof(ABP_CeilingLampFlat_Blueprint_C, LightColor) == 0x000248, "Member 'ABP_CeilingLampFlat_Blueprint_C::LightColor' has a wrong offset!");
static_assert(offsetof(ABP_CeilingLampFlat_Blueprint_C, Intensity) == 0x000258, "Member 'ABP_CeilingLampFlat_Blueprint_C::Intensity' has a wrong offset!");

}

