#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationItemCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ItemCard_classes.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CustomizationItemCard.BP_CustomizationItemCard_C
// 0x00D0 (0x07B0 - 0x06E0)
class UBP_CustomizationItemCard_C final : public UBP_ItemCard_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CustomizationItemCard_C;         // 0x06E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FPlayerCustomizationItemTableRow       ItemPayload;                                       // 0x06E8(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnEquipped;                                        // 0x0790(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnItemFocused_0;                                   // 0x07A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnEquipped__DelegateSignature();
	void OnItemFocused_0__DelegateSignature(class UBP_ItemCard_C* Item);
	void ExecuteUbergraph_BP_CustomizationItemCard(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void InitSlot(const class FString& DTRowName_0, EPlayerCustomizationType CustomizationCategory, int32 Level, class UCharacterCustomizationScrollBox_C* Parent, class UGridPanel** QualityGrid);
	void SetCharacterItemCard(const struct FPlayerCustomizationItemTableRow& Item, int32 CurrentLevel, const struct FFCTAchievementList& AchievementList);
	void Set_Quality_to_Card(class UCharacterCustomizationScrollBox_C* Parent, class UGridPanel** QualityGrid);
	void ItemSelected();
	void CreateTooltipWidget(const class FString& InAchievementString, bool InEquipped, class UBP_CustomizationSlotTooltip_C** ToolTip);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CustomizationItemCard_C">();
	}
	static class UBP_CustomizationItemCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomizationItemCard_C>();
	}
};
static_assert(alignof(UBP_CustomizationItemCard_C) == 0x000008, "Wrong alignment on UBP_CustomizationItemCard_C");
static_assert(sizeof(UBP_CustomizationItemCard_C) == 0x0007B0, "Wrong size on UBP_CustomizationItemCard_C");
static_assert(offsetof(UBP_CustomizationItemCard_C, UberGraphFrame_BP_CustomizationItemCard_C) == 0x0006E0, "Member 'UBP_CustomizationItemCard_C::UberGraphFrame_BP_CustomizationItemCard_C' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationItemCard_C, ItemPayload) == 0x0006E8, "Member 'UBP_CustomizationItemCard_C::ItemPayload' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationItemCard_C, OnEquipped) == 0x000790, "Member 'UBP_CustomizationItemCard_C::OnEquipped' has a wrong offset!");
static_assert(offsetof(UBP_CustomizationItemCard_C, OnItemFocused_0) == 0x0007A0, "Member 'UBP_CustomizationItemCard_C::OnItemFocused_0' has a wrong offset!");

}

