#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FriendsSortButtonWidget

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function BP_FriendsSortButtonWidget.BP_FriendsSortButtonWidget_C.OnUpdateFriendsSorting__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_FriendsSortButtonWidget_C_OnUpdateFriendsSorting__DelegateSignature final
{
public:
	EFriendsSortType                              SortMethod;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FriendsSortButtonWidget_C_OnUpdateFriendsSorting__DelegateSignature) == 0x000001, "Wrong alignment on BP_FriendsSortButtonWidget_C_OnUpdateFriendsSorting__DelegateSignature");
static_assert(sizeof(BP_FriendsSortButtonWidget_C_OnUpdateFriendsSorting__DelegateSignature) == 0x000001, "Wrong size on BP_FriendsSortButtonWidget_C_OnUpdateFriendsSorting__DelegateSignature");
static_assert(offsetof(BP_FriendsSortButtonWidget_C_OnUpdateFriendsSorting__DelegateSignature, SortMethod) == 0x000000, "Member 'BP_FriendsSortButtonWidget_C_OnUpdateFriendsSorting__DelegateSignature::SortMethod' has a wrong offset!");

// Function BP_FriendsSortButtonWidget.BP_FriendsSortButtonWidget_C.ExecuteUbergraph_BP_FriendsSortButtonWidget
// 0x0004 (0x0004 - 0x0000)
struct BP_FriendsSortButtonWidget_C_ExecuteUbergraph_BP_FriendsSortButtonWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FriendsSortButtonWidget_C_ExecuteUbergraph_BP_FriendsSortButtonWidget) == 0x000004, "Wrong alignment on BP_FriendsSortButtonWidget_C_ExecuteUbergraph_BP_FriendsSortButtonWidget");
static_assert(sizeof(BP_FriendsSortButtonWidget_C_ExecuteUbergraph_BP_FriendsSortButtonWidget) == 0x000004, "Wrong size on BP_FriendsSortButtonWidget_C_ExecuteUbergraph_BP_FriendsSortButtonWidget");
static_assert(offsetof(BP_FriendsSortButtonWidget_C_ExecuteUbergraph_BP_FriendsSortButtonWidget, EntryPoint) == 0x000000, "Member 'BP_FriendsSortButtonWidget_C_ExecuteUbergraph_BP_FriendsSortButtonWidget::EntryPoint' has a wrong offset!");

// Function BP_FriendsSortButtonWidget.BP_FriendsSortButtonWidget_C.OnStartListeningForGamepadInput
// 0x0010 (0x0010 - 0x0000)
struct BP_FriendsSortButtonWidget_C_OnStartListeningForGamepadInput final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_FriendsSortButtonWidget_C_OnStartListeningForGamepadInput) == 0x000004, "Wrong alignment on BP_FriendsSortButtonWidget_C_OnStartListeningForGamepadInput");
static_assert(sizeof(BP_FriendsSortButtonWidget_C_OnStartListeningForGamepadInput) == 0x000010, "Wrong size on BP_FriendsSortButtonWidget_C_OnStartListeningForGamepadInput");
static_assert(offsetof(BP_FriendsSortButtonWidget_C_OnStartListeningForGamepadInput, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_FriendsSortButtonWidget_C_OnStartListeningForGamepadInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_FriendsSortButtonWidget.BP_FriendsSortButtonWidget_C.Update Sort Method
// 0x0006 (0x0006 - 0x0000)
struct BP_FriendsSortButtonWidget_C_Update_Sort_Method final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_ByteByte_ReturnValue;           // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue_1;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FriendsSortButtonWidget_C_Update_Sort_Method) == 0x000001, "Wrong alignment on BP_FriendsSortButtonWidget_C_Update_Sort_Method");
static_assert(sizeof(BP_FriendsSortButtonWidget_C_Update_Sort_Method) == 0x000006, "Wrong size on BP_FriendsSortButtonWidget_C_Update_Sort_Method");
static_assert(offsetof(BP_FriendsSortButtonWidget_C_Update_Sort_Method, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'BP_FriendsSortButtonWidget_C_Update_Sort_Method::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendsSortButtonWidget_C_Update_Sort_Method, CallFunc_GetValidValue_ReturnValue) == 0x000001, "Member 'BP_FriendsSortButtonWidget_C_Update_Sort_Method::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendsSortButtonWidget_C_Update_Sort_Method, CallFunc_Add_ByteByte_ReturnValue) == 0x000002, "Member 'BP_FriendsSortButtonWidget_C_Update_Sort_Method::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendsSortButtonWidget_C_Update_Sort_Method, CallFunc_LessEqual_ByteByte_ReturnValue) == 0x000003, "Member 'BP_FriendsSortButtonWidget_C_Update_Sort_Method::CallFunc_LessEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendsSortButtonWidget_C_Update_Sort_Method, CallFunc_Add_ByteByte_ReturnValue_1) == 0x000004, "Member 'BP_FriendsSortButtonWidget_C_Update_Sort_Method::CallFunc_Add_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FriendsSortButtonWidget_C_Update_Sort_Method, CallFunc_GetValidValue_ReturnValue_1) == 0x000005, "Member 'BP_FriendsSortButtonWidget_C_Update_Sort_Method::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");

// Function BP_FriendsSortButtonWidget.BP_FriendsSortButtonWidget_C.UpdateSortText
// 0x0001 (0x0001 - 0x0000)
struct BP_FriendsSortButtonWidget_C_UpdateSortText final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FriendsSortButtonWidget_C_UpdateSortText) == 0x000001, "Wrong alignment on BP_FriendsSortButtonWidget_C_UpdateSortText");
static_assert(sizeof(BP_FriendsSortButtonWidget_C_UpdateSortText) == 0x000001, "Wrong size on BP_FriendsSortButtonWidget_C_UpdateSortText");
static_assert(offsetof(BP_FriendsSortButtonWidget_C_UpdateSortText, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_FriendsSortButtonWidget_C_UpdateSortText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

