#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_LiquidTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function bp_LiquidTrigger.bp_LiquidTrigger_C.ExecuteUbergraph_bp_LiquidTrigger
// 0x0110 (0x0110 - 0x0000)
struct bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0040(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger) == 0x000008, "Wrong alignment on bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger");
static_assert(sizeof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger) == 0x000110, "Wrong size on bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, EntryPoint) == 0x000000, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000010, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000020, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000028, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000030, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000038, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_ComponentBoundEvent_bFromSweep) == 0x00003C, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_ComponentBoundEvent_SweepResult) == 0x000040, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000D0, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_ComponentBoundEvent_OtherActor) == 0x0000D8, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_ComponentBoundEvent_OtherComp) == 0x0000E0, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000E8, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x0000F0, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F8, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000100, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000109, "Member 'bp_LiquidTrigger_C_ExecuteUbergraph_bp_LiquidTrigger::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function bp_LiquidTrigger.bp_LiquidTrigger_C.BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function bp_LiquidTrigger.bp_LiquidTrigger_C.BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'bp_LiquidTrigger_C_BndEvt__Collider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

