#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MaleCustomizationConfig

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"


namespace SDK::Params
{

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.ExecuteUbergraph_BP_MaleCustomizationConfig
// 0x0130 (0x0130 - 0x0000)
struct BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsEntitlementPagingSlicedResult K2Node_CustomEvent_Entitlements;                   // 0x0008(0x0050)()
	int32                                         K2Node_CustomEvent_Code;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FAccelByteModelsEntitlementPagingSlicedResult& Entitlements, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsEntitlementPagingSlicedResult Temp_struct_Variable;                              // 0x0098(0x0050)()
	class UFCTQueryEntitlementsCallbackProxy*     CallFunc_QueryUserEntitlements_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig");
static_assert(sizeof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig) == 0x000130, "Wrong size on BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, EntryPoint) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, K2Node_CustomEvent_Entitlements) == 0x000008, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::K2Node_CustomEvent_Entitlements' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, K2Node_CustomEvent_Code) == 0x000058, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, K2Node_CustomEvent_Message) == 0x000060, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, Temp_string_Variable) == 0x000080, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, Temp_int_Variable) == 0x000090, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, Temp_struct_Variable) == 0x000098, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, CallFunc_QueryUserEntitlements_ReturnValue) == 0x0000E8, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::CallFunc_QueryUserEntitlements_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, CallFunc_GetGameInstance_ReturnValue) == 0x0000F8, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, K2Node_DynamicCast_AsFCTGame_Instance_BP) == 0x000100, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::K2Node_DynamicCast_AsFCTGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, K2Node_CustomEvent_Code_1) == 0x00010C, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, K2Node_CustomEvent_Message_1) == 0x000110, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig, K2Node_CreateDelegate_OutputDelegate_1) == 0x000120, "Member 'BP_MaleCustomizationConfig_C_ExecuteUbergraph_BP_MaleCustomizationConfig::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.OnSuccess_C021A2EE445CC72F7830FCB715D9D09C
// 0x0068 (0x0068 - 0x0000)
struct BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C final
{
public:
	struct FAccelByteModelsEntitlementPagingSlicedResult Entitlements;                                      // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Code;                                              // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C");
static_assert(sizeof(BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C) == 0x000068, "Wrong size on BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C");
static_assert(offsetof(BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C, Entitlements) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C::Entitlements' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C, Code) == 0x000050, "Member 'BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C::Code' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C, Message) == 0x000058, "Member 'BP_MaleCustomizationConfig_C_OnSuccess_C021A2EE445CC72F7830FCB715D9D09C::Message' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.OnFail_C021A2EE445CC72F7830FCB715D9D09C
// 0x0018 (0x0018 - 0x0000)
struct BP_MaleCustomizationConfig_C_OnFail_C021A2EE445CC72F7830FCB715D9D09C final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_OnFail_C021A2EE445CC72F7830FCB715D9D09C) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_OnFail_C021A2EE445CC72F7830FCB715D9D09C");
static_assert(sizeof(BP_MaleCustomizationConfig_C_OnFail_C021A2EE445CC72F7830FCB715D9D09C) == 0x000018, "Wrong size on BP_MaleCustomizationConfig_C_OnFail_C021A2EE445CC72F7830FCB715D9D09C");
static_assert(offsetof(BP_MaleCustomizationConfig_C_OnFail_C021A2EE445CC72F7830FCB715D9D09C, Code) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_OnFail_C021A2EE445CC72F7830FCB715D9D09C::Code' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_OnFail_C021A2EE445CC72F7830FCB715D9D09C, Message) == 0x000008, "Member 'BP_MaleCustomizationConfig_C_OnFail_C021A2EE445CC72F7830FCB715D9D09C::Message' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetHeadItemFromDT
// 0x0220 (0x0220 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetHeadItemFromDT final
{
public:
	class FString                                 TableKey;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       Item;                                              // 0x0010(0x00A8)(Parm, OutParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0170(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetHeadItemFromDT) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetHeadItemFromDT");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetHeadItemFromDT) == 0x000220, "Wrong size on BP_MaleCustomizationConfig_C_GetHeadItemFromDT");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetHeadItemFromDT, TableKey) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetHeadItemFromDT::TableKey' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetHeadItemFromDT, Item) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetHeadItemFromDT::Item' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetHeadItemFromDT, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B8, "Member 'BP_MaleCustomizationConfig_C_GetHeadItemFromDT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetHeadItemFromDT, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'BP_MaleCustomizationConfig_C_GetHeadItemFromDT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetHeadItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'BP_MaleCustomizationConfig_C_GetHeadItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetHeadItemFromDT, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000170, "Member 'BP_MaleCustomizationConfig_C_GetHeadItemFromDT::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetHeadItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000218, "Member 'BP_MaleCustomizationConfig_C_GetHeadItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetBodyItemFromDT
// 0x0220 (0x0220 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetBodyItemFromDT final
{
public:
	class FString                                 TableKey;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       Item;                                              // 0x0010(0x00A8)(Parm, OutParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0170(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetBodyItemFromDT) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetBodyItemFromDT");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetBodyItemFromDT) == 0x000220, "Wrong size on BP_MaleCustomizationConfig_C_GetBodyItemFromDT");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetBodyItemFromDT, TableKey) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetBodyItemFromDT::TableKey' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetBodyItemFromDT, Item) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetBodyItemFromDT::Item' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetBodyItemFromDT, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B8, "Member 'BP_MaleCustomizationConfig_C_GetBodyItemFromDT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetBodyItemFromDT, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'BP_MaleCustomizationConfig_C_GetBodyItemFromDT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetBodyItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'BP_MaleCustomizationConfig_C_GetBodyItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetBodyItemFromDT, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000170, "Member 'BP_MaleCustomizationConfig_C_GetBodyItemFromDT::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetBodyItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000218, "Member 'BP_MaleCustomizationConfig_C_GetBodyItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetLegsItemFromDT
// 0x0220 (0x0220 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetLegsItemFromDT final
{
public:
	class FString                                 TableKey;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       Item;                                              // 0x0010(0x00A8)(Parm, OutParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0170(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetLegsItemFromDT) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetLegsItemFromDT");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetLegsItemFromDT) == 0x000220, "Wrong size on BP_MaleCustomizationConfig_C_GetLegsItemFromDT");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetLegsItemFromDT, TableKey) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetLegsItemFromDT::TableKey' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetLegsItemFromDT, Item) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetLegsItemFromDT::Item' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetLegsItemFromDT, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B8, "Member 'BP_MaleCustomizationConfig_C_GetLegsItemFromDT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetLegsItemFromDT, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'BP_MaleCustomizationConfig_C_GetLegsItemFromDT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetLegsItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'BP_MaleCustomizationConfig_C_GetLegsItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetLegsItemFromDT, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000170, "Member 'BP_MaleCustomizationConfig_C_GetLegsItemFromDT::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetLegsItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000218, "Member 'BP_MaleCustomizationConfig_C_GetLegsItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetFeetItemFromDT
// 0x0220 (0x0220 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetFeetItemFromDT final
{
public:
	class FString                                 TableKey;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       Item;                                              // 0x0010(0x00A8)(Parm, OutParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0170(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetFeetItemFromDT) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetFeetItemFromDT");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetFeetItemFromDT) == 0x000220, "Wrong size on BP_MaleCustomizationConfig_C_GetFeetItemFromDT");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFeetItemFromDT, TableKey) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetFeetItemFromDT::TableKey' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFeetItemFromDT, Item) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetFeetItemFromDT::Item' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFeetItemFromDT, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B8, "Member 'BP_MaleCustomizationConfig_C_GetFeetItemFromDT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFeetItemFromDT, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'BP_MaleCustomizationConfig_C_GetFeetItemFromDT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFeetItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'BP_MaleCustomizationConfig_C_GetFeetItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFeetItemFromDT, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000170, "Member 'BP_MaleCustomizationConfig_C_GetFeetItemFromDT::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFeetItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000218, "Member 'BP_MaleCustomizationConfig_C_GetFeetItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.Get Category DTRow Names
// 0x0090 (0x0090 - 0x0000)
struct BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names final
{
public:
	EPlayerCustomizationType                      Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           RowNames;                                          // 0x0008(0x0010)(Parm, OutParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0020(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x0030(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_2;       // 0x0040(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_3;       // 0x0050(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_4;       // 0x0060(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_5;       // 0x0070(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_6;       // 0x0080(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names");
static_assert(sizeof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names) == 0x000090, "Wrong size on BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names");
static_assert(offsetof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names, Type) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names::Type' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names, RowNames) == 0x000008, "Member 'BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names::RowNames' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000020, "Member 'BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x000030, "Member 'BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names, CallFunc_GetDataTableRowNames_OutRowNames_2) == 0x000040, "Member 'BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names::CallFunc_GetDataTableRowNames_OutRowNames_2' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names, CallFunc_GetDataTableRowNames_OutRowNames_3) == 0x000050, "Member 'BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names::CallFunc_GetDataTableRowNames_OutRowNames_3' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names, CallFunc_GetDataTableRowNames_OutRowNames_4) == 0x000060, "Member 'BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names::CallFunc_GetDataTableRowNames_OutRowNames_4' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names, CallFunc_GetDataTableRowNames_OutRowNames_5) == 0x000070, "Member 'BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names::CallFunc_GetDataTableRowNames_OutRowNames_5' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names, CallFunc_GetDataTableRowNames_OutRowNames_6) == 0x000080, "Member 'BP_MaleCustomizationConfig_C_Get_Category_DTRow_Names::CallFunc_GetDataTableRowNames_OutRowNames_6' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetSkinColorFromDT
// 0x0088 (0x0088 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetSkinColorFromDT final
{
public:
	class FString                                 RowName;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCustomizationColorMaterial      OutRow;                                            // 0x0010(0x0020)(Parm, OutParm)
	struct FPlayerCustomizationColorMaterial      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationColorMaterial      CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0060(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetSkinColorFromDT) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetSkinColorFromDT");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetSkinColorFromDT) == 0x000088, "Wrong size on BP_MaleCustomizationConfig_C_GetSkinColorFromDT");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorFromDT, RowName) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorFromDT::RowName' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorFromDT, OutRow) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorFromDT::OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorFromDT, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorFromDT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorFromDT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000050, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorFromDT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorFromDT, CallFunc_Conv_StringToName_ReturnValue) == 0x000054, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorFromDT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorFromDT, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000060, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorFromDT::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorFromDT, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000080, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorFromDT::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetPresetFromDT
// 0x0148 (0x0148 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetPresetFromDT final
{
public:
	class FString                                 RowName;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCustomizationPreset             OutRow;                                            // 0x0010(0x0060)(Parm, OutParm)
	struct FPlayerCustomizationPreset             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x0060)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationPreset             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00E0(0x0060)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetPresetFromDT) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetPresetFromDT");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetPresetFromDT) == 0x000148, "Wrong size on BP_MaleCustomizationConfig_C_GetPresetFromDT");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetFromDT, RowName) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetPresetFromDT::RowName' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetFromDT, OutRow) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetPresetFromDT::OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetFromDT, CallFunc_GetDataTableRowFromName_OutRow) == 0x000070, "Member 'BP_MaleCustomizationConfig_C_GetPresetFromDT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetFromDT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D0, "Member 'BP_MaleCustomizationConfig_C_GetPresetFromDT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetFromDT, CallFunc_Conv_StringToName_ReturnValue) == 0x0000D4, "Member 'BP_MaleCustomizationConfig_C_GetPresetFromDT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetFromDT, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000E0, "Member 'BP_MaleCustomizationConfig_C_GetPresetFromDT::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetFromDT, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000140, "Member 'BP_MaleCustomizationConfig_C_GetPresetFromDT::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetAccessoryItemFromDT
// 0x0220 (0x0220 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT final
{
public:
	class FString                                 TableKey;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       Item;                                              // 0x0010(0x00A8)(Parm, OutParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0170(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT) == 0x000220, "Wrong size on BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT, TableKey) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT::TableKey' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT, Item) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT::Item' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B8, "Member 'BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000170, "Member 'BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000218, "Member 'BP_MaleCustomizationConfig_C_GetAccessoryItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetEyewearItemFromDT
// 0x0220 (0x0220 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetEyewearItemFromDT final
{
public:
	class FString                                 TableKey;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       Item;                                              // 0x0010(0x00A8)(Parm, OutParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0170(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetEyewearItemFromDT) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetEyewearItemFromDT");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetEyewearItemFromDT) == 0x000220, "Wrong size on BP_MaleCustomizationConfig_C_GetEyewearItemFromDT");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetEyewearItemFromDT, TableKey) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetEyewearItemFromDT::TableKey' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetEyewearItemFromDT, Item) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetEyewearItemFromDT::Item' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetEyewearItemFromDT, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B8, "Member 'BP_MaleCustomizationConfig_C_GetEyewearItemFromDT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetEyewearItemFromDT, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'BP_MaleCustomizationConfig_C_GetEyewearItemFromDT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetEyewearItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'BP_MaleCustomizationConfig_C_GetEyewearItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetEyewearItemFromDT, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000170, "Member 'BP_MaleCustomizationConfig_C_GetEyewearItemFromDT::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetEyewearItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000218, "Member 'BP_MaleCustomizationConfig_C_GetEyewearItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetFacialHairItemFromDT
// 0x0220 (0x0220 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT final
{
public:
	class FString                                 TableKey;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       Item;                                              // 0x0010(0x00A8)(Parm, OutParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCustomizationItemTableRow       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0170(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT) == 0x000220, "Wrong size on BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT, TableKey) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT::TableKey' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT, Item) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT::Item' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B8, "Member 'BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000170, "Member 'BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000218, "Member 'BP_MaleCustomizationConfig_C_GetFacialHairItemFromDT::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetSkinColorInfo
// 0x0038 (0x0038 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetSkinColorInfo final
{
public:
	TArray<class FName>                           OutRowNames;                                       // 0x0000(0x0010)(Parm, OutParm)
	class UDataTable*                             DataTable;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Selected;                                          // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetSkinColorInfo) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetSkinColorInfo");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetSkinColorInfo) == 0x000038, "Wrong size on BP_MaleCustomizationConfig_C_GetSkinColorInfo");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorInfo, OutRowNames) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorInfo::OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorInfo, DataTable) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorInfo::DataTable' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorInfo, Selected) == 0x000018, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorInfo::Selected' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetSkinColorInfo, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000028, "Member 'BP_MaleCustomizationConfig_C_GetSkinColorInfo::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetPresetInfo
// 0x0038 (0x0038 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetPresetInfo final
{
public:
	TArray<class FName>                           OutRowNames;                                       // 0x0000(0x0010)(Parm, OutParm)
	class UDataTable*                             DataTable;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Selected;                                          // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetPresetInfo) == 0x000008, "Wrong alignment on BP_MaleCustomizationConfig_C_GetPresetInfo");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetPresetInfo) == 0x000038, "Wrong size on BP_MaleCustomizationConfig_C_GetPresetInfo");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetInfo, OutRowNames) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetPresetInfo::OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetInfo, DataTable) == 0x000010, "Member 'BP_MaleCustomizationConfig_C_GetPresetInfo::DataTable' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetInfo, Selected) == 0x000018, "Member 'BP_MaleCustomizationConfig_C_GetPresetInfo::Selected' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetPresetInfo, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000028, "Member 'BP_MaleCustomizationConfig_C_GetPresetInfo::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");

// Function BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C.GetGender
// 0x0002 (0x0002 - 0x0000)
struct BP_MaleCustomizationConfig_C_GetGender final
{
public:
	EPlayerCustomizationGender                    Gender;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCustomizationGender                    CallFunc_GetGender_Gender;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MaleCustomizationConfig_C_GetGender) == 0x000001, "Wrong alignment on BP_MaleCustomizationConfig_C_GetGender");
static_assert(sizeof(BP_MaleCustomizationConfig_C_GetGender) == 0x000002, "Wrong size on BP_MaleCustomizationConfig_C_GetGender");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetGender, Gender) == 0x000000, "Member 'BP_MaleCustomizationConfig_C_GetGender::Gender' has a wrong offset!");
static_assert(offsetof(BP_MaleCustomizationConfig_C_GetGender, CallFunc_GetGender_Gender) == 0x000001, "Member 'BP_MaleCustomizationConfig_C_GetGender::CallFunc_GetGender_Gender' has a wrong offset!");

}

