#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MaleCustomizationConfig

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CustomizationSettings_classes.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MaleCustomizationConfig.BP_MaleCustomizationConfig_C
// 0x0040 (0x05C0 - 0x0580)
class ABP_MaleCustomizationConfig_C final : public ABP_CustomizationSettings_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MaleCustomizationConfig_C;       // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UDataTable*                             MaleBodyCustomizationDT;                           // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleFeetCustomizationDT;                           // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleHeadCustomizationDT;                           // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleLegsCustomizationDT;                           // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleFacialHairCustomizationDT;                     // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleAccessoryCustomizationDT;                      // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleEyewearCustomizationDT;                        // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MaleCustomizationConfig(int32 EntryPoint);
	void OnSuccess_C021A2EE445CC72F7830FCB715D9D09C(const struct FAccelByteModelsEntitlementPagingSlicedResult& Entitlements, int32 Code, const class FString& Message);
	void OnFail_C021A2EE445CC72F7830FCB715D9D09C(int32 Code, const class FString& Message);
	void ReceiveBeginPlay();
	void GetHeadItemFromDT(const class FString& TableKey, struct FPlayerCustomizationItemTableRow* Item);
	void GetBodyItemFromDT(const class FString& TableKey, struct FPlayerCustomizationItemTableRow* Item);
	void GetLegsItemFromDT(const class FString& TableKey, struct FPlayerCustomizationItemTableRow* Item);
	void GetFeetItemFromDT(const class FString& TableKey, struct FPlayerCustomizationItemTableRow* Item);
	void Get_Category_DTRow_Names(EPlayerCustomizationType Type, TArray<class FName>* RowNames);
	void GetSkinColorFromDT(const class FString& RowName, struct FPlayerCustomizationColorMaterial* OutRow);
	void GetPresetFromDT(const class FString& RowName, struct FPlayerCustomizationPreset* OutRow);
	void GetAccessoryItemFromDT(const class FString& TableKey, struct FPlayerCustomizationItemTableRow* Item);
	void GetEyewearItemFromDT(const class FString& TableKey, struct FPlayerCustomizationItemTableRow* Item);
	void GetFacialHairItemFromDT(const class FString& TableKey, struct FPlayerCustomizationItemTableRow* Item);
	void GetSkinColorInfo(TArray<class FName>* OutRowNames, class UDataTable** DataTable, class FString* Selected);
	void GetPresetInfo(TArray<class FName>* OutRowNames, class UDataTable** DataTable, class FString* Selected);
	void GetGender(EPlayerCustomizationGender* Gender);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MaleCustomizationConfig_C">();
	}
	static class ABP_MaleCustomizationConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MaleCustomizationConfig_C>();
	}
};
static_assert(alignof(ABP_MaleCustomizationConfig_C) == 0x000008, "Wrong alignment on ABP_MaleCustomizationConfig_C");
static_assert(sizeof(ABP_MaleCustomizationConfig_C) == 0x0005C0, "Wrong size on ABP_MaleCustomizationConfig_C");
static_assert(offsetof(ABP_MaleCustomizationConfig_C, UberGraphFrame_BP_MaleCustomizationConfig_C) == 0x000580, "Member 'ABP_MaleCustomizationConfig_C::UberGraphFrame_BP_MaleCustomizationConfig_C' has a wrong offset!");
static_assert(offsetof(ABP_MaleCustomizationConfig_C, MaleBodyCustomizationDT) == 0x000588, "Member 'ABP_MaleCustomizationConfig_C::MaleBodyCustomizationDT' has a wrong offset!");
static_assert(offsetof(ABP_MaleCustomizationConfig_C, MaleFeetCustomizationDT) == 0x000590, "Member 'ABP_MaleCustomizationConfig_C::MaleFeetCustomizationDT' has a wrong offset!");
static_assert(offsetof(ABP_MaleCustomizationConfig_C, MaleHeadCustomizationDT) == 0x000598, "Member 'ABP_MaleCustomizationConfig_C::MaleHeadCustomizationDT' has a wrong offset!");
static_assert(offsetof(ABP_MaleCustomizationConfig_C, MaleLegsCustomizationDT) == 0x0005A0, "Member 'ABP_MaleCustomizationConfig_C::MaleLegsCustomizationDT' has a wrong offset!");
static_assert(offsetof(ABP_MaleCustomizationConfig_C, MaleFacialHairCustomizationDT) == 0x0005A8, "Member 'ABP_MaleCustomizationConfig_C::MaleFacialHairCustomizationDT' has a wrong offset!");
static_assert(offsetof(ABP_MaleCustomizationConfig_C, MaleAccessoryCustomizationDT) == 0x0005B0, "Member 'ABP_MaleCustomizationConfig_C::MaleAccessoryCustomizationDT' has a wrong offset!");
static_assert(offsetof(ABP_MaleCustomizationConfig_C, MaleEyewearCustomizationDT) == 0x0005B8, "Member 'ABP_MaleCustomizationConfig_C::MaleEyewearCustomizationDT' has a wrong offset!");

}

