#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayNow

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayNow.BP_PlayNow_C.ExecuteUbergraph_BP_PlayNow
// 0x00C8 (0x00C8 - 0x0000)
struct BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_CreateParty_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_CreateParty_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue_1;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow) == 0x000008, "Wrong alignment on BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow");
static_assert(sizeof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow) == 0x0000C8, "Wrong size on BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, EntryPoint) == 0x000000, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, CallFunc_CreateParty_ReturnValue) == 0x000028, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::CallFunc_CreateParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, CallFunc_CreateParty_ReturnValue_1) == 0x000058, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::CallFunc_CreateParty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, K2Node_CreateDelegate_OutputDelegate_4) == 0x000060, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, K2Node_CreateDelegate_OutputDelegate_5) == 0x000074, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, CallFunc_LeaveParty_ReturnValue) == 0x000088, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::CallFunc_LeaveParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, K2Node_CreateDelegate_OutputDelegate_6) == 0x000090, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, CallFunc_IsValid_ReturnValue_2) == 0x0000A0, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000A4, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, CallFunc_LeaveParty_ReturnValue_1) == 0x0000B8, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::CallFunc_LeaveParty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow, CallFunc_IsValid_ReturnValue_3) == 0x0000C0, "Member 'BP_PlayNow_C_ExecuteUbergraph_BP_PlayNow::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

}

