#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerProfileMenu

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerProfileMenu.BP_PlayerProfileMenu_C.OnFindGame__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerProfileMenu_C_OnFindGame__DelegateSignature final
{
public:
	bool                                          SearchingForGame_0;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerProfileMenu_C_OnFindGame__DelegateSignature) == 0x000001, "Wrong alignment on BP_PlayerProfileMenu_C_OnFindGame__DelegateSignature");
static_assert(sizeof(BP_PlayerProfileMenu_C_OnFindGame__DelegateSignature) == 0x000001, "Wrong size on BP_PlayerProfileMenu_C_OnFindGame__DelegateSignature");
static_assert(offsetof(BP_PlayerProfileMenu_C_OnFindGame__DelegateSignature, SearchingForGame_0) == 0x000000, "Member 'BP_PlayerProfileMenu_C_OnFindGame__DelegateSignature::SearchingForGame_0' has a wrong offset!");

// Function BP_PlayerProfileMenu.BP_PlayerProfileMenu_C.ExecuteUbergraph_BP_PlayerProfileMenu
// 0x0080 (0x0080 - 0x0000)
struct BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuCamController_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuCamController_C*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuCamController_C*                   CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuCamController_C*                   CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCTAchievementList                    K2Node_ComponentBoundEvent_AchievementList;        // 0x0058(0x0028)()
};
static_assert(alignof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu) == 0x000008, "Wrong alignment on BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu");
static_assert(sizeof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu) == 0x000080, "Wrong size on BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, EntryPoint) == 0x000000, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000018, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000028, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, CallFunc_GetPlayerController_ReturnValue_2) == 0x000030, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, CallFunc_SpawnAkComponentAtLocation_ReturnValue_1) == 0x000038, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::CallFunc_SpawnAkComponentAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000040, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, CallFunc_GetPlayerController_ReturnValue_3) == 0x000048, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000050, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu, K2Node_ComponentBoundEvent_AchievementList) == 0x000058, "Member 'BP_PlayerProfileMenu_C_ExecuteUbergraph_BP_PlayerProfileMenu::K2Node_ComponentBoundEvent_AchievementList' has a wrong offset!");

// Function BP_PlayerProfileMenu.BP_PlayerProfileMenu_C.BndEvt__BP_StatisticsAndAchievementView_K2Node_ComponentBoundEvent_14_OnAchievementsQueried__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerProfileMenu_C_BndEvt__BP_StatisticsAndAchievementView_K2Node_ComponentBoundEvent_14_OnAchievementsQueried__DelegateSignature final
{
public:
	struct FFCTAchievementList                    AchievementList_0;                                 // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_PlayerProfileMenu_C_BndEvt__BP_StatisticsAndAchievementView_K2Node_ComponentBoundEvent_14_OnAchievementsQueried__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerProfileMenu_C_BndEvt__BP_StatisticsAndAchievementView_K2Node_ComponentBoundEvent_14_OnAchievementsQueried__DelegateSignature");
static_assert(sizeof(BP_PlayerProfileMenu_C_BndEvt__BP_StatisticsAndAchievementView_K2Node_ComponentBoundEvent_14_OnAchievementsQueried__DelegateSignature) == 0x000028, "Wrong size on BP_PlayerProfileMenu_C_BndEvt__BP_StatisticsAndAchievementView_K2Node_ComponentBoundEvent_14_OnAchievementsQueried__DelegateSignature");
static_assert(offsetof(BP_PlayerProfileMenu_C_BndEvt__BP_StatisticsAndAchievementView_K2Node_ComponentBoundEvent_14_OnAchievementsQueried__DelegateSignature, AchievementList_0) == 0x000000, "Member 'BP_PlayerProfileMenu_C_BndEvt__BP_StatisticsAndAchievementView_K2Node_ComponentBoundEvent_14_OnAchievementsQueried__DelegateSignature::AchievementList_0' has a wrong offset!");

}

