#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PartyButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PartyButton.BP_PartyButton_C.ExecuteUbergraph_BP_PartyButton
// 0x0048 (0x0048 - 0x0000)
struct BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AClientEntryPCBP_C*                     K2Node_DynamicCast_AsClient_Entry_PCBP;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AClientEntryPCBP_C*                     K2Node_DynamicCast_AsClient_Entry_PCBP_1;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingControllerOnPC_ReturnValue;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton) == 0x000008, "Wrong alignment on BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton");
static_assert(sizeof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton) == 0x000048, "Wrong size on BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, EntryPoint) == 0x000000, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, CallFunc_IsXboxPlatform_ReturnValue) == 0x000004, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::CallFunc_IsXboxPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, CallFunc_IsPS4Platform_ReturnValue) == 0x000005, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, CallFunc_IsPS5Platform_ReturnValue) == 0x000006, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::CallFunc_IsPS5Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, K2Node_DynamicCast_AsClient_Entry_PCBP) == 0x000020, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::K2Node_DynamicCast_AsClient_Entry_PCBP' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, K2Node_DynamicCast_AsClient_Entry_PCBP_1) == 0x000038, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::K2Node_DynamicCast_AsClient_Entry_PCBP_1' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, CallFunc_IsUsingControllerOnPC_ReturnValue) == 0x000041, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::CallFunc_IsUsingControllerOnPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, CallFunc_BooleanOR_ReturnValue_1) == 0x000042, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton, CallFunc_BooleanOR_ReturnValue_2) == 0x000043, "Member 'BP_PartyButton_C_ExecuteUbergraph_BP_PartyButton::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function BP_PartyButton.BP_PartyButton_C.SetPartyButtonSize
// 0x0008 (0x0008 - 0x0000)
struct BP_PartyButton_C_SetPartyButtonSize final
{
public:
	struct FVector2D                              InButtonSize;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyButton_C_SetPartyButtonSize) == 0x000004, "Wrong alignment on BP_PartyButton_C_SetPartyButtonSize");
static_assert(sizeof(BP_PartyButton_C_SetPartyButtonSize) == 0x000008, "Wrong size on BP_PartyButton_C_SetPartyButtonSize");
static_assert(offsetof(BP_PartyButton_C_SetPartyButtonSize, InButtonSize) == 0x000000, "Member 'BP_PartyButton_C_SetPartyButtonSize::InButtonSize' has a wrong offset!");

// Function BP_PartyButton.BP_PartyButton_C.SetControllerIcon
// 0x0004 (0x0004 - 0x0000)
struct BP_PartyButton_C_SetControllerIcon final
{
public:
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PartyButton_C_SetControllerIcon) == 0x000001, "Wrong alignment on BP_PartyButton_C_SetControllerIcon");
static_assert(sizeof(BP_PartyButton_C_SetControllerIcon) == 0x000004, "Wrong size on BP_PartyButton_C_SetControllerIcon");
static_assert(offsetof(BP_PartyButton_C_SetControllerIcon, CallFunc_IsPS5Platform_ReturnValue) == 0x000000, "Member 'BP_PartyButton_C_SetControllerIcon::CallFunc_IsPS5Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_SetControllerIcon, CallFunc_IsPS4Platform_ReturnValue) == 0x000001, "Member 'BP_PartyButton_C_SetControllerIcon::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_SetControllerIcon, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'BP_PartyButton_C_SetControllerIcon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyButton_C_SetControllerIcon, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_PartyButton_C_SetControllerIcon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

