#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerProfileMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PlayerProfileMenu.BP_PlayerProfileMenu_C
// 0x0180 (0x03E0 - 0x0260)
class UBP_PlayerProfileMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBP_AccelByteRedeemCodeWidget_C*        BP_AccelByteRedeemCodeWidget;                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CustomizationMenu_C*                BP_CustomizationMenu;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_StatisticsAndAchievementView_C*     BP_StatisticsAndAchievementView;                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Ubp_wi_EnterAvatarName_C*               bp_wi_EnterAvatarName;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            ChangeDisplayNameButton;                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Achievements;                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Appearance;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Cabin;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Exit;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_PlayerStatistics;                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_ViewTrophies;                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MenuSwitcher;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PlayerProfileMenu;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            RedeemCodeButton;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Customization;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Customization_1;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Customization_2;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Customization_3;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Customization_4;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Exit;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LobbyName;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LobbyName_2;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Settings;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ViewTrophies;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thinline;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thinline_1;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_TrophyCustomization_C*              WI_TrophyCustomization;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFindGame;                                        // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnInviteFriends;                                   // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCustomize;                                       // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnLeaveLobby;                                      // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          SearchingForGame;                                  // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnGoToMainMenu;                                    // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnRefreshDisplayName;                              // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnRefreshLevel;                                    // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FFCTAchievementList                    AchievementList;                                   // 0x03B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnFindGame__DelegateSignature(bool SearchingForGame_0);
	void OnInviteFriends__DelegateSignature();
	void OnCustomize__DelegateSignature();
	void OnLeaveLobby__DelegateSignature();
	void OnGoToMainMenu__DelegateSignature();
	void OnRefreshDisplayName__DelegateSignature();
	void OnRefreshLevel__DelegateSignature();
	void ExecuteUbergraph_BP_PlayerProfileMenu(int32 EntryPoint);
	void BndEvt__BP_StatisticsAndAchievementView_K2Node_ComponentBoundEvent_14_OnAchievementsQueried__DelegateSignature(const struct FFCTAchievementList& AchievementList_0);
	void BndEvt__BP_AccelByteRedeemCodeWidget_K2Node_ComponentBoundEvent_13_OnRefreshPlayerProfile__DelegateSignature();
	void BndEvt__BP_AccelByteRedeemCodeWidget_K2Node_ComponentBoundEvent_11_OnExitMenu__DelegateSignature();
	void BndEvt__RedeemCodeButton_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__bp_wi_EnterAvatarName_K2Node_ComponentBoundEvent_9_OnCancelChangeName__DelegateSignature();
	void BndEvt__bp_wi_EnterAvatarName_K2Node_ComponentBoundEvent_8_OnDisplayNameSuccess__DelegateSignature();
	void BndEvt__MenuButton_Appearance_1_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void OnSentToFriendLobby();
	void BndEvt__WI_TrophyCustomization_K2Node_ComponentBoundEvent_6_OnBackCalled__DelegateSignature();
	void BndEvt__MenuButton_Appearance_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MenuButton_Exit_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MenuButton_ViewTrophies_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MenuButton_Achievements_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_StatisticsAndAchievementView_K2Node_ComponentBoundEvent_1_OnExitAchievements__DelegateSignature();
	void BndEvt__BP_CustomizationMenu_K2Node_ComponentBoundEvent_0_OnBackClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerProfileMenu_C">();
	}
	static class UBP_PlayerProfileMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerProfileMenu_C>();
	}
};
static_assert(alignof(UBP_PlayerProfileMenu_C) == 0x000008, "Wrong alignment on UBP_PlayerProfileMenu_C");
static_assert(sizeof(UBP_PlayerProfileMenu_C) == 0x0003E0, "Wrong size on UBP_PlayerProfileMenu_C");
static_assert(offsetof(UBP_PlayerProfileMenu_C, UberGraphFrame) == 0x000260, "Member 'UBP_PlayerProfileMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, BP_AccelByteRedeemCodeWidget) == 0x000268, "Member 'UBP_PlayerProfileMenu_C::BP_AccelByteRedeemCodeWidget' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, BP_CustomizationMenu) == 0x000270, "Member 'UBP_PlayerProfileMenu_C::BP_CustomizationMenu' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, BP_StatisticsAndAchievementView) == 0x000278, "Member 'UBP_PlayerProfileMenu_C::BP_StatisticsAndAchievementView' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, bp_wi_EnterAvatarName) == 0x000280, "Member 'UBP_PlayerProfileMenu_C::bp_wi_EnterAvatarName' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, ChangeDisplayNameButton) == 0x000288, "Member 'UBP_PlayerProfileMenu_C::ChangeDisplayNameButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, MenuButton_Achievements) == 0x000290, "Member 'UBP_PlayerProfileMenu_C::MenuButton_Achievements' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, MenuButton_Appearance) == 0x000298, "Member 'UBP_PlayerProfileMenu_C::MenuButton_Appearance' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, MenuButton_Cabin) == 0x0002A0, "Member 'UBP_PlayerProfileMenu_C::MenuButton_Cabin' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, MenuButton_Exit) == 0x0002A8, "Member 'UBP_PlayerProfileMenu_C::MenuButton_Exit' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, MenuButton_PlayerStatistics) == 0x0002B0, "Member 'UBP_PlayerProfileMenu_C::MenuButton_PlayerStatistics' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, MenuButton_ViewTrophies) == 0x0002B8, "Member 'UBP_PlayerProfileMenu_C::MenuButton_ViewTrophies' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, MenuSwitcher) == 0x0002C0, "Member 'UBP_PlayerProfileMenu_C::MenuSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, PlayerProfileMenu) == 0x0002C8, "Member 'UBP_PlayerProfileMenu_C::PlayerProfileMenu' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, RedeemCodeButton) == 0x0002D0, "Member 'UBP_PlayerProfileMenu_C::RedeemCodeButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Text_Customization) == 0x0002D8, "Member 'UBP_PlayerProfileMenu_C::Text_Customization' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Text_Customization_1) == 0x0002E0, "Member 'UBP_PlayerProfileMenu_C::Text_Customization_1' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Text_Customization_2) == 0x0002E8, "Member 'UBP_PlayerProfileMenu_C::Text_Customization_2' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Text_Customization_3) == 0x0002F0, "Member 'UBP_PlayerProfileMenu_C::Text_Customization_3' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Text_Customization_4) == 0x0002F8, "Member 'UBP_PlayerProfileMenu_C::Text_Customization_4' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Text_Exit) == 0x000300, "Member 'UBP_PlayerProfileMenu_C::Text_Exit' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Text_LobbyName) == 0x000308, "Member 'UBP_PlayerProfileMenu_C::Text_LobbyName' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Text_LobbyName_2) == 0x000310, "Member 'UBP_PlayerProfileMenu_C::Text_LobbyName_2' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Text_Settings) == 0x000318, "Member 'UBP_PlayerProfileMenu_C::Text_Settings' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Text_ViewTrophies) == 0x000320, "Member 'UBP_PlayerProfileMenu_C::Text_ViewTrophies' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Thinline) == 0x000328, "Member 'UBP_PlayerProfileMenu_C::Thinline' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, Thinline_1) == 0x000330, "Member 'UBP_PlayerProfileMenu_C::Thinline_1' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, WI_TrophyCustomization) == 0x000338, "Member 'UBP_PlayerProfileMenu_C::WI_TrophyCustomization' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, OnFindGame) == 0x000340, "Member 'UBP_PlayerProfileMenu_C::OnFindGame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, OnInviteFriends) == 0x000350, "Member 'UBP_PlayerProfileMenu_C::OnInviteFriends' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, OnCustomize) == 0x000360, "Member 'UBP_PlayerProfileMenu_C::OnCustomize' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, OnLeaveLobby) == 0x000370, "Member 'UBP_PlayerProfileMenu_C::OnLeaveLobby' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, SearchingForGame) == 0x000380, "Member 'UBP_PlayerProfileMenu_C::SearchingForGame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, OnGoToMainMenu) == 0x000388, "Member 'UBP_PlayerProfileMenu_C::OnGoToMainMenu' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, OnRefreshDisplayName) == 0x000398, "Member 'UBP_PlayerProfileMenu_C::OnRefreshDisplayName' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, OnRefreshLevel) == 0x0003A8, "Member 'UBP_PlayerProfileMenu_C::OnRefreshLevel' has a wrong offset!");
static_assert(offsetof(UBP_PlayerProfileMenu_C, AchievementList) == 0x0003B8, "Member 'UBP_PlayerProfileMenu_C::AchievementList' has a wrong offset!");

}

