#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerProfileExperienceNotch

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerProfileExperienceNotch.BP_PlayerProfileExperienceNotch_C.ExecuteUbergraph_BP_PlayerProfileExperienceNotch
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch) == 0x000004, "Wrong alignment on BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch");
static_assert(sizeof(BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch) == 0x000018, "Wrong size on BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch");
static_assert(offsetof(BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch, EntryPoint) == 0x000000, "Member 'BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch, CallFunc_MakeVector2D_ReturnValue_1) == 0x000010, "Member 'BP_PlayerProfileExperienceNotch_C_ExecuteUbergraph_BP_PlayerProfileExperienceNotch::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerProfileExperienceNotch.BP_PlayerProfileExperienceNotch_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerProfileExperienceNotch_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerProfileExperienceNotch_C_PreConstruct) == 0x000001, "Wrong alignment on BP_PlayerProfileExperienceNotch_C_PreConstruct");
static_assert(sizeof(BP_PlayerProfileExperienceNotch_C_PreConstruct) == 0x000001, "Wrong size on BP_PlayerProfileExperienceNotch_C_PreConstruct");
static_assert(offsetof(BP_PlayerProfileExperienceNotch_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_PlayerProfileExperienceNotch_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

