#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkinToneButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SkinToneButton.BP_SkinToneButton_C
// 0x0028 (0x0600 - 0x05D8)
class UBP_SkinToneButton_C final : public UCustomizationMaterialButtonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 BackgroundImage;                                   // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ColorImage;                                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CosmeticImage_1;                                   // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SkinToneButton(int32 EntryPoint);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__SkinToneButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkinToneButton_C">();
	}
	static class UBP_SkinToneButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkinToneButton_C>();
	}
};
static_assert(alignof(UBP_SkinToneButton_C) == 0x000008, "Wrong alignment on UBP_SkinToneButton_C");
static_assert(sizeof(UBP_SkinToneButton_C) == 0x000600, "Wrong size on UBP_SkinToneButton_C");
static_assert(offsetof(UBP_SkinToneButton_C, UberGraphFrame) == 0x0005D8, "Member 'UBP_SkinToneButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SkinToneButton_C, BackgroundImage) == 0x0005E0, "Member 'UBP_SkinToneButton_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UBP_SkinToneButton_C, ColorImage) == 0x0005E8, "Member 'UBP_SkinToneButton_C::ColorImage' has a wrong offset!");
static_assert(offsetof(UBP_SkinToneButton_C, CosmeticImage_1) == 0x0005F0, "Member 'UBP_SkinToneButton_C::CosmeticImage_1' has a wrong offset!");
static_assert(offsetof(UBP_SkinToneButton_C, Ak) == 0x0005F8, "Member 'UBP_SkinToneButton_C::Ak' has a wrong offset!");

}

