#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrashCan_7_2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TrashCan_7_2.BP_TrashCan_7_2_C.ExecuteUbergraph_BP_TrashCan_7_2
// 0x00D8 (0x00D8 - 0x0000)
struct BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x002C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2) == 0x000008, "Wrong alignment on BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2");
static_assert(sizeof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2) == 0x0000D8, "Wrong size on BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, EntryPoint) == 0x000000, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, K2Node_ComponentBoundEvent_HitComponent) == 0x000008, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000020, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, K2Node_ComponentBoundEvent_Hit) == 0x00002C, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, CallFunc_VSize_ReturnValue) == 0x0000B8, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000BC, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C0, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, CallFunc_FClamp_ReturnValue) == 0x0000CC, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, CallFunc_InRange_FloatFloat_ReturnValue) == 0x0000D0, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x0000D1, "Member 'BP_TrashCan_7_2_C_ExecuteUbergraph_BP_TrashCan_7_2::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_TrashCan_7_2.BP_TrashCan_7_2_C.BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature, Hit) == 0x000024, "Member 'BP_TrashCan_7_2_C_BndEvt__Old_tank_K2Node_ComponentBoundEvent_973_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_TrashCan_7_2.BP_TrashCan_7_2_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_TrashCan_7_2_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrashCan_7_2_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_TrashCan_7_2_C_UserConstructionScript");
static_assert(sizeof(BP_TrashCan_7_2_C_UserConstructionScript) == 0x000008, "Wrong size on BP_TrashCan_7_2_C_UserConstructionScript");
static_assert(offsetof(BP_TrashCan_7_2_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_TrashCan_7_2_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

