#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_TrashDebris

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function bp_TrashDebris.bp_TrashDebris_C.ExecuteUbergraph_bp_TrashDebris
// 0x00F0 (0x00F0 - 0x0000)
struct bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0048(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris) == 0x000008, "Wrong alignment on bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris");
static_assert(sizeof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris) == 0x0000F0, "Wrong size on bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, EntryPoint) == 0x000000, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, K2Node_Event_MyComp) == 0x000008, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, K2Node_Event_Other) == 0x000010, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, K2Node_Event_OtherComp) == 0x000018, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, K2Node_Event_bSelfMoved) == 0x000020, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, K2Node_Event_HitLocation) == 0x000024, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, K2Node_Event_HitNormal) == 0x000030, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, K2Node_Event_NormalImpulse) == 0x00003C, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, K2Node_Event_Hit) == 0x000048, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000D4, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, CallFunc_VSizeSquared_ReturnValue) == 0x0000D8, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000DC, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x0000E0, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, CallFunc_BooleanAND_ReturnValue) == 0x0000E8, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris, Temp_bool_Has_Been_Initd_Variable) == 0x0000E9, "Member 'bp_TrashDebris_C_ExecuteUbergraph_bp_TrashDebris::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function bp_TrashDebris.bp_TrashDebris_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct bp_TrashDebris_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(bp_TrashDebris_C_ReceiveHit) == 0x000008, "Wrong alignment on bp_TrashDebris_C_ReceiveHit");
static_assert(sizeof(bp_TrashDebris_C_ReceiveHit) == 0x0000D0, "Wrong size on bp_TrashDebris_C_ReceiveHit");
static_assert(offsetof(bp_TrashDebris_C_ReceiveHit, MyComp) == 0x000000, "Member 'bp_TrashDebris_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ReceiveHit, Other) == 0x000008, "Member 'bp_TrashDebris_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ReceiveHit, OtherComp) == 0x000010, "Member 'bp_TrashDebris_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'bp_TrashDebris_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'bp_TrashDebris_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ReceiveHit, HitNormal) == 0x000028, "Member 'bp_TrashDebris_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'bp_TrashDebris_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_ReceiveHit, Hit) == 0x000040, "Member 'bp_TrashDebris_C_ReceiveHit::Hit' has a wrong offset!");

// Function bp_TrashDebris.bp_TrashDebris_C.UserConstructionScript
// 0x0130 (0x0130 - 0x0000)
struct bp_TrashDebris_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x0044(0x0008)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue_1;           // 0x007C(0x0008)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_2; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_TrashDebris_C_UserConstructionScript) == 0x000010, "Wrong alignment on bp_TrashDebris_C_UserConstructionScript");
static_assert(sizeof(bp_TrashDebris_C_UserConstructionScript) == 0x000130, "Wrong size on bp_TrashDebris_C_UserConstructionScript");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'bp_TrashDebris_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, Temp_bool_Variable) == 0x000010, "Member 'bp_TrashDebris_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000020, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000024, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000028, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000034, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_FTrunc_ReturnValue) == 0x00003C, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000040, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_MakeRandomStream_ReturnValue) == 0x000044, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00004C, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000050, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x000054, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000058, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000064, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_1) == 0x000070, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_MakeRandomStream_ReturnValue_1) == 0x00007C, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_MakeRandomStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue_2) == 0x000084, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00008C, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x0000D0, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0000E0, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_1) == 0x0000F0, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_TrashDebris_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue_1) == 0x000120, "Member 'bp_TrashDebris_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");

}

