#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VruumbaCustomizationScrollBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_VruumbaCustomizationScrollBox.BP_VruumbaCustomizationScrollBox_C
// 0x01D0 (0x04C8 - 0x02F8)
class UBP_VruumbaCustomizationScrollBox_C final : public UVruumbaCustomizationScrollBoxUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UButton*                                AntennaButton;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AntennaImage;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BodyButton;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BodyImage;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_CustomizationCategoryButton_C*      ButtonAntenna;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_CustomizationCategoryButton_C*      ButtonBody;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_CustomizationCategoryButton_C*      ButtonParticles;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MenuListBanner_C*                   ClassicBanner;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MenuListBanner_C*                   ElegantBanner;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ExtravagantItemsContainer;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MenuListBanner_C*                   ExtravagentBanner;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HeaderText;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_149;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_446;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MenuListBanner_C*                   LuxuriousBanner;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ParticleEffectButton;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ParticleEffectImage;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SelectionScrollbox;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_132;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AVruumbaPreviewSCTBP_C*                 VruumbaPreviewer;                                  // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCTCloudCustomizationVruumba          TempCloudCustomizationVruumba;                     // 0x03A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFCTCloudCustomizationVruumba          CurrentCloudCustomizationVruumba;                  // 0x03D0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   DefaultItemName;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCTAchievementList                    AchievementList;                                   // 0x0408(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnMadeChanges;                                     // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           ClassicColor;                                      // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ElegantColor;                                      // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LuxuriousColor;                                    // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ExtravagentColor;                                  // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         BodyItems;                                         // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         AntennaItems;                                      // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         ParticleItems;                                     // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           TimerHandle;                                       // 0x04B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemTooltip_C*                      ItemTooltip;                                       // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnMadeChanges__DelegateSignature();
	void ExecuteUbergraph_BP_VruumbaCustomizationScrollBox(int32 EntryPoint);
	void OnSetToolTipVisibilityByTimer();
	void OnSetTooltipVisibility(bool Visible, class UBP_ItemCard_C* ItemCard, uint8 CategoryAsByte);
	void SetConfigToVruumba();
	void OnAntennaItemFocused(bool Focused, class UBP_ItemCard_C* Item);
	void OnParticlesItemFocused(bool Focused, class UBP_ItemCard_C* Item);
	void OnBodyItemFocused(bool Focused, class UBP_ItemCard_C* Item);
	void InitializeVruumbaCustomization(const struct FFCTCloudCustomizationVruumba& CustomizationVruumba);
	void BndEvt__BP_VruumbaCustomizationScrollBox_ButtonParticles_K2Node_ComponentBoundEvent_5_OnCategorySelected__DelegateSignature();
	void BndEvt__BP_VruumbaCustomizationScrollBox_ButtonAntenna_K2Node_ComponentBoundEvent_4_OnCategorySelected__DelegateSignature();
	void BndEvt__BP_VruumbaCustomizationScrollBox_ButtonBody_K2Node_ComponentBoundEvent_3_OnCategorySelected__DelegateSignature();
	void OnLeaveMenu();
	void OnParticlesItemSelected(const class UBP_ItemCard_C* ItemCard);
	void OnAntennaItemSelected(const class UBP_ItemCard_C* ItemCard);
	void ActivateWidget();
	void OnBodyItemSelected(const class UBP_ItemCard_C* ItemCard);
	void Construct();
	void DeactivateWidget();
	void OnSuccess_86D0CDDC4299AE5E80745B975574F5B1(const struct FAccelByteModelsEntitlementPagingSlicedResult& Entitlements, int32 Code, const class FString& Message);
	void OnFail_86D0CDDC4299AE5E80745B975574F5B1(int32 Code, const class FString& Message);
	void GetBodyByName(class FName Name_0, struct FVruumbaSkeletalMeshCustomizationItemTableRow* Out_Row);
	void GetAntennaByName(class FName Name_0, struct FVruumbaAnimatedMeshCustomizationItemTableRow* Out_Row);
	void GetParticlesByName(class FName Name_0, struct FVruumbaParticlesCustomizationItemTableRow* Out_Row);
	void SetTemporaryValue(uint8 Type, class FName Name_0);
	void Get_Temp_Item_By_Type(uint8 ItemCategory);
	void GetTempCustomizationNames(class FName* Body, class FName* Antenna, class FName* Particles);
	void GetCurrentCustomizationNames(class FName* Body, class FName* Antenna, class FName* Particles);
	void Get_Current_Item_By_Type(uint8 ItemCategory);
	void BuildVruumbaCategory(EVruumbaCustomizationType ItemCategory);
	void GetVruumbaCategoryDTRowNames(EVruumbaCustomizationType ItemCategory, TArray<class FName>* RowNames);
	void AssignBodyToPreviewer(class FName Name_0);
	void AssignAntennaToPreviewer(class FName Name_0);
	void AssignParticlesToPreviewer(class FName Name_0);
	void AddToGrid(class UUserWidget* Widget, class UGridPanel* Grid, int32 Index_0, int32 SlotsPerRow);
	void ConfirmVruumbaSettings(struct FFCTCloudCustomizationVruumba* UpdatedSetting);
	void RevertCustomization();
	void Set_UIColors(class UBP_CustomizationMenu_C* Parent);
	void AssignParticlesToPreviewerAndPlay(class FName Name_0);
	void SetAllButtonsToUnselected();
	void UpdateCurrentButton(class UCM_CustomizationCategoryButton_C* NextButton);
	void Get_Current_Category_Button(class UCM_CustomizationCategoryButton_C** AsCM_Customization_Category_Button);
	void Initialize_Body_List(TArray<struct FAccelByteModelsEntitlementInfo>& UnlockedEntitlements);
	void InitializeAntennaList(TArray<struct FAccelByteModelsEntitlementInfo>& UnlockedEntitlements);
	void InitializeParticlesList(TArray<struct FAccelByteModelsEntitlementInfo>& UnlockedEntitlements);
	void UserOwnsEntitlement(TArray<struct FAccelByteModelsEntitlementInfo>& Entitlements, const class FString& QueryID, bool* bFound);
	int32 GetCurrentLevel();
	void SetTooltipVisibility(bool bIsVisible, class UBP_ItemCard_C* ItemCard, uint8 CategoryAsByte);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VruumbaCustomizationScrollBox_C">();
	}
	static class UBP_VruumbaCustomizationScrollBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VruumbaCustomizationScrollBox_C>();
	}
};
static_assert(alignof(UBP_VruumbaCustomizationScrollBox_C) == 0x000008, "Wrong alignment on UBP_VruumbaCustomizationScrollBox_C");
static_assert(sizeof(UBP_VruumbaCustomizationScrollBox_C) == 0x0004C8, "Wrong size on UBP_VruumbaCustomizationScrollBox_C");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, UberGraphFrame) == 0x0002F8, "Member 'UBP_VruumbaCustomizationScrollBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, AntennaButton) == 0x000300, "Member 'UBP_VruumbaCustomizationScrollBox_C::AntennaButton' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, AntennaImage) == 0x000308, "Member 'UBP_VruumbaCustomizationScrollBox_C::AntennaImage' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, BodyButton) == 0x000310, "Member 'UBP_VruumbaCustomizationScrollBox_C::BodyButton' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, BodyImage) == 0x000318, "Member 'UBP_VruumbaCustomizationScrollBox_C::BodyImage' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ButtonAntenna) == 0x000320, "Member 'UBP_VruumbaCustomizationScrollBox_C::ButtonAntenna' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ButtonBody) == 0x000328, "Member 'UBP_VruumbaCustomizationScrollBox_C::ButtonBody' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ButtonParticles) == 0x000330, "Member 'UBP_VruumbaCustomizationScrollBox_C::ButtonParticles' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ClassicBanner) == 0x000338, "Member 'UBP_VruumbaCustomizationScrollBox_C::ClassicBanner' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ElegantBanner) == 0x000340, "Member 'UBP_VruumbaCustomizationScrollBox_C::ElegantBanner' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ExtravagantItemsContainer) == 0x000348, "Member 'UBP_VruumbaCustomizationScrollBox_C::ExtravagantItemsContainer' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ExtravagentBanner) == 0x000350, "Member 'UBP_VruumbaCustomizationScrollBox_C::ExtravagentBanner' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, HeaderText) == 0x000358, "Member 'UBP_VruumbaCustomizationScrollBox_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, Image_149) == 0x000360, "Member 'UBP_VruumbaCustomizationScrollBox_C::Image_149' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, Image_446) == 0x000368, "Member 'UBP_VruumbaCustomizationScrollBox_C::Image_446' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, LuxuriousBanner) == 0x000370, "Member 'UBP_VruumbaCustomizationScrollBox_C::LuxuriousBanner' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ParticleEffectButton) == 0x000378, "Member 'UBP_VruumbaCustomizationScrollBox_C::ParticleEffectButton' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ParticleEffectImage) == 0x000380, "Member 'UBP_VruumbaCustomizationScrollBox_C::ParticleEffectImage' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, SelectionScrollbox) == 0x000388, "Member 'UBP_VruumbaCustomizationScrollBox_C::SelectionScrollbox' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, VerticalBox_132) == 0x000390, "Member 'UBP_VruumbaCustomizationScrollBox_C::VerticalBox_132' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, VruumbaPreviewer) == 0x000398, "Member 'UBP_VruumbaCustomizationScrollBox_C::VruumbaPreviewer' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, TempCloudCustomizationVruumba) == 0x0003A0, "Member 'UBP_VruumbaCustomizationScrollBox_C::TempCloudCustomizationVruumba' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, CurrentCloudCustomizationVruumba) == 0x0003D0, "Member 'UBP_VruumbaCustomizationScrollBox_C::CurrentCloudCustomizationVruumba' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, DefaultItemName) == 0x000400, "Member 'UBP_VruumbaCustomizationScrollBox_C::DefaultItemName' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, AchievementList) == 0x000408, "Member 'UBP_VruumbaCustomizationScrollBox_C::AchievementList' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, OnMadeChanges) == 0x000430, "Member 'UBP_VruumbaCustomizationScrollBox_C::OnMadeChanges' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ClassicColor) == 0x000440, "Member 'UBP_VruumbaCustomizationScrollBox_C::ClassicColor' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ElegantColor) == 0x000450, "Member 'UBP_VruumbaCustomizationScrollBox_C::ElegantColor' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, LuxuriousColor) == 0x000460, "Member 'UBP_VruumbaCustomizationScrollBox_C::LuxuriousColor' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ExtravagentColor) == 0x000470, "Member 'UBP_VruumbaCustomizationScrollBox_C::ExtravagentColor' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, Ak) == 0x000480, "Member 'UBP_VruumbaCustomizationScrollBox_C::Ak' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, BodyItems) == 0x000488, "Member 'UBP_VruumbaCustomizationScrollBox_C::BodyItems' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, AntennaItems) == 0x000498, "Member 'UBP_VruumbaCustomizationScrollBox_C::AntennaItems' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ParticleItems) == 0x0004A8, "Member 'UBP_VruumbaCustomizationScrollBox_C::ParticleItems' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, TimerHandle) == 0x0004B8, "Member 'UBP_VruumbaCustomizationScrollBox_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_VruumbaCustomizationScrollBox_C, ItemTooltip) == 0x0004C0, "Member 'UBP_VruumbaCustomizationScrollBox_C::ItemTooltip' has a wrong offset!");

}

