#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_AccelByte_ProtoMinusFriend_PopUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_AccelByte_Proto-Friend_PopUp.bp_wi_AccelByte_Proto-Friend_PopUp_C
// 0x0040 (0x02A0 - 0x0260)
class Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Background_1;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Btn_Dismiss;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ov_Notification;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_NotificationMessage;                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_OK;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriend_PopUp(int32 EntryPoint);
	void BndEvt__Btn_Confirm_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_AccelByte_Proto-Friend_PopUp_C">();
	}
	static class Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C>();
	}
};
static_assert(alignof(Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C) == 0x000008, "Wrong alignment on Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C");
static_assert(sizeof(Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C) == 0x0002A0, "Wrong size on Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C, UberGraphFrame) == 0x000260, "Member 'Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C, Background_1) == 0x000268, "Member 'Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C::Background_1' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C, Btn_Dismiss) == 0x000270, "Member 'Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C::Btn_Dismiss' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C, Ov_Notification) == 0x000278, "Member 'Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C::Ov_Notification' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C, Txt_NotificationMessage) == 0x000280, "Member 'Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C::Txt_NotificationMessage' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C, Txt_OK) == 0x000288, "Member 'Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C::Txt_OK' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C, Message) == 0x000290, "Member 'Ubp_wi_AccelByte_ProtoMinusFriend_PopUp_C::Message' has a wrong offset!");

}

