#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_Home

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_Home.bp_wi_Home_C
// 0x0100 (0x0360 - 0x0260)
class Ubp_wi_Home_C final : public UUserWidget
{
public:
	class UMenuButton*                            MenuButton_Customization;                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_Customization_1;                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButton*                            MenuButton_InviteFriends;                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadCompatibleButton_C*             PlayerProfileGamepad;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadCompatibleButton_C*             PlayerProfileGamepad_1;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadCompatibleButton_C*             PlayNowGamepad;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               QuitContainer;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadCompatibleButton_C*             QuitGamepad;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadCompatibleButton_C*             SettingsGamepad;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadCompatibleButton_C*             TutorialVideoGamepad;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadCompatibleButton_C*             TutorialVideoGamepad_1;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFindGameClicked;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnQuitGameClicked;                                 // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPlayTutorialClicked;                             // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnOptionsClicked;                                  // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCustomizationClicked;                            // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnRulesClicked;                                    // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnInviteFriendsClicked;                            // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnAchievementsClicked;                             // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPlayerProfileClicked;                            // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 LoginErrorCode;                                    // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UUserWidget*                            LoadingSpinner;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnFindGameClicked__DelegateSignature();
	void OnQuitGameClicked__DelegateSignature();
	void OnPlayTutorialClicked__DelegateSignature();
	void OnOptionsClicked__DelegateSignature();
	void OnCustomizationClicked__DelegateSignature();
	void OnRulesClicked__DelegateSignature();
	void OnInviteFriendsClicked__DelegateSignature();
	void OnAchievementsClicked__DelegateSignature(const struct FFCTAchievementList& AchievementList);
	void OnPlayerProfileClicked__DelegateSignature();
	void RemoveLoadingSpinners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_Home_C">();
	}
	static class Ubp_wi_Home_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_Home_C>();
	}
};
static_assert(alignof(Ubp_wi_Home_C) == 0x000008, "Wrong alignment on Ubp_wi_Home_C");
static_assert(sizeof(Ubp_wi_Home_C) == 0x000360, "Wrong size on Ubp_wi_Home_C");
static_assert(offsetof(Ubp_wi_Home_C, MenuButton_Customization) == 0x000260, "Member 'Ubp_wi_Home_C::MenuButton_Customization' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, MenuButton_Customization_1) == 0x000268, "Member 'Ubp_wi_Home_C::MenuButton_Customization_1' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, MenuButton_InviteFriends) == 0x000270, "Member 'Ubp_wi_Home_C::MenuButton_InviteFriends' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, PlayerProfileGamepad) == 0x000278, "Member 'Ubp_wi_Home_C::PlayerProfileGamepad' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, PlayerProfileGamepad_1) == 0x000280, "Member 'Ubp_wi_Home_C::PlayerProfileGamepad_1' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, PlayNowGamepad) == 0x000288, "Member 'Ubp_wi_Home_C::PlayNowGamepad' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, QuitContainer) == 0x000290, "Member 'Ubp_wi_Home_C::QuitContainer' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, QuitGamepad) == 0x000298, "Member 'Ubp_wi_Home_C::QuitGamepad' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, SettingsGamepad) == 0x0002A0, "Member 'Ubp_wi_Home_C::SettingsGamepad' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, TutorialVideoGamepad) == 0x0002A8, "Member 'Ubp_wi_Home_C::TutorialVideoGamepad' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, TutorialVideoGamepad_1) == 0x0002B0, "Member 'Ubp_wi_Home_C::TutorialVideoGamepad_1' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, OnFindGameClicked) == 0x0002B8, "Member 'Ubp_wi_Home_C::OnFindGameClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, OnQuitGameClicked) == 0x0002C8, "Member 'Ubp_wi_Home_C::OnQuitGameClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, OnPlayTutorialClicked) == 0x0002D8, "Member 'Ubp_wi_Home_C::OnPlayTutorialClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, OnOptionsClicked) == 0x0002E8, "Member 'Ubp_wi_Home_C::OnOptionsClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, OnCustomizationClicked) == 0x0002F8, "Member 'Ubp_wi_Home_C::OnCustomizationClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, OnRulesClicked) == 0x000308, "Member 'Ubp_wi_Home_C::OnRulesClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, OnInviteFriendsClicked) == 0x000318, "Member 'Ubp_wi_Home_C::OnInviteFriendsClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, OnAchievementsClicked) == 0x000328, "Member 'Ubp_wi_Home_C::OnAchievementsClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, OnPlayerProfileClicked) == 0x000338, "Member 'Ubp_wi_Home_C::OnPlayerProfileClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, LoginErrorCode) == 0x000348, "Member 'Ubp_wi_Home_C::LoginErrorCode' has a wrong offset!");
static_assert(offsetof(Ubp_wi_Home_C, LoadingSpinner) == 0x000358, "Member 'Ubp_wi_Home_C::LoadingSpinner' has a wrong offset!");

}

