#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_PersonoidIntro

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_PersonoidIntro.bp_wi_PersonoidIntro_C.ExecuteUbergraph_bp_wi_PersonoidIntro
// 0x00A8 (0x00A8 - 0x0000)
struct bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomGameSettingsGIS*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ArePersonoidsHidden_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_HasPassengerLog_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0078(0x0028)(UObjectWrapper)
	bool                                          CallFunc_HaveAllPersonoidsReplicated_ReturnValue;  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro) == 0x000008, "Wrong alignment on bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro");
static_assert(sizeof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro) == 0x0000A8, "Wrong size on bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, EntryPoint) == 0x000000, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_ArePersonoidsHidden_ReturnValue) == 0x000030, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_ArePersonoidsHidden_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, K2Node_Event_IsDesignTime) == 0x000031, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000038, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_HasPassengerLog_ReturnValue) == 0x000048, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_HasPassengerLog_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_Array_RemoveItem_ReturnValue) == 0x000049, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000050, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000058, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000060, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000068, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, K2Node_MakeStruct_SlateColor) == 0x000078, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_HaveAllPersonoidsReplicated_ReturnValue) == 0x0000A0, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_HaveAllPersonoidsReplicated_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro, CallFunc_BooleanOR_ReturnValue) == 0x0000A1, "Member 'bp_wi_PersonoidIntro_C_ExecuteUbergraph_bp_wi_PersonoidIntro::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function bp_wi_PersonoidIntro.bp_wi_PersonoidIntro_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_PersonoidIntro_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_PersonoidIntro_C_PreConstruct) == 0x000001, "Wrong alignment on bp_wi_PersonoidIntro_C_PreConstruct");
static_assert(sizeof(bp_wi_PersonoidIntro_C_PreConstruct) == 0x000001, "Wrong size on bp_wi_PersonoidIntro_C_PreConstruct");
static_assert(offsetof(bp_wi_PersonoidIntro_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'bp_wi_PersonoidIntro_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function bp_wi_PersonoidIntro.bp_wi_PersonoidIntro_C.SetupPlayerText
// 0x0070 (0x0070 - 0x0000)
struct bp_wi_PersonoidIntro_C_SetupPlayerText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0008(0x0018)()
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)(UObjectWrapper)
	class FText                                   K2Node_Select_Default_2;                           // 0x0058(0x0018)()
};
static_assert(alignof(bp_wi_PersonoidIntro_C_SetupPlayerText) == 0x000008, "Wrong alignment on bp_wi_PersonoidIntro_C_SetupPlayerText");
static_assert(sizeof(bp_wi_PersonoidIntro_C_SetupPlayerText) == 0x000070, "Wrong size on bp_wi_PersonoidIntro_C_SetupPlayerText");
static_assert(offsetof(bp_wi_PersonoidIntro_C_SetupPlayerText, Temp_bool_Variable) == 0x000000, "Member 'bp_wi_PersonoidIntro_C_SetupPlayerText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_SetupPlayerText, Temp_bool_Variable_1) == 0x000001, "Member 'bp_wi_PersonoidIntro_C_SetupPlayerText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_SetupPlayerText, Temp_bool_Variable_2) == 0x000002, "Member 'bp_wi_PersonoidIntro_C_SetupPlayerText::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_SetupPlayerText, K2Node_Select_Default) == 0x000008, "Member 'bp_wi_PersonoidIntro_C_SetupPlayerText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_SetupPlayerText, K2Node_Select_Default_1) == 0x000020, "Member 'bp_wi_PersonoidIntro_C_SetupPlayerText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_SetupPlayerText, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'bp_wi_PersonoidIntro_C_SetupPlayerText::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_SetupPlayerText, K2Node_Select_Default_2) == 0x000058, "Member 'bp_wi_PersonoidIntro_C_SetupPlayerText::K2Node_Select_Default_2' has a wrong offset!");

// Function bp_wi_PersonoidIntro.bp_wi_PersonoidIntro_C.PlaySoundEffect
// 0x0008 (0x0008 - 0x0000)
struct bp_wi_PersonoidIntro_C_PlaySoundEffect final
{
public:
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_PersonoidIntro_C_PlaySoundEffect) == 0x000008, "Wrong alignment on bp_wi_PersonoidIntro_C_PlaySoundEffect");
static_assert(sizeof(bp_wi_PersonoidIntro_C_PlaySoundEffect) == 0x000008, "Wrong size on bp_wi_PersonoidIntro_C_PlaySoundEffect");
static_assert(offsetof(bp_wi_PersonoidIntro_C_PlaySoundEffect, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000000, "Member 'bp_wi_PersonoidIntro_C_PlaySoundEffect::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");

// Function bp_wi_PersonoidIntro.bp_wi_PersonoidIntro_C.HasPassengerLog
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_PersonoidIntro_C_HasPassengerLog final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_PersonoidIntro_C_HasPassengerLog) == 0x000008, "Wrong alignment on bp_wi_PersonoidIntro_C_HasPassengerLog");
static_assert(sizeof(bp_wi_PersonoidIntro_C_HasPassengerLog) == 0x000020, "Wrong size on bp_wi_PersonoidIntro_C_HasPassengerLog");
static_assert(offsetof(bp_wi_PersonoidIntro_C_HasPassengerLog, ReturnValue) == 0x000000, "Member 'bp_wi_PersonoidIntro_C_HasPassengerLog::ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_HasPassengerLog, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'bp_wi_PersonoidIntro_C_HasPassengerLog::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_HasPassengerLog, K2Node_DynamicCast_AsSCTPlayer_State) == 0x000010, "Member 'bp_wi_PersonoidIntro_C_HasPassengerLog::K2Node_DynamicCast_AsSCTPlayer_State' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_HasPassengerLog, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'bp_wi_PersonoidIntro_C_HasPassengerLog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(bp_wi_PersonoidIntro_C_HasPassengerLog, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000019, "Member 'bp_wi_PersonoidIntro_C_HasPassengerLog::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

