#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_VotingEntryOption

#include "Basic.hpp"

#include "E_Characters_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_VotingEntryOption.bp_wi_VotingEntryOption_C.OnVotingButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct bp_wi_VotingEntryOption_C_OnVotingButtonClicked__DelegateSignature final
{
public:
	int32                                         VotingOptionIndex_0;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_VotingEntryOption_C_OnVotingButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on bp_wi_VotingEntryOption_C_OnVotingButtonClicked__DelegateSignature");
static_assert(sizeof(bp_wi_VotingEntryOption_C_OnVotingButtonClicked__DelegateSignature) == 0x000004, "Wrong size on bp_wi_VotingEntryOption_C_OnVotingButtonClicked__DelegateSignature");
static_assert(offsetof(bp_wi_VotingEntryOption_C_OnVotingButtonClicked__DelegateSignature, VotingOptionIndex_0) == 0x000000, "Member 'bp_wi_VotingEntryOption_C_OnVotingButtonClicked__DelegateSignature::VotingOptionIndex_0' has a wrong offset!");

// Function bp_wi_VotingEntryOption.bp_wi_VotingEntryOption_C.ExecuteUbergraph_bp_wi_VotingEntryOption
// 0x1030 (0x1030 - 0x0000)
struct bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0008(0x001C)(NoDestructor)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform_1;               // 0x0024(0x001C)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0070(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0098(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0120(0x0088)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x01A8(0x0278)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0420(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0448(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0470(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x04F8(0x0088)()
	class UAkAudioEvent*                          K2Node_CustomEvent_AkEvent;                        // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_1;                   // 0x0588(0x0278)(UObjectWrapper)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0808(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x0814(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_819[0x7];                                      // 0x0819(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Name_2;                         // 0x0820(0x0018)()
	E_Characters                                  K2Node_CustomEvent_Character_1;                    // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Name_1;                         // 0x0840(0x0018)()
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0858(0x0018)()
	E_Characters                                  K2Node_CustomEvent_Character;                      // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_871[0x7];                                      // 0x0871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0880(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_4;                    // 0x08A8(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0930(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_5;                    // 0x0958(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x09E0(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_6;                    // 0x0A08(0x0088)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_2;                   // 0x0A90(0x0278)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x0D08(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_7;                    // 0x0D30(0x0088)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_3;                   // 0x0DB8(0x0278)()
};
static_assert(alignof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption) == 0x000008, "Wrong alignment on bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption");
static_assert(sizeof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption) == 0x001030, "Wrong size on bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, EntryPoint) == 0x000000, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, CallFunc_PostEventAtLocation_ReturnValue) == 0x000004, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_WidgetTransform) == 0x000008, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_WidgetTransform_1) == 0x000024, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_WidgetTransform_1' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_Event_IsDesignTime) == 0x000040, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateColor_1) == 0x000070, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateBrush) == 0x000098, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateBrush_1) == 0x000120, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_ButtonStyle) == 0x0001A8, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateColor_2) == 0x000420, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateColor_3) == 0x000448, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateBrush_2) == 0x000470, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateBrush_3) == 0x0004F8, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateBrush_3' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_CustomEvent_AkEvent) == 0x000580, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_CustomEvent_AkEvent' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_ButtonStyle_1) == 0x000588, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_ButtonStyle_1' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, CallFunc_GetOwningPlayer_ReturnValue) == 0x000800, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, CallFunc_GetCameraLocation_ReturnValue) == 0x000808, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x000814, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_SwitchEnum_CmpSuccess) == 0x000818, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_CustomEvent_Name_2) == 0x000820, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_CustomEvent_Name_2' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_CustomEvent_Character_1) == 0x000838, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_CustomEvent_Name_1) == 0x000840, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_CustomEvent_Name_1' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_CustomEvent_Name) == 0x000858, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_CustomEvent_Character) == 0x000870, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000878, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateColor_4) == 0x000880, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateBrush_4) == 0x0008A8, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateBrush_4' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateColor_5) == 0x000930, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateBrush_5) == 0x000958, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateBrush_5' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateColor_6) == 0x0009E0, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateBrush_6) == 0x000A08, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateBrush_6' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_ButtonStyle_2) == 0x000A90, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_ButtonStyle_2' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateColor_7) == 0x000D08, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_SlateBrush_7) == 0x000D30, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_SlateBrush_7' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption, K2Node_MakeStruct_ButtonStyle_3) == 0x000DB8, "Member 'bp_wi_VotingEntryOption_C_ExecuteUbergraph_bp_wi_VotingEntryOption::K2Node_MakeStruct_ButtonStyle_3' has a wrong offset!");

// Function bp_wi_VotingEntryOption.bp_wi_VotingEntryOption_C.Set Layout Who Should Die
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_VotingEntryOption_C_Set_Layout_Who_Should_Die final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	E_Characters                                  Character_0;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_VotingEntryOption_C_Set_Layout_Who_Should_Die) == 0x000008, "Wrong alignment on bp_wi_VotingEntryOption_C_Set_Layout_Who_Should_Die");
static_assert(sizeof(bp_wi_VotingEntryOption_C_Set_Layout_Who_Should_Die) == 0x000020, "Wrong size on bp_wi_VotingEntryOption_C_Set_Layout_Who_Should_Die");
static_assert(offsetof(bp_wi_VotingEntryOption_C_Set_Layout_Who_Should_Die, Name_0) == 0x000000, "Member 'bp_wi_VotingEntryOption_C_Set_Layout_Who_Should_Die::Name_0' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_Set_Layout_Who_Should_Die, Character_0) == 0x000018, "Member 'bp_wi_VotingEntryOption_C_Set_Layout_Who_Should_Die::Character_0' has a wrong offset!");

// Function bp_wi_VotingEntryOption.bp_wi_VotingEntryOption_C.Set Layout Yes Or No
// 0x0018 (0x0018 - 0x0000)
struct bp_wi_VotingEntryOption_C_Set_Layout_Yes_Or_No final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(bp_wi_VotingEntryOption_C_Set_Layout_Yes_Or_No) == 0x000008, "Wrong alignment on bp_wi_VotingEntryOption_C_Set_Layout_Yes_Or_No");
static_assert(sizeof(bp_wi_VotingEntryOption_C_Set_Layout_Yes_Or_No) == 0x000018, "Wrong size on bp_wi_VotingEntryOption_C_Set_Layout_Yes_Or_No");
static_assert(offsetof(bp_wi_VotingEntryOption_C_Set_Layout_Yes_Or_No, Name_0) == 0x000000, "Member 'bp_wi_VotingEntryOption_C_Set_Layout_Yes_Or_No::Name_0' has a wrong offset!");

// Function bp_wi_VotingEntryOption.bp_wi_VotingEntryOption_C.Set Layout Which Log To See
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_VotingEntryOption_C_Set_Layout_Which_Log_To_See final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	E_Characters                                  Character_0;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_VotingEntryOption_C_Set_Layout_Which_Log_To_See) == 0x000008, "Wrong alignment on bp_wi_VotingEntryOption_C_Set_Layout_Which_Log_To_See");
static_assert(sizeof(bp_wi_VotingEntryOption_C_Set_Layout_Which_Log_To_See) == 0x000020, "Wrong size on bp_wi_VotingEntryOption_C_Set_Layout_Which_Log_To_See");
static_assert(offsetof(bp_wi_VotingEntryOption_C_Set_Layout_Which_Log_To_See, Name_0) == 0x000000, "Member 'bp_wi_VotingEntryOption_C_Set_Layout_Which_Log_To_See::Name_0' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_Set_Layout_Which_Log_To_See, Character_0) == 0x000018, "Member 'bp_wi_VotingEntryOption_C_Set_Layout_Which_Log_To_See::Character_0' has a wrong offset!");

// Function bp_wi_VotingEntryOption.bp_wi_VotingEntryOption_C.Audio Click
// 0x0008 (0x0008 - 0x0000)
struct bp_wi_VotingEntryOption_C_Audio_Click final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_VotingEntryOption_C_Audio_Click) == 0x000008, "Wrong alignment on bp_wi_VotingEntryOption_C_Audio_Click");
static_assert(sizeof(bp_wi_VotingEntryOption_C_Audio_Click) == 0x000008, "Wrong size on bp_wi_VotingEntryOption_C_Audio_Click");
static_assert(offsetof(bp_wi_VotingEntryOption_C_Audio_Click, AkEvent) == 0x000000, "Member 'bp_wi_VotingEntryOption_C_Audio_Click::AkEvent' has a wrong offset!");

// Function bp_wi_VotingEntryOption.bp_wi_VotingEntryOption_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_VotingEntryOption_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_VotingEntryOption_C_PreConstruct) == 0x000001, "Wrong alignment on bp_wi_VotingEntryOption_C_PreConstruct");
static_assert(sizeof(bp_wi_VotingEntryOption_C_PreConstruct) == 0x000001, "Wrong size on bp_wi_VotingEntryOption_C_PreConstruct");
static_assert(offsetof(bp_wi_VotingEntryOption_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'bp_wi_VotingEntryOption_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function bp_wi_VotingEntryOption.bp_wi_VotingEntryOption_C.HideMyOwnVotingEntry
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_VotingEntryOption_C_HideMyOwnVotingEntry final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_VotingEntryOption_C_HideMyOwnVotingEntry) == 0x000008, "Wrong alignment on bp_wi_VotingEntryOption_C_HideMyOwnVotingEntry");
static_assert(sizeof(bp_wi_VotingEntryOption_C_HideMyOwnVotingEntry) == 0x000020, "Wrong size on bp_wi_VotingEntryOption_C_HideMyOwnVotingEntry");
static_assert(offsetof(bp_wi_VotingEntryOption_C_HideMyOwnVotingEntry, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'bp_wi_VotingEntryOption_C_HideMyOwnVotingEntry::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_VotingEntryOption_C_HideMyOwnVotingEntry, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000018, "Member 'bp_wi_VotingEntryOption_C_HideMyOwnVotingEntry::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");

// Function bp_wi_VotingEntryOption.bp_wi_VotingEntryOption_C.Get_Text_LogNumber_Text_0
// 0x0018 (0x0018 - 0x0000)
struct bp_wi_VotingEntryOption_C_Get_Text_LogNumber_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(bp_wi_VotingEntryOption_C_Get_Text_LogNumber_Text_0) == 0x000008, "Wrong alignment on bp_wi_VotingEntryOption_C_Get_Text_LogNumber_Text_0");
static_assert(sizeof(bp_wi_VotingEntryOption_C_Get_Text_LogNumber_Text_0) == 0x000018, "Wrong size on bp_wi_VotingEntryOption_C_Get_Text_LogNumber_Text_0");
static_assert(offsetof(bp_wi_VotingEntryOption_C_Get_Text_LogNumber_Text_0, ReturnValue) == 0x000000, "Member 'bp_wi_VotingEntryOption_C_Get_Text_LogNumber_Text_0::ReturnValue' has a wrong offset!");

}

