#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_StartScreenGuest

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "E_StartScreenTabs_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_StartScreenGuest.bp_wi_StartScreenGuest_C.OnChangeTab__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_StartScreenGuest_C_OnChangeTab__DelegateSignature final
{
public:
	E_StartScreenTabs                             Tab;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_StartScreenGuest_C_OnChangeTab__DelegateSignature) == 0x000001, "Wrong alignment on bp_wi_StartScreenGuest_C_OnChangeTab__DelegateSignature");
static_assert(sizeof(bp_wi_StartScreenGuest_C_OnChangeTab__DelegateSignature) == 0x000001, "Wrong size on bp_wi_StartScreenGuest_C_OnChangeTab__DelegateSignature");
static_assert(offsetof(bp_wi_StartScreenGuest_C_OnChangeTab__DelegateSignature, Tab) == 0x000000, "Member 'bp_wi_StartScreenGuest_C_OnChangeTab__DelegateSignature::Tab' has a wrong offset!");

// Function bp_wi_StartScreenGuest.bp_wi_StartScreenGuest_C.ExecuteUbergraph_bp_wi_StartScreenGuest
// 0x0108 (0x0108 - 0x0000)
struct bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_Project_Version_FCT_Project_Version_FCT; // 0x0008(0x0018)()
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0050(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0060(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0080(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Pause_ReturnValue;                        // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPaused_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AClientEntryPCBP_C*                     K2Node_DynamicCast_AsClient_Entry_PCBP;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest) == 0x000008, "Wrong alignment on bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest");
static_assert(sizeof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest) == 0x000108, "Wrong size on bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, EntryPoint) == 0x000000, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_Get_Project_Version_FCT_Project_Version_FCT) == 0x000008, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_Get_Project_Version_FCT_Project_Version_FCT' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, Temp_struct_Variable) == 0x000020, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, Temp_delegate_Variable) == 0x000040, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, Temp_struct_Variable_1) == 0x000050, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, Temp_delegate_Variable_1) == 0x000060, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, Temp_struct_Variable_2) == 0x000070, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, Temp_delegate_Variable_2) == 0x000080, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_GetOwningPlayer_ReturnValue) == 0x000090, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_OpenSource_ReturnValue) == 0x000098, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_OpenSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x0000A0, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_Play_ReturnValue) == 0x0000A8, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_Pause_ReturnValue) == 0x0000A9, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_Pause_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_PostAkEvent_ReturnValue) == 0x0000AC, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_PostAkEvent_ReturnValue_1) == 0x0000B0, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_PostAkEvent_ReturnValue_2) == 0x0000B4, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_IsPlaying_ReturnValue) == 0x0000B8, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_PostEventAtLocation_ReturnValue) == 0x0000BC, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000C8, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_IsPaused_ReturnValue) == 0x0000D0, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_IsPaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000D8, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000E0, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_IsPlaying_ReturnValue_1) == 0x0000E8, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, CallFunc_GetPlayerController_ReturnValue) == 0x0000F0, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, K2Node_DynamicCast_AsClient_Entry_PCBP) == 0x0000F8, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::K2Node_DynamicCast_AsClient_Entry_PCBP' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'bp_wi_StartScreenGuest_C_ExecuteUbergraph_bp_wi_StartScreenGuest::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function bp_wi_StartScreenGuest.bp_wi_StartScreenGuest_C.ChangeTAB
// 0x0040 (0x0040 - 0x0000)
struct bp_wi_StartScreenGuest_C_ChangeTAB final
{
public:
	E_StartScreenTabs                             Start_Screen_Tab_State;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_StartScreenTabs                             Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_StartScreenGuest_C_ChangeTAB) == 0x000008, "Wrong alignment on bp_wi_StartScreenGuest_C_ChangeTAB");
static_assert(sizeof(bp_wi_StartScreenGuest_C_ChangeTAB) == 0x000040, "Wrong size on bp_wi_StartScreenGuest_C_ChangeTAB");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ChangeTAB, Start_Screen_Tab_State) == 0x000000, "Member 'bp_wi_StartScreenGuest_C_ChangeTAB::Start_Screen_Tab_State' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ChangeTAB, Temp_object_Variable) == 0x000008, "Member 'bp_wi_StartScreenGuest_C_ChangeTAB::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ChangeTAB, Temp_object_Variable_1) == 0x000010, "Member 'bp_wi_StartScreenGuest_C_ChangeTAB::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ChangeTAB, Temp_object_Variable_2) == 0x000018, "Member 'bp_wi_StartScreenGuest_C_ChangeTAB::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ChangeTAB, Temp_object_Variable_3) == 0x000020, "Member 'bp_wi_StartScreenGuest_C_ChangeTAB::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ChangeTAB, Temp_object_Variable_4) == 0x000028, "Member 'bp_wi_StartScreenGuest_C_ChangeTAB::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ChangeTAB, Temp_byte_Variable) == 0x000030, "Member 'bp_wi_StartScreenGuest_C_ChangeTAB::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreenGuest_C_ChangeTAB, K2Node_Select_Default) == 0x000038, "Member 'bp_wi_StartScreenGuest_C_ChangeTAB::K2Node_Select_Default' has a wrong offset!");

}

