#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_FindGame

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AkAudio_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_FindGame.bp_wi_FindGame_C.ExecuteUbergraph_bp_wi_FindGame
// 0x02B0 (0x02B0 - 0x0000)
struct bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0050(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0060(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0080(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InProgress;                     // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x00B8(0x0018)(ConstParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsDsNotice               K2Node_Event_Notification;                         // 0x00F8(0x00F8)(ConstParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserDisplayName_ReturnValue;           // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0254(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0260(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0288(0x0028)()
};
static_assert(alignof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame) == 0x000008, "Wrong alignment on bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame");
static_assert(sizeof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame) == 0x0002B0, "Wrong size on bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, EntryPoint) == 0x000000, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, Temp_struct_Variable) == 0x000020, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, Temp_delegate_Variable) == 0x000040, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, Temp_struct_Variable_1) == 0x000050, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, Temp_delegate_Variable_1) == 0x000060, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, Temp_struct_Variable_2) == 0x000070, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, Temp_delegate_Variable_2) == 0x000080, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, K2Node_Event_IsDesignTime) == 0x0000A0, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, K2Node_CustomEvent_InProgress) == 0x0000A1, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::K2Node_CustomEvent_InProgress' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, K2Node_CustomEvent_Message) == 0x0000A8, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, K2Node_ComponentBoundEvent_Text_1) == 0x0000B8, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D8, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_PostAkEvent_ReturnValue) == 0x0000E4, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x0000E8, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_PostAkEvent_ReturnValue_1) == 0x0000F0, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, K2Node_Event_Notification) == 0x0000F8, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::K2Node_Event_Notification' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_PostAkEvent_ReturnValue_2) == 0x0001F0, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_GetUserDisplayName_ReturnValue) == 0x0001F8, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_GetUserDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_Conv_IntToString_ReturnValue) == 0x000208, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000218, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000228, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000238, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000240, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000250, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_Conv_StringToName_ReturnValue) == 0x000254, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, CallFunc_BooleanOR_ReturnValue) == 0x00025C, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, K2Node_MakeStruct_SlateColor) == 0x000260, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame, K2Node_MakeStruct_SlateColor_1) == 0x000288, "Member 'bp_wi_FindGame_C_ExecuteUbergraph_bp_wi_FindGame::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function bp_wi_FindGame.bp_wi_FindGame_C.BndEvt__EditableText_142_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct bp_wi_FindGame_C_BndEvt__EditableText_142_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(bp_wi_FindGame_C_BndEvt__EditableText_142_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on bp_wi_FindGame_C_BndEvt__EditableText_142_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(bp_wi_FindGame_C_BndEvt__EditableText_142_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on bp_wi_FindGame_C_BndEvt__EditableText_142_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(bp_wi_FindGame_C_BndEvt__EditableText_142_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'bp_wi_FindGame_C_BndEvt__EditableText_142_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function bp_wi_FindGame.bp_wi_FindGame_C.OnDSNotif
// 0x00F8 (0x00F8 - 0x0000)
struct bp_wi_FindGame_C_OnDSNotif final
{
public:
	struct FAccelByteModelsDsNotice               Notification;                                      // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(bp_wi_FindGame_C_OnDSNotif) == 0x000008, "Wrong alignment on bp_wi_FindGame_C_OnDSNotif");
static_assert(sizeof(bp_wi_FindGame_C_OnDSNotif) == 0x0000F8, "Wrong size on bp_wi_FindGame_C_OnDSNotif");
static_assert(offsetof(bp_wi_FindGame_C_OnDSNotif, Notification) == 0x000000, "Member 'bp_wi_FindGame_C_OnDSNotif::Notification' has a wrong offset!");

// Function bp_wi_FindGame.bp_wi_FindGame_C.BndEvt__EditableTextBoxReadWriteMatchCode_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct bp_wi_FindGame_C_BndEvt__EditableTextBoxReadWriteMatchCode_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(bp_wi_FindGame_C_BndEvt__EditableTextBoxReadWriteMatchCode_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on bp_wi_FindGame_C_BndEvt__EditableTextBoxReadWriteMatchCode_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(bp_wi_FindGame_C_BndEvt__EditableTextBoxReadWriteMatchCode_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on bp_wi_FindGame_C_BndEvt__EditableTextBoxReadWriteMatchCode_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(bp_wi_FindGame_C_BndEvt__EditableTextBoxReadWriteMatchCode_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'bp_wi_FindGame_C_BndEvt__EditableTextBoxReadWriteMatchCode_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function bp_wi_FindGame.bp_wi_FindGame_C.Set Matchmaking State
// 0x0018 (0x0018 - 0x0000)
struct bp_wi_FindGame_C_Set_Matchmaking_State final
{
public:
	bool                                          InProgress;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_FindGame_C_Set_Matchmaking_State) == 0x000008, "Wrong alignment on bp_wi_FindGame_C_Set_Matchmaking_State");
static_assert(sizeof(bp_wi_FindGame_C_Set_Matchmaking_State) == 0x000018, "Wrong size on bp_wi_FindGame_C_Set_Matchmaking_State");
static_assert(offsetof(bp_wi_FindGame_C_Set_Matchmaking_State, InProgress) == 0x000000, "Member 'bp_wi_FindGame_C_Set_Matchmaking_State::InProgress' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_Set_Matchmaking_State, Message) == 0x000008, "Member 'bp_wi_FindGame_C_Set_Matchmaking_State::Message' has a wrong offset!");

// Function bp_wi_FindGame.bp_wi_FindGame_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_FindGame_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_FindGame_C_PreConstruct) == 0x000001, "Wrong alignment on bp_wi_FindGame_C_PreConstruct");
static_assert(sizeof(bp_wi_FindGame_C_PreConstruct) == 0x000001, "Wrong size on bp_wi_FindGame_C_PreConstruct");
static_assert(offsetof(bp_wi_FindGame_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'bp_wi_FindGame_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function bp_wi_FindGame.bp_wi_FindGame_C.Set Matchmaking Message
// 0x0028 (0x0028 - 0x0000)
struct bp_wi_FindGame_C_Set_Matchmaking_Message final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(bp_wi_FindGame_C_Set_Matchmaking_Message) == 0x000008, "Wrong alignment on bp_wi_FindGame_C_Set_Matchmaking_Message");
static_assert(sizeof(bp_wi_FindGame_C_Set_Matchmaking_Message) == 0x000028, "Wrong size on bp_wi_FindGame_C_Set_Matchmaking_Message");
static_assert(offsetof(bp_wi_FindGame_C_Set_Matchmaking_Message, Message) == 0x000000, "Member 'bp_wi_FindGame_C_Set_Matchmaking_Message::Message' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_Set_Matchmaking_Message, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'bp_wi_FindGame_C_Set_Matchmaking_Message::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function bp_wi_FindGame.bp_wi_FindGame_C.UpdateIsMatchmaking
// 0x0088 (0x0088 - 0x0000)
struct bp_wi_FindGame_C_UpdateIsMatchmaking final
{
public:
	bool                                          InProgress;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StatusMessage;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0038(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0060(0x0018)()
	class UAkAudioEvent*                          K2Node_Select_Default_2;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_FindGame_C_UpdateIsMatchmaking) == 0x000008, "Wrong alignment on bp_wi_FindGame_C_UpdateIsMatchmaking");
static_assert(sizeof(bp_wi_FindGame_C_UpdateIsMatchmaking) == 0x000088, "Wrong size on bp_wi_FindGame_C_UpdateIsMatchmaking");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, InProgress) == 0x000000, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::InProgress' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, StatusMessage) == 0x000008, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::StatusMessage' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, Temp_byte_Variable) == 0x000018, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, Temp_byte_Variable_1) == 0x000019, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, Temp_bool_Variable) == 0x00001A, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, Temp_text_Variable) == 0x000020, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, Temp_struct_Variable) == 0x000038, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, Temp_delegate_Variable) == 0x000048, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, Temp_bool_Variable_1) == 0x000058, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, Temp_bool_Variable_2) == 0x000059, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, K2Node_Select_Default) == 0x00005A, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, CallFunc_Not_PreBool_ReturnValue) == 0x00005B, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, K2Node_Select_Default_1) == 0x000060, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, K2Node_Select_Default_2) == 0x000078, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000080, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_UpdateIsMatchmaking, CallFunc_PostAkEvent_ReturnValue) == 0x000084, "Member 'bp_wi_FindGame_C_UpdateIsMatchmaking::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function bp_wi_FindGame.bp_wi_FindGame_C.GetABGameMode1
// 0x0030 (0x0030 - 0x0000)
struct bp_wi_FindGame_C_GetABGameMode1 final
{
public:
	class FString                                 GameMode;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class AClientEntryPC*                         ClientPC;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AClientEntryPC*                         K2Node_DynamicCast_AsClient_Entry_PC;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_FindGame_C_GetABGameMode1) == 0x000008, "Wrong alignment on bp_wi_FindGame_C_GetABGameMode1");
static_assert(sizeof(bp_wi_FindGame_C_GetABGameMode1) == 0x000030, "Wrong size on bp_wi_FindGame_C_GetABGameMode1");
static_assert(offsetof(bp_wi_FindGame_C_GetABGameMode1, GameMode) == 0x000000, "Member 'bp_wi_FindGame_C_GetABGameMode1::GameMode' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_GetABGameMode1, ClientPC) == 0x000010, "Member 'bp_wi_FindGame_C_GetABGameMode1::ClientPC' has a wrong offset!");
static_assert(offsetof(bp_wi_FindGame_C_GetABGameMode1, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'bp_wi_FindGame_C_GetABGameMode1::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
