#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_StartScreen

#include "Basic.hpp"

#include "AccelByteUe4Sdk_structs.hpp"
#include "AkAudio_structs.hpp"
#include "E_StartScreenTabs_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_StartScreen.bp_wi_StartScreen_C.OnChangeTab__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_StartScreen_C_OnChangeTab__DelegateSignature final
{
public:
	E_StartScreenTabs                             Tab;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_StartScreen_C_OnChangeTab__DelegateSignature) == 0x000001, "Wrong alignment on bp_wi_StartScreen_C_OnChangeTab__DelegateSignature");
static_assert(sizeof(bp_wi_StartScreen_C_OnChangeTab__DelegateSignature) == 0x000001, "Wrong size on bp_wi_StartScreen_C_OnChangeTab__DelegateSignature");
static_assert(offsetof(bp_wi_StartScreen_C_OnChangeTab__DelegateSignature, Tab) == 0x000000, "Member 'bp_wi_StartScreen_C_OnChangeTab__DelegateSignature::Tab' has a wrong offset!");

// Function bp_wi_StartScreen.bp_wi_StartScreen_C.ExecuteUbergraph_bp_wi_StartScreen
// 0x1128 (0x1128 - 0x0000)
struct bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAccelByteModelsPartyJoinResponse      K2Node_CustomEvent_PartyInfo_2;                    // 0x0010(0x0070)()
	struct FAccelByteModelsPartyJoinResponse      K2Node_CustomEvent_PartyInfo_1;                    // 0x0080(0x0070)()
	TDelegate<void(const struct FAccelByteModelsPartyJoinResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsPartyJoinResponse      Temp_struct_Variable;                              // 0x0100(0x0070)()
	class UFCTJoinPartyCallbackProxy*             CallFunc_JoinPendingConsoleSession_ReturnValue;    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController_13;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_12;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      Temp_object_Variable;                              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULoadingSpinnerWI_C*                    CallFunc_Create_ReturnValue;                       // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_11;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      Temp_object_Variable_1;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_10;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_9;             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      Temp_object_Variable_2;                            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_8;             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_7;             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      Temp_object_Variable_3;                            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0250(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0260(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0270(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0280(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0290(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x02A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_6;             // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_5;             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      Temp_object_Variable_4;                            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULoadingSpinnerWI_C*                    CallFunc_Create_ReturnValue_1;                     // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULoadingSpinnerWI_C*                    CallFunc_Create_ReturnValue_2;                     // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0308(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0318(0x0010)(ZeroConstructor, NoDestructor)
	class UFCTPartyConnectionCallbackProxy*       CallFunc_CreateParty_ReturnValue;                  // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_4;                            // 0x0330(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0344(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0354(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0364(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue;                   // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x0380(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_5;                         // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccountUserData                       K2Node_CustomEvent_Result_2;                       // 0x03B0(0x0120)(ConstParm)
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_4;                         // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FAccountUserData& Result, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x04E4(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAccountUserData                       Temp_struct_Variable_5;                            // 0x0508(0x0120)()
	class UUserDataCallbackProxy*                 CallFunc_GetUserData_ReturnValue;                  // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Result, int32 Code)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x0634(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Result_1;                       // 0x0648(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_3;                         // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65C[0x4];                                      // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVersusEvilDocumentsPayload            K2Node_CustomEvent_Payload;                        // 0x0660(0x0010)(ConstParm)
	class FString                                 K2Node_CustomEvent_Result;                         // 0x0670(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_2;                         // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVersusEvilDocumentsPayload& Payload, const class FString& Result, int32 Code)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x0684(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0698(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVersusEvilDocumentsPayload            Temp_struct_Variable_6;                            // 0x06A8(0x0010)()
	class UFCTQueryLegalEligibilitiesCallbackProxy* CallFunc_QueryVersusEvilLegalEligibilities_ReturnValue; // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1[0x3];                                      // 0x06C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_VersusEvilPolicyAcceptanceWidget_C* CallFunc_Create_ReturnValue_3;                     // 0x06C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x06D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x3];                                      // 0x06E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x06E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x06F4(0x0010)(NoDestructor)
	uint8                                         Pad_704[0x4];                                      // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController_4;             // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_18;           // 0x0710(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      Temp_object_Variable_5;                            // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x0728(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsInfoPartyResponse      K2Node_CustomEvent_PartyInfo;                      // 0x0738(0x0070)()
	TDelegate<void(const struct FAccelByteModelsInfoPartyResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x07A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsInfoPartyResponse      Temp_struct_Variable_7;                            // 0x07B8(0x0070)()
	class UFCTPartyInfoCallbackProxy*             CallFunc_GetPartyInfo_ReturnValue;                 // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_831[0x3];                                      // 0x0831(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_21;           // 0x0834(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_22;           // 0x0844(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_854[0x4];                                      // 0x0854(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue_1;                 // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_23;           // 0x0860(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_871[0x7];                                      // 0x0871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController_3;             // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_2;             // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_24;           // 0x0888(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      Temp_object_Variable_6;                            // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggedIn_ReturnValue;                   // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A9[0x7];                                      // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController_1;             // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_25;           // 0x08B8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_PlayerController;               // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_26;           // 0x08D0(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      Temp_object_Variable_7;                            // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_27;           // 0x08E8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FC[0x4];                                      // 0x08FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0900(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code;                           // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_914[0x4];                                      // 0x0914(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0918(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_28;           // 0x0928(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_2;                            // 0x0938(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94C[0x4];                                      // 0x094C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTSyncPlatformPurchases*              CallFunc_SyncPlatformPurchases_ReturnValue;        // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_8;                            // 0x0958(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_969[0x3];                                      // 0x0969(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x096C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_97C[0x4];                                      // 0x097C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_9;                            // 0x0980(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x0990(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_29;           // 0x09A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_30;           // 0x09B0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_31;           // 0x09C0(0x0010)(ZeroConstructor, NoDestructor)
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue_2;                 // 0x09D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x09D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x09E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x09E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E2[0x2];                                      // 0x09E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsPartyJoinResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_32;           // 0x09E4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue;             // 0x09F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F5[0x3];                                      // 0x09F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x09F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAccelByteModelsPartyJoinResponse      K2Node_CustomEvent_PartyInfo_8;                    // 0x0A00(0x0070)()
	class UBlueprintConsoleQueryBlockListCallbackProxy* CallFunc_QueryConsoleBlockList_ReturnValue;        // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAccelByteModelsPartyJoinResponse      K2Node_CustomEvent_PartyInfo_3;                    // 0x0A78(0x0070)()
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0AE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE9[0x3];                                      // 0x0AE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsPartyJoinResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_33;           // 0x0AEC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_AFC[0x4];                                      // 0x0AFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsPartyJoinResponse      K2Node_CustomEvent_PartyInfo_4;                    // 0x0B00(0x0070)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0B70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AClientEntryPCBP_C*                     K2Node_DynamicCast_AsClient_Entry_PCBP;            // 0x0B78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0B80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B81[0x3];                                      // 0x0B81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsPartyJoinResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_34;           // 0x0B84(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FAccelByteModelsPartyJoinResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_35;           // 0x0B94(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_BA4[0x4];                                      // 0x0BA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0BA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0BB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingConsoleSessionInvite_ReturnValue; // 0x0BB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB9[0x7];                                      // 0x0BB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlueprintConsolePrivilegeCheckerCallbackProxy* CallFunc_CheckConsoleCommunicationPrivilege_ReturnValue; // 0x0BC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0BC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC9[0x7];                                      // 0x0BC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue_3;                 // 0x0BD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0BD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD9[0x7];                                      // 0x0BD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_36;           // 0x0BE8(0x0010)(ZeroConstructor, NoDestructor)
	class AClientEntryPCBP_C*                     K2Node_DynamicCast_AsClient_Entry_PCBP_1;          // 0x0BF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0C00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C01[0x7];                                      // 0x0C01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0C08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingConsoleSessionInvite_ReturnValue_1; // 0x0C10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C11[0x3];                                      // 0x0C11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_37;           // 0x0C14(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_C24[0x4];                                      // 0x0C24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue_4;                 // 0x0C28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0C30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C31[0x7];                                      // 0x0C31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0C38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlueprintConsoleQueryBlockListCallbackProxy* CallFunc_QueryConsoleBlockList_ReturnValue_1;      // 0x0C40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0C48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C49[0x7];                                      // 0x0C49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0C50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x0C58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlueprintConsolePrivilegeCheckerCallbackProxy* CallFunc_CheckConsoleCommunicationPrivilege_ReturnValue_1; // 0x0C60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_5;            // 0x0C68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlueprintConsolePrivilegeCheckerCallbackProxy* CallFunc_CheckConsoleOnlinePrivilege_ReturnValue;  // 0x0C70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0C78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0C79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x0C7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Rewind_ReturnValue;                       // 0x0C7B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0C7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Pause_ReturnValue;                        // 0x0C7D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C7E[0x2];                                      // 0x0C7E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTJoinPartyCallbackProxy*             CallFunc_JoinPendingConsoleSession_ReturnValue_1;  // 0x0C80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAccelByteModelsPartyJoinResponse      Temp_struct_Variable_10;                           // 0x0C88(0x0070)()
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0CF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0CFA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CFB[0x1];                                      // 0x0CFB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0CFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0D00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0D04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_6;            // 0x0D08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0D10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D14[0x4];                                      // 0x0D14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlueprintConsolePrivilegeCheckerCallbackProxy* CallFunc_CheckConsoleOnlinePrivilege_ReturnValue_1; // 0x0D18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0D20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D21[0x7];                                      // 0x0D21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0D28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0D30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPaused_ReturnValue;                     // 0x0D38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D39[0x7];                                      // 0x0D39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0D40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0D48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0D50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue_1;              // 0x0D51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D52[0x2];                                      // 0x0D52(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_38;           // 0x0D54(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue_1;           // 0x0D64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue_1;             // 0x0D65(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D66[0x2];                                      // 0x0D66(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_Project_Version_FCT_Project_Version_FCT; // 0x0D68(0x0018)()
	struct FFCTAchievementList                    K2Node_ComponentBoundEvent_AchievementList;        // 0x0D80(0x0028)()
	bool                                          CallFunc_IsPS4Platform_ReturnValue_1;              // 0x0DA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA9[0x7];                                      // 0x0DA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsPartyJoinResponse      K2Node_CustomEvent_PartyInfo_5;                    // 0x0DB0(0x0070)()
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0E20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0E21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0E22(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E23[0x5];                                      // 0x0E23(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccountUserData                       K2Node_ComponentBoundEvent_UserData;               // 0x0E28(0x0120)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_39;           // 0x0F48(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0F58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5C[0x4];                                      // 0x0F5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_7;            // 0x0F60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlueprintConsoleQueryBlockListCallbackProxy* CallFunc_QueryConsoleBlockList_ReturnValue_2;      // 0x0F68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x0F70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F71[0x7];                                      // 0x0F71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      Temp_object_Variable_8;                            // 0x0F78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FAccelByteModelsPartyJoinResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_40;           // 0x0F80(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsPartyJoinResponse      K2Node_CustomEvent_PartyInfo_6;                    // 0x0F90(0x0070)()
	class APlayerController*                      K2Node_CustomEvent_PlayerController_14;            // 0x1000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue_2;           // 0x1008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1009[0x7];                                     // 0x1009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_8;            // 0x1010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FAccelByteModelsPartyJoinResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_41;           // 0x1018(0x0010)(ZeroConstructor, NoDestructor)
	class UBlueprintConsolePrivilegeCheckerCallbackProxy* CallFunc_CheckConsoleCommunicationPrivilege_ReturnValue_2; // 0x1028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x1030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1031[0x3];                                     // 0x1031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_42;           // 0x1034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1044[0x4];                                     // 0x1044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChildMenuToMenuController_ReturnValue; // 0x1048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAccelByteModelsPartyJoinResponse      K2Node_CustomEvent_PartyInfo_7;                    // 0x1050(0x0070)()
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x10C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x10C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C9[0x7];                                     // 0x10C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_9;            // 0x10D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue_2;             // 0x10D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D9[0x7];                                     // 0x10D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlueprintConsolePrivilegeCheckerCallbackProxy* CallFunc_CheckConsoleOnlinePrivilege_ReturnValue_2; // 0x10E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x10E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x10E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x10EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue_2;              // 0x10EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10EC[0x4];                                     // 0x10EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x10F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS4Platform_ReturnValue_2;              // 0x10F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x10F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x10FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x10FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_43;           // 0x10FC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x110C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x1110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Rewind_ReturnValue_1;                     // 0x1114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1115[0x3];                                     // 0x1115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsPartyJoinResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_44;           // 0x1118(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen) == 0x000008, "Wrong alignment on bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen");
static_assert(sizeof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen) == 0x001128, "Wrong size on bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, EntryPoint) == 0x000000, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PartyInfo_2) == 0x000010, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PartyInfo_2' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PartyInfo_1) == 0x000080, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PartyInfo_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_struct_Variable) == 0x000100, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, CallFunc_JoinPendingConsoleSession_ReturnValue) == 0x000170, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::CallFunc_JoinPendingConsoleSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PlayerController_13) == 0x000180, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PlayerController_13' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000188, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PlayerController_12) == 0x000198, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PlayerController_12' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001A0, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_object_Variable) == 0x0001B0, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, CallFunc_Create_ReturnValue) == 0x0001B8, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PlayerController_11) == 0x0001C0, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PlayerController_11' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001C8, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_object_Variable_1) == 0x0001D8, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001E0, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PlayerController_10) == 0x0001F0, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PlayerController_10' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PlayerController_9) == 0x0001F8, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PlayerController_9' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CreateDelegate_OutputDelegate_5) == 0x000200, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_object_Variable_2) == 0x000210, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CreateDelegate_OutputDelegate_6) == 0x000218, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PlayerController_8) == 0x000228, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PlayerController_8' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PlayerController_7) == 0x000230, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PlayerController_7' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CreateDelegate_OutputDelegate_7) == 0x000238, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_object_Variable_3) == 0x000248, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_struct_Variable_1) == 0x000250, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_delegate_Variable) == 0x000260, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_struct_Variable_2) == 0x000270, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_delegate_Variable_1) == 0x000280, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_struct_Variable_3) == 0x000290, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_delegate_Variable_2) == 0x0002A0, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PlayerController_6) == 0x0002B0, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PlayerController_6' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CreateDelegate_OutputDelegate_8) == 0x0002B8, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CustomEvent_PlayerController_5) == 0x0002C8, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CustomEvent_PlayerController_5' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002D0, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen, Temp_object_Variable_4) == 0x0002E0, "Member 'bp_wi_StartScreen_C_ExecuteUbergraph_bp_wi_StartScreen::Temp_object_Variable_4' has a wrong offset!");
