#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_GlobalOxygenWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_GlobalOxygenWarning.bp_wi_GlobalOxygenWarning_C
// 0x0080 (0x02E0 - 0x0260)
class Ubp_wi_GlobalOxygenWarning_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       GoCritical;                                        // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pulsing;                                           // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomLine;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Container;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Exclamation;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Exclamation_1;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Frame;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Frame_1;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URoundedBGBoxWI_C*                      RoundedBGBoxWI;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1467;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_31;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_96;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopLine;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           NewVar_0;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bp_wi_GlobalOxygenWarning(int32 EntryPoint);
	void PulseAnimation();
	void Toggle_Critical(bool TURR);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_GlobalOxygenWarning_C">();
	}
	static class Ubp_wi_GlobalOxygenWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_GlobalOxygenWarning_C>();
	}
};
static_assert(alignof(Ubp_wi_GlobalOxygenWarning_C) == 0x000008, "Wrong alignment on Ubp_wi_GlobalOxygenWarning_C");
static_assert(sizeof(Ubp_wi_GlobalOxygenWarning_C) == 0x0002E0, "Wrong size on Ubp_wi_GlobalOxygenWarning_C");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, UberGraphFrame) == 0x000260, "Member 'Ubp_wi_GlobalOxygenWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, GoCritical) == 0x000268, "Member 'Ubp_wi_GlobalOxygenWarning_C::GoCritical' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, Pulsing) == 0x000270, "Member 'Ubp_wi_GlobalOxygenWarning_C::Pulsing' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, BottomLine) == 0x000278, "Member 'Ubp_wi_GlobalOxygenWarning_C::BottomLine' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, Container) == 0x000280, "Member 'Ubp_wi_GlobalOxygenWarning_C::Container' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, Img_Exclamation) == 0x000288, "Member 'Ubp_wi_GlobalOxygenWarning_C::Img_Exclamation' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, Img_Exclamation_1) == 0x000290, "Member 'Ubp_wi_GlobalOxygenWarning_C::Img_Exclamation_1' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, Img_Frame) == 0x000298, "Member 'Ubp_wi_GlobalOxygenWarning_C::Img_Frame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, Img_Frame_1) == 0x0002A0, "Member 'Ubp_wi_GlobalOxygenWarning_C::Img_Frame_1' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, RoundedBGBoxWI) == 0x0002A8, "Member 'Ubp_wi_GlobalOxygenWarning_C::RoundedBGBoxWI' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, SafeZone_1467) == 0x0002B0, "Member 'Ubp_wi_GlobalOxygenWarning_C::SafeZone_1467' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, TextBlock_31) == 0x0002B8, "Member 'Ubp_wi_GlobalOxygenWarning_C::TextBlock_31' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, TextBlock_96) == 0x0002C0, "Member 'Ubp_wi_GlobalOxygenWarning_C::TextBlock_96' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, TopLine) == 0x0002C8, "Member 'Ubp_wi_GlobalOxygenWarning_C::TopLine' has a wrong offset!");
static_assert(offsetof(Ubp_wi_GlobalOxygenWarning_C, NewVar_0) == 0x0002D0, "Member 'Ubp_wi_GlobalOxygenWarning_C::NewVar_0' has a wrong offset!");

}

