#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_OxygenWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_OxygenWarning.bp_wi_OxygenWarning_C
// 0x0018 (0x0278 - 0x0260)
class Ubp_wi_OxygenWarning_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Pulsing;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Container;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bp_wi_OxygenWarning(int32 EntryPoint);
	void PulseAnimation(bool On);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_OxygenWarning_C">();
	}
	static class Ubp_wi_OxygenWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_OxygenWarning_C>();
	}
};
static_assert(alignof(Ubp_wi_OxygenWarning_C) == 0x000008, "Wrong alignment on Ubp_wi_OxygenWarning_C");
static_assert(sizeof(Ubp_wi_OxygenWarning_C) == 0x000278, "Wrong size on Ubp_wi_OxygenWarning_C");
static_assert(offsetof(Ubp_wi_OxygenWarning_C, UberGraphFrame) == 0x000260, "Member 'Ubp_wi_OxygenWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_OxygenWarning_C, Pulsing) == 0x000268, "Member 'Ubp_wi_OxygenWarning_C::Pulsing' has a wrong offset!");
static_assert(offsetof(Ubp_wi_OxygenWarning_C, Container) == 0x000270, "Member 'Ubp_wi_OxygenWarning_C::Container' has a wrong offset!");

}

