#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_DoNotShowWelcomeVoiceOptionsAgain

#include "Basic.hpp"


namespace SDK::Params
{

// Function bp_wi_DoNotShowWelcomeVoiceOptionsAgain.bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C.ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain
// 0x0070 (0x0070 - 0x0000)
struct bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGame_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               K2Node_DynamicCast_AsBp_Special_Options_Save;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_SpecialOptionsSave_C*               CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGame_ReturnValue_1;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               K2Node_DynamicCast_AsBp_Special_Options_Save_1;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitialLoadComplete_ReturnValue;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_CreateSaveGameObject_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain) == 0x000008, "Wrong alignment on bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain");
static_assert(sizeof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain) == 0x000070, "Wrong size on bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, EntryPoint) == 0x000000, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, CallFunc_LoadGame_ReturnValue) == 0x000008, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::CallFunc_LoadGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, K2Node_DynamicCast_AsBp_Special_Options_Save) == 0x000010, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::K2Node_DynamicCast_AsBp_Special_Options_Save' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, K2Node_ComponentBoundEvent_bIsChecked) == 0x00002C, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000030, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, CallFunc_LoadGame_ReturnValue_1) == 0x000038, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::CallFunc_LoadGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, K2Node_DynamicCast_AsBp_Special_Options_Save_1) == 0x000040, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::K2Node_DynamicCast_AsBp_Special_Options_Save_1' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, CallFunc_SaveGame_ReturnValue) == 0x000049, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::CallFunc_SaveGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, CallFunc_InitialLoadComplete_ReturnValue) == 0x00004A, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::CallFunc_InitialLoadComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, CallFunc_GetGameInstance_ReturnValue) == 0x000050, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, CallFunc_CreateSaveGameObject_ReturnValue_1) == 0x000058, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::CallFunc_CreateSaveGameObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, K2Node_DynamicCast_AsSCTGame_Instance) == 0x000060, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::K2Node_DynamicCast_AsSCTGame_Instance' has a wrong offset!");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function bp_wi_DoNotShowWelcomeVoiceOptionsAgain.bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C.BndEvt__CheckBox_DontShowAgain_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_BndEvt__CheckBox_DontShowAgain_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_BndEvt__CheckBox_DontShowAgain_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_BndEvt__CheckBox_DontShowAgain_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_BndEvt__CheckBox_DontShowAgain_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_BndEvt__CheckBox_DontShowAgain_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_BndEvt__CheckBox_DontShowAgain_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C_BndEvt__CheckBox_DontShowAgain_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

}

