#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_ThumbsVoteMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_ThumbsVoteMenu.bp_wi_ThumbsVoteMenu_C
// 0x0088 (0x02E8 - 0x0260)
class Ubp_wi_ThumbsVoteMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 BottomLine1;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bottomline2;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Close;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PassengerLog;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerLine;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PressG;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ResidentStatus;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Topline1;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Topline2;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Votes_HorizontalBox;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PassengerLog_C*                     WI_PassengerLog;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YourImage;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             YourName;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Debugging;                                         // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ColorScheme;                                       // 0x02D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bp_wi_ThumbsVoteMenu(int32 EntryPoint);
	void BndEvt__Button_Close_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void CloseWindow();
	void UpdateVotingOptionEntries(TArray<class APlayerState*>& PlayerArray);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_ThumbsVoteMenu_C">();
	}
	static class Ubp_wi_ThumbsVoteMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_ThumbsVoteMenu_C>();
	}
};
static_assert(alignof(Ubp_wi_ThumbsVoteMenu_C) == 0x000008, "Wrong alignment on Ubp_wi_ThumbsVoteMenu_C");
static_assert(sizeof(Ubp_wi_ThumbsVoteMenu_C) == 0x0002E8, "Wrong size on Ubp_wi_ThumbsVoteMenu_C");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, UberGraphFrame) == 0x000260, "Member 'Ubp_wi_ThumbsVoteMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, BottomLine1) == 0x000268, "Member 'Ubp_wi_ThumbsVoteMenu_C::BottomLine1' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, Bottomline2) == 0x000270, "Member 'Ubp_wi_ThumbsVoteMenu_C::Bottomline2' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, Button_Close) == 0x000278, "Member 'Ubp_wi_ThumbsVoteMenu_C::Button_Close' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, PassengerLog) == 0x000280, "Member 'Ubp_wi_ThumbsVoteMenu_C::PassengerLog' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, PlayerLine) == 0x000288, "Member 'Ubp_wi_ThumbsVoteMenu_C::PlayerLine' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, PressG) == 0x000290, "Member 'Ubp_wi_ThumbsVoteMenu_C::PressG' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, ResidentStatus) == 0x000298, "Member 'Ubp_wi_ThumbsVoteMenu_C::ResidentStatus' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, Topline1) == 0x0002A0, "Member 'Ubp_wi_ThumbsVoteMenu_C::Topline1' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, Topline2) == 0x0002A8, "Member 'Ubp_wi_ThumbsVoteMenu_C::Topline2' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, Votes_HorizontalBox) == 0x0002B0, "Member 'Ubp_wi_ThumbsVoteMenu_C::Votes_HorizontalBox' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, WI_PassengerLog) == 0x0002B8, "Member 'Ubp_wi_ThumbsVoteMenu_C::WI_PassengerLog' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, YourImage) == 0x0002C0, "Member 'Ubp_wi_ThumbsVoteMenu_C::YourImage' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, YourName) == 0x0002C8, "Member 'Ubp_wi_ThumbsVoteMenu_C::YourName' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, Debugging) == 0x0002D0, "Member 'Ubp_wi_ThumbsVoteMenu_C::Debugging' has a wrong offset!");
static_assert(offsetof(Ubp_wi_ThumbsVoteMenu_C, ColorScheme) == 0x0002D4, "Member 'Ubp_wi_ThumbsVoteMenu_C::ColorScheme' has a wrong offset!");

}

