#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_PlayTutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_PlayTutorial.bp_wi_PlayTutorial_C
// 0x0028 (0x0288 - 0x0260)
class Ubp_wi_PlayTutorial_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UFooter_WI_C*                           Footer_WI;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Headline;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnBackClicked;                                     // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnBackClicked__DelegateSignature();
	void ExecuteUbergraph_bp_wi_PlayTutorial(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__Footer_WI_K2Node_ComponentBoundEvent_3_OnBackButtonPressed__DelegateSignature();
	void BndEvt__Footer_WI_K2Node_ComponentBoundEvent_2_OnFooterMainButtonPressed__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_PlayTutorial_C">();
	}
	static class Ubp_wi_PlayTutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_PlayTutorial_C>();
	}
};
static_assert(alignof(Ubp_wi_PlayTutorial_C) == 0x000008, "Wrong alignment on Ubp_wi_PlayTutorial_C");
static_assert(sizeof(Ubp_wi_PlayTutorial_C) == 0x000288, "Wrong size on Ubp_wi_PlayTutorial_C");
static_assert(offsetof(Ubp_wi_PlayTutorial_C, UberGraphFrame) == 0x000260, "Member 'Ubp_wi_PlayTutorial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_PlayTutorial_C, Footer_WI) == 0x000268, "Member 'Ubp_wi_PlayTutorial_C::Footer_WI' has a wrong offset!");
static_assert(offsetof(Ubp_wi_PlayTutorial_C, Text_Headline) == 0x000270, "Member 'Ubp_wi_PlayTutorial_C::Text_Headline' has a wrong offset!");
static_assert(offsetof(Ubp_wi_PlayTutorial_C, OnBackClicked) == 0x000278, "Member 'Ubp_wi_PlayTutorial_C::OnBackClicked' has a wrong offset!");

}

