#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_SymbolUniGrid

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.OnOptionSymbolClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_SymbolUniGrid_C_OnOptionSymbolClicked__DelegateSignature final
{
public:
	bool                                          CorrectSymbolClicked;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_OnOptionSymbolClicked__DelegateSignature) == 0x000001, "Wrong alignment on bp_wi_SymbolUniGrid_C_OnOptionSymbolClicked__DelegateSignature");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_OnOptionSymbolClicked__DelegateSignature) == 0x000001, "Wrong size on bp_wi_SymbolUniGrid_C_OnOptionSymbolClicked__DelegateSignature");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_OnOptionSymbolClicked__DelegateSignature, CorrectSymbolClicked) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_OnOptionSymbolClicked__DelegateSignature::CorrectSymbolClicked' has a wrong offset!");

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.ExecuteUbergraph_bp_wi_SymbolUniGrid
// 0x00B0 (0x00B0 - 0x0000)
struct bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_wi_SymbolEntry_C*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_wi_SymbolEntry_C*                   CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_SolveableObject;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SolutionSeed_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SolutionSeed;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CorrectSymbolClicked;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_wi_SymbolEntry_C*                   CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCorrectSymbol_IsCorrectSymbol;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid) == 0x000008, "Wrong alignment on bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid) == 0x0000B0, "Wrong size on bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, EntryPoint) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, K2Node_Event_IsDesignTime) == 0x000004, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, Temp_struct_Variable) == 0x000008, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, Temp_struct_Variable_1) == 0x000018, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, Temp_int_Array_Index_Variable) == 0x000030, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, Temp_int_Array_Index_Variable_2) == 0x000040, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, Temp_bool_Variable) == 0x000044, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Array_Get_Item) == 0x000048, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, K2Node_CustomEvent_SolveableObject) == 0x000068, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::K2Node_CustomEvent_SolveableObject' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, K2Node_CustomEvent_SolutionSeed_1) == 0x000070, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::K2Node_CustomEvent_SolutionSeed_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, K2Node_CustomEvent_SolutionSeed) == 0x000074, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::K2Node_CustomEvent_SolutionSeed' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, K2Node_CustomEvent_CorrectSymbolClicked) == 0x000078, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::K2Node_CustomEvent_CorrectSymbolClicked' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_IsCorrectSymbol_IsCorrectSymbol) == 0x000088, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_IsCorrectSymbol_IsCorrectSymbol' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, K2Node_Select_Default) == 0x00008C, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Array_Length_ReturnValue_2) == 0x00009C, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A0, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, Temp_int_Loop_Counter_Variable_2) == 0x0000A4, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000A8, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000AC, "Member 'bp_wi_SymbolUniGrid_C_ExecuteUbergraph_bp_wi_SymbolUniGrid::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_SymbolUniGrid_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_PreConstruct) == 0x000001, "Wrong alignment on bp_wi_SymbolUniGrid_C_PreConstruct");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_PreConstruct) == 0x000001, "Wrong size on bp_wi_SymbolUniGrid_C_PreConstruct");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.HandleOptionSymbolClicked
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_SymbolUniGrid_C_HandleOptionSymbolClicked final
{
public:
	bool                                          CorrectSymbolClicked;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_HandleOptionSymbolClicked) == 0x000001, "Wrong alignment on bp_wi_SymbolUniGrid_C_HandleOptionSymbolClicked");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_HandleOptionSymbolClicked) == 0x000001, "Wrong size on bp_wi_SymbolUniGrid_C_HandleOptionSymbolClicked");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_HandleOptionSymbolClicked, CorrectSymbolClicked) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_HandleOptionSymbolClicked::CorrectSymbolClicked' has a wrong offset!");

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.SetCorrectSymbolOption
// 0x0004 (0x0004 - 0x0000)
struct bp_wi_SymbolUniGrid_C_SetCorrectSymbolOption final
{
public:
	int32                                         SolutionSeed;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_SetCorrectSymbolOption) == 0x000004, "Wrong alignment on bp_wi_SymbolUniGrid_C_SetCorrectSymbolOption");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_SetCorrectSymbolOption) == 0x000004, "Wrong size on bp_wi_SymbolUniGrid_C_SetCorrectSymbolOption");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_SetCorrectSymbolOption, SolutionSeed) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_SetCorrectSymbolOption::SolutionSeed' has a wrong offset!");

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.GenerateSymbolOptions
// 0x0010 (0x0010 - 0x0000)
struct bp_wi_SymbolUniGrid_C_GenerateSymbolOptions final
{
public:
	class UObject*                                SolveableObject;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SolutionSeed;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_GenerateSymbolOptions) == 0x000008, "Wrong alignment on bp_wi_SymbolUniGrid_C_GenerateSymbolOptions");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_GenerateSymbolOptions) == 0x000010, "Wrong size on bp_wi_SymbolUniGrid_C_GenerateSymbolOptions");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateSymbolOptions, SolveableObject) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_GenerateSymbolOptions::SolveableObject' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateSymbolOptions, SolutionSeed) == 0x000008, "Member 'bp_wi_SymbolUniGrid_C_GenerateSymbolOptions::SolutionSeed' has a wrong offset!");

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.GenerateUniqueSymbolsInGrid
// 0x0130 (0x0130 - 0x0000)
struct bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid final
{
public:
	TArray<class UTexture2D*>                     UniqueSymbols_0;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Duplicate;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                SolveableObject;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Seed;                                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_RowCount;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 GridFields;                                        // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         L_UniqueSymbolIndex;                               // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_TotalSymbolCount;                                // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                L_SolveableObject;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     L_UniqueSymbols;                                   // 0x0048(0x0010)(Edit, BlueprintVisible)
	int32                                         L_CurrentRow;                                      // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_CurrentColum;                                    // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item_2;                         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_wi_SymbolEntry_C*                   CallFunc_Create_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid) == 0x000008, "Wrong alignment on bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid) == 0x000130, "Wrong size on bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, UniqueSymbols_0) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::UniqueSymbols_0' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Duplicate) == 0x000010, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Duplicate' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, SolveableObject) == 0x000018, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::SolveableObject' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Seed) == 0x000020, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Seed' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, L_RowCount) == 0x000024, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::L_RowCount' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, GridFields) == 0x000028, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::GridFields' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, L_UniqueSymbolIndex) == 0x000038, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::L_UniqueSymbolIndex' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, L_TotalSymbolCount) == 0x00003C, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::L_TotalSymbolCount' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, L_SolveableObject) == 0x000040, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::L_SolveableObject' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, L_UniqueSymbols) == 0x000048, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::L_UniqueSymbols' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, L_CurrentRow) == 0x000058, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::L_CurrentRow' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, L_CurrentColum) == 0x00005C, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::L_CurrentColum' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Temp_bool_Variable) == 0x000064, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Temp_int_Variable) == 0x000068, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Subtract_IntInt_ReturnValue) == 0x00006C, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_MakeRandomStream_ReturnValue) == 0x000070, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Temp_int_Array_Index_Variable) == 0x000088, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Array_Get_Item) == 0x000090, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Temp_int_Variable_1) == 0x000098, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Multiply_IntInt_ReturnValue) == 0x00009C, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A0, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A4, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Array_LastIndex_ReturnValue) == 0x0000A8, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x0000AC, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000B0, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Array_Get_Item_1) == 0x0000B4, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Percent_IntInt_ReturnValue) == 0x0000B8, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Divide_IntInt_ReturnValue) == 0x0000BC, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000C0, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0000C4, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Temp_int_Variable_2) == 0x0000C8, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Temp_int_Variable_3) == 0x0000CC, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Array_LastIndex_ReturnValue_1) == 0x0000D0, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D4, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000D8, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x0000DC, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Temp_int_Variable_4) == 0x0000E0, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, K2Node_Select_Default) == 0x0000E4, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x0000EC, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Divide_IntInt_ReturnValue_1) == 0x0000F0, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, Temp_int_Variable_5) == 0x0000F4, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000F8, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Array_Get_Item_2) == 0x000100, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Array_Add_ReturnValue) == 0x000108, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x00010C, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Add_IntInt_ReturnValue_5) == 0x000110, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Array_AddUnique_ReturnValue) == 0x000114, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_GetOwningPlayer_ReturnValue) == 0x000118, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Create_ReturnValue) == 0x000120, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid, CallFunc_Array_Add_ReturnValue_1) == 0x000128, "Member 'bp_wi_SymbolUniGrid_C_GenerateUniqueSymbolsInGrid::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.AddContentToGrid
// 0x0030 (0x0030 - 0x0000)
struct bp_wi_SymbolUniGrid_C_AddContentToGrid final
{
public:
	class Ubp_wi_SymbolEntry_C*                   bp_wi_SymbolEntry;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InColumn;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InRow;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool CorrectSymbolClicked)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_AddContentToGrid) == 0x000008, "Wrong alignment on bp_wi_SymbolUniGrid_C_AddContentToGrid");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_AddContentToGrid) == 0x000030, "Wrong size on bp_wi_SymbolUniGrid_C_AddContentToGrid");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_AddContentToGrid, bp_wi_SymbolEntry) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_AddContentToGrid::bp_wi_SymbolEntry' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_AddContentToGrid, InColumn) == 0x000008, "Member 'bp_wi_SymbolUniGrid_C_AddContentToGrid::InColumn' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_AddContentToGrid, InRow) == 0x00000C, "Member 'bp_wi_SymbolUniGrid_C_AddContentToGrid::InRow' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_AddContentToGrid, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'bp_wi_SymbolUniGrid_C_AddContentToGrid::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_AddContentToGrid, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'bp_wi_SymbolUniGrid_C_AddContentToGrid::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_AddContentToGrid, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000028, "Member 'bp_wi_SymbolUniGrid_C_AddContentToGrid::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.IsCorrectSymbol
// 0x0020 (0x0020 - 0x0000)
struct bp_wi_SymbolUniGrid_C_IsCorrectSymbol final
{
public:
	class Ubp_wi_SymbolEntry_C*                   TestSymbolEntry;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SolutionSeed;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCorrectSymbol_0;                                 // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetCorrectSymbol_Correct_Symbol;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_IsCorrectSymbol) == 0x000008, "Wrong alignment on bp_wi_SymbolUniGrid_C_IsCorrectSymbol");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_IsCorrectSymbol) == 0x000020, "Wrong size on bp_wi_SymbolUniGrid_C_IsCorrectSymbol");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_IsCorrectSymbol, TestSymbolEntry) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_IsCorrectSymbol::TestSymbolEntry' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_IsCorrectSymbol, SolutionSeed) == 0x000008, "Member 'bp_wi_SymbolUniGrid_C_IsCorrectSymbol::SolutionSeed' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_IsCorrectSymbol, IsCorrectSymbol_0) == 0x00000C, "Member 'bp_wi_SymbolUniGrid_C_IsCorrectSymbol::IsCorrectSymbol_0' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_IsCorrectSymbol, CallFunc_GetCorrectSymbol_Correct_Symbol) == 0x000010, "Member 'bp_wi_SymbolUniGrid_C_IsCorrectSymbol::CallFunc_GetCorrectSymbol_Correct_Symbol' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_IsCorrectSymbol, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'bp_wi_SymbolUniGrid_C_IsCorrectSymbol::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.GetCorrectSymbol
// 0x0028 (0x0028 - 0x0000)
struct bp_wi_SymbolUniGrid_C_GetCorrectSymbol final
{
public:
	int32                                         SolutionSeed;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Correct_Symbol;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerFromStream_ReturnValue;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_GetCorrectSymbol) == 0x000008, "Wrong alignment on bp_wi_SymbolUniGrid_C_GetCorrectSymbol");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_GetCorrectSymbol) == 0x000028, "Wrong size on bp_wi_SymbolUniGrid_C_GetCorrectSymbol");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GetCorrectSymbol, SolutionSeed) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_GetCorrectSymbol::SolutionSeed' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GetCorrectSymbol, Correct_Symbol) == 0x000008, "Member 'bp_wi_SymbolUniGrid_C_GetCorrectSymbol::Correct_Symbol' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GetCorrectSymbol, CallFunc_MakeRandomStream_ReturnValue) == 0x000010, "Member 'bp_wi_SymbolUniGrid_C_GetCorrectSymbol::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GetCorrectSymbol, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'bp_wi_SymbolUniGrid_C_GetCorrectSymbol::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GetCorrectSymbol, CallFunc_RandomIntegerFromStream_ReturnValue) == 0x00001C, "Member 'bp_wi_SymbolUniGrid_C_GetCorrectSymbol::CallFunc_RandomIntegerFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GetCorrectSymbol, CallFunc_Array_Get_Item) == 0x000020, "Member 'bp_wi_SymbolUniGrid_C_GetCorrectSymbol::CallFunc_Array_Get_Item' has a wrong offset!");

// Function bp_wi_SymbolUniGrid.bp_wi_SymbolUniGrid_C.GetRandomSymbol
// 0x0018 (0x0018 - 0x0000)
struct bp_wi_SymbolUniGrid_C_GetRandomSymbol final
{
public:
	class UTexture2D*                             RandomSymbol;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_SymbolUniGrid_C_GetRandomSymbol) == 0x000008, "Wrong alignment on bp_wi_SymbolUniGrid_C_GetRandomSymbol");
static_assert(sizeof(bp_wi_SymbolUniGrid_C_GetRandomSymbol) == 0x000018, "Wrong size on bp_wi_SymbolUniGrid_C_GetRandomSymbol");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GetRandomSymbol, RandomSymbol) == 0x000000, "Member 'bp_wi_SymbolUniGrid_C_GetRandomSymbol::RandomSymbol' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GetRandomSymbol, CallFunc_Array_LastIndex_ReturnValue) == 0x000008, "Member 'bp_wi_SymbolUniGrid_C_GetRandomSymbol::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_wi_SymbolUniGrid_C_GetRandomSymbol, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00000C, "Member 'bp_wi_SymbolUniGrid_C_GetRandomSymbol::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
