#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_GlobalOxygenWarning

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function bp_wi_GlobalOxygenWarning.bp_wi_GlobalOxygenWarning_C.ExecuteUbergraph_bp_wi_GlobalOxygenWarning
// 0x0088 (0x0088 - 0x0000)
struct bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_True;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)(UObjectWrapper)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)(UObjectWrapper)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0058(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning) == 0x000008, "Wrong alignment on bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning");
static_assert(sizeof(bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning) == 0x000088, "Wrong size on bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning");
static_assert(offsetof(bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning, EntryPoint) == 0x000000, "Member 'bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning, Temp_bool_Variable) == 0x000004, "Member 'bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning, K2Node_CustomEvent_True) == 0x000005, "Member 'bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning::K2Node_CustomEvent_True' has a wrong offset!");
static_assert(offsetof(bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning, K2Node_Select_Default) == 0x000058, "Member 'bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'bp_wi_GlobalOxygenWarning_C_ExecuteUbergraph_bp_wi_GlobalOxygenWarning::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function bp_wi_GlobalOxygenWarning.bp_wi_GlobalOxygenWarning_C.Toggle Critical
// 0x0001 (0x0001 - 0x0000)
struct bp_wi_GlobalOxygenWarning_C_Toggle_Critical final
{
public:
	bool                                          TURR;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_wi_GlobalOxygenWarning_C_Toggle_Critical) == 0x000001, "Wrong alignment on bp_wi_GlobalOxygenWarning_C_Toggle_Critical");
static_assert(sizeof(bp_wi_GlobalOxygenWarning_C_Toggle_Critical) == 0x000001, "Wrong size on bp_wi_GlobalOxygenWarning_C_Toggle_Critical");
static_assert(offsetof(bp_wi_GlobalOxygenWarning_C_Toggle_Critical, TURR) == 0x000000, "Member 'bp_wi_GlobalOxygenWarning_C_Toggle_Critical::TURR' has a wrong offset!");

}

