#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_AccelByte_ProtoMinusFriendCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_AccelByte_Proto-FriendCard.bp_wi_AccelByte_Proto-FriendCard_C
// 0x0058 (0x0318 - 0x02C0)
class Ubp_wi_AccelByte_ProtoMinusFriendCard_C final : public UFriendCardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UButton*                                Button_Accept;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_AddFriend;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_CancelRequest;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Decline;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_InviteParty;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_RemoveFriend;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ButtonSwitcher;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OnlineStatusSwitcher;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_DisplayName;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Header;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bp_wi_AccelByte_ProtoMinusFriendCard(int32 EntryPoint);
	void BndEvt__Button_InviteParty_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BndEvt__Button_Accept_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Decline_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_CancelRequest_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_RemoveFriend_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_AddFriend_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnSuccess_1DFA34E146B2B77F2AFDECB341F959EE(const class FString& PlayerId);
	void OnFail_1DFA34E146B2B77F2AFDECB341F959EE(const class FString& PlayerId);
	void OnSuccess_45BCFC1742304A757FB20697B60D9BB2(const class FString& FriendId, const class FString& Message);
	void OnError_45BCFC1742304A757FB20697B60D9BB2(const class FString& Message);
	void OnSuccess_322255044CCBD8E40AD2DBA147711004(const class FString& FriendId, const class FString& Message);
	void OnError_322255044CCBD8E40AD2DBA147711004(const class FString& Message);
	void OnSuccess_1DFD265E48D7D3352C811590D78BBAB4(const class FString& FriendId, const class FString& Message);
	void OnError_1DFD265E48D7D3352C811590D78BBAB4(const class FString& Message);
	void OnSuccess_6C6870594DFCF1D4AD5173BEE981C927(const class FString& FriendId, const class FString& Message);
	void OnError_6C6870594DFCF1D4AD5173BEE981C927(const class FString& Message);
	void OnSuccess_582972C449865D99531660A0E33CA6A8(const class FString& FriendId, const class FString& Message);
	void OnError_582972C449865D99531660A0E33CA6A8(const class FString& Message);
	void Set_Header(EFFCTFriendListType ListType_0);
	void Set_Profile(const class FString& DisplayName_0, const class FString& UserId_0, EFFCTFriendListType ListType_0, uint8 Online_status);
	void WriteLog(const class FString& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_AccelByte_Proto-FriendCard_C">();
	}
	static class Ubp_wi_AccelByte_ProtoMinusFriendCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_AccelByte_ProtoMinusFriendCard_C>();
	}
};
static_assert(alignof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C) == 0x000008, "Wrong alignment on Ubp_wi_AccelByte_ProtoMinusFriendCard_C");
static_assert(sizeof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C) == 0x000318, "Wrong size on Ubp_wi_AccelByte_ProtoMinusFriendCard_C");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, UberGraphFrame) == 0x0002C0, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, Button_Accept) == 0x0002C8, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::Button_Accept' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, Button_AddFriend) == 0x0002D0, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::Button_AddFriend' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, Button_CancelRequest) == 0x0002D8, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::Button_CancelRequest' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, Button_Decline) == 0x0002E0, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::Button_Decline' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, Button_InviteParty) == 0x0002E8, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::Button_InviteParty' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, Button_RemoveFriend) == 0x0002F0, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::Button_RemoveFriend' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, ButtonSwitcher) == 0x0002F8, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::ButtonSwitcher' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, OnlineStatusSwitcher) == 0x000300, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::OnlineStatusSwitcher' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, Txt_DisplayName) == 0x000308, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::Txt_DisplayName' has a wrong offset!");
static_assert(offsetof(Ubp_wi_AccelByte_ProtoMinusFriendCard_C, Txt_Header) == 0x000310, "Member 'Ubp_wi_AccelByte_ProtoMinusFriendCard_C::Txt_Header' has a wrong offset!");

}

