#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_SymbolEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_SymbolEntry.bp_wi_SymbolEntry_C
// 0x0088 (0x02E8 - 0x0260)
class Ubp_wi_SymbolEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       ButtonClicked;                                     // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGamepadCompatibleButton_C*             ButtonSymbol;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             SymbolTexture;                                     // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSymbolClicked;                                   // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Debugging;                                         // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                SolveableObject;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsCorrectSymbol;                                   // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Success;                                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Fail;                                              // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            PureDisplaySymbolTint;                             // 0x02B8(0x0028)(Edit, BlueprintVisible)
	bool                                          IsPureDisplaySymbol;                               // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void OnSymbolClicked__DelegateSignature(bool CorrectSymbolClicked_0);
	void ExecuteUbergraph_bp_wi_SymbolEntry(int32 EntryPoint);
	void BndEvt__ButtonSymbol_K2Node_ComponentBoundEvent_3_OnHovered__DelegateSignature();
	void BndEvt__ButtonSymbol_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void IncorrectSymbolClicked();
	void CorrectSymbolClicked();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_SymbolEntry_C">();
	}
	static class Ubp_wi_SymbolEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_SymbolEntry_C>();
	}
};
static_assert(alignof(Ubp_wi_SymbolEntry_C) == 0x000008, "Wrong alignment on Ubp_wi_SymbolEntry_C");
static_assert(sizeof(Ubp_wi_SymbolEntry_C) == 0x0002E8, "Wrong size on Ubp_wi_SymbolEntry_C");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, UberGraphFrame) == 0x000260, "Member 'Ubp_wi_SymbolEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, ButtonClicked) == 0x000268, "Member 'Ubp_wi_SymbolEntry_C::ButtonClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, ButtonSymbol) == 0x000270, "Member 'Ubp_wi_SymbolEntry_C::ButtonSymbol' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, SymbolTexture) == 0x000278, "Member 'Ubp_wi_SymbolEntry_C::SymbolTexture' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, OnSymbolClicked) == 0x000280, "Member 'Ubp_wi_SymbolEntry_C::OnSymbolClicked' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, Debugging) == 0x000290, "Member 'Ubp_wi_SymbolEntry_C::Debugging' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, SolveableObject) == 0x000298, "Member 'Ubp_wi_SymbolEntry_C::SolveableObject' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, IsCorrectSymbol) == 0x0002A0, "Member 'Ubp_wi_SymbolEntry_C::IsCorrectSymbol' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, Success) == 0x0002A8, "Member 'Ubp_wi_SymbolEntry_C::Success' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, Fail) == 0x0002B0, "Member 'Ubp_wi_SymbolEntry_C::Fail' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, PureDisplaySymbolTint) == 0x0002B8, "Member 'Ubp_wi_SymbolEntry_C::PureDisplaySymbolTint' has a wrong offset!");
static_assert(offsetof(Ubp_wi_SymbolEntry_C, IsPureDisplaySymbol) == 0x0002E0, "Member 'Ubp_wi_SymbolEntry_C::IsPureDisplaySymbol' has a wrong offset!");

}

