#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wi_DoNotShowWelcomeVoiceOptionsAgain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass bp_wi_DoNotShowWelcomeVoiceOptionsAgain.bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C
// 0x0020 (0x0280 - 0x0260)
class Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCheckBox*                              CheckBox_DontShowAgain;                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_DoNotShowAgain;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               SpecialOptionsSave;                                // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bp_wi_DoNotShowWelcomeVoiceOptionsAgain(int32 EntryPoint);
	void OnInitialLoadComplete();
	void Construct();
	void BndEvt__CheckBox_DontShowAgain_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wi_DoNotShowWelcomeVoiceOptionsAgain_C">();
	}
	static class Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C>();
	}
};
static_assert(alignof(Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C) == 0x000008, "Wrong alignment on Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C");
static_assert(sizeof(Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C) == 0x000280, "Wrong size on Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C");
static_assert(offsetof(Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C, UberGraphFrame) == 0x000260, "Member 'Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C, CheckBox_DontShowAgain) == 0x000268, "Member 'Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C::CheckBox_DontShowAgain' has a wrong offset!");
static_assert(offsetof(Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C, Text_DoNotShowAgain) == 0x000270, "Member 'Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C::Text_DoNotShowAgain' has a wrong offset!");
static_assert(offsetof(Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C, SpecialOptionsSave) == 0x000278, "Member 'Ubp_wi_DoNotShowWelcomeVoiceOptionsAgain_C::SpecialOptionsSave' has a wrong offset!");

}

