#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_AAS_Follower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_AAS_Follower.BPC_AAS_Follower_C
// 0x0038 (0x00E8 - 0x00B0)
class UBPC_AAS_Follower_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             OnDidUpdate;                                       // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         UpdateTime;                                        // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UpdateDistance;                                    // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateTimerHandle;                                 // 0x00D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastLocation;                                      // 0x00D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnDidUpdate__DelegateSignature(class UBPC_AAS_Follower_C* Follower);
	void ExecuteUbergraph_BPC_AAS_Follower(int32 EntryPoint);
	void Update_Timer_Triggered();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void GetLocation(struct FVector* Location);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_AAS_Follower_C">();
	}
	static class UBPC_AAS_Follower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_AAS_Follower_C>();
	}
};
static_assert(alignof(UBPC_AAS_Follower_C) == 0x000008, "Wrong alignment on UBPC_AAS_Follower_C");
static_assert(sizeof(UBPC_AAS_Follower_C) == 0x0000E8, "Wrong size on UBPC_AAS_Follower_C");
static_assert(offsetof(UBPC_AAS_Follower_C, UberGraphFrame) == 0x0000B0, "Member 'UBPC_AAS_Follower_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_AAS_Follower_C, OnDidUpdate) == 0x0000B8, "Member 'UBPC_AAS_Follower_C::OnDidUpdate' has a wrong offset!");
static_assert(offsetof(UBPC_AAS_Follower_C, UpdateTime) == 0x0000C8, "Member 'UBPC_AAS_Follower_C::UpdateTime' has a wrong offset!");
static_assert(offsetof(UBPC_AAS_Follower_C, UpdateDistance) == 0x0000CC, "Member 'UBPC_AAS_Follower_C::UpdateDistance' has a wrong offset!");
static_assert(offsetof(UBPC_AAS_Follower_C, UpdateTimerHandle) == 0x0000D0, "Member 'UBPC_AAS_Follower_C::UpdateTimerHandle' has a wrong offset!");
static_assert(offsetof(UBPC_AAS_Follower_C, LastLocation) == 0x0000D8, "Member 'UBPC_AAS_Follower_C::LastLocation' has a wrong offset!");

}

