#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button_DoorOpener

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SCT_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function Button_DoorOpener.Button_DoorOpener_C.OnButtonPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Button_DoorOpener_C_OnButtonPressed__DelegateSignature final
{
public:
	class ACharacterSCTBP_C*                      PressingCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_DoorOpener_C_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong alignment on Button_DoorOpener_C_OnButtonPressed__DelegateSignature");
static_assert(sizeof(Button_DoorOpener_C_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong size on Button_DoorOpener_C_OnButtonPressed__DelegateSignature");
static_assert(offsetof(Button_DoorOpener_C_OnButtonPressed__DelegateSignature, PressingCharacter) == 0x000000, "Member 'Button_DoorOpener_C_OnButtonPressed__DelegateSignature::PressingCharacter' has a wrong offset!");

// Function Button_DoorOpener.Button_DoorOpener_C.OnButtonReleased__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Button_DoorOpener_C_OnButtonReleased__DelegateSignature final
{
public:
	class ACharacterSCTBP_C*                      ReleasingCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_DoorOpener_C_OnButtonReleased__DelegateSignature) == 0x000008, "Wrong alignment on Button_DoorOpener_C_OnButtonReleased__DelegateSignature");
static_assert(sizeof(Button_DoorOpener_C_OnButtonReleased__DelegateSignature) == 0x000008, "Wrong size on Button_DoorOpener_C_OnButtonReleased__DelegateSignature");
static_assert(offsetof(Button_DoorOpener_C_OnButtonReleased__DelegateSignature, ReleasingCharacter) == 0x000000, "Member 'Button_DoorOpener_C_OnButtonReleased__DelegateSignature::ReleasingCharacter' has a wrong offset!");

// Function Button_DoorOpener.Button_DoorOpener_C.ExecuteUbergraph_Button_DoorOpener
// 0x0070 (0x0070 - 0x0000)
struct Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload;                // 0x0038(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener) == 0x000008, "Wrong alignment on Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener");
static_assert(sizeof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener) == 0x000070, "Wrong size on Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, EntryPoint) == 0x000000, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::EntryPoint' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, Temp_struct_Variable) == 0x000008, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, Temp_delegate_Variable) == 0x00001C, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, CallFunc_Conv_IntToByte_ReturnValue) == 0x00002C, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, K2Node_MakeStruct_Color) == 0x000030, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, Temp_bool_Has_Been_Initd_Variable) == 0x000034, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, CallFunc_HasAuthority_ReturnValue) == 0x000035, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, Temp_bool_IsClosed_Variable) == 0x000036, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, K2Node_ComponentBoundEvent_payload) == 0x000038, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::K2Node_ComponentBoundEvent_payload' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener, CallFunc_PostAkEvent_ReturnValue) == 0x00006C, "Member 'Button_DoorOpener_C_ExecuteUbergraph_Button_DoorOpener::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function Button_DoorOpener.Button_DoorOpener_C.BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct Button_DoorOpener_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Button_DoorOpener_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Button_DoorOpener_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature");
static_assert(sizeof(Button_DoorOpener_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on Button_DoorOpener_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature");
static_assert(offsetof(Button_DoorOpener_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'Button_DoorOpener_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function Button_DoorOpener.Button_DoorOpener_C.SetCooldownText
// 0x0020 (0x0020 - 0x0000)
struct Button_DoorOpener_C_SetCooldownText final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Button_DoorOpener_C_SetCooldownText) == 0x000008, "Wrong alignment on Button_DoorOpener_C_SetCooldownText");
static_assert(sizeof(Button_DoorOpener_C_SetCooldownText) == 0x000020, "Wrong size on Button_DoorOpener_C_SetCooldownText");
static_assert(offsetof(Button_DoorOpener_C_SetCooldownText, Value) == 0x000000, "Member 'Button_DoorOpener_C_SetCooldownText::Value' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_SetCooldownText, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'Button_DoorOpener_C_SetCooldownText::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function Button_DoorOpener.Button_DoorOpener_C.OpenDoors
// 0x0028 (0x0028 - 0x0000)
struct Button_DoorOpener_C_OpenDoors final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubpc_ac_Opener_C*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_DoorOpener_C_OpenDoors) == 0x000008, "Wrong alignment on Button_DoorOpener_C_OpenDoors");
static_assert(sizeof(Button_DoorOpener_C_OpenDoors) == 0x000028, "Wrong size on Button_DoorOpener_C_OpenDoors");
static_assert(offsetof(Button_DoorOpener_C_OpenDoors, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Button_DoorOpener_C_OpenDoors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_OpenDoors, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Button_DoorOpener_C_OpenDoors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_OpenDoors, CallFunc_Array_Get_Item) == 0x000008, "Member 'Button_DoorOpener_C_OpenDoors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_OpenDoors, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'Button_DoorOpener_C_OpenDoors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_OpenDoors, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'Button_DoorOpener_C_OpenDoors::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_OpenDoors, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'Button_DoorOpener_C_OpenDoors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_OpenDoors, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'Button_DoorOpener_C_OpenDoors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_OpenDoors, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'Button_DoorOpener_C_OpenDoors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Button_DoorOpener.Button_DoorOpener_C.ShowAsCompleted
// 0x0001 (0x0001 - 0x0000)
struct Button_DoorOpener_C_ShowAsCompleted final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Button_DoorOpener_C_ShowAsCompleted) == 0x000001, "Wrong alignment on Button_DoorOpener_C_ShowAsCompleted");
static_assert(sizeof(Button_DoorOpener_C_ShowAsCompleted) == 0x000001, "Wrong size on Button_DoorOpener_C_ShowAsCompleted");
static_assert(offsetof(Button_DoorOpener_C_ShowAsCompleted, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'Button_DoorOpener_C_ShowAsCompleted::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function Button_DoorOpener.Button_DoorOpener_C.MakeTextDisabled
// 0x0020 (0x0020 - 0x0000)
struct Button_DoorOpener_C_MakeTextDisabled final
{
public:
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
};
static_assert(alignof(Button_DoorOpener_C_MakeTextDisabled) == 0x000008, "Wrong alignment on Button_DoorOpener_C_MakeTextDisabled");
static_assert(sizeof(Button_DoorOpener_C_MakeTextDisabled) == 0x000020, "Wrong size on Button_DoorOpener_C_MakeTextDisabled");
static_assert(offsetof(Button_DoorOpener_C_MakeTextDisabled, K2Node_MakeStruct_Color) == 0x000000, "Member 'Button_DoorOpener_C_MakeTextDisabled::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_MakeTextDisabled, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Button_DoorOpener_C_MakeTextDisabled::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_MakeTextDisabled, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'Button_DoorOpener_C_MakeTextDisabled::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function Button_DoorOpener.Button_DoorOpener_C.MakeTextEnabled
// 0x0020 (0x0020 - 0x0000)
struct Button_DoorOpener_C_MakeTextEnabled final
{
public:
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
};
static_assert(alignof(Button_DoorOpener_C_MakeTextEnabled) == 0x000008, "Wrong alignment on Button_DoorOpener_C_MakeTextEnabled");
static_assert(sizeof(Button_DoorOpener_C_MakeTextEnabled) == 0x000020, "Wrong size on Button_DoorOpener_C_MakeTextEnabled");
static_assert(offsetof(Button_DoorOpener_C_MakeTextEnabled, K2Node_MakeStruct_Color) == 0x000000, "Member 'Button_DoorOpener_C_MakeTextEnabled::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_MakeTextEnabled, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Button_DoorOpener_C_MakeTextEnabled::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_MakeTextEnabled, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'Button_DoorOpener_C_MakeTextEnabled::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function Button_DoorOpener.Button_DoorOpener_C.CloseDoors
// 0x0028 (0x0028 - 0x0000)
struct Button_DoorOpener_C_CloseDoors final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubpc_ac_Opener_C*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_DoorOpener_C_CloseDoors) == 0x000008, "Wrong alignment on Button_DoorOpener_C_CloseDoors");
static_assert(sizeof(Button_DoorOpener_C_CloseDoors) == 0x000028, "Wrong size on Button_DoorOpener_C_CloseDoors");
static_assert(offsetof(Button_DoorOpener_C_CloseDoors, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Button_DoorOpener_C_CloseDoors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_CloseDoors, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Button_DoorOpener_C_CloseDoors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_CloseDoors, CallFunc_Array_Get_Item) == 0x000008, "Member 'Button_DoorOpener_C_CloseDoors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_CloseDoors, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'Button_DoorOpener_C_CloseDoors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_CloseDoors, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'Button_DoorOpener_C_CloseDoors::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_CloseDoors, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'Button_DoorOpener_C_CloseDoors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_CloseDoors, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'Button_DoorOpener_C_CloseDoors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_DoorOpener_C_CloseDoors, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'Button_DoorOpener_C_CloseDoors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

