#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button_General_SimplePresser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_PanelStates_structs.hpp"
#include "SCT_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Button_General_SimplePresser.Button_General_SimplePresser_C.ExecuteUbergraph_Button_General_SimplePresser
// 0x02F0 (0x02F0 - 0x0000)
struct Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ACharacterSCTBP_C* PressingCharacter)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_2;              // 0x00C8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_1;              // 0x00F8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled;           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload;                // 0x0150(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_2;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x018C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_IsOpening;              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_CustomEvent_PressingCharacter;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFinalFantSkillcheckWI_C*>       CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0228(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UFinalFantSkillcheckWI_C*               CallFunc_Array_Get_Item;                           // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Interactable_C>     K2Node_DynamicCast_AsI_Interactable;               // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InteractPressed_Success;                  // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273[0x5];                                      // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Interactable_C>     K2Node_DynamicCast_AsI_Interactable_1;             // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InteractReleased_Void;                    // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFinalFantSkillcheckWI_C*>       CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x02A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UFinalFantSkillcheckWI_C*               CallFunc_Array_Get_Item_3;                         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Interactable_C>     K2Node_DynamicCast_AsI_Interactable_2;             // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InteractReleased_Void_1;                  // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E3[0x1];                                      // 0x02E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser) == 0x000008, "Wrong alignment on Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser");
static_assert(sizeof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser) == 0x0002F0, "Wrong size on Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, EntryPoint) == 0x000000, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::EntryPoint' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_struct_Variable) == 0x000028, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_delegate_Variable) == 0x000038, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_struct_Variable_1) == 0x000048, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_delegate_Variable_1) == 0x000058, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_int_Array_Index_Variable) == 0x000070, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_CreateDelegate_OutputDelegate_2) == 0x000074, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_HasAuthority_ReturnValue) == 0x000084, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_int_Loop_Counter_Variable_1) == 0x000088, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Add_IntInt_ReturnValue_1) == 0x00008C, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_int_Array_Index_Variable_1) == 0x000090, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_int_Loop_Counter_Variable_2) == 0x000094, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Add_IntInt_ReturnValue_2) == 0x000098, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_int_Array_Index_Variable_2) == 0x00009C, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_int_Loop_Counter_Variable_3) == 0x0000A0, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000A4, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_int_Loop_Counter_Variable_4) == 0x0000A8, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000AC, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_int_Array_Index_Variable_3) == 0x0000B0, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_MapRangeClamped_ReturnValue) == 0x0000B4, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_MakeRotator_ReturnValue) == 0x0000B8, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_ComponentBoundEvent_payload_2) == 0x0000C8, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_ComponentBoundEvent_payload_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_ComponentBoundEvent_payload_1) == 0x0000F8, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_ComponentBoundEvent_payload_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_ComponentBoundEvent_wasCancelled) == 0x000128, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_ComponentBoundEvent_wasCancelled' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000130, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000140, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_ComponentBoundEvent_payload) == 0x000150, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_ComponentBoundEvent_payload' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_AsCharacter_SCTBP_2) == 0x000180, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_AsCharacter_SCTBP_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_bSuccess_2) == 0x000188, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00018C, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_ComponentBoundEvent_IsOpening) == 0x000218, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_ComponentBoundEvent_IsOpening' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, Temp_int_Array_Index_Variable_4) == 0x00021C, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_CustomEvent_PressingCharacter) == 0x000220, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_CustomEvent_PressingCharacter' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000228, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Array_Get_Item) == 0x000238, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Array_Length_ReturnValue) == 0x000240, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Less_IntInt_ReturnValue) == 0x000244, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_PostAkEvent_ReturnValue) == 0x000248, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Array_Get_Item_1) == 0x000250, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Array_Length_ReturnValue_1) == 0x000258, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_AsI_Interactable) == 0x000260, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_AsI_Interactable' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_bSuccess_3) == 0x000270, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Less_IntInt_ReturnValue_1) == 0x000271, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_InteractPressed_Success) == 0x000272, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_InteractPressed_Success' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Array_Get_Item_2) == 0x000278, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Array_Length_ReturnValue_2) == 0x000280, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_AsI_Interactable_1) == 0x000288, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_AsI_Interactable_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_bSuccess_4) == 0x000298, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Less_IntInt_ReturnValue_2) == 0x000299, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_InteractReleased_Void) == 0x00029A, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_InteractReleased_Void' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_HasAuthority_ReturnValue_1) == 0x00029B, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x0002A0, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Array_Get_Item_3) == 0x0002B0, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Array_Length_ReturnValue_3) == 0x0002B8, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Less_IntInt_ReturnValue_3) == 0x0002BC, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Array_Get_Item_4) == 0x0002C0, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Array_Length_ReturnValue_4) == 0x0002C8, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_AsI_Interactable_2) == 0x0002D0, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_AsI_Interactable_2' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, K2Node_DynamicCast_bSuccess_5) == 0x0002E0, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_Less_IntInt_ReturnValue_4) == 0x0002E1, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_InteractReleased_Void_1) == 0x0002E2, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_InteractReleased_Void_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_PostAkEvent_ReturnValue_1) == 0x0002E4, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002E8, "Member 'Button_General_SimplePresser_C_ExecuteUbergraph_Button_General_SimplePresser::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function Button_General_SimplePresser.Button_General_SimplePresser_C.On Button Pressed
// 0x0008 (0x0008 - 0x0000)
struct Button_General_SimplePresser_C_On_Button_Pressed final
{
public:
	class ACharacterSCTBP_C*                      PressingCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_General_SimplePresser_C_On_Button_Pressed) == 0x000008, "Wrong alignment on Button_General_SimplePresser_C_On_Button_Pressed");
static_assert(sizeof(Button_General_SimplePresser_C_On_Button_Pressed) == 0x000008, "Wrong size on Button_General_SimplePresser_C_On_Button_Pressed");
static_assert(offsetof(Button_General_SimplePresser_C_On_Button_Pressed, PressingCharacter) == 0x000000, "Member 'Button_General_SimplePresser_C_On_Button_Pressed::PressingCharacter' has a wrong offset!");

// Function Button_General_SimplePresser.Button_General_SimplePresser_C.BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_1_OnOpenStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Button_General_SimplePresser_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_1_OnOpenStateChanged__DelegateSignature final
{
public:
	bool                                          IsOpening;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Button_General_SimplePresser_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_1_OnOpenStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Button_General_SimplePresser_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_1_OnOpenStateChanged__DelegateSignature");
static_assert(sizeof(Button_General_SimplePresser_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_1_OnOpenStateChanged__DelegateSignature) == 0x000001, "Wrong size on Button_General_SimplePresser_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_1_OnOpenStateChanged__DelegateSignature");
static_assert(offsetof(Button_General_SimplePresser_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_1_OnOpenStateChanged__DelegateSignature, IsOpening) == 0x000000, "Member 'Button_General_SimplePresser_C_BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_1_OnOpenStateChanged__DelegateSignature::IsOpening' has a wrong offset!");

// Function Button_General_SimplePresser.Button_General_SimplePresser_C.BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature");
static_assert(sizeof(Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature) == 0x000038, "Wrong size on Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature");
static_assert(offsetof(Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature, WasCancelled) == 0x000030, "Member 'Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature::WasCancelled' has a wrong offset!");

// Function Button_General_SimplePresser.Button_General_SimplePresser_C.BndEvt__Interaction_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature");
static_assert(sizeof(Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature");
static_assert(offsetof(Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function Button_General_SimplePresser.Button_General_SimplePresser_C.OnRep_E_RepairPanelStates
// 0x0020 (0x0020 - 0x0000)
struct Button_General_SimplePresser_C_OnRep_E_RepairPanelStates final
{
public:
	E_PanelStates                                 Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_General_SimplePresser_C_OnRep_E_RepairPanelStates) == 0x000008, "Wrong alignment on Button_General_SimplePresser_C_OnRep_E_RepairPanelStates");
static_assert(sizeof(Button_General_SimplePresser_C_OnRep_E_RepairPanelStates) == 0x000020, "Wrong size on Button_General_SimplePresser_C_OnRep_E_RepairPanelStates");
static_assert(offsetof(Button_General_SimplePresser_C_OnRep_E_RepairPanelStates, Temp_byte_Variable) == 0x000000, "Member 'Button_General_SimplePresser_C_OnRep_E_RepairPanelStates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_OnRep_E_RepairPanelStates, Temp_object_Variable) == 0x000008, "Member 'Button_General_SimplePresser_C_OnRep_E_RepairPanelStates::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_OnRep_E_RepairPanelStates, Temp_object_Variable_1) == 0x000010, "Member 'Button_General_SimplePresser_C_OnRep_E_RepairPanelStates::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_OnRep_E_RepairPanelStates, K2Node_Select_Default) == 0x000018, "Member 'Button_General_SimplePresser_C_OnRep_E_RepairPanelStates::K2Node_Select_Default' has a wrong offset!");

// Function Button_General_SimplePresser.Button_General_SimplePresser_C.BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature");
static_assert(sizeof(Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature");
static_assert(offsetof(Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'Button_General_SimplePresser_C_BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function Button_General_SimplePresser.Button_General_SimplePresser_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct Button_General_SimplePresser_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Button_General_SimplePresser_C_UserConstructionScript) == 0x000001, "Wrong alignment on Button_General_SimplePresser_C_UserConstructionScript");
static_assert(sizeof(Button_General_SimplePresser_C_UserConstructionScript) == 0x000002, "Wrong size on Button_General_SimplePresser_C_UserConstructionScript");
static_assert(offsetof(Button_General_SimplePresser_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Button_General_SimplePresser_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_General_SimplePresser_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000001, "Member 'Button_General_SimplePresser_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

