#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button_DoorOpener_Chandelier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Button_DoorOpener_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Button_DoorOpener_Chandelier.Button_DoorOpener_Chandelier_C
// 0x0028 (0x0348 - 0x0320)
class AButton_DoorOpener_Chandelier_C final : public AButton_DoorOpener_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Button_DoorOpener_Chandelier_C;     // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UStaticMeshComponent*                   XrayMesh;                                          // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Handle;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Alpha_61CBD02449DF95BA9FF8489609E00E61; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_61CBD02449DF95BA9FF8489609E00E61; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Button_DoorOpener_Chandelier(int32 EntryPoint);
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void OnOpenStateChanged(bool IsOpening);
	void ReceiveBeginPlay();
	void Server_Interact_Pressed();
	void Priority_Lost();
	void Priority_Gained();
	void Clicked_Cosmetics();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void HighlightChandelier(bool Highlight);
	void SetHighlightBillVisibility(bool Visibility);
	void RenderXray(bool On);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Button_DoorOpener_Chandelier_C">();
	}
	static class AButton_DoorOpener_Chandelier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AButton_DoorOpener_Chandelier_C>();
	}
};
static_assert(alignof(AButton_DoorOpener_Chandelier_C) == 0x000008, "Wrong alignment on AButton_DoorOpener_Chandelier_C");
static_assert(sizeof(AButton_DoorOpener_Chandelier_C) == 0x000348, "Wrong size on AButton_DoorOpener_Chandelier_C");
static_assert(offsetof(AButton_DoorOpener_Chandelier_C, UberGraphFrame_Button_DoorOpener_Chandelier_C) == 0x000320, "Member 'AButton_DoorOpener_Chandelier_C::UberGraphFrame_Button_DoorOpener_Chandelier_C' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_Chandelier_C, XrayMesh) == 0x000328, "Member 'AButton_DoorOpener_Chandelier_C::XrayMesh' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_Chandelier_C, Handle) == 0x000330, "Member 'AButton_DoorOpener_Chandelier_C::Handle' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_Chandelier_C, Timeline_0_Alpha_61CBD02449DF95BA9FF8489609E00E61) == 0x000338, "Member 'AButton_DoorOpener_Chandelier_C::Timeline_0_Alpha_61CBD02449DF95BA9FF8489609E00E61' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_Chandelier_C, Timeline_0__Direction_61CBD02449DF95BA9FF8489609E00E61) == 0x00033C, "Member 'AButton_DoorOpener_Chandelier_C::Timeline_0__Direction_61CBD02449DF95BA9FF8489609E00E61' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_Chandelier_C, Timeline_0) == 0x000340, "Member 'AButton_DoorOpener_Chandelier_C::Timeline_0' has a wrong offset!");

}

