#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button_General_SimplePresser

#include "Basic.hpp"

#include "E_PanelStates_structs.hpp"
#include "Engine_structs.hpp"
#include "Button_General_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Button_General_SimplePresser.Button_General_SimplePresser_C
// 0x0060 (0x03E8 - 0x0388)
class AButton_General_SimplePresser_C : public AButton_General_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Button_General_SimplePresser_C;     // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class Ubpc_ac_Opener_C*                       bpc_ac_Opener;                                     // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FramePanel;                                        // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UContextStaticMeshComponent*            Lid;                                               // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem_0;                                  // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Rot_Rot_F827C61446D1A2BC7C5867BB19BF56E7;          // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Rot__Direction_F827C61446D1A2BC7C5867BB19BF56E7;   // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Rot;                                               // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            FramePanelMesh;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPanel;                                          // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ButtonState;                                       // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_PanelStates                                 E_RepairPanelStates;                               // 0x03CA(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB[0x5];                                      // 0x03CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     SuccesMatInst;                                     // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     IdleMatInst;                                       // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverwrittenByCoopActorForEscapePod;                // 0x03E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_Button_General_SimplePresser(int32 EntryPoint);
	void Server_Special_Event_From_Coop_Actor();
	void On_Button_Pressed(class ACharacterSCTBP_C* PressingCharacter);
	void On_Cooled_Down();
	void On_Cooldown_Begin();
	void BndEvt__bpc_ac_Opener_K2Node_ComponentBoundEvent_1_OnOpenStateChanged__DelegateSignature(bool IsOpening);
	void Animate_Repaired();
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload, bool WasCancelled);
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_2_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void Rot__Closed__EventFunc();
	void Rot__UpdateFunc();
	void Rot__FinishedFunc();
	void SetAsRepaired();
	void OnRep_E_RepairPanelStates();
	void OnRep_OverwrittenByCoopActorForEscapePod();
	void ReceiveBeginPlay();
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Button_General_SimplePresser_C">();
	}
	static class AButton_General_SimplePresser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AButton_General_SimplePresser_C>();
	}
};
static_assert(alignof(AButton_General_SimplePresser_C) == 0x000008, "Wrong alignment on AButton_General_SimplePresser_C");
static_assert(sizeof(AButton_General_SimplePresser_C) == 0x0003E8, "Wrong size on AButton_General_SimplePresser_C");
static_assert(offsetof(AButton_General_SimplePresser_C, UberGraphFrame_Button_General_SimplePresser_C) == 0x000388, "Member 'AButton_General_SimplePresser_C::UberGraphFrame_Button_General_SimplePresser_C' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, bpc_ac_Opener) == 0x000390, "Member 'AButton_General_SimplePresser_C::bpc_ac_Opener' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, FramePanel) == 0x000398, "Member 'AButton_General_SimplePresser_C::FramePanel' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, Lid) == 0x0003A0, "Member 'AButton_General_SimplePresser_C::Lid' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, ParticleSystem_0) == 0x0003A8, "Member 'AButton_General_SimplePresser_C::ParticleSystem_0' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, Rot_Rot_F827C61446D1A2BC7C5867BB19BF56E7) == 0x0003B0, "Member 'AButton_General_SimplePresser_C::Rot_Rot_F827C61446D1A2BC7C5867BB19BF56E7' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, Rot__Direction_F827C61446D1A2BC7C5867BB19BF56E7) == 0x0003B4, "Member 'AButton_General_SimplePresser_C::Rot__Direction_F827C61446D1A2BC7C5867BB19BF56E7' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, Rot) == 0x0003B8, "Member 'AButton_General_SimplePresser_C::Rot' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, FramePanelMesh) == 0x0003C0, "Member 'AButton_General_SimplePresser_C::FramePanelMesh' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, HasPanel) == 0x0003C8, "Member 'AButton_General_SimplePresser_C::HasPanel' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, ButtonState) == 0x0003C9, "Member 'AButton_General_SimplePresser_C::ButtonState' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, E_RepairPanelStates) == 0x0003CA, "Member 'AButton_General_SimplePresser_C::E_RepairPanelStates' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, SuccesMatInst) == 0x0003D0, "Member 'AButton_General_SimplePresser_C::SuccesMatInst' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, IdleMatInst) == 0x0003D8, "Member 'AButton_General_SimplePresser_C::IdleMatInst' has a wrong offset!");
static_assert(offsetof(AButton_General_SimplePresser_C, OverwrittenByCoopActorForEscapePod) == 0x0003E0, "Member 'AButton_General_SimplePresser_C::OverwrittenByCoopActorForEscapePod' has a wrong offset!");

}

