#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button_DoorOpener

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Button_DoorOpener.Button_DoorOpener_C
// 0x0100 (0x0320 - 0x0220)
class AButton_DoorOpener_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UInteractionComponent*                  Interaction;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRenderComplete;                                // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   CooldownText;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneTexts;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OutlineArea1;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OutlineMesh;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UContextStaticMeshComponent*            ContextStaticMesh;                                 // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Button;                                            // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Amount_Amount_8A81854D490F06A6375EA49F79A75E82;    // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Amount__Direction_8A81854D490F06A6375EA49F79A75E82; // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Amount;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsToControl;                                   // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          StartSkillcheck;                                   // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFinalFantSkillcheckWI_C*               WI_Skillcheck;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Failed;                                            // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OnCooldown;                                        // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CooldownTimeHandle;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          OneTimePresser;                                    // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OneShotShillcheck;                                 // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ImmidiateActivationOfActors;                       // 0x02C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C3[0x1];                                      // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CooldownTimeAfterRelease;                          // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Completed;                                         // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCooledDown;                                      // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnButtonPressed;                                   // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnButtonReleased;                                  // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Activated;                                         // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnProxySkillCheckFail;                             // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          EnabledInteraction;                                // 0x0318(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          DefaultEnabledInteraction;                         // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DoorsOpened;                                       // 0x031A(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          CanActivateOnce;                                   // 0x031B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnCooledDown__DelegateSignature();
	void OnButtonPressed__DelegateSignature(class ACharacterSCTBP_C* PressingCharacter);
	void OnButtonReleased__DelegateSignature(class ACharacterSCTBP_C* ReleasingCharacter);
	void OnProxySkillCheckFail__DelegateSignature();
	void ExecuteUbergraph_Button_DoorOpener(int32 EntryPoint);
	void Priority_Lost();
	void Priority_Gained();
	void BndEvt__ContextStaticMesh_K2Node_ComponentBoundEvent_1_PriorityDelegate__DelegateSignature();
	void BndEvt__ContextStaticMesh_K2Node_ComponentBoundEvent_0_PriorityDelegate__DelegateSignature();
	void Clicked_Cosmetics();
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void Server_Interact_Pressed();
	void Amount__UpdateFunc();
	void Amount__FinishedFunc();
	void SetCooldownText(const class FText& Value);
	void OpenDoors();
	void ShowAsCompleted();
	void OnRep_EnabledInteraction();
	void MakeTextDisabled();
	void MakeTextEnabled();
	void CloseDoors();
	void OnRep_DoorsOpened();
	void OnRep_Enabled();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Button_DoorOpener_C">();
	}
	static class AButton_DoorOpener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AButton_DoorOpener_C>();
	}
};
static_assert(alignof(AButton_DoorOpener_C) == 0x000008, "Wrong alignment on AButton_DoorOpener_C");
static_assert(sizeof(AButton_DoorOpener_C) == 0x000320, "Wrong size on AButton_DoorOpener_C");
static_assert(offsetof(AButton_DoorOpener_C, UberGraphFrame) == 0x000220, "Member 'AButton_DoorOpener_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, Interaction) == 0x000228, "Member 'AButton_DoorOpener_C::Interaction' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, TextRenderComplete) == 0x000230, "Member 'AButton_DoorOpener_C::TextRenderComplete' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, TextRender) == 0x000238, "Member 'AButton_DoorOpener_C::TextRender' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, CooldownText) == 0x000240, "Member 'AButton_DoorOpener_C::CooldownText' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, SceneTexts) == 0x000248, "Member 'AButton_DoorOpener_C::SceneTexts' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, OutlineArea1) == 0x000250, "Member 'AButton_DoorOpener_C::OutlineArea1' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, OutlineMesh) == 0x000258, "Member 'AButton_DoorOpener_C::OutlineMesh' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, ContextStaticMesh) == 0x000260, "Member 'AButton_DoorOpener_C::ContextStaticMesh' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, Ak) == 0x000268, "Member 'AButton_DoorOpener_C::Ak' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, Button) == 0x000270, "Member 'AButton_DoorOpener_C::Button' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, DefaultSceneRoot) == 0x000278, "Member 'AButton_DoorOpener_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, Amount_Amount_8A81854D490F06A6375EA49F79A75E82) == 0x000280, "Member 'AButton_DoorOpener_C::Amount_Amount_8A81854D490F06A6375EA49F79A75E82' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, Amount__Direction_8A81854D490F06A6375EA49F79A75E82) == 0x000284, "Member 'AButton_DoorOpener_C::Amount__Direction_8A81854D490F06A6375EA49F79A75E82' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, Amount) == 0x000288, "Member 'AButton_DoorOpener_C::Amount' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, ActorsToControl) == 0x000290, "Member 'AButton_DoorOpener_C::ActorsToControl' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, StartSkillcheck) == 0x0002A0, "Member 'AButton_DoorOpener_C::StartSkillcheck' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, WI_Skillcheck) == 0x0002A8, "Member 'AButton_DoorOpener_C::WI_Skillcheck' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, Failed) == 0x0002B0, "Member 'AButton_DoorOpener_C::Failed' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, OnCooldown) == 0x0002B1, "Member 'AButton_DoorOpener_C::OnCooldown' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, CooldownTimeHandle) == 0x0002B8, "Member 'AButton_DoorOpener_C::CooldownTimeHandle' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, OneTimePresser) == 0x0002C0, "Member 'AButton_DoorOpener_C::OneTimePresser' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, OneShotShillcheck) == 0x0002C1, "Member 'AButton_DoorOpener_C::OneShotShillcheck' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, ImmidiateActivationOfActors) == 0x0002C2, "Member 'AButton_DoorOpener_C::ImmidiateActivationOfActors' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, CooldownTimeAfterRelease) == 0x0002C4, "Member 'AButton_DoorOpener_C::CooldownTimeAfterRelease' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, Completed) == 0x0002C8, "Member 'AButton_DoorOpener_C::Completed' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, OnCooledDown) == 0x0002D0, "Member 'AButton_DoorOpener_C::OnCooledDown' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, OnButtonPressed) == 0x0002E0, "Member 'AButton_DoorOpener_C::OnButtonPressed' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, OnButtonReleased) == 0x0002F0, "Member 'AButton_DoorOpener_C::OnButtonReleased' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, Activated) == 0x000300, "Member 'AButton_DoorOpener_C::Activated' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, OnProxySkillCheckFail) == 0x000308, "Member 'AButton_DoorOpener_C::OnProxySkillCheckFail' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, EnabledInteraction) == 0x000318, "Member 'AButton_DoorOpener_C::EnabledInteraction' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, DefaultEnabledInteraction) == 0x000319, "Member 'AButton_DoorOpener_C::DefaultEnabledInteraction' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, DoorsOpened) == 0x00031A, "Member 'AButton_DoorOpener_C::DoorsOpened' has a wrong offset!");
static_assert(offsetof(AButton_DoorOpener_C, CanActivateOnce) == 0x00031B, "Member 'AButton_DoorOpener_C::CanActivateOnce' has a wrong offset!");

}

