#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CAIN_EndButton

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CAIN_EndButton.CAIN_EndButton_C.OnHeldButton__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CAIN_EndButton_C_OnHeldButton__DelegateSignature final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CAIN_EndButton_C_OnHeldButton__DelegateSignature) == 0x000008, "Wrong alignment on CAIN_EndButton_C_OnHeldButton__DelegateSignature");
static_assert(sizeof(CAIN_EndButton_C_OnHeldButton__DelegateSignature) == 0x000008, "Wrong size on CAIN_EndButton_C_OnHeldButton__DelegateSignature");
static_assert(offsetof(CAIN_EndButton_C_OnHeldButton__DelegateSignature, Character) == 0x000000, "Member 'CAIN_EndButton_C_OnHeldButton__DelegateSignature::Character' has a wrong offset!");

// Function CAIN_EndButton.CAIN_EndButton_C.OnNotHeldButton__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CAIN_EndButton_C_OnNotHeldButton__DelegateSignature final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CAIN_EndButton_C_OnNotHeldButton__DelegateSignature) == 0x000008, "Wrong alignment on CAIN_EndButton_C_OnNotHeldButton__DelegateSignature");
static_assert(sizeof(CAIN_EndButton_C_OnNotHeldButton__DelegateSignature) == 0x000008, "Wrong size on CAIN_EndButton_C_OnNotHeldButton__DelegateSignature");
static_assert(offsetof(CAIN_EndButton_C_OnNotHeldButton__DelegateSignature, Character) == 0x000000, "Member 'CAIN_EndButton_C_OnNotHeldButton__DelegateSignature::Character' has a wrong offset!");

// Function CAIN_EndButton.CAIN_EndButton_C.ExecuteUbergraph_CAIN_EndButton
// 0x0188 (0x0188 - 0x0000)
struct CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_1;              // 0x0040(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload;                // 0x0070(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter_1;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Abp_Cain_MovementRig_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x00C8(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Abp_Cain_MovementRig_C*                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x00FC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0110(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0120(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0138(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0170(0x0018)()
};
static_assert(alignof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton) == 0x000008, "Wrong alignment on CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton");
static_assert(sizeof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton) == 0x000188, "Wrong size on CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, EntryPoint) == 0x000000, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_bool_Variable) == 0x000004, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_text_Variable) == 0x000008, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_text_Variable_1) == 0x000020, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_bool_IsClosed_Variable) == 0x000038, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_bool_IsClosed_Variable_1) == 0x000039, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_bool_Has_Been_Initd_Variable) == 0x00003A, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_HasAuthority_ReturnValue) == 0x00003B, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, K2Node_ComponentBoundEvent_payload_1) == 0x000040, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::K2Node_ComponentBoundEvent_payload_1' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, K2Node_ComponentBoundEvent_payload) == 0x000070, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::K2Node_ComponentBoundEvent_payload' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, K2Node_ComponentBoundEvent_wasCancelled) == 0x0000A0, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::K2Node_ComponentBoundEvent_wasCancelled' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, K2Node_DynamicCast_AsCharacter) == 0x0000A8, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, K2Node_DynamicCast_AsCharacter_1) == 0x0000B8, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::K2Node_DynamicCast_AsCharacter_1' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000C1, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000C8, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D8, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000F0, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_Array_Length_ReturnValue) == 0x0000F4, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F8, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000F9, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_delegate_Variable) == 0x0000FC, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_struct_Variable) == 0x000110, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_delegate_Variable_1) == 0x000120, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_PostAkEvent_ReturnValue) == 0x000130, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, Temp_struct_Variable_1) == 0x000138, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_PostAkEvent_ReturnValue_1) == 0x000148, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_GetPlayerController_ReturnValue) == 0x000150, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, CallFunc_K2_GetPawn_ReturnValue) == 0x000158, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000160, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton, K2Node_Select_Default) == 0x000170, "Member 'CAIN_EndButton_C_ExecuteUbergraph_CAIN_EndButton::K2Node_Select_Default' has a wrong offset!");

// Function CAIN_EndButton.CAIN_EndButton_C.BndEvt__Interaction Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature");
static_assert(sizeof(CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature) == 0x000038, "Wrong size on CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature");
static_assert(offsetof(CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature, Payload) == 0x000000, "Member 'CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature::Payload' has a wrong offset!");
static_assert(offsetof(CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature, WasCancelled) == 0x000030, "Member 'CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature::WasCancelled' has a wrong offset!");

// Function CAIN_EndButton.CAIN_EndButton_C.BndEvt__Interaction Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature");
static_assert(sizeof(CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature");
static_assert(offsetof(CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'CAIN_EndButton_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

}

