#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CAINServer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Button_General_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CAINServer.CAINServer_C
// 0x00C8 (0x0450 - 0x0388)
class ACAINServer_C final : public AButton_General_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CAINServer_C;                       // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UStaticMeshComponent*                   RedLight;                                          // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent*                  InteractionSabotage;                               // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionProgressBarCreator*         InteractionProgressBarCreatorSabotage;             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UContextStaticMeshComponent*            ContextStaticMeshSabotage;                         // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem1_0;                                 // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LowerLid;                                          // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class Ubpc_ac_Opener_C*                       bpc_ac_Opener;                                     // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Lid_Amount_C592D3A94210F710DAD5E1B06ABA6231;       // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Lid__Direction_C592D3A94210F710DAD5E1B06ABA6231;   // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Lid;                                               // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFinalFantSkillcheckWI_C*               WI_Skillcheck_CAINServer_C;                        // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Repaired;                                          // 0x0400(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AServerRoomManagerSCT_C*                ServerRoomManager;                                 // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PermaRepaired;                                     // 0x0410(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacter*>                     CharactersWhoRepaired;                             // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ACharacterSCTBP_C*                      CharacterToReceiveScore;                           // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacter*>                     CharactersWhoSabotaged;                            // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UAkAudioEvent*                          AudioFail;                                         // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AudioFix;                                          // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CAINServer(int32 EntryPoint);
	void HandleITSpecialistAchievement();
	void BndEvt__CAINServer_InteractionSabotage_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature(const struct FInteractionPayload& Payload, bool WasCancelled);
	void Blow_up();
	void Show_Failed_Skillcheck(class APlayerController* PlayerController);
	void Audio_Fail();
	void BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_6_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_5_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void BndEvt__InteractionSabotage_K2Node_ComponentBoundEvent_2_InteractionSuccessfulDelegate__DelegateSignature();
	void Audio_Hold_Stop();
	void Audio_Hold_Start();
	void Audio_Fix();
	void Audio_Sabotage();
	void Perma_Repaired_Cosmetics();
	void Perma_Repair();
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionEndedDelegate__DelegateSignature(const struct FInteractionPayload& Payload, bool WasCancelled);
	void Sabotage();
	void Repair();
	void Completed_Skillcheck();
	void Proxy_CompletedOneshot();
	void Failed_Skillcheck();
	void Proxy_FailedSkillcheck();
	void Lid__UpdateFunc();
	void Lid__FinishedFunc();
	void OnRep_Sabotaged();
	void OnRep_PermaRepaired();
	void ScoreForServerRepair(bool Repair);
	void Start_text_Cooldown();
	void Set_Cooldown_Text();
	void ReceiveBeginPlay();
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void UserConstructionScript();
	void MakeTextEnabled();
	void MakeTextDisabled();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CAINServer_C">();
	}
	static class ACAINServer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACAINServer_C>();
	}
};
static_assert(alignof(ACAINServer_C) == 0x000008, "Wrong alignment on ACAINServer_C");
static_assert(sizeof(ACAINServer_C) == 0x000450, "Wrong size on ACAINServer_C");
static_assert(offsetof(ACAINServer_C, UberGraphFrame_CAINServer_C) == 0x000388, "Member 'ACAINServer_C::UberGraphFrame_CAINServer_C' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, RedLight) == 0x000390, "Member 'ACAINServer_C::RedLight' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, InteractionSabotage) == 0x000398, "Member 'ACAINServer_C::InteractionSabotage' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, InteractionProgressBarCreatorSabotage) == 0x0003A0, "Member 'ACAINServer_C::InteractionProgressBarCreatorSabotage' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, ContextStaticMeshSabotage) == 0x0003A8, "Member 'ACAINServer_C::ContextStaticMeshSabotage' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, ParticleSystem1_0) == 0x0003B0, "Member 'ACAINServer_C::ParticleSystem1_0' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, SkeletalMesh) == 0x0003B8, "Member 'ACAINServer_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, StaticMesh3) == 0x0003C0, "Member 'ACAINServer_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, LowerLid) == 0x0003C8, "Member 'ACAINServer_C::LowerLid' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, StaticMesh1) == 0x0003D0, "Member 'ACAINServer_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, StaticMesh) == 0x0003D8, "Member 'ACAINServer_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, bpc_ac_Opener) == 0x0003E0, "Member 'ACAINServer_C::bpc_ac_Opener' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, Lid_Amount_C592D3A94210F710DAD5E1B06ABA6231) == 0x0003E8, "Member 'ACAINServer_C::Lid_Amount_C592D3A94210F710DAD5E1B06ABA6231' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, Lid__Direction_C592D3A94210F710DAD5E1B06ABA6231) == 0x0003EC, "Member 'ACAINServer_C::Lid__Direction_C592D3A94210F710DAD5E1B06ABA6231' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, Lid) == 0x0003F0, "Member 'ACAINServer_C::Lid' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, WI_Skillcheck_CAINServer_C) == 0x0003F8, "Member 'ACAINServer_C::WI_Skillcheck_CAINServer_C' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, Repaired) == 0x000400, "Member 'ACAINServer_C::Repaired' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, ServerRoomManager) == 0x000408, "Member 'ACAINServer_C::ServerRoomManager' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, PermaRepaired) == 0x000410, "Member 'ACAINServer_C::PermaRepaired' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, CharactersWhoRepaired) == 0x000418, "Member 'ACAINServer_C::CharactersWhoRepaired' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, CharacterToReceiveScore) == 0x000428, "Member 'ACAINServer_C::CharacterToReceiveScore' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, CharactersWhoSabotaged) == 0x000430, "Member 'ACAINServer_C::CharactersWhoSabotaged' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, AudioFail) == 0x000440, "Member 'ACAINServer_C::AudioFail' has a wrong offset!");
static_assert(offsetof(ACAINServer_C, AudioFix) == 0x000448, "Member 'ACAINServer_C::AudioFix' has a wrong offset!");

}

