#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChampagneBottleGA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ChampagneBottleGA.ChampagneBottleGA_C
// 0x0020 (0x0460 - 0x0440)
class UChampagneBottleGA_C final : public UChampagneBottle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AEquipablePower_ChampagneBottle_C*      EquipablePower_ChampagneBottle;                    // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MeleeDownedDuration;                               // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAgendaCoopPowerEvent*                  HitEvent;                                          // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChampagneBottleGA(int32 EntryPoint);
	void OnBottleThrown(class ACharacterSCTBP_C* Owner);
	void K2_OnEndAbility(bool bWasCancelled);
	void Audio_Bottle_Impact();
	void Audio_Swing_Bottle();
	void Audio_Start_Aim();
	void K2_ActivateAbility();
	void OnFinish_3B909D464B0199E6B2267D93BAEC07AD();
	void OnFinish_21AF4E51421C63BF8CA1929024CA9B98();
	void OnRelease_03099AE94382C845B77D16881AAEF69C(float TimeHeld);
	void OnCompleted_76A5CDEA4A69829CF7806FB084298BD2();
	void OnBlendOut_76A5CDEA4A69829CF7806FB084298BD2();
	void OnInterrupted_76A5CDEA4A69829CF7806FB084298BD2();
	void OnCancelled_76A5CDEA4A69829CF7806FB084298BD2();
	void RagdollTarget();
	void ShowBottleCosmetic();
	void BreakEquipablePower();
	void CallHitEvent();

	void GetTargetRagdollImpulse(class AActor* Target, struct FVector* Impulse) const;
	void GetOwnerController(class APlayerController** AsPlayer_Controller) const;
	void GetTargetController(class APlayerController** AsPlayer_Controller) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChampagneBottleGA_C">();
	}
	static class UChampagneBottleGA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChampagneBottleGA_C>();
	}
};
static_assert(alignof(UChampagneBottleGA_C) == 0x000008, "Wrong alignment on UChampagneBottleGA_C");
static_assert(sizeof(UChampagneBottleGA_C) == 0x000460, "Wrong size on UChampagneBottleGA_C");
static_assert(offsetof(UChampagneBottleGA_C, UberGraphFrame) == 0x000440, "Member 'UChampagneBottleGA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChampagneBottleGA_C, EquipablePower_ChampagneBottle) == 0x000448, "Member 'UChampagneBottleGA_C::EquipablePower_ChampagneBottle' has a wrong offset!");
static_assert(offsetof(UChampagneBottleGA_C, MeleeDownedDuration) == 0x000450, "Member 'UChampagneBottleGA_C::MeleeDownedDuration' has a wrong offset!");
static_assert(offsetof(UChampagneBottleGA_C, HitEvent) == 0x000458, "Member 'UChampagneBottleGA_C::HitEvent' has a wrong offset!");

}

