#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterPreviewerPartyMemberSCTBP

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"


namespace SDK::Params
{

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP
// 0x03A0 (0x03A0 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_4;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_4;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FFCTCloudCustomizationGender           K2Node_CustomEvent_Payload_2;                      // 0x0028(0x00B0)()
	bool                                          K2Node_CustomEvent_IsMale;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Code_3;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTCloudCustomizationGender& Payload, bool IsMale, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTCloudCustomizationGender           Temp_struct_Variable;                              // 0x0118(0x00B0)()
	class UFCTAccelByteCustomizationSettingsCallbackProxy* CallFunc_GetCustomizationSettingsByUserId_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Code_2;                         // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSimpleUserData                        K2Node_CustomEvent_UserData;                       // 0x01F8(0x0040)()
	TDelegate<void(const struct FSimpleUserData& UserData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	struct FSimpleUserData                        Temp_struct_Variable_1;                            // 0x0248(0x0040)()
	TDelegate<void(struct FAccelByteUserPresenceData& Payload, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteUserPresenceData             K2Node_CustomEvent_Payload_1;                      // 0x0298(0x0028)(ConstParm)
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAccelByteUserPresenceData             K2Node_CustomEvent_Payload;                        // 0x02D8(0x0028)(ConstParm)
	int32                                         K2Node_CustomEvent_Code;                           // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(struct FAccelByteUserPresenceData& Payload, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0318(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_1;                            // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteUserPresenceData             Temp_struct_Variable_2;                            // 0x0340(0x0028)()
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_UserId;                         // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAccelByteGetUserUtils*              CallFunc_GetUserInfo_ReturnValue;                  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGetUserPresenceStatusCallbackProxy*    CallFunc_GetPresenceStatusByUserId_ReturnValue;    // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP) == 0x0003A0, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, EntryPoint) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Code_4) == 0x000004, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Code_4' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Message_4) == 0x000008, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Message_4' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Payload_2) == 0x000028, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_IsMale) == 0x0000D8, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_IsMale' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Code_3) == 0x0000DC, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Code_3' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Message_3) == 0x0000E0, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Message_3' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F0, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, Temp_string_Variable) == 0x000100, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, Temp_int_Variable) == 0x000110, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, Temp_bool_Variable) == 0x000114, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, Temp_struct_Variable) == 0x000118, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, CallFunc_GetCustomizationSettingsByUserId_ReturnValue) == 0x0001C8, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::CallFunc_GetCustomizationSettingsByUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001D0, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, CallFunc_IsValid_ReturnValue) == 0x0001E0, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Code_2) == 0x0001E4, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Code_2' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Message_2) == 0x0001E8, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_UserData) == 0x0001F8, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_UserData' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CreateDelegate_OutputDelegate_3) == 0x000238, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, Temp_struct_Variable_1) == 0x000248, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CreateDelegate_OutputDelegate_4) == 0x000288, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Payload_1) == 0x000298, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Code_1) == 0x0002C0, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Message_1) == 0x0002C8, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Payload) == 0x0002D8, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Code) == 0x000300, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_Message) == 0x000308, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CreateDelegate_OutputDelegate_5) == 0x000318, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, Temp_string_Variable_1) == 0x000328, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, Temp_int_Variable_1) == 0x000338, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, Temp_struct_Variable_2) == 0x000340, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000368, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, K2Node_CustomEvent_UserId) == 0x000370, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::K2Node_CustomEvent_UserId' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, CallFunc_GetUserInfo_ReturnValue) == 0x000380, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::CallFunc_GetUserInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, CallFunc_IsValid_ReturnValue_1) == 0x000388, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, CallFunc_IsEditor_ReturnValue) == 0x000389, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, CallFunc_GetPresenceStatusByUserId_ReturnValue) == 0x000390, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::CallFunc_GetPresenceStatusByUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP, CallFunc_IsValid_ReturnValue_2) == 0x000398, "Member 'CharacterPreviewerPartyMemberSCTBP_C_ExecuteUbergraph_CharacterPreviewerPartyMemberSCTBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.OnPartyMemberJoined
// 0x0010 (0x0010 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_OnPartyMemberJoined final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_OnPartyMemberJoined) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_OnPartyMemberJoined");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_OnPartyMemberJoined) == 0x000010, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_OnPartyMemberJoined");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnPartyMemberJoined, UserId) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnPartyMemberJoined::UserId' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.OnSuccess_7FEF5916492BDCB3681DFDB214EB1485
// 0x0040 (0x0040 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485 final
{
public:
	struct FAccelByteUserPresenceData             Payload;                                           // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Code;                                              // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485) == 0x000040, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485, Payload) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485::Payload' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485, Code) == 0x000028, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485::Code' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485, Message) == 0x000030, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_7FEF5916492BDCB3681DFDB214EB1485::Message' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.OnError_7FEF5916492BDCB3681DFDB214EB1485
// 0x0040 (0x0040 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485 final
{
public:
	struct FAccelByteUserPresenceData             Payload;                                           // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Code;                                              // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485) == 0x000040, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485, Payload) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485::Payload' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485, Code) == 0x000028, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485::Code' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485, Message) == 0x000030, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnError_7FEF5916492BDCB3681DFDB214EB1485::Message' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.OnSuccess_8CB46EF445440A9BEBF38E901A2A0BD6
// 0x0040 (0x0040 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_8CB46EF445440A9BEBF38E901A2A0BD6 final
{
public:
	struct FSimpleUserData                        UserData;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_8CB46EF445440A9BEBF38E901A2A0BD6) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_8CB46EF445440A9BEBF38E901A2A0BD6");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_8CB46EF445440A9BEBF38E901A2A0BD6) == 0x000040, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_8CB46EF445440A9BEBF38E901A2A0BD6");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_8CB46EF445440A9BEBF38E901A2A0BD6, UserData) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_8CB46EF445440A9BEBF38E901A2A0BD6::UserData' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.OnFail_8CB46EF445440A9BEBF38E901A2A0BD6
// 0x0018 (0x0018 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_OnFail_8CB46EF445440A9BEBF38E901A2A0BD6 final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_OnFail_8CB46EF445440A9BEBF38E901A2A0BD6) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_OnFail_8CB46EF445440A9BEBF38E901A2A0BD6");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_OnFail_8CB46EF445440A9BEBF38E901A2A0BD6) == 0x000018, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_OnFail_8CB46EF445440A9BEBF38E901A2A0BD6");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnFail_8CB46EF445440A9BEBF38E901A2A0BD6, Code) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnFail_8CB46EF445440A9BEBF38E901A2A0BD6::Code' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnFail_8CB46EF445440A9BEBF38E901A2A0BD6, Message) == 0x000008, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnFail_8CB46EF445440A9BEBF38E901A2A0BD6::Message' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.OnSuccess_D5CB2D3847B399733431F486E3C2EE60
// 0x00C8 (0x00C8 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60 final
{
public:
	struct FFCTCloudCustomizationGender           Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsMale;                                            // 0x00B0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x00B4(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x00B8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60) == 0x0000C8, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60, Payload) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60::Payload' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60, IsMale) == 0x0000B0, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60::IsMale' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60, Code) == 0x0000B4, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60::Code' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60, Message) == 0x0000B8, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnSuccess_D5CB2D3847B399733431F486E3C2EE60::Message' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.OnError_D5CB2D3847B399733431F486E3C2EE60
// 0x0018 (0x0018 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_OnError_D5CB2D3847B399733431F486E3C2EE60 final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_OnError_D5CB2D3847B399733431F486E3C2EE60) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_OnError_D5CB2D3847B399733431F486E3C2EE60");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_OnError_D5CB2D3847B399733431F486E3C2EE60) == 0x000018, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_OnError_D5CB2D3847B399733431F486E3C2EE60");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnError_D5CB2D3847B399733431F486E3C2EE60, Code) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnError_D5CB2D3847B399733431F486E3C2EE60::Code' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_OnError_D5CB2D3847B399733431F486E3C2EE60, Message) == 0x000008, "Member 'CharacterPreviewerPartyMemberSCTBP_C_OnError_D5CB2D3847B399733431F486E3C2EE60::Message' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.Get Customization Config
// 0x0090 (0x0090 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config final
{
public:
	bool                                          IsMale;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CustomizationSettings_C*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FemaleCustomizationConfig_C*        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MaleCustomizationConfig_C*          CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config) == 0x000010, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config) == 0x000090, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config, IsMale) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config::IsMale' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config, ReturnValue) == 0x000008, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config, CallFunc_GetTransform_ReturnValue_1) == 0x000050, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000080, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000088, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Get_Customization_Config::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.Set Customization
// 0x00C0 (0x00C0 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_Set_Customization final
{
public:
	struct FFCTCloudCustomizationGender           CustomizationPayload;                              // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsMale;                                            // 0x00B0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CustomizationSettings_C*            CallFunc_Get_Customization_Config_ReturnValue;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_Set_Customization) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_Set_Customization");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_Set_Customization) == 0x0000C0, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_Set_Customization");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Set_Customization, CustomizationPayload) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Set_Customization::CustomizationPayload' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Set_Customization, IsMale) == 0x0000B0, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Set_Customization::IsMale' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Set_Customization, CallFunc_Get_Customization_Config_ReturnValue) == 0x0000B8, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Set_Customization::CallFunc_Get_Customization_Config_ReturnValue' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.Set Gender Mesh
// 0x0001 (0x0001 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_Set_Gender_Mesh final
{
public:
	bool                                          bIsMale;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_Set_Gender_Mesh) == 0x000001, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_Set_Gender_Mesh");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_Set_Gender_Mesh) == 0x000001, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_Set_Gender_Mesh");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_Set_Gender_Mesh, bIsMale) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_Set_Gender_Mesh::bIsMale' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.SetName
// 0x0038 (0x0038 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_SetName final
{
public:
	class FString                                 RenderName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UNameCanvasRenderTargetXboxOneBP_C*     CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxOneGDKPlatform_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNameCanvasRenderTargetBP_C*            CallFunc_SpawnObject_ReturnValue_1;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_SetName) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_SetName");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_SetName) == 0x000038, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_SetName");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_SetName, RenderName) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_SetName::RenderName' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_SetName, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'CharacterPreviewerPartyMemberSCTBP_C_SetName::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_SetName, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'CharacterPreviewerPartyMemberSCTBP_C_SetName::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_SetName, CallFunc_IsXboxOneGDKPlatform_ReturnValue) == 0x000020, "Member 'CharacterPreviewerPartyMemberSCTBP_C_SetName::CallFunc_IsXboxOneGDKPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_SetName, CallFunc_SpawnObject_ReturnValue_1) == 0x000028, "Member 'CharacterPreviewerPartyMemberSCTBP_C_SetName::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_SetName, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000030, "Member 'CharacterPreviewerPartyMemberSCTBP_C_SetName::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.UpdatePlatformIcon
// 0x0028 (0x0028 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon final
{
public:
	class FString                                 Platform;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetPlatformTexture_IconTexture;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon) == 0x000028, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon, Platform) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon::Platform' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon, Texture) == 0x000010, "Member 'CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon::Texture' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon, CallFunc_GetPlatformTexture_IconTexture) == 0x000018, "Member 'CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon::CallFunc_GetPlatformTexture_IconTexture' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'CharacterPreviewerPartyMemberSCTBP_C_UpdatePlatformIcon::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.GetPlatformTexture
// 0x0028 (0x0028 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture final
{
public:
	class FString                                 Selection;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue_1;              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue_1;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue_2;              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue_2;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue_3;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue_3;              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture) == 0x000008, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture) == 0x000028, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, Selection) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::Selection' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, IconTexture) == 0x000010, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::IconTexture' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_IsPS5Platform_ReturnValue) == 0x000018, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_IsPS5Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, K2Node_SwitchString_CmpSuccess) == 0x000019, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_IsPS4Platform_ReturnValue) == 0x00001A, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_IsPS5Platform_ReturnValue_1) == 0x00001B, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_IsPS5Platform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_IsPS4Platform_ReturnValue_1) == 0x00001C, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_IsPS4Platform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_BooleanOR_ReturnValue) == 0x00001D, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_BooleanOR_ReturnValue_1) == 0x00001E, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_IsPS5Platform_ReturnValue_2) == 0x00001F, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_IsPS5Platform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_IsPS4Platform_ReturnValue_2) == 0x000020, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_IsPS4Platform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_IsPS5Platform_ReturnValue_3) == 0x000021, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_IsPS5Platform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_BooleanOR_ReturnValue_2) == 0x000022, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_IsPS4Platform_ReturnValue_3) == 0x000023, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_IsPS4Platform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_BooleanOR_ReturnValue_3) == 0x000024, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture, CallFunc_IsEditor_ReturnValue) == 0x000025, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetPlatformTexture::CallFunc_IsEditor_ReturnValue' has a wrong offset!");

// Function CharacterPreviewerPartyMemberSCTBP.CharacterPreviewerPartyMemberSCTBP_C.GetRandomDebugPlatformIcon
// 0x0008 (0x0008 - 0x0000)
struct CharacterPreviewerPartyMemberSCTBP_C_GetRandomDebugPlatformIcon final
{
public:
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterPreviewerPartyMemberSCTBP_C_GetRandomDebugPlatformIcon) == 0x000004, "Wrong alignment on CharacterPreviewerPartyMemberSCTBP_C_GetRandomDebugPlatformIcon");
static_assert(sizeof(CharacterPreviewerPartyMemberSCTBP_C_GetRandomDebugPlatformIcon) == 0x000008, "Wrong size on CharacterPreviewerPartyMemberSCTBP_C_GetRandomDebugPlatformIcon");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetRandomDebugPlatformIcon, CallFunc_RandomInteger_ReturnValue) == 0x000000, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetRandomDebugPlatformIcon::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterPreviewerPartyMemberSCTBP_C_GetRandomDebugPlatformIcon, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'CharacterPreviewerPartyMemberSCTBP_C_GetRandomDebugPlatformIcon::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

