#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterWI.CharacterWI_C
// 0x0148 (0x03C8 - 0x0280)
class UCharacterWI_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       FadePlayerUI;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LowOxygen;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectItem;                                        // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAgendaHUD_C*                           AgendaHUD;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_EquippedItems;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOxygenLocalWI_C*                       CharacterOxygenWI;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControllerIconWI_C*                    ControllerIconWI;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControllerIconWI_C*                    ControllerIconWI_278;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControllerIconWI_C*                    ControllerIconWI_418;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControllerIconWI_C*                    ControllerIconWI_629;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControllerIconWI_C*                    ControllerIconWI_796;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCountdownWI_C*                         CountdownWI;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         EmoteMinuswheelReminder;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Equipment_1;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EquipmentForAnimation;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGenericProgressBarWI_C*                GenericProgressBarWI;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGenericTextFeedbackWI_C*               GenericTextFeedbackWI;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_76;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_541;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemStacksWI_C*                        ItemStacks1WI;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeycardObjectiveWI_C*                  KeycardObjectiveWI;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPassengerLogDisplayWI_C*               PassengerLogDisplayWI;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPassiveItemWI_C*                       PassiveItemWI;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerObjectiveWI_C*                   PlayerObjective;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PlayerUI;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar1_Cooldown;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PushTotalkReminder;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USkillWI_C*                             SkillWI;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTeleporterDisplayWI_C*                 TeleporterDisplayWI;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tentacles;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPlayerName;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        UISwitcher;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Tips;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Vignette;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWorldOxygenWI_C*                       WorldOxygenWI_199;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInventory*                             OwningCharacterInventory;                          // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinCooldownDuration;                               // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharacterWI(int32 EntryPoint);
	void OnInitialLoadCompleted();
	void Construct();
	void Anim_Fade_In();
	void Start_Widget_Presentation();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void On_Slot_Cleared(class UPower* PowerChanged, EInventorySlotID SlotId);
	void On_Slot_Assigned(class UPower* PowerChanged, EInventorySlotID SlotId);
	void Update_Equipment_Items();
	void OnInitialized();
	void Update_Item_Slot_Images(class UPower* Power, EInventorySlotID ItemSlot);
	void Anim_Low_Oxygen_Vignette_Stop();
	void Anim_Low_Oxygen_Vignette_Start();
	void SetIconForEquipment(class UTexture2D* Texture, EInventorySlotID EquipmentSlot);
	void ClearEquipmentSlotIfPowerIsNull(EInventorySlotID SlotId);
	void ClearItemSlotImagesIfNull();
	void InitEquipmentIcons();
	void StartCountdown(int32 Time, const class FString& Descriptor);
	void FadeTeleporterDisplay(bool In);
	void Set_Name(const class FString& NewName);
	void UpdateEquipmentInSlots(EInventorySlotID SlotId, class UImage* ImageObject);
	void PlayEquipAnimation(class UTexture2D* Texture);
	void ShowEquippedItemInSlot(class UPower* Power, EInventorySlotID Slot_0);
	void UpdateEquipmentCooldowns();
	void Update_Equipment_Cooldown(class UPower* Power, class UProgressBar* ProgressBar);
	void UpdateNameColor(const struct FLinearColor& Value);
	void Update_Name_Color_if_Player_State_Matches(class APlayerState* PlayerState, const struct FLinearColor& Value);
	void RemoveWidgetsFromBackfill();
	void SetGrayedOutIcon(class UImage* Image_0, class UTexture2D* Icon);
	void SetSolidIcon(class UImage* Image_0, class UTexture2D* Icon);
	void OnPlayerStateReceived(class ASCTPlayerState* PlayerState);
	void AnimateAgendaHUD(class ASCTPlayerState* Player_State);
	void OnAgendaStateChanged(EAgendaObjectState State);
	void BindToReceivedPlayerState();
	void GetSpecialOptions(class Ubp_SpecialOptionsSave_C** AsBp_Special_Options_Save);

	void GetGrayedOutColor(const struct FLinearColor& Color, struct FLinearColor* Output) const;
	void GetSolidColor(const struct FLinearColor& Color, struct FLinearColor* Output) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterWI_C">();
	}
	static class UCharacterWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterWI_C>();
	}
};
static_assert(alignof(UCharacterWI_C) == 0x000008, "Wrong alignment on UCharacterWI_C");
static_assert(sizeof(UCharacterWI_C) == 0x0003C8, "Wrong size on UCharacterWI_C");
static_assert(offsetof(UCharacterWI_C, UberGraphFrame) == 0x000280, "Member 'UCharacterWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, FadePlayerUI) == 0x000288, "Member 'UCharacterWI_C::FadePlayerUI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, LowOxygen) == 0x000290, "Member 'UCharacterWI_C::LowOxygen' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, SelectItem) == 0x000298, "Member 'UCharacterWI_C::SelectItem' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, AgendaHUD) == 0x0002A0, "Member 'UCharacterWI_C::AgendaHUD' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, Canvas_EquippedItems) == 0x0002A8, "Member 'UCharacterWI_C::Canvas_EquippedItems' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, CanvasPanel_0) == 0x0002B0, "Member 'UCharacterWI_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, CharacterOxygenWI) == 0x0002B8, "Member 'UCharacterWI_C::CharacterOxygenWI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, ControllerIconWI) == 0x0002C0, "Member 'UCharacterWI_C::ControllerIconWI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, ControllerIconWI_278) == 0x0002C8, "Member 'UCharacterWI_C::ControllerIconWI_278' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, ControllerIconWI_418) == 0x0002D0, "Member 'UCharacterWI_C::ControllerIconWI_418' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, ControllerIconWI_629) == 0x0002D8, "Member 'UCharacterWI_C::ControllerIconWI_629' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, ControllerIconWI_796) == 0x0002E0, "Member 'UCharacterWI_C::ControllerIconWI_796' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, CountdownWI) == 0x0002E8, "Member 'UCharacterWI_C::CountdownWI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, EmoteMinuswheelReminder) == 0x0002F0, "Member 'UCharacterWI_C::EmoteMinuswheelReminder' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, Equipment_1) == 0x0002F8, "Member 'UCharacterWI_C::Equipment_1' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, EquipmentForAnimation) == 0x000300, "Member 'UCharacterWI_C::EquipmentForAnimation' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, GenericProgressBarWI) == 0x000308, "Member 'UCharacterWI_C::GenericProgressBarWI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, GenericTextFeedbackWI) == 0x000310, "Member 'UCharacterWI_C::GenericTextFeedbackWI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, Image) == 0x000318, "Member 'UCharacterWI_C::Image' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, Image_2) == 0x000320, "Member 'UCharacterWI_C::Image_2' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, Image_76) == 0x000328, "Member 'UCharacterWI_C::Image_76' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, Image_541) == 0x000330, "Member 'UCharacterWI_C::Image_541' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, ItemStacks1WI) == 0x000338, "Member 'UCharacterWI_C::ItemStacks1WI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, KeycardObjectiveWI) == 0x000340, "Member 'UCharacterWI_C::KeycardObjectiveWI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, PassengerLogDisplayWI) == 0x000348, "Member 'UCharacterWI_C::PassengerLogDisplayWI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, PassiveItemWI) == 0x000350, "Member 'UCharacterWI_C::PassiveItemWI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, PlayerObjective) == 0x000358, "Member 'UCharacterWI_C::PlayerObjective' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, PlayerUI) == 0x000360, "Member 'UCharacterWI_C::PlayerUI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, ProgressBar1_Cooldown) == 0x000368, "Member 'UCharacterWI_C::ProgressBar1_Cooldown' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, PushTotalkReminder) == 0x000370, "Member 'UCharacterWI_C::PushTotalkReminder' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, SkillWI) == 0x000378, "Member 'UCharacterWI_C::SkillWI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, TeleporterDisplayWI) == 0x000380, "Member 'UCharacterWI_C::TeleporterDisplayWI' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, Tentacles) == 0x000388, "Member 'UCharacterWI_C::Tentacles' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, TextPlayerName) == 0x000390, "Member 'UCharacterWI_C::TextPlayerName' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, UISwitcher) == 0x000398, "Member 'UCharacterWI_C::UISwitcher' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, VerticalBox_Tips) == 0x0003A0, "Member 'UCharacterWI_C::VerticalBox_Tips' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, Vignette) == 0x0003A8, "Member 'UCharacterWI_C::Vignette' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, WorldOxygenWI_199) == 0x0003B0, "Member 'UCharacterWI_C::WorldOxygenWI_199' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, OwningCharacterInventory) == 0x0003B8, "Member 'UCharacterWI_C::OwningCharacterInventory' has a wrong offset!");
static_assert(offsetof(UCharacterWI_C, MinCooldownDuration) == 0x0003C0, "Member 'UCharacterWI_C::MinCooldownDuration' has a wrong offset!");

}

