#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CigaretteRigAnim_AnimBp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "E_Emotes_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass cigaretteRigAnim_AnimBp.cigaretteRigAnim_AnimBp_C
// 0x07B0 (0x0A70 - 0x02C0)
class UCigaretteRigAnim_AnimBp_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x02F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0370(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x03C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x03E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0488(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x04B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0530(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0560(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x05E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0610(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0690(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x06C0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0740(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0770(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x07F0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0820(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x08A0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x08D0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0950(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0980(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x09B0(0x00B0)()
	E_Emotes                                      IsEmoting;                                         // 0x0A60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CigaretRequest;                                    // 0x0A61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Smoking;                                           // 0x0A62(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A63[0x5];                                      // 0x0A63(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             OwningCharacter;                                   // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_cigaretteRigAnim_AnimBp(int32 EntryPoint);
	void BlueprintBeginPlay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_cigaretteRigAnim_AnimBp_AnimGraphNode_TransitionResult_EDAED50F46E13D120B18619BCDAF7EEF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_cigaretteRigAnim_AnimBp_AnimGraphNode_TransitionResult_CFBE5CE54BA4826676F7CC9FB634A00B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_cigaretteRigAnim_AnimBp_AnimGraphNode_TransitionResult_CE59D47F408831D11D414CB27CEA1CB8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_cigaretteRigAnim_AnimBp_AnimGraphNode_TransitionResult_D22105164B744EA4D49324893F286338();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_cigaretteRigAnim_AnimBp_AnimGraphNode_TransitionResult_217F08F449C3CE93CB312BA4F06430E6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_cigaretteRigAnim_AnimBp_AnimGraphNode_TransitionResult_5D78860242B52FA003DC42825233CAC7();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"cigaretteRigAnim_AnimBp_C">();
	}
	static class UCigaretteRigAnim_AnimBp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCigaretteRigAnim_AnimBp_C>();
	}
};
static_assert(alignof(UCigaretteRigAnim_AnimBp_C) == 0x000010, "Wrong alignment on UCigaretteRigAnim_AnimBp_C");
static_assert(sizeof(UCigaretteRigAnim_AnimBp_C) == 0x000A70, "Wrong size on UCigaretteRigAnim_AnimBp_C");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, UberGraphFrame) == 0x0002C0, "Member 'UCigaretteRigAnim_AnimBp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult_10) == 0x0002F8, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult_9) == 0x000320, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult_8) == 0x000348, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult_7) == 0x000370, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult_6) == 0x000398, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult_5) == 0x0003C0, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult_4) == 0x0003E8, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult_3) == 0x000410, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult_2) == 0x000438, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult_1) == 0x000460, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_TransitionResult) == 0x000488, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_SequencePlayer_6) == 0x0004B0, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_StateResult_7) == 0x000530, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_SequencePlayer_5) == 0x000560, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_StateResult_6) == 0x0005E0, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_SequencePlayer_4) == 0x000610, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_StateResult_5) == 0x000690, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_SequencePlayer_3) == 0x0006C0, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_StateResult_4) == 0x000740, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_SequencePlayer_2) == 0x000770, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_StateResult_3) == 0x0007F0, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_SequencePlayer_1) == 0x000820, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_StateResult_2) == 0x0008A0, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_SequencePlayer) == 0x0008D0, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_StateResult_1) == 0x000950, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_StateResult) == 0x000980, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, AnimGraphNode_StateMachine) == 0x0009B0, "Member 'UCigaretteRigAnim_AnimBp_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, IsEmoting) == 0x000A60, "Member 'UCigaretteRigAnim_AnimBp_C::IsEmoting' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, CigaretRequest) == 0x000A61, "Member 'UCigaretteRigAnim_AnimBp_C::CigaretRequest' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, Smoking) == 0x000A62, "Member 'UCigaretteRigAnim_AnimBp_C::Smoking' has a wrong offset!");
static_assert(offsetof(UCigaretteRigAnim_AnimBp_C, OwningCharacter) == 0x000A68, "Member 'UCigaretteRigAnim_AnimBp_C::OwningCharacter' has a wrong offset!");

}

