#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cigarette

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Cigarette.Cigarette_C
// 0x0028 (0x0248 - 0x0220)
class ACigarette_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Cigarette(int32 EntryPoint);
	void Light_Cigaret();
	void Simulate_Phyics();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cigarette_C">();
	}
	static class ACigarette_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACigarette_C>();
	}
};
static_assert(alignof(ACigarette_C) == 0x000008, "Wrong alignment on ACigarette_C");
static_assert(sizeof(ACigarette_C) == 0x000248, "Wrong size on ACigarette_C");
static_assert(offsetof(ACigarette_C, UberGraphFrame) == 0x000220, "Member 'ACigarette_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACigarette_C, SkeletalMesh) == 0x000228, "Member 'ACigarette_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ACigarette_C, ParticleSystem) == 0x000230, "Member 'ACigarette_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ACigarette_C, Cylinder) == 0x000238, "Member 'ACigarette_C::Cylinder' has a wrong offset!");
static_assert(offsetof(ACigarette_C, DefaultSceneRoot) == 0x000240, "Member 'ACigarette_C::DefaultSceneRoot' has a wrong offset!");

}

