#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CigaretteDispenser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseInteractableSCTBP_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CigaretteDispenser.CigaretteDispenser_C
// 0x0040 (0x0290 - 0x0250)
class ACigaretteDispenser_C final : public ABaseInteractableSCTBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CigaretteDispenser_C;               // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh3;                              // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh2;                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh1;                              // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAkComponent*                           AK1;                                               // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ACigarette_C*                           Cigaret;                                           // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CigaretteDispenser(int32 EntryPoint);
	void Audio_Released();
	void Audio_Pressed();
	void ReceiveBeginPlay();
	void BndEvt__ContextStaticMesh_K2Node_ComponentBoundEvent_2_PriorityDelegate__DelegateSignature();
	void BndEvt__ContextStaticMesh_K2Node_ComponentBoundEvent_3_PriorityDelegate__DelegateSignature();
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_4_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void Spawn_and_Attach_Smoke(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CigaretteDispenser_C">();
	}
	static class ACigaretteDispenser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACigaretteDispenser_C>();
	}
};
static_assert(alignof(ACigaretteDispenser_C) == 0x000008, "Wrong alignment on ACigaretteDispenser_C");
static_assert(sizeof(ACigaretteDispenser_C) == 0x000290, "Wrong size on ACigaretteDispenser_C");
static_assert(offsetof(ACigaretteDispenser_C, UberGraphFrame_CigaretteDispenser_C) == 0x000250, "Member 'ACigaretteDispenser_C::UberGraphFrame_CigaretteDispenser_C' has a wrong offset!");
static_assert(offsetof(ACigaretteDispenser_C, InstancedStaticMesh3) == 0x000258, "Member 'ACigaretteDispenser_C::InstancedStaticMesh3' has a wrong offset!");
static_assert(offsetof(ACigaretteDispenser_C, InstancedStaticMesh2) == 0x000260, "Member 'ACigaretteDispenser_C::InstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ACigaretteDispenser_C, InstancedStaticMesh1) == 0x000268, "Member 'ACigaretteDispenser_C::InstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ACigaretteDispenser_C, InstancedStaticMesh) == 0x000270, "Member 'ACigaretteDispenser_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ACigaretteDispenser_C, AK1) == 0x000278, "Member 'ACigaretteDispenser_C::AK1' has a wrong offset!");
static_assert(offsetof(ACigaretteDispenser_C, Ak) == 0x000280, "Member 'ACigaretteDispenser_C::Ak' has a wrong offset!");
static_assert(offsetof(ACigaretteDispenser_C, Cigaret) == 0x000288, "Member 'ACigaretteDispenser_C::Cigaret' has a wrong offset!");

}

