#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cigarette

#include "Basic.hpp"


namespace SDK::Params
{

// Function Cigarette.Cigarette_C.ExecuteUbergraph_Cigarette
// 0x0038 (0x0038 - 0x0000)
struct Cigarette_C_ExecuteUbergraph_Cigarette final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCigaretteRigAnim_AnimBp_C*             K2Node_DynamicCast_AsCigarette_Rig_Anim_Anim_Bp;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cigarette_C_ExecuteUbergraph_Cigarette) == 0x000008, "Wrong alignment on Cigarette_C_ExecuteUbergraph_Cigarette");
static_assert(sizeof(Cigarette_C_ExecuteUbergraph_Cigarette) == 0x000038, "Wrong size on Cigarette_C_ExecuteUbergraph_Cigarette");
static_assert(offsetof(Cigarette_C_ExecuteUbergraph_Cigarette, EntryPoint) == 0x000000, "Member 'Cigarette_C_ExecuteUbergraph_Cigarette::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cigarette_C_ExecuteUbergraph_Cigarette, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Cigarette_C_ExecuteUbergraph_Cigarette::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cigarette_C_ExecuteUbergraph_Cigarette, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'Cigarette_C_ExecuteUbergraph_Cigarette::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cigarette_C_ExecuteUbergraph_Cigarette, K2Node_DynamicCast_AsCharacter) == 0x000018, "Member 'Cigarette_C_ExecuteUbergraph_Cigarette::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(Cigarette_C_ExecuteUbergraph_Cigarette, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Cigarette_C_ExecuteUbergraph_Cigarette::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cigarette_C_ExecuteUbergraph_Cigarette, K2Node_DynamicCast_AsCigarette_Rig_Anim_Anim_Bp) == 0x000028, "Member 'Cigarette_C_ExecuteUbergraph_Cigarette::K2Node_DynamicCast_AsCigarette_Rig_Anim_Anim_Bp' has a wrong offset!");
static_assert(offsetof(Cigarette_C_ExecuteUbergraph_Cigarette, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Cigarette_C_ExecuteUbergraph_Cigarette::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

