#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_BanMessageContentDialog

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CM_BanMessageContentDialog.CM_BanMessageContentDialog_C.ExecuteUbergraph_CM_BanMessageContentDialog
// 0x0040 (0x0040 - 0x0000)
struct CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog) == 0x000004, "Wrong alignment on CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog");
static_assert(sizeof(CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog) == 0x000040, "Wrong size on CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog");
static_assert(offsetof(CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog, EntryPoint) == 0x000000, "Member 'CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog, K2Node_Event_MyGeometry) == 0x000004, "Member 'CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'CM_BanMessageContentDialog_C_ExecuteUbergraph_CM_BanMessageContentDialog::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function CM_BanMessageContentDialog.CM_BanMessageContentDialog_C.Tick
// 0x003C (0x003C - 0x0000)
struct CM_BanMessageContentDialog_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_BanMessageContentDialog_C_Tick) == 0x000004, "Wrong alignment on CM_BanMessageContentDialog_C_Tick");
static_assert(sizeof(CM_BanMessageContentDialog_C_Tick) == 0x00003C, "Wrong size on CM_BanMessageContentDialog_C_Tick");
static_assert(offsetof(CM_BanMessageContentDialog_C_Tick, MyGeometry) == 0x000000, "Member 'CM_BanMessageContentDialog_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_Tick, InDeltaTime) == 0x000038, "Member 'CM_BanMessageContentDialog_C_Tick::InDeltaTime' has a wrong offset!");

// Function CM_BanMessageContentDialog.CM_BanMessageContentDialog_C.SetUI
// 0x00D0 (0x00D0 - 0x0000)
struct CM_BanMessageContentDialog_C_SetUI final
{
public:
	class FString                                 Seconds;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Minutes;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Hours;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Days;                                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0040(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0050(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Map_Find_Value;                           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Map_Find_Value_1;                         // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_FormatAccelByteDateTimeToUnrealDateTime_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_BanMessageContentDialog_C_SetUI) == 0x000008, "Wrong alignment on CM_BanMessageContentDialog_C_SetUI");
static_assert(sizeof(CM_BanMessageContentDialog_C_SetUI) == 0x0000D0, "Wrong size on CM_BanMessageContentDialog_C_SetUI");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, Seconds) == 0x000000, "Member 'CM_BanMessageContentDialog_C_SetUI::Seconds' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, Minutes) == 0x000010, "Member 'CM_BanMessageContentDialog_C_SetUI::Minutes' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, Hours) == 0x000020, "Member 'CM_BanMessageContentDialog_C_SetUI::Hours' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, Days) == 0x000030, "Member 'CM_BanMessageContentDialog_C_SetUI::Days' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, Temp_string_Variable) == 0x000040, "Member 'CM_BanMessageContentDialog_C_SetUI::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, Temp_string_Variable_1) == 0x000050, "Member 'CM_BanMessageContentDialog_C_SetUI::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'CM_BanMessageContentDialog_C_SetUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_Map_Find_Value) == 0x000070, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_Map_Find_Value_1) == 0x000088, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_Map_Find_ReturnValue_1) == 0x000098, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_FormatAccelByteDateTimeToUnrealDateTime_ReturnValue) == 0x0000A0, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_FormatAccelByteDateTimeToUnrealDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, K2Node_SwitchString_CmpSuccess) == 0x0000A8, "Member 'CM_BanMessageContentDialog_C_SetUI::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_BreakDateTime_Year) == 0x0000AC, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_BreakDateTime_Month) == 0x0000B0, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_BreakDateTime_Day) == 0x0000B4, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_BreakDateTime_Hour) == 0x0000B8, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_BreakDateTime_Minute) == 0x0000BC, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_BreakDateTime_Second) == 0x0000C0, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_BreakDateTime_Millisecond) == 0x0000C4, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_SetUI, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'CM_BanMessageContentDialog_C_SetUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function CM_BanMessageContentDialog.CM_BanMessageContentDialog_C.Format Time ValueAsString
// 0x0040 (0x0040 - 0x0000)
struct CM_BanMessageContentDialog_C_Format_Time_ValueAsString final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_BanMessageContentDialog_C_Format_Time_ValueAsString) == 0x000008, "Wrong alignment on CM_BanMessageContentDialog_C_Format_Time_ValueAsString");
static_assert(sizeof(CM_BanMessageContentDialog_C_Format_Time_ValueAsString) == 0x000040, "Wrong size on CM_BanMessageContentDialog_C_Format_Time_ValueAsString");
static_assert(offsetof(CM_BanMessageContentDialog_C_Format_Time_ValueAsString, Value) == 0x000000, "Member 'CM_BanMessageContentDialog_C_Format_Time_ValueAsString::Value' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_Format_Time_ValueAsString, ReturnValue) == 0x000008, "Member 'CM_BanMessageContentDialog_C_Format_Time_ValueAsString::ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_Format_Time_ValueAsString, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'CM_BanMessageContentDialog_C_Format_Time_ValueAsString::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_Format_Time_ValueAsString, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'CM_BanMessageContentDialog_C_Format_Time_ValueAsString::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_Format_Time_ValueAsString, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'CM_BanMessageContentDialog_C_Format_Time_ValueAsString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function CM_BanMessageContentDialog.CM_BanMessageContentDialog_C.UpdateTimeRemaining
// 0x0118 (0x0118 - 0x0000)
struct CM_BanMessageContentDialog_C_UpdateTimeRemaining final
{
public:
	class FString                                 Temp_string_Variable;                              // 0x0000(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Map_Find_Value;                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_FormatAccelByteDateTimeToUnrealDateTime_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Days;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_TimespanTimespan_ReturnValue;        // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_Time_ValueAsString_ReturnValue;    // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_Time_ValueAsString_ReturnValue_1;  // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_Time_ValueAsString_ReturnValue_2;  // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_Time_ValueAsString_ReturnValue_3;  // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0100(0x0018)()
};
static_assert(alignof(CM_BanMessageContentDialog_C_UpdateTimeRemaining) == 0x000008, "Wrong alignment on CM_BanMessageContentDialog_C_UpdateTimeRemaining");
static_assert(sizeof(CM_BanMessageContentDialog_C_UpdateTimeRemaining) == 0x000118, "Wrong size on CM_BanMessageContentDialog_C_UpdateTimeRemaining");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, Temp_string_Variable) == 0x000000, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Map_Find_Value) == 0x000010, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_MakeTimespan_ReturnValue) == 0x000028, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_FormatAccelByteDateTimeToUnrealDateTime_ReturnValue) == 0x000030, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_FormatAccelByteDateTimeToUnrealDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_UtcNow_ReturnValue) == 0x000038, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000040, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_BreakTimespan_Days) == 0x000048, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_BreakTimespan_Days' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_BreakTimespan_Hours) == 0x00004C, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_BreakTimespan_Hours' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_BreakTimespan_Minutes) == 0x000050, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_BreakTimespan_Minutes' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_BreakTimespan_Seconds) == 0x000054, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_BreakTimespan_Seconds' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_BreakTimespan_Milliseconds) == 0x000058, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_BreakTimespan_Milliseconds' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Less_TimespanTimespan_ReturnValue) == 0x00005C, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Less_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Format_Time_ValueAsString_ReturnValue) == 0x000060, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Format_Time_ValueAsString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Format_Time_ValueAsString_ReturnValue_1) == 0x000070, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Format_Time_ValueAsString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Format_Time_ValueAsString_ReturnValue_2) == 0x000080, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Format_Time_ValueAsString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Format_Time_ValueAsString_ReturnValue_3) == 0x000090, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Format_Time_ValueAsString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A0, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B0, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C0, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D0, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E0, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000F0, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CM_BanMessageContentDialog_C_UpdateTimeRemaining, CallFunc_Conv_StringToText_ReturnValue) == 0x000100, "Member 'CM_BanMessageContentDialog_C_UpdateTimeRemaining::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

