#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_ContentDialogWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CM_ContentDialogWrapper.CM_ContentDialogWrapper_C.ExecuteUbergraph_CM_ContentDialogWrapper
// 0x0080 (0x0080 - 0x0000)
struct CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCM_ContentDialog_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Timer;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_2;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_3;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper) == 0x000008, "Wrong alignment on CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper");
static_assert(sizeof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper) == 0x000080, "Wrong size on CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, EntryPoint) == 0x000000, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_Create_ReturnValue) == 0x000008, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_Not_PreBool_ReturnValue_1) == 0x000031, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, K2Node_CustomEvent_Timer) == 0x000050, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::K2Node_CustomEvent_Timer' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_GetRenderOpacity_ReturnValue) == 0x000054, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x000058, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000068, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_GetRenderOpacity_ReturnValue_2) == 0x000070, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_GetRenderOpacity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000074, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_GetRenderOpacity_ReturnValue_3) == 0x000078, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_GetRenderOpacity_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00007C, "Member 'CM_ContentDialogWrapper_C_ExecuteUbergraph_CM_ContentDialogWrapper::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function CM_ContentDialogWrapper.CM_ContentDialogWrapper_C.OnStartFadeTransition
// 0x0004 (0x0004 - 0x0000)
struct CM_ContentDialogWrapper_C_OnStartFadeTransition final
{
public:
	float                                         Timer;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ContentDialogWrapper_C_OnStartFadeTransition) == 0x000004, "Wrong alignment on CM_ContentDialogWrapper_C_OnStartFadeTransition");
static_assert(sizeof(CM_ContentDialogWrapper_C_OnStartFadeTransition) == 0x000004, "Wrong size on CM_ContentDialogWrapper_C_OnStartFadeTransition");
static_assert(offsetof(CM_ContentDialogWrapper_C_OnStartFadeTransition, Timer) == 0x000000, "Member 'CM_ContentDialogWrapper_C_OnStartFadeTransition::Timer' has a wrong offset!");

// Function CM_ContentDialogWrapper.CM_ContentDialogWrapper_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_ContentDialogWrapper_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ContentDialogWrapper_C_PreConstruct) == 0x000001, "Wrong alignment on CM_ContentDialogWrapper_C_PreConstruct");
static_assert(sizeof(CM_ContentDialogWrapper_C_PreConstruct) == 0x000001, "Wrong size on CM_ContentDialogWrapper_C_PreConstruct");
static_assert(offsetof(CM_ContentDialogWrapper_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_ContentDialogWrapper_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_ContentDialogWrapper.CM_ContentDialogWrapper_C.Add Content
// 0x0010 (0x0010 - 0x0000)
struct CM_ContentDialogWrapper_C_Add_Content final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ContentDialogWrapper_C_Add_Content) == 0x000008, "Wrong alignment on CM_ContentDialogWrapper_C_Add_Content");
static_assert(sizeof(CM_ContentDialogWrapper_C_Add_Content) == 0x000010, "Wrong size on CM_ContentDialogWrapper_C_Add_Content");
static_assert(offsetof(CM_ContentDialogWrapper_C_Add_Content, Widget) == 0x000000, "Member 'CM_ContentDialogWrapper_C_Add_Content::Widget' has a wrong offset!");
static_assert(offsetof(CM_ContentDialogWrapper_C_Add_Content, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000008, "Member 'CM_ContentDialogWrapper_C_Add_Content::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

}

