#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_CustomGameMenu

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "Engine_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"


namespace SDK::Params
{

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.OnReceivedMatchmakingResponse__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CM_CustomGameMenu_C_OnReceivedMatchmakingResponse__DelegateSignature final
{
public:
	EAccelByteMatchmakingStatus                   Response;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_OnReceivedMatchmakingResponse__DelegateSignature) == 0x000001, "Wrong alignment on CM_CustomGameMenu_C_OnReceivedMatchmakingResponse__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_OnReceivedMatchmakingResponse__DelegateSignature) == 0x000001, "Wrong size on CM_CustomGameMenu_C_OnReceivedMatchmakingResponse__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_OnReceivedMatchmakingResponse__DelegateSignature, Response) == 0x000000, "Member 'CM_CustomGameMenu_C_OnReceivedMatchmakingResponse__DelegateSignature::Response' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.ExecuteUbergraph_CM_CustomGameMenu
// 0x0430 (0x0430 - 0x0000)
struct CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTMatchmakingManagementCallbackProxy* CallFunc_SendReadyConsent_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTMatchmakingManagementCallbackProxy* CallFunc_CancelMatchmaking_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTMatchmakingManagementCallbackProxy* CallFunc_CancelMatchmaking_ReturnValue_1;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomGameSettingsGIS*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsInfoPartyResponse      K2Node_CustomEvent_PartyInfo;                      // 0x00B0(0x0070)()
	TDelegate<void(const struct FAccelByteModelsInfoPartyResponse& PartyInfo)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	struct FAccelByteModelsInfoPartyResponse      Temp_struct_Variable;                              // 0x0130(0x0070)()
	class UFCTPartyInfoCallbackProxy*             CallFunc_GetPartyInfo_ReturnValue;                 // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_12;               // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomGameSettings                    CallFunc_GetDefaultCustomGameSettings_ReturnValue; // 0x01B8(0x0034)(NoDestructor)
	float                                         K2Node_ComponentBoundEvent_Value_11;               // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomGameSettings                    CallFunc_GetDefaultCustomGameSettings_ReturnValue_1; // 0x01F4(0x0034)(NoDestructor)
	struct FCustomGameSettings                    CallFunc_GetDefaultCustomGameSettings_ReturnValue_2; // 0x0228(0x0034)(NoDestructor)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAccelByteModelsMatchmakingNotice      K2Node_Event_Notification;                         // 0x0260(0x0060)(ConstParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetABGameMode_GameMode;                   // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Host_Preference_Settings_Out_AllowCrossPlatformPlay; // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_Host_Preference_Settings_Out_Matchmaker_Language; // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTMatchmakingManagementCallbackProxy* CallFunc_StartMatchmaking_ReturnValue;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x02F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_10;               // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_AccelBytePartyMemberList_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0318(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_AccelBytePartyMemberList_C*         CallFunc_Array_Get_Item;                           // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_LeaderId;                       // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& LeaderId)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0340(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0354(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_Value_9;                // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_8;                // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_7;                // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_6;                // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_5;                // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOn_ReturnValue;                         // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_4;                // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_3;                // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOn_ReturnValue_1;                       // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPartySizeRequired_Return_Value;        // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartySizeRequired_Return_Value_1;      // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x03B8(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0400(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0410(0x0018)()
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu) == 0x000008, "Wrong alignment on CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu");
static_assert(sizeof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu) == 0x000430, "Wrong size on CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, EntryPoint) == 0x000000, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_SendReadyConsent_ReturnValue) == 0x000008, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_SendReadyConsent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_CancelMatchmaking_ReturnValue) == 0x000058, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_CancelMatchmaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x000060, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x000074, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_CancelMatchmaking_ReturnValue_1) == 0x000088, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_CancelMatchmaking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000090, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate_6) == 0x00009C, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CustomEvent_PartyInfo) == 0x0000B0, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CustomEvent_PartyInfo' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate_7) == 0x000120, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, Temp_struct_Variable) == 0x000130, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_GetPartyInfo_ReturnValue) == 0x0001A0, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_GetPartyInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_IsValid_ReturnValue_3) == 0x0001A8, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_12) == 0x0001AC, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_12' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_FTrunc_ReturnValue) == 0x0001B4, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_GetDefaultCustomGameSettings_ReturnValue) == 0x0001B8, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_GetDefaultCustomGameSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_11) == 0x0001EC, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_11' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_FTrunc_ReturnValue_1) == 0x0001F0, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_GetDefaultCustomGameSettings_ReturnValue_1) == 0x0001F4, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_GetDefaultCustomGameSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_GetDefaultCustomGameSettings_ReturnValue_2) == 0x000228, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_GetDefaultCustomGameSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_Event_Notification) == 0x000260, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_Event_Notification' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002C0, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_GetABGameMode_GameMode) == 0x0002C8, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_GetABGameMode_GameMode' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Get_Host_Preference_Settings_Out_AllowCrossPlatformPlay) == 0x0002D8, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Get_Host_Preference_Settings_Out_AllowCrossPlatformPlay' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Get_Host_Preference_Settings_Out_Matchmaker_Language) == 0x0002E0, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Get_Host_Preference_Settings_Out_Matchmaker_Language' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_StartMatchmaking_ReturnValue) == 0x0002F0, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_StartMatchmaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate_8) == 0x0002F8, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_IsValid_ReturnValue_4) == 0x000308, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_10) == 0x00030C, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_10' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000310, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000318, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Array_Get_Item) == 0x000328, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CustomEvent_LeaderId) == 0x000330, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CustomEvent_LeaderId' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate_9) == 0x000340, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000350, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_CreateDelegate_OutputDelegate_10) == 0x000354, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_9) == 0x000364, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_9' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000368, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_8) == 0x00036C, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_8' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000370, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_7) == 0x000374, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_7' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000378, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_6) == 0x00037C, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_6' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x000380, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_5) == 0x000384, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_5' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Divide_FloatFloat_ReturnValue_5) == 0x000388, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Divide_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_IsOn_ReturnValue) == 0x00038C, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_IsOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_4) == 0x000390, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_4' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_3) == 0x000394, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_3' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_2) == 0x000398, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_IsOn_ReturnValue_1) == 0x00039C, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_IsOn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Divide_FloatFloat_ReturnValue_6) == 0x0003A0, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Divide_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_GetPartySizeRequired_Return_Value) == 0x0003A4, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_GetPartySizeRequired_Return_Value' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0003A8, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_GetPartySizeRequired_Return_Value_1) == 0x0003AC, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_GetPartySizeRequired_Return_Value_1' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value_1) == 0x0003B0, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_MakeStruct_FormatArgumentData) == 0x0003B8, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_FTrunc_ReturnValue_2) == 0x0003F8, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_MakeArray_Array) == 0x000400, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_Format_ReturnValue) == 0x000410, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, K2Node_ComponentBoundEvent_Value) == 0x000428, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu, CallFunc_FTrunc_ReturnValue_3) == 0x00042C, "Member 'CM_CustomGameMenu_C_ExecuteUbergraph_CM_CustomGameMenu::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_MaxPersonoids_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MaxPersonoids_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MaxPersonoids_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MaxPersonoids_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MaxPersonoids_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MaxPersonoids_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MaxPersonoids_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MaxPersonoids_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_MinimumPersonoids_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MinimumPersonoids_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MinimumPersonoids_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MinimumPersonoids_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MinimumPersonoids_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MinimumPersonoids_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MinimumPersonoids_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_MinimumPersonoids_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_PassengerLogMultiplier_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_PassengerLogMultiplier_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_PassengerLogMultiplier_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_PassengerLogMultiplier_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_PassengerLogMultiplier_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_PassengerLogMultiplier_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_PassengerLogMultiplier_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_PassengerLogMultiplier_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_CatastropheEventsEnabled_K2Node_ComponentBoundEvent_16_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_CatastropheEventsEnabled_K2Node_ComponentBoundEvent_16_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_CatastropheEventsEnabled_K2Node_ComponentBoundEvent_16_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_CatastropheEventsEnabled_K2Node_ComponentBoundEvent_16_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_CatastropheEventsEnabled_K2Node_ComponentBoundEvent_16_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_CatastropheEventsEnabled_K2Node_ComponentBoundEvent_16_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_CatastropheEventsEnabled_K2Node_ComponentBoundEvent_16_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_CatastropheEventsEnabled_K2Node_ComponentBoundEvent_16_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_HiddenPersonoids_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_HiddenPersonoids_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_HiddenPersonoids_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_HiddenPersonoids_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_HiddenPersonoids_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_HiddenPersonoids_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_HiddenPersonoids_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_HiddenPersonoids_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_OxygenCanisterMultiplier_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenCanisterMultiplier_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenCanisterMultiplier_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenCanisterMultiplier_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenCanisterMultiplier_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenCanisterMultiplier_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenCanisterMultiplier_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenCanisterMultiplier_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_OxygenGeneratorFailedMultiplier_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorFailedMultiplier_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorFailedMultiplier_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorFailedMultiplier_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorFailedMultiplier_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorFailedMultiplier_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorFailedMultiplier_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorFailedMultiplier_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_OxygenGeneratorRepairMultiplier_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorRepairMultiplier_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorRepairMultiplier_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorRepairMultiplier_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorRepairMultiplier_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorRepairMultiplier_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorRepairMultiplier_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorRepairMultiplier_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_OxygenOutletSabotageMultiplier_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenOutletSabotageMultiplier_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenOutletSabotageMultiplier_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenOutletSabotageMultiplier_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenOutletSabotageMultiplier_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenOutletSabotageMultiplier_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenOutletSabotageMultiplier_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenOutletSabotageMultiplier_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_OxygenGeneratorMultiplier_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorMultiplier_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorMultiplier_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorMultiplier_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorMultiplier_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorMultiplier_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorMultiplier_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenGeneratorMultiplier_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.OnMemberLeftParty
// 0x0010 (0x0010 - 0x0000)
struct CM_CustomGameMenu_C_OnMemberLeftParty final
{
public:
	class FString                                 LeaderId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_OnMemberLeftParty) == 0x000008, "Wrong alignment on CM_CustomGameMenu_C_OnMemberLeftParty");
static_assert(sizeof(CM_CustomGameMenu_C_OnMemberLeftParty) == 0x000010, "Wrong size on CM_CustomGameMenu_C_OnMemberLeftParty");
static_assert(offsetof(CM_CustomGameMenu_C_OnMemberLeftParty, LeaderId) == 0x000000, "Member 'CM_CustomGameMenu_C_OnMemberLeftParty::LeaderId' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_OxygenMultiplier_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenMultiplier_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenMultiplier_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenMultiplier_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenMultiplier_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenMultiplier_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenMultiplier_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_OxygenMultiplier_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.OnMatchmakingNotif
// 0x0060 (0x0060 - 0x0000)
struct CM_CustomGameMenu_C_OnMatchmakingNotif final
{
public:
	struct FAccelByteModelsMatchmakingNotice      Notification;                                      // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CM_CustomGameMenu_C_OnMatchmakingNotif) == 0x000008, "Wrong alignment on CM_CustomGameMenu_C_OnMatchmakingNotif");
static_assert(sizeof(CM_CustomGameMenu_C_OnMatchmakingNotif) == 0x000060, "Wrong size on CM_CustomGameMenu_C_OnMatchmakingNotif");
static_assert(offsetof(CM_CustomGameMenu_C_OnMatchmakingNotif, Notification) == 0x000000, "Member 'CM_CustomGameMenu_C_OnMatchmakingNotif::Notification' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_AmounOfMainAreas_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmounOfMainAreas_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmounOfMainAreas_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmounOfMainAreas_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmounOfMainAreas_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmounOfMainAreas_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmounOfMainAreas_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmounOfMainAreas_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.BndEvt__CM_CustomGameMenu_AmountOfSyringes_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmountOfSyringes_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmountOfSyringes_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmountOfSyringes_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(sizeof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmountOfSyringes_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmountOfSyringes_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(offsetof(CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmountOfSyringes_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'CM_CustomGameMenu_C_BndEvt__CM_CustomGameMenu_AmountOfSyringes_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.OnSuccess_D2C26E47406E32BA9BA45CB6310AEB08
// 0x0070 (0x0070 - 0x0000)
struct CM_CustomGameMenu_C_OnSuccess_D2C26E47406E32BA9BA45CB6310AEB08 final
{
public:
	struct FAccelByteModelsInfoPartyResponse      PartyInfo;                                         // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CM_CustomGameMenu_C_OnSuccess_D2C26E47406E32BA9BA45CB6310AEB08) == 0x000008, "Wrong alignment on CM_CustomGameMenu_C_OnSuccess_D2C26E47406E32BA9BA45CB6310AEB08");
static_assert(sizeof(CM_CustomGameMenu_C_OnSuccess_D2C26E47406E32BA9BA45CB6310AEB08) == 0x000070, "Wrong size on CM_CustomGameMenu_C_OnSuccess_D2C26E47406E32BA9BA45CB6310AEB08");
static_assert(offsetof(CM_CustomGameMenu_C_OnSuccess_D2C26E47406E32BA9BA45CB6310AEB08, PartyInfo) == 0x000000, "Member 'CM_CustomGameMenu_C_OnSuccess_D2C26E47406E32BA9BA45CB6310AEB08::PartyInfo' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.MinPersonoidsValueChanged
// 0x0010 (0x0010 - 0x0000)
struct CM_CustomGameMenu_C_MinPersonoidsValueChanged final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Slider_Bar_ValueAsInt_OutValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Slider_Bar_ValueAsInt_OutValue_1;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_CustomGameMenu_C_MinPersonoidsValueChanged) == 0x000004, "Wrong alignment on CM_CustomGameMenu_C_MinPersonoidsValueChanged");
static_assert(sizeof(CM_CustomGameMenu_C_MinPersonoidsValueChanged) == 0x000010, "Wrong size on CM_CustomGameMenu_C_MinPersonoidsValueChanged");
static_assert(offsetof(CM_CustomGameMenu_C_MinPersonoidsValueChanged, InValue) == 0x000000, "Member 'CM_CustomGameMenu_C_MinPersonoidsValueChanged::InValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_MinPersonoidsValueChanged, CallFunc_Get_Slider_Bar_ValueAsInt_OutValue) == 0x000004, "Member 'CM_CustomGameMenu_C_MinPersonoidsValueChanged::CallFunc_Get_Slider_Bar_ValueAsInt_OutValue' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_MinPersonoidsValueChanged, CallFunc_Get_Slider_Bar_ValueAsInt_OutValue_1) == 0x000008, "Member 'CM_CustomGameMenu_C_MinPersonoidsValueChanged::CallFunc_Get_Slider_Bar_ValueAsInt_OutValue_1' has a wrong offset!");
static_assert(offsetof(CM_CustomGameMenu_C_MinPersonoidsValueChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'CM_CustomGameMenu_C_MinPersonoidsValueChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function CM_CustomGameMenu.CM_CustomGameMenu_C.Max Personoids Value Changed
// 0x0010 (0x0010 - 0x0000)
struct CM_CustomGameMenu_C_Max_Personoids_Value_Changed final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
