#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_CrossplayNotificationPopUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_CrossplayNotificationPopUp.CM_CrossplayNotificationPopUp_C
// 0x0040 (0x02A0 - 0x0260)
class UCM_CrossplayNotificationPopUp_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_ClickableSubTitleWI_C*              ConfirmButton;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_34;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_113;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_189;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                YesButton;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CustomizationMenu_C*                Parent;                                            // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_CrossplayNotificationPopUp(int32 EntryPoint);
	void BndEvt__CM_CrossplayNotificationPopUp2_ConfirmButton_K2Node_ComponentBoundEvent_5_OnPressed_0__DelegateSignature();
	void BndEvt__CM_CrossplayNotificationPopUp2_ConfirmButton_K2Node_ComponentBoundEvent_4_OnButtonState__DelegateSignature();
	void BndEvt__CM_SaveCharacterPopup_Button_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_CrossplayNotificationPopUp_C">();
	}
	static class UCM_CrossplayNotificationPopUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_CrossplayNotificationPopUp_C>();
	}
};
static_assert(alignof(UCM_CrossplayNotificationPopUp_C) == 0x000008, "Wrong alignment on UCM_CrossplayNotificationPopUp_C");
static_assert(sizeof(UCM_CrossplayNotificationPopUp_C) == 0x0002A0, "Wrong size on UCM_CrossplayNotificationPopUp_C");
static_assert(offsetof(UCM_CrossplayNotificationPopUp_C, UberGraphFrame) == 0x000260, "Member 'UCM_CrossplayNotificationPopUp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_CrossplayNotificationPopUp_C, ConfirmButton) == 0x000268, "Member 'UCM_CrossplayNotificationPopUp_C::ConfirmButton' has a wrong offset!");
static_assert(offsetof(UCM_CrossplayNotificationPopUp_C, Image) == 0x000270, "Member 'UCM_CrossplayNotificationPopUp_C::Image' has a wrong offset!");
static_assert(offsetof(UCM_CrossplayNotificationPopUp_C, Image_34) == 0x000278, "Member 'UCM_CrossplayNotificationPopUp_C::Image_34' has a wrong offset!");
static_assert(offsetof(UCM_CrossplayNotificationPopUp_C, Image_113) == 0x000280, "Member 'UCM_CrossplayNotificationPopUp_C::Image_113' has a wrong offset!");
static_assert(offsetof(UCM_CrossplayNotificationPopUp_C, Image_189) == 0x000288, "Member 'UCM_CrossplayNotificationPopUp_C::Image_189' has a wrong offset!");
static_assert(offsetof(UCM_CrossplayNotificationPopUp_C, YesButton) == 0x000290, "Member 'UCM_CrossplayNotificationPopUp_C::YesButton' has a wrong offset!");
static_assert(offsetof(UCM_CrossplayNotificationPopUp_C, Parent) == 0x000298, "Member 'UCM_CrossplayNotificationPopUp_C::Parent' has a wrong offset!");

}

