#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_ClickableSubTitleWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ETitleStyle_structs.hpp"
#include "SCT_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.ExecuteUbergraph_CM_ClickableSubTitleWI
// 0x0120 (0x0120 - 0x0000)
struct CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0044(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_InvalidateTimerHandle_ReturnValue;     // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHoldProgress_Progress;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInActiveMenu_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWidgetInAnyMenu_ReturnValue;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsWidgetInActiveMenu_ReturnValue_1;       // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWidgetInAnyMenu_ReturnValue_1;          // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0108(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0110(0x0008)(NoDestructor)
	bool                                          K2Node_CustomEvent_bInHoldStateHasSound;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI) == 0x000008, "Wrong alignment on CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI");
static_assert(sizeof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI) == 0x000120, "Wrong size on CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, EntryPoint) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, K2Node_Event_IsDesignTime) == 0x000040, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, K2Node_Event_MyGeometry) == 0x000044, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, K2Node_Event_InDeltaTime) == 0x00007C, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_MakeVector2D_ReturnValue) == 0x000080, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000088, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_MakeVector2D_ReturnValue_1) == 0x00008C, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000094, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_MakeVector2D_ReturnValue_2) == 0x000098, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_Not_PreBool_ReturnValue) == 0x0000A0, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_NotEqual_NameName_ReturnValue) == 0x0000B0, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_K2_InvalidateTimerHandle_ReturnValue) == 0x0000B8, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_K2_InvalidateTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000C0, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C8, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D0, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_GetHoldProgress_Progress) == 0x0000D4, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_GetHoldProgress_Progress' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_IsWidgetInActiveMenu_ReturnValue) == 0x0000D8, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_IsWidgetInActiveMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_IsWidgetInAnyMenu_ReturnValue) == 0x0000D9, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_IsWidgetInAnyMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000DA, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000DC, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000EC, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_IsWidgetInActiveMenu_ReturnValue_1) == 0x0000FC, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_IsWidgetInActiveMenu_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_IsWidgetInAnyMenu_ReturnValue_1) == 0x0000FD, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_IsWidgetInAnyMenu_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000FE, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000FF, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_BooleanAND_ReturnValue) == 0x000100, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000101, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_BooleanAND_ReturnValue_1) == 0x000102, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_Not_PreBool_ReturnValue_4) == 0x000103, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, CallFunc_BooleanAND_ReturnValue_2) == 0x000104, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, K2Node_Event_InFocusEvent_1) == 0x000108, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, K2Node_Event_InFocusEvent) == 0x000110, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI, K2Node_CustomEvent_bInHoldStateHasSound) == 0x000118, "Member 'CM_ClickableSubTitleWI_C_ExecuteUbergraph_CM_ClickableSubTitleWI::K2Node_CustomEvent_bInHoldStateHasSound' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.SetHoldStateHasSound
// 0x0001 (0x0001 - 0x0000)
struct CM_ClickableSubTitleWI_C_SetHoldStateHasSound final
{
public:
	bool                                          bInHoldStateHasSound;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_SetHoldStateHasSound) == 0x000001, "Wrong alignment on CM_ClickableSubTitleWI_C_SetHoldStateHasSound");
static_assert(sizeof(CM_ClickableSubTitleWI_C_SetHoldStateHasSound) == 0x000001, "Wrong size on CM_ClickableSubTitleWI_C_SetHoldStateHasSound");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetHoldStateHasSound, bInHoldStateHasSound) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_SetHoldStateHasSound::bInHoldStateHasSound' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CM_ClickableSubTitleWI_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on CM_ClickableSubTitleWI_C_OnRemovedFromFocusPath");
static_assert(sizeof(CM_ClickableSubTitleWI_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on CM_ClickableSubTitleWI_C_OnRemovedFromFocusPath");
static_assert(offsetof(CM_ClickableSubTitleWI_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CM_ClickableSubTitleWI_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on CM_ClickableSubTitleWI_C_OnAddedToFocusPath");
static_assert(sizeof(CM_ClickableSubTitleWI_C_OnAddedToFocusPath) == 0x000008, "Wrong size on CM_ClickableSubTitleWI_C_OnAddedToFocusPath");
static_assert(offsetof(CM_ClickableSubTitleWI_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.Tick
// 0x003C (0x003C - 0x0000)
struct CM_ClickableSubTitleWI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_Tick) == 0x000004, "Wrong alignment on CM_ClickableSubTitleWI_C_Tick");
static_assert(sizeof(CM_ClickableSubTitleWI_C_Tick) == 0x00003C, "Wrong size on CM_ClickableSubTitleWI_C_Tick");
static_assert(offsetof(CM_ClickableSubTitleWI_C_Tick, MyGeometry) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_Tick, InDeltaTime) == 0x000038, "Member 'CM_ClickableSubTitleWI_C_Tick::InDeltaTime' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_ClickableSubTitleWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_PreConstruct) == 0x000001, "Wrong alignment on CM_ClickableSubTitleWI_C_PreConstruct");
static_assert(sizeof(CM_ClickableSubTitleWI_C_PreConstruct) == 0x000001, "Wrong size on CM_ClickableSubTitleWI_C_PreConstruct");
static_assert(offsetof(CM_ClickableSubTitleWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.Check Minimum Height
// 0x0004 (0x0004 - 0x0000)
struct CM_ClickableSubTitleWI_C_Check_Minimum_Height final
{
public:
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_Check_Minimum_Height) == 0x000004, "Wrong alignment on CM_ClickableSubTitleWI_C_Check_Minimum_Height");
static_assert(sizeof(CM_ClickableSubTitleWI_C_Check_Minimum_Height) == 0x000004, "Wrong size on CM_ClickableSubTitleWI_C_Check_Minimum_Height");
static_assert(offsetof(CM_ClickableSubTitleWI_C_Check_Minimum_Height, CallFunc_FMax_ReturnValue) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_Check_Minimum_Height::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.SetupUI
// 0x00F8 (0x00F8 - 0x0000)
struct CM_ClickableSubTitleWI_C_SetupUI final
{
public:
	struct FSlateFontInfo                         TitleFont;                                         // 0x0000(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         CapWidth;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0088(0x0028)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_5;               // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_SetupUI) == 0x000008, "Wrong alignment on CM_ClickableSubTitleWI_C_SetupUI");
static_assert(sizeof(CM_ClickableSubTitleWI_C_SetupUI) == 0x0000F8, "Wrong size on CM_ClickableSubTitleWI_C_SetupUI");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, TitleFont) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_SetupUI::TitleFont' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CapWidth) == 0x000058, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CapWidth' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'CM_ClickableSubTitleWI_C_SetupUI::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, K2Node_MakeStruct_SlateColor_1) == 0x000088, "Member 'CM_ClickableSubTitleWI_C_SetupUI::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CallFunc_MakeVector2D_ReturnValue) == 0x0000B4, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, K2Node_SwitchEnum_CmpSuccess) == 0x0000BC, "Member 'CM_ClickableSubTitleWI_C_SetupUI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000C0, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000C4, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000CC, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CallFunc_MakeVector2D_ReturnValue_2) == 0x0000D0, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CallFunc_MakeVector2D_ReturnValue_3) == 0x0000D8, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000E0, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CallFunc_MakeVector2D_ReturnValue_4) == 0x0000E4, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CallFunc_MakeVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupUI, CallFunc_MakeVector2D_ReturnValue_5) == 0x0000EC, "Member 'CM_ClickableSubTitleWI_C_SetupUI::CallFunc_MakeVector2D_ReturnValue_5' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.SetButtonState
// 0x0001 (0x0001 - 0x0000)
struct CM_ClickableSubTitleWI_C_SetButtonState final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_SetButtonState) == 0x000001, "Wrong alignment on CM_ClickableSubTitleWI_C_SetButtonState");
static_assert(sizeof(CM_ClickableSubTitleWI_C_SetButtonState) == 0x000001, "Wrong size on CM_ClickableSubTitleWI_C_SetButtonState");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetButtonState, bEnabled) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_SetButtonState::bEnabled' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.SetupBannerUI
// 0x0070 (0x0070 - 0x0000)
struct CM_ClickableSubTitleWI_C_SetupBannerUI final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InTextSize;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InHeight;                                          // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InTextColor;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InBackgroundColor;                                 // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETitleStyle                                   InStyle;                                           // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InTextPadding;                                     // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0028)(UObjectWrapper)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_SetupBannerUI) == 0x000008, "Wrong alignment on CM_ClickableSubTitleWI_C_SetupBannerUI");
static_assert(sizeof(CM_ClickableSubTitleWI_C_SetupBannerUI) == 0x000070, "Wrong size on CM_ClickableSubTitleWI_C_SetupBannerUI");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupBannerUI, InTitle) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_SetupBannerUI::InTitle' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupBannerUI, InTextSize) == 0x000018, "Member 'CM_ClickableSubTitleWI_C_SetupBannerUI::InTextSize' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupBannerUI, InHeight) == 0x00001C, "Member 'CM_ClickableSubTitleWI_C_SetupBannerUI::InHeight' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupBannerUI, InTextColor) == 0x000020, "Member 'CM_ClickableSubTitleWI_C_SetupBannerUI::InTextColor' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupBannerUI, InBackgroundColor) == 0x000030, "Member 'CM_ClickableSubTitleWI_C_SetupBannerUI::InBackgroundColor' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupBannerUI, InStyle) == 0x000040, "Member 'CM_ClickableSubTitleWI_C_SetupBannerUI::InStyle' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupBannerUI, InTextPadding) == 0x000044, "Member 'CM_ClickableSubTitleWI_C_SetupBannerUI::InTextPadding' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupBannerUI, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'CM_ClickableSubTitleWI_C_SetupBannerUI::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.SetupConsoleButtonUI
// 0x0090 (0x0090 - 0x0000)
struct CM_ClickableSubTitleWI_C_SetupConsoleButtonUI final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetIcon_ConsoleButtonTexture;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIcon_Scale;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI) == 0x000008, "Wrong alignment on CM_ClickableSubTitleWI_C_SetupConsoleButtonUI");
static_assert(sizeof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI) == 0x000090, "Wrong size on CM_ClickableSubTitleWI_C_SetupConsoleButtonUI");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, Scale) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::Scale' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_MakeVector2D_ReturnValue_1) == 0x00000C, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000018, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000020, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_MakeVector2D_ReturnValue_2) == 0x00002C, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_MakeVector2D_ReturnValue_3) == 0x000038, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000040, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000048, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, K2Node_MakeStruct_Margin) == 0x000050, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000060, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000064, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, K2Node_MakeStruct_Margin_1) == 0x000068, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000078, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_GetIcon_ConsoleButtonTexture) == 0x000080, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_GetIcon_ConsoleButtonTexture' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetupConsoleButtonUI, CallFunc_GetIcon_Scale) == 0x000088, "Member 'CM_ClickableSubTitleWI_C_SetupConsoleButtonUI::CallFunc_GetIcon_Scale' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.IsSonyPlatform
// 0x0004 (0x0004 - 0x0000)
struct CM_ClickableSubTitleWI_C_IsSonyPlatform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_IsSonyPlatform) == 0x000001, "Wrong alignment on CM_ClickableSubTitleWI_C_IsSonyPlatform");
static_assert(sizeof(CM_ClickableSubTitleWI_C_IsSonyPlatform) == 0x000004, "Wrong size on CM_ClickableSubTitleWI_C_IsSonyPlatform");
static_assert(offsetof(CM_ClickableSubTitleWI_C_IsSonyPlatform, ReturnValue) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_IsSonyPlatform::ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_IsSonyPlatform, CallFunc_IsPS5Platform_ReturnValue) == 0x000001, "Member 'CM_ClickableSubTitleWI_C_IsSonyPlatform::CallFunc_IsPS5Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_IsSonyPlatform, CallFunc_IsPS4Platform_ReturnValue) == 0x000002, "Member 'CM_ClickableSubTitleWI_C_IsSonyPlatform::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_IsSonyPlatform, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'CM_ClickableSubTitleWI_C_IsSonyPlatform::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.CancelHold
// 0x0001 (0x0001 - 0x0000)
struct CM_ClickableSubTitleWI_C_CancelHold final
{
public:
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_CancelHold) == 0x000001, "Wrong alignment on CM_ClickableSubTitleWI_C_CancelHold");
static_assert(sizeof(CM_ClickableSubTitleWI_C_CancelHold) == 0x000001, "Wrong size on CM_ClickableSubTitleWI_C_CancelHold");
static_assert(offsetof(CM_ClickableSubTitleWI_C_CancelHold, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_CancelHold::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.RefreshButtonVisuals
// 0x0001 (0x0001 - 0x0000)
struct CM_ClickableSubTitleWI_C_RefreshButtonVisuals final
{
public:
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_RefreshButtonVisuals) == 0x000001, "Wrong alignment on CM_ClickableSubTitleWI_C_RefreshButtonVisuals");
static_assert(sizeof(CM_ClickableSubTitleWI_C_RefreshButtonVisuals) == 0x000001, "Wrong size on CM_ClickableSubTitleWI_C_RefreshButtonVisuals");
static_assert(offsetof(CM_ClickableSubTitleWI_C_RefreshButtonVisuals, CallFunc_BooleanOR_ReturnValue) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_RefreshButtonVisuals::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.GetHoldProgress
// 0x0010 (0x0010 - 0x0000)
struct CM_ClickableSubTitleWI_C_GetHoldProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_GetHoldProgress) == 0x000004, "Wrong alignment on CM_ClickableSubTitleWI_C_GetHoldProgress");
static_assert(sizeof(CM_ClickableSubTitleWI_C_GetHoldProgress) == 0x000010, "Wrong size on CM_ClickableSubTitleWI_C_GetHoldProgress");
static_assert(offsetof(CM_ClickableSubTitleWI_C_GetHoldProgress, Progress) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_GetHoldProgress::Progress' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_GetHoldProgress, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000004, "Member 'CM_ClickableSubTitleWI_C_GetHoldProgress::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_GetHoldProgress, CallFunc_SafeDivide_ReturnValue) == 0x000008, "Member 'CM_ClickableSubTitleWI_C_GetHoldProgress::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_GetHoldProgress, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x00000C, "Member 'CM_ClickableSubTitleWI_C_GetHoldProgress::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.UpdateButtonIconPrompt
// 0x0020 (0x0020 - 0x0000)
struct CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowButtonIconPrompt_ReturnValue;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt) == 0x000008, "Wrong alignment on CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt");
static_assert(sizeof(CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt) == 0x000020, "Wrong size on CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt");
static_assert(offsetof(CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt, K2Node_MakeStruct_Margin) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000010, "Member 'CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt, CallFunc_ShouldShowButtonIconPrompt_ReturnValue) == 0x000018, "Member 'CM_ClickableSubTitleWI_C_UpdateButtonIconPrompt::CallFunc_ShouldShowButtonIconPrompt_ReturnValue' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.SetSlateCosmetics
// 0x0020 (0x0020 - 0x0000)
struct CM_ClickableSubTitleWI_C_SetSlateCosmetics final
{
public:
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_SetSlateCosmetics) == 0x000004, "Wrong alignment on CM_ClickableSubTitleWI_C_SetSlateCosmetics");
static_assert(sizeof(CM_ClickableSubTitleWI_C_SetSlateCosmetics) == 0x000020, "Wrong size on CM_ClickableSubTitleWI_C_SetSlateCosmetics");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetSlateCosmetics, CallFunc_MakeVector2D_ReturnValue) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_SetSlateCosmetics::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetSlateCosmetics, CallFunc_MakeVector2D_ReturnValue_1) == 0x000008, "Member 'CM_ClickableSubTitleWI_C_SetSlateCosmetics::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetSlateCosmetics, CallFunc_MakeVector2D_ReturnValue_2) == 0x000010, "Member 'CM_ClickableSubTitleWI_C_SetSlateCosmetics::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetSlateCosmetics, CallFunc_MakeVector2D_ReturnValue_3) == 0x000018, "Member 'CM_ClickableSubTitleWI_C_SetSlateCosmetics::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.SetNavigationForDirection
// 0x0010 (0x0010 - 0x0000)
struct CM_ClickableSubTitleWI_C_SetNavigationForDirection final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_SetNavigationForDirection) == 0x000008, "Wrong alignment on CM_ClickableSubTitleWI_C_SetNavigationForDirection");
static_assert(sizeof(CM_ClickableSubTitleWI_C_SetNavigationForDirection) == 0x000010, "Wrong size on CM_ClickableSubTitleWI_C_SetNavigationForDirection");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetNavigationForDirection, Direction) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_SetNavigationForDirection::Direction' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_SetNavigationForDirection, Target) == 0x000008, "Member 'CM_ClickableSubTitleWI_C_SetNavigationForDirection::Target' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.GetNavigationWidget
// 0x0008 (0x0008 - 0x0000)
struct CM_ClickableSubTitleWI_C_GetNavigationWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_GetNavigationWidget) == 0x000008, "Wrong alignment on CM_ClickableSubTitleWI_C_GetNavigationWidget");
static_assert(sizeof(CM_ClickableSubTitleWI_C_GetNavigationWidget) == 0x000008, "Wrong size on CM_ClickableSubTitleWI_C_GetNavigationWidget");
static_assert(offsetof(CM_ClickableSubTitleWI_C_GetNavigationWidget, Widget) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_GetNavigationWidget::Widget' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.ShouldShowButtonIconPrompt
// 0x0008 (0x0008 - 0x0000)
struct CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingControllerOnPC_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt) == 0x000001, "Wrong alignment on CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt");
static_assert(sizeof(CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt) == 0x000008, "Wrong size on CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt, ReturnValue) == 0x000000, "Member 'CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt::ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt, CallFunc_IsConsolePlatform_ReturnValue) == 0x000001, "Member 'CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt, CallFunc_IsUsingControllerOnPC_ReturnValue) == 0x000002, "Member 'CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt::CallFunc_IsUsingControllerOnPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt, CallFunc_BooleanAND_ReturnValue_1) == 0x000007, "Member 'CM_ClickableSubTitleWI_C_ShouldShowButtonIconPrompt::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function CM_ClickableSubTitleWI.CM_ClickableSubTitleWI_C.GetLastControllerType
// 0x0020 (0x0020 - 0x0000)
struct CM_ClickableSubTitleWI_C_GetLastControllerType final
{
public:
	ESCTControllerType                            ControllerType;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESCTControllerType                            CallFunc_GetLastControllerType_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
