#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_ClickableSquareSelectionButtonBasicWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CM_ClickableSquareSelectionButtonBasicWI.CM_ClickableSquareSelectionButtonBasicWI_C.ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI
// 0x0018 (0x0018 - 0x0000)
struct CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI) == 0x000004, "Wrong alignment on CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI");
static_assert(sizeof(CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI) == 0x000018, "Wrong size on CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI");
static_assert(offsetof(CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI, EntryPoint) == 0x000000, "Member 'CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI, K2Node_Event_IsDesignTime) == 0x000014, "Member 'CM_ClickableSquareSelectionButtonBasicWI_C_ExecuteUbergraph_CM_ClickableSquareSelectionButtonBasicWI::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function CM_ClickableSquareSelectionButtonBasicWI.CM_ClickableSquareSelectionButtonBasicWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_ClickableSquareSelectionButtonBasicWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ClickableSquareSelectionButtonBasicWI_C_PreConstruct) == 0x000001, "Wrong alignment on CM_ClickableSquareSelectionButtonBasicWI_C_PreConstruct");
static_assert(sizeof(CM_ClickableSquareSelectionButtonBasicWI_C_PreConstruct) == 0x000001, "Wrong size on CM_ClickableSquareSelectionButtonBasicWI_C_PreConstruct");
static_assert(offsetof(CM_ClickableSquareSelectionButtonBasicWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_ClickableSquareSelectionButtonBasicWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_ClickableSquareSelectionButtonBasicWI.CM_ClickableSquareSelectionButtonBasicWI_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CM_ClickableSquareSelectionButtonBasicWI_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CM_ClickableSquareSelectionButtonBasicWI_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on CM_ClickableSquareSelectionButtonBasicWI_C_OnRemovedFromFocusPath");
static_assert(sizeof(CM_ClickableSquareSelectionButtonBasicWI_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on CM_ClickableSquareSelectionButtonBasicWI_C_OnRemovedFromFocusPath");
static_assert(offsetof(CM_ClickableSquareSelectionButtonBasicWI_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'CM_ClickableSquareSelectionButtonBasicWI_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function CM_ClickableSquareSelectionButtonBasicWI.CM_ClickableSquareSelectionButtonBasicWI_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CM_ClickableSquareSelectionButtonBasicWI_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CM_ClickableSquareSelectionButtonBasicWI_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on CM_ClickableSquareSelectionButtonBasicWI_C_OnAddedToFocusPath");
static_assert(sizeof(CM_ClickableSquareSelectionButtonBasicWI_C_OnAddedToFocusPath) == 0x000008, "Wrong size on CM_ClickableSquareSelectionButtonBasicWI_C_OnAddedToFocusPath");
static_assert(offsetof(CM_ClickableSquareSelectionButtonBasicWI_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'CM_ClickableSquareSelectionButtonBasicWI_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

}

