#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_ChooseRegionContentWelcomeDialog

#include "Basic.hpp"


namespace SDK::Params
{

// Function CM_ChooseRegionContentWelcomeDialog.CM_ChooseRegionContentWelcomeDialog_C.ExecuteUbergraph_CM_ChooseRegionContentWelcomeDialog
// 0x0004 (0x0004 - 0x0000)
struct CM_ChooseRegionContentWelcomeDialog_C_ExecuteUbergraph_CM_ChooseRegionContentWelcomeDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ChooseRegionContentWelcomeDialog_C_ExecuteUbergraph_CM_ChooseRegionContentWelcomeDialog) == 0x000004, "Wrong alignment on CM_ChooseRegionContentWelcomeDialog_C_ExecuteUbergraph_CM_ChooseRegionContentWelcomeDialog");
static_assert(sizeof(CM_ChooseRegionContentWelcomeDialog_C_ExecuteUbergraph_CM_ChooseRegionContentWelcomeDialog) == 0x000004, "Wrong size on CM_ChooseRegionContentWelcomeDialog_C_ExecuteUbergraph_CM_ChooseRegionContentWelcomeDialog");
static_assert(offsetof(CM_ChooseRegionContentWelcomeDialog_C_ExecuteUbergraph_CM_ChooseRegionContentWelcomeDialog, EntryPoint) == 0x000000, "Member 'CM_ChooseRegionContentWelcomeDialog_C_ExecuteUbergraph_CM_ChooseRegionContentWelcomeDialog::EntryPoint' has a wrong offset!");

// Function CM_ChooseRegionContentWelcomeDialog.CM_ChooseRegionContentWelcomeDialog_C.RestartRequired
// 0x0020 (0x0020 - 0x0000)
struct CM_ChooseRegionContentWelcomeDialog_C_RestartRequired final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)(ConstParm)
	class UCM_ContentDialogWrapper_C*             CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_ChooseRegionContentWelcomeDialog_C_RestartRequired) == 0x000008, "Wrong alignment on CM_ChooseRegionContentWelcomeDialog_C_RestartRequired");
static_assert(sizeof(CM_ChooseRegionContentWelcomeDialog_C_RestartRequired) == 0x000020, "Wrong size on CM_ChooseRegionContentWelcomeDialog_C_RestartRequired");
static_assert(offsetof(CM_ChooseRegionContentWelcomeDialog_C_RestartRequired, Temp_text_Variable) == 0x000000, "Member 'CM_ChooseRegionContentWelcomeDialog_C_RestartRequired::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CM_ChooseRegionContentWelcomeDialog_C_RestartRequired, CallFunc_Create_ReturnValue) == 0x000018, "Member 'CM_ChooseRegionContentWelcomeDialog_C_RestartRequired::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function CM_ChooseRegionContentWelcomeDialog.CM_ChooseRegionContentWelcomeDialog_C.TryChangeRegion
// 0x0018 (0x0018 - 0x0000)
struct CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion final
{
public:
	bool                                          InChinaRegion;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AClientEntryPC*                         CallFunc_GetMainMenuPlayerController_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredRegion_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion) == 0x000008, "Wrong alignment on CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion");
static_assert(sizeof(CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion) == 0x000018, "Wrong size on CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion");
static_assert(offsetof(CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion, InChinaRegion) == 0x000000, "Member 'CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion::InChinaRegion' has a wrong offset!");
static_assert(offsetof(CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion, CallFunc_GetMainMenuPlayerController_ReturnValue) == 0x000008, "Member 'CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion::CallFunc_GetMainMenuPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion, CallFunc_SetDesiredRegion_ReturnValue) == 0x000010, "Member 'CM_ChooseRegionContentWelcomeDialog_C_TryChangeRegion::CallFunc_SetDesiredRegion_ReturnValue' has a wrong offset!");

}

