#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_CreatingLobbyContentDialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CM_ContentDialog_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_CreatingLobbyContentDialog.CM_CreatingLobbyContentDialog_C
// 0x0028 (0x02E8 - 0x02C0)
class UCM_CreatingLobbyContentDialog_C final : public UCM_ContentDialog_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_ClickableSubTitleWI_C*              BackButton;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              FindGameButton;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Throbber_126;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_CreatingLobbyContentDialog(int32 EntryPoint);
	void BndEvt__CM_CreatingLobbyContentDialog_FindGameButton_K2Node_ComponentBoundEvent_1_OnHoldComplete__DelegateSignature();
	void BndEvt__CM_CreatingLobbyContentDialog_BackButton_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_CreatingLobbyContentDialog_C">();
	}
	static class UCM_CreatingLobbyContentDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_CreatingLobbyContentDialog_C>();
	}
};
static_assert(alignof(UCM_CreatingLobbyContentDialog_C) == 0x000008, "Wrong alignment on UCM_CreatingLobbyContentDialog_C");
static_assert(sizeof(UCM_CreatingLobbyContentDialog_C) == 0x0002E8, "Wrong size on UCM_CreatingLobbyContentDialog_C");
static_assert(offsetof(UCM_CreatingLobbyContentDialog_C, UberGraphFrame) == 0x0002C0, "Member 'UCM_CreatingLobbyContentDialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_CreatingLobbyContentDialog_C, BackButton) == 0x0002C8, "Member 'UCM_CreatingLobbyContentDialog_C::BackButton' has a wrong offset!");
static_assert(offsetof(UCM_CreatingLobbyContentDialog_C, Background) == 0x0002D0, "Member 'UCM_CreatingLobbyContentDialog_C::Background' has a wrong offset!");
static_assert(offsetof(UCM_CreatingLobbyContentDialog_C, FindGameButton) == 0x0002D8, "Member 'UCM_CreatingLobbyContentDialog_C::FindGameButton' has a wrong offset!");
static_assert(offsetof(UCM_CreatingLobbyContentDialog_C, Throbber_126) == 0x0002E0, "Member 'UCM_CreatingLobbyContentDialog_C::Throbber_126' has a wrong offset!");

}

