#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_DLCPreviewer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_DLCPreviewer.CM_DLCPreviewer_C
// 0x0070 (0x02D0 - 0x0260)
class UCM_DLCPreviewer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_CharacterRender_C*                  CM_CharacterRender;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              CM_ClickableSubTitleWI;                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_34;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_160;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FPlayerCustomizationItemTableRow> Items;                                             // 0x0290(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FString                                 StoreId;                                           // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ACharacterPreviewerSCTBP_C*             MalePreviewer;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     PostProcessVolume;                                 // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnGoBack;                                          // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnGoBack__DelegateSignature();
	void ExecuteUbergraph_CM_DLCPreviewer(int32 EntryPoint);
	void BndEvt__CM_DLCPreviewer_CM_ClickableSubTitleWI_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void InitializePreviewer(const class FString& InStoreId, const struct FPlayerCustomizationItemTableRow& InItems);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_DLCPreviewer_C">();
	}
	static class UCM_DLCPreviewer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_DLCPreviewer_C>();
	}
};
static_assert(alignof(UCM_DLCPreviewer_C) == 0x000008, "Wrong alignment on UCM_DLCPreviewer_C");
static_assert(sizeof(UCM_DLCPreviewer_C) == 0x0002D0, "Wrong size on UCM_DLCPreviewer_C");
static_assert(offsetof(UCM_DLCPreviewer_C, UberGraphFrame) == 0x000260, "Member 'UCM_DLCPreviewer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_DLCPreviewer_C, CM_CharacterRender) == 0x000268, "Member 'UCM_DLCPreviewer_C::CM_CharacterRender' has a wrong offset!");
static_assert(offsetof(UCM_DLCPreviewer_C, CM_ClickableSubTitleWI) == 0x000270, "Member 'UCM_DLCPreviewer_C::CM_ClickableSubTitleWI' has a wrong offset!");
static_assert(offsetof(UCM_DLCPreviewer_C, Image) == 0x000278, "Member 'UCM_DLCPreviewer_C::Image' has a wrong offset!");
static_assert(offsetof(UCM_DLCPreviewer_C, Image_34) == 0x000280, "Member 'UCM_DLCPreviewer_C::Image_34' has a wrong offset!");
static_assert(offsetof(UCM_DLCPreviewer_C, Image_160) == 0x000288, "Member 'UCM_DLCPreviewer_C::Image_160' has a wrong offset!");
static_assert(offsetof(UCM_DLCPreviewer_C, Items) == 0x000290, "Member 'UCM_DLCPreviewer_C::Items' has a wrong offset!");
static_assert(offsetof(UCM_DLCPreviewer_C, StoreId) == 0x0002A0, "Member 'UCM_DLCPreviewer_C::StoreId' has a wrong offset!");
static_assert(offsetof(UCM_DLCPreviewer_C, MalePreviewer) == 0x0002B0, "Member 'UCM_DLCPreviewer_C::MalePreviewer' has a wrong offset!");
static_assert(offsetof(UCM_DLCPreviewer_C, PostProcessVolume) == 0x0002B8, "Member 'UCM_DLCPreviewer_C::PostProcessVolume' has a wrong offset!");
static_assert(offsetof(UCM_DLCPreviewer_C, OnGoBack) == 0x0002C0, "Member 'UCM_DLCPreviewer_C::OnGoBack' has a wrong offset!");

}

