#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_DLCUserWidget

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CM_DLCUserWidget.CM_DLCUserWidget_C.ExecuteUbergraph_CM_DLCUserWidget
// 0x0330 (0x0330 - 0x0000)
struct CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBulkDLCPacksData                      K2Node_CustomEvent_Payload;                        // 0x0008(0x0010)()
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FBulkDLCPacksData& Payload, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBulkDLCPacksData                      Temp_struct_Variable;                              // 0x0050(0x0010)()
	TDelegate<void(const struct FBulkDLCPacksData& OutUpdatedDLCData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UFCTGetTexturesFromUrlCallbackProxy*    CallFunc_GetDLCTextures_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBulkDLCPacksData                      K2Node_CustomEvent_OutUpdatedDLCData_1;            // 0x0080(0x0010)()
	struct FBulkDLCPacksData                      K2Node_CustomEvent_OutUpdatedDLCData;              // 0x0090(0x0010)()
	TDelegate<void(const struct FBulkDLCPacksData& OutUpdatedDLCData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FBulkDLCPacksData                      Temp_struct_Variable_1;                            // 0x00B0(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDLCPackData                           CallFunc_Array_Get_Item;                           // 0x00D0(0x0170)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBulkDLCPacksData                      K2Node_CustomEvent_Payload_1;                      // 0x0248(0x0010)()
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_CultureCode;                    // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTGetBulkDLCPacksCallbackProxy*       CallFunc_GetBulkDLCPacks_ReturnValue;              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue;           // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x02D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(const struct FBulkDLCPacksData& Payload, const class FString& Message, int32 Code)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x02E8(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_DLCGridPanel_C*                     K2Node_DynamicCast_AsCM_DLCGrid_Panel;             // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget) == 0x000008, "Wrong alignment on CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget");
static_assert(sizeof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget) == 0x000330, "Wrong size on CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, EntryPoint) == 0x000000, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CustomEvent_Payload) == 0x000008, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CustomEvent_Message) == 0x000018, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CustomEvent_Code) == 0x000028, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, Temp_int_Variable) == 0x00003C, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, Temp_string_Variable) == 0x000040, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, Temp_struct_Variable) == 0x000050, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_GetDLCTextures_ReturnValue) == 0x000070, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_GetDLCTextures_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CustomEvent_OutUpdatedDLCData_1) == 0x000080, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CustomEvent_OutUpdatedDLCData_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CustomEvent_OutUpdatedDLCData) == 0x000090, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CustomEvent_OutUpdatedDLCData' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A0, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, Temp_struct_Variable_1) == 0x0000B0, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, Temp_bool_True_if_break_was_hit_Variable) == 0x0000C4, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000240, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000241, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CustomEvent_Payload_1) == 0x000248, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CustomEvent_Message_1) == 0x000258, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CustomEvent_Code_1) == 0x000268, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_Event_IsDesignTime) == 0x00026C, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, Temp_int_Loop_Counter_Variable) == 0x000270, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000274, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000278, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_BooleanAND_ReturnValue) == 0x00027C, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, Temp_int_Loop_Counter_Variable_1) == 0x000280, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, Temp_int_Array_Index_Variable_1) == 0x000284, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000288, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CustomEvent_CultureCode) == 0x000290, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CustomEvent_CultureCode' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_GetSubstring_ReturnValue) == 0x0002A0, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x0002B0, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_GetBulkDLCPacks_ReturnValue) == 0x0002B8, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_GetBulkDLCPacks_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002C0, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_IsValid_ReturnValue_1) == 0x0002C1, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_GetCurrentLanguage_ReturnValue) == 0x0002C8, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_GetAllChildren_ReturnValue) == 0x0002D8, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002E8, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_Array_Get_Item_1) == 0x0002F8, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_DynamicCast_AsCM_DLCGrid_Panel) == 0x000300, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_DynamicCast_AsCM_DLCGrid_Panel' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_Array_Length_ReturnValue_1) == 0x00030C, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000310, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000318, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000328, "Member 'CM_DLCUserWidget_C_ExecuteUbergraph_CM_DLCUserWidget::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function CM_DLCUserWidget.CM_DLCUserWidget_C.OnSetDLC
// 0x0010 (0x0010 - 0x0000)
struct CM_DLCUserWidget_C_OnSetDLC final
{
public:
	class FString                                 CultureCode;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_DLCUserWidget_C_OnSetDLC) == 0x000008, "Wrong alignment on CM_DLCUserWidget_C_OnSetDLC");
static_assert(sizeof(CM_DLCUserWidget_C_OnSetDLC) == 0x000010, "Wrong size on CM_DLCUserWidget_C_OnSetDLC");
static_assert(offsetof(CM_DLCUserWidget_C_OnSetDLC, CultureCode) == 0x000000, "Member 'CM_DLCUserWidget_C_OnSetDLC::CultureCode' has a wrong offset!");

// Function CM_DLCUserWidget.CM_DLCUserWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_DLCUserWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_DLCUserWidget_C_PreConstruct) == 0x000001, "Wrong alignment on CM_DLCUserWidget_C_PreConstruct");
static_assert(sizeof(CM_DLCUserWidget_C_PreConstruct) == 0x000001, "Wrong size on CM_DLCUserWidget_C_PreConstruct");
static_assert(offsetof(CM_DLCUserWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_DLCUserWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_DLCUserWidget.CM_DLCUserWidget_C.OnSuccess_8403A454436171800C7326993E84FD08
// 0x0010 (0x0010 - 0x0000)
struct CM_DLCUserWidget_C_OnSuccess_8403A454436171800C7326993E84FD08 final
{
public:
	struct FBulkDLCPacksData                      OutUpdatedDLCData;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CM_DLCUserWidget_C_OnSuccess_8403A454436171800C7326993E84FD08) == 0x000008, "Wrong alignment on CM_DLCUserWidget_C_OnSuccess_8403A454436171800C7326993E84FD08");
static_assert(sizeof(CM_DLCUserWidget_C_OnSuccess_8403A454436171800C7326993E84FD08) == 0x000010, "Wrong size on CM_DLCUserWidget_C_OnSuccess_8403A454436171800C7326993E84FD08");
static_assert(offsetof(CM_DLCUserWidget_C_OnSuccess_8403A454436171800C7326993E84FD08, OutUpdatedDLCData) == 0x000000, "Member 'CM_DLCUserWidget_C_OnSuccess_8403A454436171800C7326993E84FD08::OutUpdatedDLCData' has a wrong offset!");

// Function CM_DLCUserWidget.CM_DLCUserWidget_C.OnError_8403A454436171800C7326993E84FD08
// 0x0010 (0x0010 - 0x0000)
struct CM_DLCUserWidget_C_OnError_8403A454436171800C7326993E84FD08 final
{
public:
	struct FBulkDLCPacksData                      OutUpdatedDLCData;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CM_DLCUserWidget_C_OnError_8403A454436171800C7326993E84FD08) == 0x000008, "Wrong alignment on CM_DLCUserWidget_C_OnError_8403A454436171800C7326993E84FD08");
static_assert(sizeof(CM_DLCUserWidget_C_OnError_8403A454436171800C7326993E84FD08) == 0x000010, "Wrong size on CM_DLCUserWidget_C_OnError_8403A454436171800C7326993E84FD08");
static_assert(offsetof(CM_DLCUserWidget_C_OnError_8403A454436171800C7326993E84FD08, OutUpdatedDLCData) == 0x000000, "Member 'CM_DLCUserWidget_C_OnError_8403A454436171800C7326993E84FD08::OutUpdatedDLCData' has a wrong offset!");

// Function CM_DLCUserWidget.CM_DLCUserWidget_C.OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59
// 0x0028 (0x0028 - 0x0000)
struct CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59 final
{
public:
	struct FBulkDLCPacksData                      Payload;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Code;                                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59) == 0x000008, "Wrong alignment on CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59");
static_assert(sizeof(CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59) == 0x000028, "Wrong size on CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59");
static_assert(offsetof(CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59, Payload) == 0x000000, "Member 'CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59::Payload' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59, Message) == 0x000010, "Member 'CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59::Message' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59, Code) == 0x000020, "Member 'CM_DLCUserWidget_C_OnSuccess_DD0D5C364E6CF10BA020EDAF3AD4AB59::Code' has a wrong offset!");

// Function CM_DLCUserWidget.CM_DLCUserWidget_C.OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59
// 0x0028 (0x0028 - 0x0000)
struct CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59 final
{
public:
	struct FBulkDLCPacksData                      Payload;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Code;                                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59) == 0x000008, "Wrong alignment on CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59");
static_assert(sizeof(CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59) == 0x000028, "Wrong size on CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59");
static_assert(offsetof(CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59, Payload) == 0x000000, "Member 'CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59::Payload' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59, Message) == 0x000010, "Member 'CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59::Message' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59, Code) == 0x000020, "Member 'CM_DLCUserWidget_C_OnError_DD0D5C364E6CF10BA020EDAF3AD4AB59::Code' has a wrong offset!");

// Function CM_DLCUserWidget.CM_DLCUserWidget_C.Add Item
// 0x0208 (0x0208 - 0x0000)
struct CM_DLCUserWidget_C_Add_Item final
{
public:
	struct FDLCPackData                           Pack;                                              // 0x0000(0x0170)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CurrentRow;                                        // 0x0170(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentCol;                                        // 0x0174(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_DLCGridPanel_C*                     DLCGridPanel;                                      // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetStoreIdByCurrentPlatform_StoreId;      // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCM_DLCGridPanel_C*                     CallFunc_Create_ReturnValue;                       // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlayerCustomizationItemTableRow> K2Node_MakeArray_Array;                            // 0x01B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D0(0x0018)()
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_1;             // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_2;             // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_DLCUserWidget_C_Add_Item) == 0x000008, "Wrong alignment on CM_DLCUserWidget_C_Add_Item");
static_assert(sizeof(CM_DLCUserWidget_C_Add_Item) == 0x000208, "Wrong size on CM_DLCUserWidget_C_Add_Item");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, Pack) == 0x000000, "Member 'CM_DLCUserWidget_C_Add_Item::Pack' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CurrentRow) == 0x000170, "Member 'CM_DLCUserWidget_C_Add_Item::CurrentRow' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CurrentCol) == 0x000174, "Member 'CM_DLCUserWidget_C_Add_Item::CurrentCol' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, DLCGridPanel) == 0x000178, "Member 'CM_DLCUserWidget_C_Add_Item::DLCGridPanel' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, K2Node_MakeStruct_Margin) == 0x000180, "Member 'CM_DLCUserWidget_C_Add_Item::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CallFunc_GetStoreIdByCurrentPlatform_StoreId) == 0x000190, "Member 'CM_DLCUserWidget_C_Add_Item::CallFunc_GetStoreIdByCurrentPlatform_StoreId' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CallFunc_Create_ReturnValue) == 0x0001A0, "Member 'CM_DLCUserWidget_C_Add_Item::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, Temp_int_Variable) == 0x0001A8, "Member 'CM_DLCUserWidget_C_Add_Item::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CallFunc_Add_IntInt_ReturnValue) == 0x0001AC, "Member 'CM_DLCUserWidget_C_Add_Item::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001B0, "Member 'CM_DLCUserWidget_C_Add_Item::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, K2Node_MakeArray_Array) == 0x0001B8, "Member 'CM_DLCUserWidget_C_Add_Item::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CallFunc_Not_PreBool_ReturnValue) == 0x0001C8, "Member 'CM_DLCUserWidget_C_Add_Item::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D0, "Member 'CM_DLCUserWidget_C_Add_Item::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CallFunc_SlotAsGridSlot_ReturnValue) == 0x0001E8, "Member 'CM_DLCUserWidget_C_Add_Item::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CallFunc_SlotAsGridSlot_ReturnValue_1) == 0x0001F0, "Member 'CM_DLCUserWidget_C_Add_Item::CallFunc_SlotAsGridSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CallFunc_AddChild_ReturnValue) == 0x0001F8, "Member 'CM_DLCUserWidget_C_Add_Item::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_Add_Item, CallFunc_SlotAsGridSlot_ReturnValue_2) == 0x000200, "Member 'CM_DLCUserWidget_C_Add_Item::CallFunc_SlotAsGridSlot_ReturnValue_2' has a wrong offset!");

// Function CM_DLCUserWidget.CM_DLCUserWidget_C.BuildDLCGrid
// 0x0338 (0x0338 - 0x0000)
struct CM_DLCUserWidget_C_BuildDLCGrid final
{
public:
	struct FBulkDLCPacksData                      DLCPacks;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         LastRowColSpanHz;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastRowRemainder;                                  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextCol;                                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentCol;                                        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRow;                                        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDLCPackData                           CurrentDLC;                                        // 0x0028(0x0170)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDLCPackData                           CallFunc_Array_Get_Item;                           // 0x01B8(0x0170)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_DLCUserWidget_C_BuildDLCGrid) == 0x000008, "Wrong alignment on CM_DLCUserWidget_C_BuildDLCGrid");
static_assert(sizeof(CM_DLCUserWidget_C_BuildDLCGrid) == 0x000338, "Wrong size on CM_DLCUserWidget_C_BuildDLCGrid");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, DLCPacks) == 0x000000, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::DLCPacks' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, LastRowColSpanHz) == 0x000010, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::LastRowColSpanHz' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, LastRowRemainder) == 0x000014, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::LastRowRemainder' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, NextCol) == 0x000018, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::NextCol' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CurrentCol) == 0x00001C, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CurrentCol' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CurrentRow) == 0x000020, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CurrentRow' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CurrentDLC) == 0x000028, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CurrentDLC' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, Temp_int_Variable) == 0x000198, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CallFunc_Array_Length_ReturnValue) == 0x00019C, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, Temp_int_Loop_Counter_Variable) == 0x0001A0, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, Temp_int_Variable_1) == 0x0001A4, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CallFunc_Less_IntInt_ReturnValue) == 0x0001A8, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CallFunc_Add_IntInt_ReturnValue) == 0x0001AC, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, Temp_int_Array_Index_Variable) == 0x0001B0, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CallFunc_Array_Get_Item) == 0x0001B8, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CallFunc_Add_IntInt_ReturnValue_1) == 0x000328, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00032C, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CallFunc_Add_IntInt_ReturnValue_2) == 0x000330, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_BuildDLCGrid, CallFunc_Add_IntInt_ReturnValue_3) == 0x000334, "Member 'CM_DLCUserWidget_C_BuildDLCGrid::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function CM_DLCUserWidget.CM_DLCUserWidget_C.GetStoreIdByCurrentPlatform
// 0x0188 (0x0188 - 0x0000)
struct CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform final
{
public:
	struct FDLCPackData                           Pack;                                              // 0x0000(0x0170)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 StoreId;                                           // 0x0170(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAccelBytePlatformSync                        CallFunc_GetAccelBytePlatformSync_ReturnValue;     // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform) == 0x000008, "Wrong alignment on CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform");
static_assert(sizeof(CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform) == 0x000188, "Wrong size on CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform");
static_assert(offsetof(CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform, Pack) == 0x000000, "Member 'CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform::Pack' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform, StoreId) == 0x000170, "Member 'CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform::StoreId' has a wrong offset!");
static_assert(offsetof(CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform, CallFunc_IsPS4Platform_ReturnValue) == 0x000180, "Member 'CM_DLCUserWidget_C_GetStoreIdByCurrentPlatform::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
