#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_EmoteCustomization

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_Emote_structs.hpp"


namespace SDK::Params
{

// Function CM_EmoteCustomization.CM_EmoteCustomization_C.ExecuteUbergraph_CM_EmoteCustomization
// 0x00A0 (0x00A0 - 0x0000)
struct CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHoveredEmoteCustomizationData_SelectedIndex; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Emote                               CallFunc_GetHoveredEmoteCustomizationData_Details; // 0x0010(0x0060)(HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetHoveredEmoteCustomizationData_Position; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization) == 0x000008, "Wrong alignment on CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization");
static_assert(sizeof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization) == 0x0000A0, "Wrong size on CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization");
static_assert(offsetof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization, EntryPoint) == 0x000000, "Member 'CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization, CallFunc_GetHoveredEmoteCustomizationData_SelectedIndex) == 0x000008, "Member 'CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization::CallFunc_GetHoveredEmoteCustomizationData_SelectedIndex' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization, CallFunc_GetHoveredEmoteCustomizationData_Details) == 0x000010, "Member 'CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization::CallFunc_GetHoveredEmoteCustomizationData_Details' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization, CallFunc_GetHoveredEmoteCustomizationData_Position) == 0x000070, "Member 'CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization::CallFunc_GetHoveredEmoteCustomizationData_Position' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000078, "Member 'CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000080, "Member 'CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization, CallFunc_GetPosition_ReturnValue) == 0x000088, "Member 'CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000090, "Member 'CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000098, "Member 'CM_EmoteCustomization_C_ExecuteUbergraph_CM_EmoteCustomization::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");

// Function CM_EmoteCustomization.CM_EmoteCustomization_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_EmoteCustomization_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_EmoteCustomization_C_PreConstruct) == 0x000001, "Wrong alignment on CM_EmoteCustomization_C_PreConstruct");
static_assert(sizeof(CM_EmoteCustomization_C_PreConstruct) == 0x000001, "Wrong size on CM_EmoteCustomization_C_PreConstruct");
static_assert(offsetof(CM_EmoteCustomization_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_EmoteCustomization_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_EmoteCustomization.CM_EmoteCustomization_C.GetEmoteStructsFromNames
// 0x00B8 (0x00B8 - 0x0000)
struct CM_EmoteCustomization_C_GetEmoteStructsFromNames final
{
public:
	TArray<class FName>                           Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FS_Emote>                       Emotes;                                            // 0x0010(0x0010)(Parm, OutParm)
	TArray<struct FS_Emote>                       L_Emotes;                                          // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Emote                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_EmoteCustomization_C_GetEmoteStructsFromNames) == 0x000008, "Wrong alignment on CM_EmoteCustomization_C_GetEmoteStructsFromNames");
static_assert(sizeof(CM_EmoteCustomization_C_GetEmoteStructsFromNames) == 0x0000B8, "Wrong size on CM_EmoteCustomization_C_GetEmoteStructsFromNames");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, Array) == 0x000000, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::Array' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, Emotes) == 0x000010, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::Emotes' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, L_Emotes) == 0x000020, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::L_Emotes' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, Temp_int_Array_Index_Variable) == 0x000034, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, CallFunc_Array_Get_Item) == 0x00003C, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A8, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, CallFunc_Less_IntInt_ReturnValue) == 0x0000A9, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_EmoteCustomization_C_GetEmoteStructsFromNames, CallFunc_Array_AddUnique_ReturnValue) == 0x0000B0, "Member 'CM_EmoteCustomization_C_GetEmoteStructsFromNames::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

}

