#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_GameTabWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CM_SettingsTab_Base_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_GameTabWI.CM_GameTabWI_C
// 0x0060 (0x02C8 - 0x0268)
class UCM_GameTabWI_C final : public UCM_SettingsTab_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CM_GameTabWI_C;                     // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_CheckboxWI_C*                       CM_CheckboxWI_CrossPlay;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              CM_ClickableSubTitleWI;                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_LanguageWI_C*                       CM_LanguageWI;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_MatchmakingLanguageWI_C*            CM_MatchmakingLanguageWI;                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_TabTitle_C*                         CM_TabTitle;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Resolution;                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxVerify;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Game;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_CheckboxWI_C*                       ToolTips;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               Special_Options;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCrossPlayVisible;                                 // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CM_GameTabWI(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__CM_GameTabWI_CM_CheckboxWI_K2Node_ComponentBoundEvent_0_StateChanged__DelegateSignature(bool IsChecked);
	void OnInitialized();
	void Update_Cross_Play_Checkbox();
	void BndEvt__CM_GameTabWI_CM_CheckboxWI_CrossPlay_K2Node_ComponentBoundEvent_2_StateChanged__DelegateSignature(bool IsChecked);
	void PreConstruct(bool IsDesignTime);
	void Set_Gamepad_Focus();
	void Update_Values();
	void BndEvt__CM_GameTabWI_CM_ClickableSubTitleWI_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature();
	void Update_Tool_Tips_Checkbox();
	void UpdateAndSaveToolTips(bool DisableTooltips, class Ubp_SpecialOptionsSave_C* SpecialOptions);
	void UpdateAndSaveCrossPlayOption(bool AllowCrossPlatformPlay, class Ubp_SpecialOptionsSave_C* SpecialOptions);
	void RecreateGameTabContent(class UWidget* InFirstRowContent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_GameTabWI_C">();
	}
	static class UCM_GameTabWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_GameTabWI_C>();
	}
};
static_assert(alignof(UCM_GameTabWI_C) == 0x000008, "Wrong alignment on UCM_GameTabWI_C");
static_assert(sizeof(UCM_GameTabWI_C) == 0x0002C8, "Wrong size on UCM_GameTabWI_C");
static_assert(offsetof(UCM_GameTabWI_C, UberGraphFrame_CM_GameTabWI_C) == 0x000268, "Member 'UCM_GameTabWI_C::UberGraphFrame_CM_GameTabWI_C' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, CM_CheckboxWI_CrossPlay) == 0x000270, "Member 'UCM_GameTabWI_C::CM_CheckboxWI_CrossPlay' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, CM_ClickableSubTitleWI) == 0x000278, "Member 'UCM_GameTabWI_C::CM_ClickableSubTitleWI' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, CM_LanguageWI) == 0x000280, "Member 'UCM_GameTabWI_C::CM_LanguageWI' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, CM_MatchmakingLanguageWI) == 0x000288, "Member 'UCM_GameTabWI_C::CM_MatchmakingLanguageWI' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, CM_TabTitle) == 0x000290, "Member 'UCM_GameTabWI_C::CM_TabTitle' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, HorizontalBox_Resolution) == 0x000298, "Member 'UCM_GameTabWI_C::HorizontalBox_Resolution' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, HorizontalBoxVerify) == 0x0002A0, "Member 'UCM_GameTabWI_C::HorizontalBoxVerify' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, ScrollBox_Game) == 0x0002A8, "Member 'UCM_GameTabWI_C::ScrollBox_Game' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, ToolTips) == 0x0002B0, "Member 'UCM_GameTabWI_C::ToolTips' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, Special_Options) == 0x0002B8, "Member 'UCM_GameTabWI_C::Special_Options' has a wrong offset!");
static_assert(offsetof(UCM_GameTabWI_C, bCrossPlayVisible) == 0x0002C0, "Member 'UCM_GameTabWI_C::bCrossPlayVisible' has a wrong offset!");

}

