#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_HorizontalSelectionWI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CM_HorizontalSelectionWI.CM_HorizontalSelectionWI_C.ExecuteUbergraph_CM_HorizontalSelectionWI
// 0x0048 (0x0048 - 0x0000)
struct CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCM_HorizontalSelectionButtonWI_C*      K2Node_DynamicCast_AsCM_Horizontal_Selection_Button_WI; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI) == 0x000008, "Wrong alignment on CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI");
static_assert(sizeof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI) == 0x000048, "Wrong size on CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, EntryPoint) == 0x000000, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, CallFunc_Array_Get_Item) == 0x000020, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, K2Node_DynamicCast_AsCM_Horizontal_Selection_Button_WI) == 0x000030, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::K2Node_DynamicCast_AsCM_Horizontal_Selection_Button_WI' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI, K2Node_Event_IsDesignTime) == 0x000045, "Member 'CM_HorizontalSelectionWI_C_ExecuteUbergraph_CM_HorizontalSelectionWI::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function CM_HorizontalSelectionWI.CM_HorizontalSelectionWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CM_HorizontalSelectionWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_HorizontalSelectionWI_C_PreConstruct) == 0x000001, "Wrong alignment on CM_HorizontalSelectionWI_C_PreConstruct");
static_assert(sizeof(CM_HorizontalSelectionWI_C_PreConstruct) == 0x000001, "Wrong size on CM_HorizontalSelectionWI_C_PreConstruct");
static_assert(offsetof(CM_HorizontalSelectionWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CM_HorizontalSelectionWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CM_HorizontalSelectionWI.CM_HorizontalSelectionWI_C.SetNavigationButtonTextures
// 0x0004 (0x0004 - 0x0000)
struct CM_HorizontalSelectionWI_C_SetNavigationButtonTextures final
{
public:
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_HorizontalSelectionWI_C_SetNavigationButtonTextures) == 0x000001, "Wrong alignment on CM_HorizontalSelectionWI_C_SetNavigationButtonTextures");
static_assert(sizeof(CM_HorizontalSelectionWI_C_SetNavigationButtonTextures) == 0x000004, "Wrong size on CM_HorizontalSelectionWI_C_SetNavigationButtonTextures");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetNavigationButtonTextures, CallFunc_IsXboxPlatform_ReturnValue) == 0x000000, "Member 'CM_HorizontalSelectionWI_C_SetNavigationButtonTextures::CallFunc_IsXboxPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetNavigationButtonTextures, CallFunc_IsConsolePlatform_ReturnValue) == 0x000001, "Member 'CM_HorizontalSelectionWI_C_SetNavigationButtonTextures::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetNavigationButtonTextures, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'CM_HorizontalSelectionWI_C_SetNavigationButtonTextures::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetNavigationButtonTextures, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'CM_HorizontalSelectionWI_C_SetNavigationButtonTextures::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function CM_HorizontalSelectionWI.CM_HorizontalSelectionWI_C.SetXboxTexture
// 0x0018 (0x0018 - 0x0000)
struct CM_HorizontalSelectionWI_C_SetXboxTexture final
{
public:
	class UImage*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetXboxTexture_Value;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetXboxTexture_Success;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_HorizontalSelectionWI_C_SetXboxTexture) == 0x000008, "Wrong alignment on CM_HorizontalSelectionWI_C_SetXboxTexture");
static_assert(sizeof(CM_HorizontalSelectionWI_C_SetXboxTexture) == 0x000018, "Wrong size on CM_HorizontalSelectionWI_C_SetXboxTexture");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetXboxTexture, Target) == 0x000000, "Member 'CM_HorizontalSelectionWI_C_SetXboxTexture::Target' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetXboxTexture, CallFunc_GetXboxTexture_Value) == 0x000008, "Member 'CM_HorizontalSelectionWI_C_SetXboxTexture::CallFunc_GetXboxTexture_Value' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetXboxTexture, CallFunc_GetXboxTexture_Success) == 0x000010, "Member 'CM_HorizontalSelectionWI_C_SetXboxTexture::CallFunc_GetXboxTexture_Success' has a wrong offset!");

// Function CM_HorizontalSelectionWI.CM_HorizontalSelectionWI_C.SetVisibilityOfNavigationButtons
// 0x0007 (0x0007 - 0x0000)
struct CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingControllerOnPC_Value;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons) == 0x000001, "Wrong alignment on CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons");
static_assert(sizeof(CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons) == 0x000007, "Wrong size on CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons, Temp_bool_Variable) == 0x000000, "Member 'CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons, Temp_byte_Variable) == 0x000001, "Member 'CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons, Temp_byte_Variable_1) == 0x000002, "Member 'CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons, CallFunc_IsUsingControllerOnPC_Value) == 0x000003, "Member 'CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons::CallFunc_IsUsingControllerOnPC_Value' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons, CallFunc_IsConsolePlatform_ReturnValue) == 0x000004, "Member 'CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons, K2Node_Select_Default) == 0x000006, "Member 'CM_HorizontalSelectionWI_C_SetVisibilityOfNavigationButtons::K2Node_Select_Default' has a wrong offset!");

// Function CM_HorizontalSelectionWI.CM_HorizontalSelectionWI_C.SetSpaceBetweenEndcaps
// 0x0058 (0x0058 - 0x0000)
struct CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps final
{
public:
	float                                         HorizontalSpace;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCM_HorizontalSelectionButtonWI_C*      K2Node_DynamicCast_AsCM_Horizontal_Selection_Button_WI; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps) == 0x000008, "Wrong alignment on CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps");
static_assert(sizeof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps) == 0x000058, "Wrong size on CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, HorizontalSpace) == 0x000000, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::HorizontalSpace' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, CallFunc_Array_Get_Item) == 0x000038, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, K2Node_DynamicCast_AsCM_Horizontal_Selection_Button_WI) == 0x000048, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::K2Node_DynamicCast_AsCM_Horizontal_Selection_Button_WI' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, CallFunc_GetVisibility_ReturnValue) == 0x000051, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000052, "Member 'CM_HorizontalSelectionWI_C_SetSpaceBetweenEndcaps::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function CM_HorizontalSelectionWI.CM_HorizontalSelectionWI_C.GetXboxTexture
// 0x0038 (0x0038 - 0x0000)
struct CM_HorizontalSelectionWI_C_GetXboxTexture final
{
public:
	class UImage*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Value;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_HorizontalSelectionWI_C_GetXboxTexture) == 0x000008, "Wrong alignment on CM_HorizontalSelectionWI_C_GetXboxTexture");
static_assert(sizeof(CM_HorizontalSelectionWI_C_GetXboxTexture) == 0x000038, "Wrong size on CM_HorizontalSelectionWI_C_GetXboxTexture");
static_assert(offsetof(CM_HorizontalSelectionWI_C_GetXboxTexture, Target) == 0x000000, "Member 'CM_HorizontalSelectionWI_C_GetXboxTexture::Target' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_GetXboxTexture, Value) == 0x000008, "Member 'CM_HorizontalSelectionWI_C_GetXboxTexture::Value' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_GetXboxTexture, Success) == 0x000010, "Member 'CM_HorizontalSelectionWI_C_GetXboxTexture::Success' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_GetXboxTexture, K2Node_DynamicCast_AsTexture_2D) == 0x000018, "Member 'CM_HorizontalSelectionWI_C_GetXboxTexture::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_GetXboxTexture, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CM_HorizontalSelectionWI_C_GetXboxTexture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_GetXboxTexture, CallFunc_Map_Find_Value) == 0x000028, "Member 'CM_HorizontalSelectionWI_C_GetXboxTexture::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_GetXboxTexture, CallFunc_Map_Find_ReturnValue) == 0x000030, "Member 'CM_HorizontalSelectionWI_C_GetXboxTexture::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function CM_HorizontalSelectionWI.CM_HorizontalSelectionWI_C.IsUsingControllerOnPC
// 0x0020 (0x0020 - 0x0000)
struct CM_HorizontalSelectionWI_C_IsUsingControllerOnPC final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESCTControllerType                            CallFunc_GetLastControllerType_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_HorizontalSelectionWI_C_IsUsingControllerOnPC) == 0x000008, "Wrong alignment on CM_HorizontalSelectionWI_C_IsUsingControllerOnPC");
static_assert(sizeof(CM_HorizontalSelectionWI_C_IsUsingControllerOnPC) == 0x000020, "Wrong size on CM_HorizontalSelectionWI_C_IsUsingControllerOnPC");
static_assert(offsetof(CM_HorizontalSelectionWI_C_IsUsingControllerOnPC, Value) == 0x000000, "Member 'CM_HorizontalSelectionWI_C_IsUsingControllerOnPC::Value' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_IsUsingControllerOnPC, CallFunc_IsConsolePlatform_ReturnValue) == 0x000001, "Member 'CM_HorizontalSelectionWI_C_IsUsingControllerOnPC::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_IsUsingControllerOnPC, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'CM_HorizontalSelectionWI_C_IsUsingControllerOnPC::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_IsUsingControllerOnPC, K2Node_DynamicCast_AsSCTGame_Instance) == 0x000010, "Member 'CM_HorizontalSelectionWI_C_IsUsingControllerOnPC::K2Node_DynamicCast_AsSCTGame_Instance' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_IsUsingControllerOnPC, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CM_HorizontalSelectionWI_C_IsUsingControllerOnPC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_IsUsingControllerOnPC, CallFunc_GetLastControllerType_ReturnValue) == 0x000019, "Member 'CM_HorizontalSelectionWI_C_IsUsingControllerOnPC::CallFunc_GetLastControllerType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_HorizontalSelectionWI_C_IsUsingControllerOnPC, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'CM_HorizontalSelectionWI_C_IsUsingControllerOnPC::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

