#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_HostCrossplayMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_HostCrossplayMessage.CM_HostCrossplayMessage_C
// 0x0028 (0x0288 - 0x0260)
class UCM_HostCrossplayMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UTextBlock*                             CrossPlayText;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x0270(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSpeed;                                       // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bEnabled;                                          // 0x027C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinOpacity;                                        // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         TextSize;                                          // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_HostCrossplayMessage(int32 EntryPoint);
	void DisableCrossplayMessage();
	void OnFadeDown();
	void OnFadeUp();
	void EnableCrossplayMessage();
	void PreConstruct(bool IsDesignTime);
	void SetSlateFont();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_HostCrossplayMessage_C">();
	}
	static class UCM_HostCrossplayMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_HostCrossplayMessage_C>();
	}
};
static_assert(alignof(UCM_HostCrossplayMessage_C) == 0x000008, "Wrong alignment on UCM_HostCrossplayMessage_C");
static_assert(sizeof(UCM_HostCrossplayMessage_C) == 0x000288, "Wrong size on UCM_HostCrossplayMessage_C");
static_assert(offsetof(UCM_HostCrossplayMessage_C, UberGraphFrame) == 0x000260, "Member 'UCM_HostCrossplayMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_HostCrossplayMessage_C, CrossPlayText) == 0x000268, "Member 'UCM_HostCrossplayMessage_C::CrossPlayText' has a wrong offset!");
static_assert(offsetof(UCM_HostCrossplayMessage_C, TimerHandle) == 0x000270, "Member 'UCM_HostCrossplayMessage_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UCM_HostCrossplayMessage_C, InterpSpeed) == 0x000278, "Member 'UCM_HostCrossplayMessage_C::InterpSpeed' has a wrong offset!");
static_assert(offsetof(UCM_HostCrossplayMessage_C, bEnabled) == 0x00027C, "Member 'UCM_HostCrossplayMessage_C::bEnabled' has a wrong offset!");
static_assert(offsetof(UCM_HostCrossplayMessage_C, MinOpacity) == 0x000280, "Member 'UCM_HostCrossplayMessage_C::MinOpacity' has a wrong offset!");
static_assert(offsetof(UCM_HostCrossplayMessage_C, TextSize) == 0x000284, "Member 'UCM_HostCrossplayMessage_C::TextSize' has a wrong offset!");

}

