#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_MatchmakingLanguageWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.ExecuteUbergraph_CM_MatchmakingLanguageWI
// 0x01C0 (0x01C0 - 0x0000)
struct CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& UpdatedLanguage)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_UpdatedLanguage;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0054(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x005C(0x0008)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0064(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00A0(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0110(0x0070)(ConstParm)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_InitialLoadComplete_ReturnValue;          // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCachedMatchmakerLanguage_Matchmaker_Language; // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKeyIndex_ReturnValue;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI) == 0x000008, "Wrong alignment on CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI) == 0x0001C0, "Wrong size on CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, EntryPoint) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_DynamicCast_AsSCTGame_Instance) == 0x000020, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_DynamicCast_AsSCTGame_Instance' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, CallFunc_GetGameInstance_ReturnValue_1) == 0x000030, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_CustomEvent_UpdatedLanguage) == 0x000038, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_CustomEvent_UpdatedLanguage' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_DynamicCast_AsFCTGame_Instance_BP) == 0x000048, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_DynamicCast_AsFCTGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_Event_InFocusEvent_1) == 0x000054, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_Event_InFocusEvent) == 0x00005C, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_Event_MyGeometry) == 0x000064, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_Event_MouseEvent_1) == 0x0000A0, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_Event_MouseEvent) == 0x000110, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_ComponentBoundEvent_SelectedItem) == 0x000180, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_ComponentBoundEvent_SelectionType) == 0x000190, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000194, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, CallFunc_InitialLoadComplete_ReturnValue) == 0x0001A4, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::CallFunc_InitialLoadComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, CallFunc_GetCachedMatchmakerLanguage_Matchmaker_Language) == 0x0001A8, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::CallFunc_GetCachedMatchmakerLanguage_Matchmaker_Language' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI, CallFunc_GetKeyIndex_ReturnValue) == 0x0001B8, "Member 'CM_MatchmakingLanguageWI_C_ExecuteUbergraph_CM_MatchmakingLanguageWI::CallFunc_GetKeyIndex_ReturnValue' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.BndEvt__CM_MatchmakingLanguageWI_LanguageRestrictedMatchmakingComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct CM_MatchmakingLanguageWI_C_BndEvt__CM_MatchmakingLanguageWI_LanguageRestrictedMatchmakingComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_BndEvt__CM_MatchmakingLanguageWI_LanguageRestrictedMatchmakingComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on CM_MatchmakingLanguageWI_C_BndEvt__CM_MatchmakingLanguageWI_LanguageRestrictedMatchmakingComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_BndEvt__CM_MatchmakingLanguageWI_LanguageRestrictedMatchmakingComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on CM_MatchmakingLanguageWI_C_BndEvt__CM_MatchmakingLanguageWI_LanguageRestrictedMatchmakingComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_BndEvt__CM_MatchmakingLanguageWI_LanguageRestrictedMatchmakingComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_BndEvt__CM_MatchmakingLanguageWI_LanguageRestrictedMatchmakingComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_BndEvt__CM_MatchmakingLanguageWI_LanguageRestrictedMatchmakingComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'CM_MatchmakingLanguageWI_C_BndEvt__CM_MatchmakingLanguageWI_LanguageRestrictedMatchmakingComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct CM_MatchmakingLanguageWI_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_OnMouseLeave) == 0x000008, "Wrong alignment on CM_MatchmakingLanguageWI_C_OnMouseLeave");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_OnMouseLeave) == 0x000070, "Wrong size on CM_MatchmakingLanguageWI_C_OnMouseLeave");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct CM_MatchmakingLanguageWI_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_OnMouseEnter) == 0x000008, "Wrong alignment on CM_MatchmakingLanguageWI_C_OnMouseEnter");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_OnMouseEnter) == 0x0000A8, "Wrong size on CM_MatchmakingLanguageWI_C_OnMouseEnter");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'CM_MatchmakingLanguageWI_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CM_MatchmakingLanguageWI_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on CM_MatchmakingLanguageWI_C_OnRemovedFromFocusPath");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on CM_MatchmakingLanguageWI_C_OnRemovedFromFocusPath");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CM_MatchmakingLanguageWI_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on CM_MatchmakingLanguageWI_C_OnAddedToFocusPath");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_OnAddedToFocusPath) == 0x000008, "Wrong size on CM_MatchmakingLanguageWI_C_OnAddedToFocusPath");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.On Matchmaker Language Redraw
// 0x0010 (0x0010 - 0x0000)
struct CM_MatchmakingLanguageWI_C_On_Matchmaker_Language_Redraw final
{
public:
	class FString                                 UpdatedLanguage;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_On_Matchmaker_Language_Redraw) == 0x000008, "Wrong alignment on CM_MatchmakingLanguageWI_C_On_Matchmaker_Language_Redraw");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_On_Matchmaker_Language_Redraw) == 0x000010, "Wrong size on CM_MatchmakingLanguageWI_C_On_Matchmaker_Language_Redraw");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_On_Matchmaker_Language_Redraw, UpdatedLanguage) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_On_Matchmaker_Language_Redraw::UpdatedLanguage' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.GetSpecialOptions
// 0x0028 (0x0028 - 0x0000)
struct CM_MatchmakingLanguageWI_C_GetSpecialOptions final
{
public:
	class Ubp_SpecialOptionsSave_C*               SpecialOptions;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGame_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               K2Node_DynamicCast_AsBp_Special_Options_Save;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_GetSpecialOptions) == 0x000008, "Wrong alignment on CM_MatchmakingLanguageWI_C_GetSpecialOptions");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_GetSpecialOptions) == 0x000028, "Wrong size on CM_MatchmakingLanguageWI_C_GetSpecialOptions");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_GetSpecialOptions, SpecialOptions) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_GetSpecialOptions::SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_GetSpecialOptions, CallFunc_LoadGame_ReturnValue) == 0x000008, "Member 'CM_MatchmakingLanguageWI_C_GetSpecialOptions::CallFunc_LoadGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_GetSpecialOptions, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000010, "Member 'CM_MatchmakingLanguageWI_C_GetSpecialOptions::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_GetSpecialOptions, K2Node_DynamicCast_AsBp_Special_Options_Save) == 0x000018, "Member 'CM_MatchmakingLanguageWI_C_GetSpecialOptions::K2Node_DynamicCast_AsBp_Special_Options_Save' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_GetSpecialOptions, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CM_MatchmakingLanguageWI_C_GetSpecialOptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.Set Selected Index Visually Only
// 0x000C (0x000C - 0x0000)
struct CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only) == 0x000004, "Wrong alignment on CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only) == 0x00000C, "Wrong size on CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only, Index_0) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only::Index_0' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'CM_MatchmakingLanguageWI_C_Set_Selected_Index_Visually_Only::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.SaveSelectedOption
// 0x0048 (0x0048 - 0x0000)
struct CM_MatchmakingLanguageWI_C_SaveSelectedOption final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 L_Matchmaker_Language;                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindOptionIndex_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetKeyAt_ReturnValue;                     // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_SaveSelectedOption) == 0x000008, "Wrong alignment on CM_MatchmakingLanguageWI_C_SaveSelectedOption");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_SaveSelectedOption) == 0x000048, "Wrong size on CM_MatchmakingLanguageWI_C_SaveSelectedOption");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_SaveSelectedOption, Option) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_SaveSelectedOption::Option' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_SaveSelectedOption, L_Matchmaker_Language) == 0x000010, "Member 'CM_MatchmakingLanguageWI_C_SaveSelectedOption::L_Matchmaker_Language' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_SaveSelectedOption, CallFunc_IsEmpty_ReturnValue) == 0x000020, "Member 'CM_MatchmakingLanguageWI_C_SaveSelectedOption::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_SaveSelectedOption, CallFunc_GetSpecialOptions_SpecialOptions) == 0x000028, "Member 'CM_MatchmakingLanguageWI_C_SaveSelectedOption::CallFunc_GetSpecialOptions_SpecialOptions' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_SaveSelectedOption, CallFunc_FindOptionIndex_ReturnValue) == 0x000030, "Member 'CM_MatchmakingLanguageWI_C_SaveSelectedOption::CallFunc_FindOptionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_SaveSelectedOption, CallFunc_SaveGame_ReturnValue) == 0x000034, "Member 'CM_MatchmakingLanguageWI_C_SaveSelectedOption::CallFunc_SaveGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_SaveSelectedOption, CallFunc_GetKeyAt_ReturnValue) == 0x000038, "Member 'CM_MatchmakingLanguageWI_C_SaveSelectedOption::CallFunc_GetKeyAt_ReturnValue' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.TriggerGameInstanceDelegate
// 0x0018 (0x0018 - 0x0000)
struct CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate) == 0x000008, "Wrong alignment on CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate) == 0x000018, "Wrong size on CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate, K2Node_DynamicCast_AsFCTGame_Instance_BP) == 0x000008, "Member 'CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate::K2Node_DynamicCast_AsFCTGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'CM_MatchmakingLanguageWI_C_TriggerGameInstanceDelegate::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CM_MatchmakingLanguageWI.CM_MatchmakingLanguageWI_C.GetCachedMatchmakerLanguage
// 0x0028 (0x0028 - 0x0000)
struct CM_MatchmakingLanguageWI_C_GetCachedMatchmakerLanguage final
{
public:
	class FString                                 Matchmaker_Language;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_MatchmakingLanguageWI_C_GetCachedMatchmakerLanguage) == 0x000008, "Wrong alignment on CM_MatchmakingLanguageWI_C_GetCachedMatchmakerLanguage");
static_assert(sizeof(CM_MatchmakingLanguageWI_C_GetCachedMatchmakerLanguage) == 0x000028, "Wrong size on CM_MatchmakingLanguageWI_C_GetCachedMatchmakerLanguage");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_GetCachedMatchmakerLanguage, Matchmaker_Language) == 0x000000, "Member 'CM_MatchmakingLanguageWI_C_GetCachedMatchmakerLanguage::Matchmaker_Language' has a wrong offset!");
static_assert(offsetof(CM_MatchmakingLanguageWI_C_GetCachedMatchmakerLanguage, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'CM_MatchmakingLanguageWI_C_GetCachedMatchmakerLanguage::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
