#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_PartyFullContentDialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CM_ContentDialog_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_PartyFullContentDialog.CM_PartyFullContentDialog_C
// 0x0018 (0x02D8 - 0x02C0)
class UCM_PartyFullContentDialog_C final : public UCM_ContentDialog_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Background;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              ConfirmButton;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_PartyFullContentDialog(int32 EntryPoint);
	void BndEvt__CM_PartyFullContentDialog_ConfirmButton_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_PartyFullContentDialog_C">();
	}
	static class UCM_PartyFullContentDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_PartyFullContentDialog_C>();
	}
};
static_assert(alignof(UCM_PartyFullContentDialog_C) == 0x000008, "Wrong alignment on UCM_PartyFullContentDialog_C");
static_assert(sizeof(UCM_PartyFullContentDialog_C) == 0x0002D8, "Wrong size on UCM_PartyFullContentDialog_C");
static_assert(offsetof(UCM_PartyFullContentDialog_C, UberGraphFrame) == 0x0002C0, "Member 'UCM_PartyFullContentDialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_PartyFullContentDialog_C, Background) == 0x0002C8, "Member 'UCM_PartyFullContentDialog_C::Background' has a wrong offset!");
static_assert(offsetof(UCM_PartyFullContentDialog_C, ConfirmButton) == 0x0002D0, "Member 'UCM_PartyFullContentDialog_C::ConfirmButton' has a wrong offset!");

}

