#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_PlayNow

#include "Basic.hpp"

#include "AccelByteUe4Sdk_structs.hpp"
#include "Engine_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_PlayNow.CM_PlayNow_C
// 0x0208 (0x0468 - 0x0260)
class UCM_PlayNow_C final : public UMatchmakingLobbyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_ClickableSubTitleWI_C*              CancelFindGameWidget;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              CreateCustomGameWidget;                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CustomGameButtonVtBox;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              FindGameWidget;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        HostButtonState;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              InitializingFindGameWidget;                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LangPreferenceText;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerRequirementsCustomGameText;                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerRequirementsCustomGameText_1;                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URoundedBGBoxWI_C*                      RoundedBGBoxWI;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URoundedBGBoxWI_C*                      RoundedBGBoxWI_1;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              WaitingForHostWidget;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ServerName1;                                       // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnRecievedMatchmakingResponse;                     // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnStartHostCountdown;                              // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCancelHostCountdown;                             // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnConsoleReconnect;                                // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCM_MainMenuWI_C*                       CM_MainMenuParent;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAccountUserData                       UserData;                                          // 0x0320(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnAddBanMessage;                                   // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAkAudioEvent*                          Button_Press;                                      // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          MatchmakingCancelSuccess;                          // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AK_OnStopFindGame;                                 // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnRecievedMatchmakingResponse__DelegateSignature(EAccelByteMatchmakingStatus Response);
	void OnStartHostCountdown__DelegateSignature();
	void OnCancelHostCountdown__DelegateSignature();
	void OnConsoleReconnect__DelegateSignature();
	void OnAddBanMessage__DelegateSignature(const TMap<class FString, class FString>& Params_0);
	void ExecuteUbergraph_CM_PlayNow(int32 EntryPoint);
	void OnLeaveCustomGameMenu();
	void BndEvt__CM_PlayNow_CreateCustomGameWidget_K2Node_ComponentBoundEvent_7_OnButtonState__DelegateSignature();
	void ActivateWidget();
	void OnInitialized();
	void OnMatchmakingLanguageUpdated(const class FString& UpdatedLanguage);
	void OnStartPS5MainActivity();
	void OnJoinedParty(bool IsHost);
	void OnClientLoggedIn();
	void CancelHostCountdown();
	void StartHostCountdown();
	void BndEvt__CM_PlayNow_CancelFindGameWidget_K2Node_ComponentBoundEvent_5_OnHoldStart__DelegateSignature();
	void BndEvt__CM_PlayNow_FindGameWidget_K2Node_ComponentBoundEvent_4_OnHoldStart__DelegateSignature();
	void BndEvt__CM_PlayNow_CancelFindGameWidget_K2Node_ComponentBoundEvent_3_OnHoldComplete__DelegateSignature();
	void BndEvt__CM_PlayNow_FindGameWidget_K2Node_ComponentBoundEvent_2_OnHoldComplete__DelegateSignature();
	void Construct();
	void OnSetPartyMemberUI();
	void BndEvt__CM_PlayNow_CancelFindGameWidget_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature();
	void BndEvt__CM_PlayNow_CM_ClickableSubTitleWI_1_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void OnStartMatchmakingAfterCountdown();
	void OnMatchmakingNotif(const struct FAccelByteModelsMatchmakingNotice& Notification);
	void DeactivateWidget();
	void OnSuccess_576C8CDD43A1CBABF0711DB568948834(const struct FAccelByteModelsInfoPartyResponse& PartyInfo);
	void OnFail_576C8CDD43A1CBABF0711DB568948834();
	void OnSuccess_3F42D9BD4256E92F55B4E4BC64B40140();
	void OnFail_3F42D9BD4256E92F55B4E4BC64B40140();
	void OnSuccess_F4C3994C477803AB8C317198824CFBDC(const struct FAccountUserData& Result, const class FString& Message, int32 Code);
	void OnError_F4C3994C477803AB8C317198824CFBDC(const class FString& Message, int32 Code);
	void OnSuccess_443723844D17E305DCB5CDA90F7B76EF();
	void OnFail_443723844D17E305DCB5CDA90F7B76EF();
	void OnSuccess_576C8CDD43A1CBABF0711DB5CFB8801E(const struct FAccelByteModelsInfoPartyResponse& PartyInfo);
	void OnFail_576C8CDD43A1CBABF0711DB5CFB8801E();
	void OnSuccess_3DED6FF246B4C805D8831883697AEB88(const struct FFCTUserBansPayload& Bans, int32 Code, const class FString& Message);
	void OnError_3DED6FF246B4C805D8831883697AEB88(const struct FFCTUserBansPayload& Bans, int32 Code, const class FString& Message);
	void OnSuccess_576C8CDD43A1CBABF0711DB5B630051D(const struct FAccelByteModelsInfoPartyResponse& PartyInfo);
	void OnFail_576C8CDD43A1CBABF0711DB5B630051D();
	void GetABGameMode(class FString* GameMode);
	void ResetUI();
	void Set_Party_Member_UIBy_Leader_ID(const class FString& LeaderId);
	void IsOnPlayNowTab(bool* IsOnTab);
	void SetMemberUI(bool IsHost, int32 Count);
	void SetFindCancelGameUI(bool FindingGame);
	void UpdateLanguagePrefText(const class FString& Language);
	bool IsHostByActiveWidget();
	class AAKEventHolder_C* GetAKEventHolder();
	void OnPartyMemberLeft(const class FString& LeaderId);
	void SetHostPartyMemberUI(int32 Count);
	void SetGuestPartyMemberUI();
	void Set_CustomGamesEnabledState(bool bIsEnabled_0);
	void Get_Party_Member_Count(int32* Count);

	void Get_Host_Preference_Settings(bool* Out_AllowCrossPlatformPlay, class FString* Out_Matchmaker_Language) const;
	void GetPartySizeRequired(int32* Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_PlayNow_C">();
	}
	static class UCM_PlayNow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_PlayNow_C>();
	}
};
static_assert(alignof(UCM_PlayNow_C) == 0x000008, "Wrong alignment on UCM_PlayNow_C");
static_assert(sizeof(UCM_PlayNow_C) == 0x000468, "Wrong size on UCM_PlayNow_C");
static_assert(offsetof(UCM_PlayNow_C, UberGraphFrame) == 0x000260, "Member 'UCM_PlayNow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, CancelFindGameWidget) == 0x000268, "Member 'UCM_PlayNow_C::CancelFindGameWidget' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, CreateCustomGameWidget) == 0x000270, "Member 'UCM_PlayNow_C::CreateCustomGameWidget' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, CustomGameButtonVtBox) == 0x000278, "Member 'UCM_PlayNow_C::CustomGameButtonVtBox' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, FindGameWidget) == 0x000280, "Member 'UCM_PlayNow_C::FindGameWidget' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, HostButtonState) == 0x000288, "Member 'UCM_PlayNow_C::HostButtonState' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, InitializingFindGameWidget) == 0x000290, "Member 'UCM_PlayNow_C::InitializingFindGameWidget' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, LangPreferenceText) == 0x000298, "Member 'UCM_PlayNow_C::LangPreferenceText' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, PlayerRequirementsCustomGameText) == 0x0002A0, "Member 'UCM_PlayNow_C::PlayerRequirementsCustomGameText' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, PlayerRequirementsCustomGameText_1) == 0x0002A8, "Member 'UCM_PlayNow_C::PlayerRequirementsCustomGameText_1' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, RoundedBGBoxWI) == 0x0002B0, "Member 'UCM_PlayNow_C::RoundedBGBoxWI' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, RoundedBGBoxWI_1) == 0x0002B8, "Member 'UCM_PlayNow_C::RoundedBGBoxWI_1' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, WaitingForHostWidget) == 0x0002C0, "Member 'UCM_PlayNow_C::WaitingForHostWidget' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, ServerName1) == 0x0002C8, "Member 'UCM_PlayNow_C::ServerName1' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, OnRecievedMatchmakingResponse) == 0x0002D8, "Member 'UCM_PlayNow_C::OnRecievedMatchmakingResponse' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, OnStartHostCountdown) == 0x0002E8, "Member 'UCM_PlayNow_C::OnStartHostCountdown' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, OnCancelHostCountdown) == 0x0002F8, "Member 'UCM_PlayNow_C::OnCancelHostCountdown' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, OnConsoleReconnect) == 0x000308, "Member 'UCM_PlayNow_C::OnConsoleReconnect' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, CM_MainMenuParent) == 0x000318, "Member 'UCM_PlayNow_C::CM_MainMenuParent' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, UserData) == 0x000320, "Member 'UCM_PlayNow_C::UserData' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, OnAddBanMessage) == 0x000440, "Member 'UCM_PlayNow_C::OnAddBanMessage' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, Button_Press) == 0x000450, "Member 'UCM_PlayNow_C::Button_Press' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, MatchmakingCancelSuccess) == 0x000458, "Member 'UCM_PlayNow_C::MatchmakingCancelSuccess' has a wrong offset!");
static_assert(offsetof(UCM_PlayNow_C, AK_OnStopFindGame) == 0x000460, "Member 'UCM_PlayNow_C::AK_OnStopFindGame' has a wrong offset!");

}

