#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_PartyJoinFailedCrossPlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CM_ContentDialog_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_PartyJoinFailedCrossPlay.CM_PartyJoinFailedCrossPlay_C
// 0x0020 (0x02E0 - 0x02C0)
class UCM_PartyJoinFailedCrossPlay_C final : public UCM_ContentDialog_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Background;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_125;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              ConfirmButton;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_PartyJoinFailedCrossPlay(int32 EntryPoint);
	void BndEvt__CM_PartyJoinFailedCrossPlay_Button_125_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__CM_PartyFullContentDialog_ConfirmButton_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_PartyJoinFailedCrossPlay_C">();
	}
	static class UCM_PartyJoinFailedCrossPlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_PartyJoinFailedCrossPlay_C>();
	}
};
static_assert(alignof(UCM_PartyJoinFailedCrossPlay_C) == 0x000008, "Wrong alignment on UCM_PartyJoinFailedCrossPlay_C");
static_assert(sizeof(UCM_PartyJoinFailedCrossPlay_C) == 0x0002E0, "Wrong size on UCM_PartyJoinFailedCrossPlay_C");
static_assert(offsetof(UCM_PartyJoinFailedCrossPlay_C, UberGraphFrame) == 0x0002C0, "Member 'UCM_PartyJoinFailedCrossPlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_PartyJoinFailedCrossPlay_C, Background) == 0x0002C8, "Member 'UCM_PartyJoinFailedCrossPlay_C::Background' has a wrong offset!");
static_assert(offsetof(UCM_PartyJoinFailedCrossPlay_C, Button_125) == 0x0002D0, "Member 'UCM_PartyJoinFailedCrossPlay_C::Button_125' has a wrong offset!");
static_assert(offsetof(UCM_PartyJoinFailedCrossPlay_C, ConfirmButton) == 0x0002D8, "Member 'UCM_PartyJoinFailedCrossPlay_C::ConfirmButton' has a wrong offset!");

}

