#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_SubMenuWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_SubMenuWI.CM_SubMenuWI_C
// 0x0100 (0x03D0 - 0x02D0)
class UCM_SubMenuWI_C final : public USubMenuUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UHorizontalBox*                         HorizontalBox_1;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_194;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L2button;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftCap;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R2button;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightCap;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          HidePreviewItems;                                  // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCM_SubMenuSelectionButtonWI_C*> ButtonsInMenu;                                     // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWidgetSwitcher*                        WidgetSwitcherToAffect;                            // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnNavigate;                                        // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         SelectedIndex;                                     // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreventNavigation;                                 // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnterTimestamp;                                    // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SoundTimeLimit;                                    // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UTexture2D*, class UTexture2D*>    ButtonTextureConversionMap;                        // 0x0380(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnNavigate__DelegateSignature(const class FString& Title);
	void ExecuteUbergraph_CM_SubMenuWI(int32 EntryPoint);
	void ResetDisplay();
	void PreConstruct(bool IsDesignTime);
	void ButtonEvent();
	void Construct();
	void Navigate_Left();
	void Remove_Bindings_To_Triggers();
	void Set_Up_Bindings_To_Triggers();
	void Navigate_Right();
	void CustomEvent_0();
	void AddMenuItem(const class FText& Title, float Width, class UCM_SubMenuSelectionButtonWI_C** MenuItem);
	void SetActiveWidgetSelectionAsSelected(class UCM_SubMenuSelectionButtonWI_C* SelectionButton);
	void NavigateSubMenu(bool Right);
	void Navigate_Sub_Menu_to_Specific(int32 Index_0);
	void ManualSelectedIndexUpdate(int32 Index_0);
	void UpdateNavigationButtons();
	void SetNavigationButtonTextures();
	void SetXboxTexture(class UImage* Target);

	bool IsUsingControllerOnPC() const;
	void GetXboxTexture(class UImage* Target, class UTexture2D** Value, bool* Success) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_SubMenuWI_C">();
	}
	static class UCM_SubMenuWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_SubMenuWI_C>();
	}
};
static_assert(alignof(UCM_SubMenuWI_C) == 0x000008, "Wrong alignment on UCM_SubMenuWI_C");
static_assert(sizeof(UCM_SubMenuWI_C) == 0x0003D0, "Wrong size on UCM_SubMenuWI_C");
static_assert(offsetof(UCM_SubMenuWI_C, UberGraphFrame) == 0x0002D0, "Member 'UCM_SubMenuWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, HorizontalBox_1) == 0x0002D8, "Member 'UCM_SubMenuWI_C::HorizontalBox_1' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, Image) == 0x0002E0, "Member 'UCM_SubMenuWI_C::Image' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, Image_1) == 0x0002E8, "Member 'UCM_SubMenuWI_C::Image_1' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, Image_3) == 0x0002F0, "Member 'UCM_SubMenuWI_C::Image_3' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, Image_4) == 0x0002F8, "Member 'UCM_SubMenuWI_C::Image_4' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, Image_5) == 0x000300, "Member 'UCM_SubMenuWI_C::Image_5' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, Image_7) == 0x000308, "Member 'UCM_SubMenuWI_C::Image_7' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, Image_8) == 0x000310, "Member 'UCM_SubMenuWI_C::Image_8' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, Image_194) == 0x000318, "Member 'UCM_SubMenuWI_C::Image_194' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, L2button) == 0x000320, "Member 'UCM_SubMenuWI_C::L2button' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, LeftCap) == 0x000328, "Member 'UCM_SubMenuWI_C::LeftCap' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, R2button) == 0x000330, "Member 'UCM_SubMenuWI_C::R2button' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, RightCap) == 0x000338, "Member 'UCM_SubMenuWI_C::RightCap' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, HidePreviewItems) == 0x000340, "Member 'UCM_SubMenuWI_C::HidePreviewItems' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, ButtonsInMenu) == 0x000348, "Member 'UCM_SubMenuWI_C::ButtonsInMenu' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, WidgetSwitcherToAffect) == 0x000358, "Member 'UCM_SubMenuWI_C::WidgetSwitcherToAffect' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, OnNavigate) == 0x000360, "Member 'UCM_SubMenuWI_C::OnNavigate' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, SelectedIndex) == 0x000370, "Member 'UCM_SubMenuWI_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, PreventNavigation) == 0x000374, "Member 'UCM_SubMenuWI_C::PreventNavigation' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, EnterTimestamp) == 0x000378, "Member 'UCM_SubMenuWI_C::EnterTimestamp' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, SoundTimeLimit) == 0x00037C, "Member 'UCM_SubMenuWI_C::SoundTimeLimit' has a wrong offset!");
static_assert(offsetof(UCM_SubMenuWI_C, ButtonTextureConversionMap) == 0x000380, "Member 'UCM_SubMenuWI_C::ButtonTextureConversionMap' has a wrong offset!");

}

