#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_TabTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_TabTitle.CM_TabTitle_C
// 0x0050 (0x02B0 - 0x0260)
class UCM_TabTitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBorder*                                Border_BG;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_23;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SubMenu;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_65;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0290(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         BottomBorderPadding;                               // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_TabTitle(int32 EntryPoint);
	void Set_Bottom_Border_Padding(float In_Size_Y);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_TabTitle_C">();
	}
	static class UCM_TabTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_TabTitle_C>();
	}
};
static_assert(alignof(UCM_TabTitle_C) == 0x000008, "Wrong alignment on UCM_TabTitle_C");
static_assert(sizeof(UCM_TabTitle_C) == 0x0002B0, "Wrong size on UCM_TabTitle_C");
static_assert(offsetof(UCM_TabTitle_C, UberGraphFrame) == 0x000260, "Member 'UCM_TabTitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCM_TabTitle_C, Border_BG) == 0x000268, "Member 'UCM_TabTitle_C::Border_BG' has a wrong offset!");
static_assert(offsetof(UCM_TabTitle_C, Image) == 0x000270, "Member 'UCM_TabTitle_C::Image' has a wrong offset!");
static_assert(offsetof(UCM_TabTitle_C, Image_23) == 0x000278, "Member 'UCM_TabTitle_C::Image_23' has a wrong offset!");
static_assert(offsetof(UCM_TabTitle_C, TextBlock_SubMenu) == 0x000280, "Member 'UCM_TabTitle_C::TextBlock_SubMenu' has a wrong offset!");
static_assert(offsetof(UCM_TabTitle_C, VerticalBox_65) == 0x000288, "Member 'UCM_TabTitle_C::VerticalBox_65' has a wrong offset!");
static_assert(offsetof(UCM_TabTitle_C, Text) == 0x000290, "Member 'UCM_TabTitle_C::Text' has a wrong offset!");
static_assert(offsetof(UCM_TabTitle_C, BottomBorderPadding) == 0x0002A8, "Member 'UCM_TabTitle_C::BottomBorderPadding' has a wrong offset!");

}

