#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_TheBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CM_MenuAreaWI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CM_TheBar.CM_TheBar_C
// 0x0060 (0x02C8 - 0x0268)
class UCM_TheBar_C final : public UCM_MenuAreaWI_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CM_TheBar_C;                        // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_BarLiveMessage_C*                   CM_BarLiveMessage;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_MicrophoneRecommended_C*            CM_MicrophoneRecommended;                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CompleteAMatchButton;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DebugAchievements;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_87;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PlayGardens10Times;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PlayMaintenance10Times;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Win5Matches;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         XboxSwitchUserPrompt;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsDebug;                                           // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            XboxLoadingSpinner;                                // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CM_TheBar(int32 EntryPoint);
	void OnSwitchXboxUser();
	void DpadRightPressed();
	void DpadLeftPressed();
	void OnInitialized();
	void DeactivateWidget();
	void OnCarouselClicked();
	void ActivateWidget();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__CM_TheBar_PlayMaintenance10Times_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__CM_TheBar_PlayGardens10Times_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__CM_TheBar_CompleteAMatchButton_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__CM_TheBar_Win5Matches_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void OnSuccessNewUser_AC0809644530970FAB3F7BB74225418B(class APlayerController* PlayerController);
	void OnSuccessExistingUser_AC0809644530970FAB3F7BB74225418B(class APlayerController* PlayerController);
	void OnFailure_AC0809644530970FAB3F7BB74225418B(class APlayerController* PlayerController);
	void OnSuccess_2D52C04E4BBCC75F1D52F88BB16BBFF0(class UFCTAchievement* AchievementInfo, const class FString& Message);
	void OnError_2D52C04E4BBCC75F1D52F88BB16BBFF0(const class FString& Message);
	void OnSuccess_B58F06BF46FAA5BF77D8F199C9FF8231(class UFCTAchievement* AchievementInfo, const class FString& Message);
	void OnError_B58F06BF46FAA5BF77D8F199C9FF8231(const class FString& Message);
	void OnSuccess_6E8493764D2695F0004DBBB7702F6EC6(class UFCTAchievement* AchievementInfo, const class FString& Message);
	void OnError_6E8493764D2695F0004DBBB7702F6EC6(const class FString& Message);
	void OnSuccess_8DD72F9445E924A7150CDF9300C8FBAA(class UFCTAchievement* AchievementInfo, const class FString& Message);
	void OnError_8DD72F9445E924A7150CDF9300C8FBAA(const class FString& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CM_TheBar_C">();
	}
	static class UCM_TheBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCM_TheBar_C>();
	}
};
static_assert(alignof(UCM_TheBar_C) == 0x000008, "Wrong alignment on UCM_TheBar_C");
static_assert(sizeof(UCM_TheBar_C) == 0x0002C8, "Wrong size on UCM_TheBar_C");
static_assert(offsetof(UCM_TheBar_C, UberGraphFrame_CM_TheBar_C) == 0x000268, "Member 'UCM_TheBar_C::UberGraphFrame_CM_TheBar_C' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, CM_BarLiveMessage) == 0x000270, "Member 'UCM_TheBar_C::CM_BarLiveMessage' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, CM_MicrophoneRecommended) == 0x000278, "Member 'UCM_TheBar_C::CM_MicrophoneRecommended' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, CompleteAMatchButton) == 0x000280, "Member 'UCM_TheBar_C::CompleteAMatchButton' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, DebugAchievements) == 0x000288, "Member 'UCM_TheBar_C::DebugAchievements' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, Image_87) == 0x000290, "Member 'UCM_TheBar_C::Image_87' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, PlayGardens10Times) == 0x000298, "Member 'UCM_TheBar_C::PlayGardens10Times' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, PlayMaintenance10Times) == 0x0002A0, "Member 'UCM_TheBar_C::PlayMaintenance10Times' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, Win5Matches) == 0x0002A8, "Member 'UCM_TheBar_C::Win5Matches' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, XboxSwitchUserPrompt) == 0x0002B0, "Member 'UCM_TheBar_C::XboxSwitchUserPrompt' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, IsDebug) == 0x0002B8, "Member 'UCM_TheBar_C::IsDebug' has a wrong offset!");
static_assert(offsetof(UCM_TheBar_C, XboxLoadingSpinner) == 0x0002C0, "Member 'UCM_TheBar_C::XboxLoadingSpinner' has a wrong offset!");

}

