#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CM_Tutorials

#include "Basic.hpp"


namespace SDK::Params
{

// Function CM_Tutorials.CM_Tutorials_C.ExecuteUbergraph_CM_Tutorials
// 0x00F8 (0x00F8 - 0x0000)
struct CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& Title)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCM_SubMenuSelectionButtonWI_C*         CallFunc_AddMenuItem_MenuItem;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         CallFunc_AddMenuItem_MenuItem_1;                   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Title;                          // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCM_SubMenuSelectionButtonWI_C*         CallFunc_AddMenuItem_MenuItem_2;                   // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         CallFunc_AddMenuItem_MenuItem_3;                   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         CallFunc_AddMenuItem_MenuItem_4;                   // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         CallFunc_AddMenuItem_MenuItem_5;                   // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCM_SubMenuSelectionButtonWI_C*         CallFunc_AddMenuItem_MenuItem_6;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials) == 0x000008, "Wrong alignment on CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials");
static_assert(sizeof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials) == 0x0000F8, "Wrong size on CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, EntryPoint) == 0x000000, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::EntryPoint' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_CreateDelegate_OutputDelegate_6) == 0x000064, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_CreateDelegate_OutputDelegate_7) == 0x000074, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, Temp_bool_IsClosed_Variable) == 0x000084, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, Temp_bool_Has_Been_Initd_Variable) == 0x000085, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, CallFunc_AddMenuItem_MenuItem) == 0x000088, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::CallFunc_AddMenuItem_MenuItem' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, CallFunc_AddMenuItem_MenuItem_1) == 0x000090, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::CallFunc_AddMenuItem_MenuItem_1' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_CustomEvent_Title) == 0x000098, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_CustomEvent_Title' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, CallFunc_Conv_StringToInt_ReturnValue) == 0x0000A8, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, CallFunc_AddMenuItem_MenuItem_2) == 0x0000B0, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::CallFunc_AddMenuItem_MenuItem_2' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, CallFunc_AddMenuItem_MenuItem_3) == 0x0000B8, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::CallFunc_AddMenuItem_MenuItem_3' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, CallFunc_AddMenuItem_MenuItem_4) == 0x0000C0, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::CallFunc_AddMenuItem_MenuItem_4' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, CallFunc_AddMenuItem_MenuItem_5) == 0x0000C8, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::CallFunc_AddMenuItem_MenuItem_5' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, CallFunc_AddMenuItem_MenuItem_6) == 0x0000D0, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::CallFunc_AddMenuItem_MenuItem_6' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000D8, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_CustomEvent_Index) == 0x0000DC, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, K2Node_SwitchInteger_CmpSuccess) == 0x0000E0, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, CallFunc_PlayAnimation_ReturnValue) == 0x0000E8, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials, Temp_bool_IsClosed_Variable_1) == 0x0000F0, "Member 'CM_Tutorials_C_ExecuteUbergraph_CM_Tutorials::Temp_bool_IsClosed_Variable_1' has a wrong offset!");

// Function CM_Tutorials.CM_Tutorials_C.Show Tutorial Index
// 0x0004 (0x0004 - 0x0000)
struct CM_Tutorials_C_Show_Tutorial_Index final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_Tutorials_C_Show_Tutorial_Index) == 0x000004, "Wrong alignment on CM_Tutorials_C_Show_Tutorial_Index");
static_assert(sizeof(CM_Tutorials_C_Show_Tutorial_Index) == 0x000004, "Wrong size on CM_Tutorials_C_Show_Tutorial_Index");
static_assert(offsetof(CM_Tutorials_C_Show_Tutorial_Index, Index_0) == 0x000000, "Member 'CM_Tutorials_C_Show_Tutorial_Index::Index_0' has a wrong offset!");

// Function CM_Tutorials.CM_Tutorials_C.On Navigate Menu With Gamepad
// 0x0010 (0x0010 - 0x0000)
struct CM_Tutorials_C_On_Navigate_Menu_With_Gamepad final
{
public:
	class FString                                 Title;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CM_Tutorials_C_On_Navigate_Menu_With_Gamepad) == 0x000008, "Wrong alignment on CM_Tutorials_C_On_Navigate_Menu_With_Gamepad");
static_assert(sizeof(CM_Tutorials_C_On_Navigate_Menu_With_Gamepad) == 0x000010, "Wrong size on CM_Tutorials_C_On_Navigate_Menu_With_Gamepad");
static_assert(offsetof(CM_Tutorials_C_On_Navigate_Menu_With_Gamepad, Title) == 0x000000, "Member 'CM_Tutorials_C_On_Navigate_Menu_With_Gamepad::Title' has a wrong offset!");

// Function CM_Tutorials.CM_Tutorials_C.CanGoFurther
// 0x0014 (0x0014 - 0x0000)
struct CM_Tutorials_C_CanGoFurther final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CM_Tutorials_C_CanGoFurther) == 0x000004, "Wrong alignment on CM_Tutorials_C_CanGoFurther");
static_assert(sizeof(CM_Tutorials_C_CanGoFurther) == 0x000014, "Wrong size on CM_Tutorials_C_CanGoFurther");
static_assert(offsetof(CM_Tutorials_C_CanGoFurther, NewIndex) == 0x000000, "Member 'CM_Tutorials_C_CanGoFurther::NewIndex' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_CanGoFurther, Return) == 0x000004, "Member 'CM_Tutorials_C_CanGoFurther::Return' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_CanGoFurther, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000008, "Member 'CM_Tutorials_C_CanGoFurther::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_CanGoFurther, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'CM_Tutorials_C_CanGoFurther::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_CanGoFurther, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00000D, "Member 'CM_Tutorials_C_CanGoFurther::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_CanGoFurther, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'CM_Tutorials_C_CanGoFurther::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_CanGoFurther, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000F, "Member 'CM_Tutorials_C_CanGoFurther::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CM_Tutorials_C_CanGoFurther, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'CM_Tutorials_C_CanGoFurther::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

