#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConsoleIconMainMenuWI

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ConsoleIconMainMenuWI.ConsoleIconMainMenuWI_C.ExecuteUbergraph_ConsoleIconMainMenuWI
// 0x000C (0x000C - 0x0000)
struct ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingControllerOnPC_ReturnValue;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI) == 0x000004, "Wrong alignment on ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI");
static_assert(sizeof(ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI) == 0x00000C, "Wrong size on ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI");
static_assert(offsetof(ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI, EntryPoint) == 0x000000, "Member 'ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI, Temp_byte_Variable) == 0x000004, "Member 'ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI, Temp_byte_Variable_1) == 0x000005, "Member 'ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI, CallFunc_IsUsingControllerOnPC_ReturnValue) == 0x000006, "Member 'ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI::CallFunc_IsUsingControllerOnPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI, K2Node_Event_IsDesignTime) == 0x000007, "Member 'ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI, Temp_bool_Variable) == 0x000008, "Member 'ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI, K2Node_Select_Default) == 0x000009, "Member 'ConsoleIconMainMenuWI_C_ExecuteUbergraph_ConsoleIconMainMenuWI::K2Node_Select_Default' has a wrong offset!");

// Function ConsoleIconMainMenuWI.ConsoleIconMainMenuWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ConsoleIconMainMenuWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ConsoleIconMainMenuWI_C_PreConstruct) == 0x000001, "Wrong alignment on ConsoleIconMainMenuWI_C_PreConstruct");
static_assert(sizeof(ConsoleIconMainMenuWI_C_PreConstruct) == 0x000001, "Wrong size on ConsoleIconMainMenuWI_C_PreConstruct");
static_assert(offsetof(ConsoleIconMainMenuWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ConsoleIconMainMenuWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

