#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConsoleIconWI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ControllerButtonType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ConsoleIconWI.ConsoleIconWI_C.ExecuteUbergraph_ConsoleIconWI
// 0x0008 (0x0008 - 0x0000)
struct ConsoleIconWI_C_ExecuteUbergraph_ConsoleIconWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ConsoleIconWI_C_ExecuteUbergraph_ConsoleIconWI) == 0x000004, "Wrong alignment on ConsoleIconWI_C_ExecuteUbergraph_ConsoleIconWI");
static_assert(sizeof(ConsoleIconWI_C_ExecuteUbergraph_ConsoleIconWI) == 0x000008, "Wrong size on ConsoleIconWI_C_ExecuteUbergraph_ConsoleIconWI");
static_assert(offsetof(ConsoleIconWI_C_ExecuteUbergraph_ConsoleIconWI, EntryPoint) == 0x000000, "Member 'ConsoleIconWI_C_ExecuteUbergraph_ConsoleIconWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_ExecuteUbergraph_ConsoleIconWI, K2Node_Event_IsDesignTime) == 0x000004, "Member 'ConsoleIconWI_C_ExecuteUbergraph_ConsoleIconWI::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function ConsoleIconWI.ConsoleIconWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ConsoleIconWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ConsoleIconWI_C_PreConstruct) == 0x000001, "Wrong alignment on ConsoleIconWI_C_PreConstruct");
static_assert(sizeof(ConsoleIconWI_C_PreConstruct) == 0x000001, "Wrong size on ConsoleIconWI_C_PreConstruct");
static_assert(offsetof(ConsoleIconWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ConsoleIconWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ConsoleIconWI.ConsoleIconWI_C.SetIcon
// 0x0058 (0x0058 - 0x0000)
struct ConsoleIconWI_C_SetIcon final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0014(0x0010)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x0024(0x0010)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_Select_Default;                             // 0x0048(0x0010)(NoDestructor)
};
static_assert(alignof(ConsoleIconWI_C_SetIcon) == 0x000008, "Wrong alignment on ConsoleIconWI_C_SetIcon");
static_assert(sizeof(ConsoleIconWI_C_SetIcon) == 0x000058, "Wrong size on ConsoleIconWI_C_SetIcon");
static_assert(offsetof(ConsoleIconWI_C_SetIcon, K2Node_MakeStruct_Margin) == 0x000000, "Member 'ConsoleIconWI_C_SetIcon::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_SetIcon, Temp_bool_Variable) == 0x000010, "Member 'ConsoleIconWI_C_SetIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_SetIcon, K2Node_MakeStruct_Anchors) == 0x000014, "Member 'ConsoleIconWI_C_SetIcon::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_SetIcon, K2Node_MakeStruct_Anchors_1) == 0x000024, "Member 'ConsoleIconWI_C_SetIcon::K2Node_MakeStruct_Anchors_1' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_SetIcon, CallFunc_GetParent_ReturnValue) == 0x000038, "Member 'ConsoleIconWI_C_SetIcon::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_SetIcon, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000040, "Member 'ConsoleIconWI_C_SetIcon::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_SetIcon, K2Node_Select_Default) == 0x000048, "Member 'ConsoleIconWI_C_SetIcon::K2Node_Select_Default' has a wrong offset!");

// Function ConsoleIconWI.ConsoleIconWI_C.InitializeProgressBar
// 0x0070 (0x0070 - 0x0000)
struct ConsoleIconWI_C_InitializeProgressBar final
{
public:
	struct FSlateColor                            CallFunc_GetColor_Color;                           // 0x0000(0x0028)()
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_SetFieldsInStruct_StructOut;                // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0028)()
};
static_assert(alignof(ConsoleIconWI_C_InitializeProgressBar) == 0x000008, "Wrong alignment on ConsoleIconWI_C_InitializeProgressBar");
static_assert(sizeof(ConsoleIconWI_C_InitializeProgressBar) == 0x000070, "Wrong size on ConsoleIconWI_C_InitializeProgressBar");
static_assert(offsetof(ConsoleIconWI_C_InitializeProgressBar, CallFunc_GetColor_Color) == 0x000000, "Member 'ConsoleIconWI_C_InitializeProgressBar::CallFunc_GetColor_Color' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_InitializeProgressBar, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000028, "Member 'ConsoleIconWI_C_InitializeProgressBar::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_InitializeProgressBar, K2Node_SetFieldsInStruct_StructOut) == 0x000038, "Member 'ConsoleIconWI_C_InitializeProgressBar::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_InitializeProgressBar, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'ConsoleIconWI_C_InitializeProgressBar::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function ConsoleIconWI.ConsoleIconWI_C.SetPercentage
// 0x0004 (0x0004 - 0x0000)
struct ConsoleIconWI_C_SetPercentage final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConsoleIconWI_C_SetPercentage) == 0x000004, "Wrong alignment on ConsoleIconWI_C_SetPercentage");
static_assert(sizeof(ConsoleIconWI_C_SetPercentage) == 0x000004, "Wrong size on ConsoleIconWI_C_SetPercentage");
static_assert(offsetof(ConsoleIconWI_C_SetPercentage, Value) == 0x000000, "Member 'ConsoleIconWI_C_SetPercentage::Value' has a wrong offset!");

// Function ConsoleIconWI.ConsoleIconWI_C.SetButtonType
// 0x0008 (0x0008 - 0x0000)
struct ConsoleIconWI_C_SetButtonType final
{
public:
	class UTexture2D*                             Icon_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConsoleIconWI_C_SetButtonType) == 0x000008, "Wrong alignment on ConsoleIconWI_C_SetButtonType");
static_assert(sizeof(ConsoleIconWI_C_SetButtonType) == 0x000008, "Wrong size on ConsoleIconWI_C_SetButtonType");
static_assert(offsetof(ConsoleIconWI_C_SetButtonType, Icon_0) == 0x000000, "Member 'ConsoleIconWI_C_SetButtonType::Icon_0' has a wrong offset!");

// Function ConsoleIconWI.ConsoleIconWI_C.InitializeHoldText
// 0x0005 (0x0005 - 0x0000)
struct ConsoleIconWI_C_InitializeHoldText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConsoleIconWI_C_InitializeHoldText) == 0x000001, "Wrong alignment on ConsoleIconWI_C_InitializeHoldText");
static_assert(sizeof(ConsoleIconWI_C_InitializeHoldText) == 0x000005, "Wrong size on ConsoleIconWI_C_InitializeHoldText");
static_assert(offsetof(ConsoleIconWI_C_InitializeHoldText, Temp_bool_Variable) == 0x000000, "Member 'ConsoleIconWI_C_InitializeHoldText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_InitializeHoldText, Temp_byte_Variable) == 0x000001, "Member 'ConsoleIconWI_C_InitializeHoldText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_InitializeHoldText, Temp_byte_Variable_1) == 0x000002, "Member 'ConsoleIconWI_C_InitializeHoldText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_InitializeHoldText, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'ConsoleIconWI_C_InitializeHoldText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_InitializeHoldText, K2Node_Select_Default) == 0x000004, "Member 'ConsoleIconWI_C_InitializeHoldText::K2Node_Select_Default' has a wrong offset!");

// Function ConsoleIconWI.ConsoleIconWI_C.GetColor
// 0x01A0 (0x01A0 - 0x0000)
struct ConsoleIconWI_C_GetColor final
{
public:
	struct FSlateColor                            Color;                                             // 0x0000(0x0028)(Parm, OutParm)
	EControllerButtonType                         Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0080(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00A8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x00D0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x00F8(0x0028)(UObjectWrapper)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x0120(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x0148(0x0028)(UObjectWrapper)
	EControllerButtonType                         CallFunc_TextureToType_NewParam;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0178(0x0028)()
};
static_assert(alignof(ConsoleIconWI_C_GetColor) == 0x000008, "Wrong alignment on ConsoleIconWI_C_GetColor");
static_assert(sizeof(ConsoleIconWI_C_GetColor) == 0x0001A0, "Wrong size on ConsoleIconWI_C_GetColor");
static_assert(offsetof(ConsoleIconWI_C_GetColor, Color) == 0x000000, "Member 'ConsoleIconWI_C_GetColor::Color' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, Temp_byte_Variable) == 0x000028, "Member 'ConsoleIconWI_C_GetColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'ConsoleIconWI_C_GetColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, K2Node_MakeStruct_SlateColor_1) == 0x000058, "Member 'ConsoleIconWI_C_GetColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, K2Node_MakeStruct_SlateColor_2) == 0x000080, "Member 'ConsoleIconWI_C_GetColor::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, K2Node_MakeStruct_SlateColor_3) == 0x0000A8, "Member 'ConsoleIconWI_C_GetColor::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, K2Node_MakeStruct_SlateColor_4) == 0x0000D0, "Member 'ConsoleIconWI_C_GetColor::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, K2Node_MakeStruct_SlateColor_5) == 0x0000F8, "Member 'ConsoleIconWI_C_GetColor::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, K2Node_MakeStruct_SlateColor_6) == 0x000120, "Member 'ConsoleIconWI_C_GetColor::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, K2Node_MakeStruct_SlateColor_7) == 0x000148, "Member 'ConsoleIconWI_C_GetColor::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, CallFunc_TextureToType_NewParam) == 0x000170, "Member 'ConsoleIconWI_C_GetColor::CallFunc_TextureToType_NewParam' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_GetColor, K2Node_Select_Default) == 0x000178, "Member 'ConsoleIconWI_C_GetColor::K2Node_Select_Default' has a wrong offset!");

// Function ConsoleIconWI.ConsoleIconWI_C.TextureToType
// 0x0008 (0x0008 - 0x0000)
struct ConsoleIconWI_C_TextureToType final
{
public:
	EControllerButtonType                         NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_5;    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_6;    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ConsoleIconWI_C_TextureToType) == 0x000001, "Wrong alignment on ConsoleIconWI_C_TextureToType");
static_assert(sizeof(ConsoleIconWI_C_TextureToType) == 0x000008, "Wrong size on ConsoleIconWI_C_TextureToType");
static_assert(offsetof(ConsoleIconWI_C_TextureToType, NewParam) == 0x000000, "Member 'ConsoleIconWI_C_TextureToType::NewParam' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_TextureToType, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000001, "Member 'ConsoleIconWI_C_TextureToType::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_TextureToType, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000002, "Member 'ConsoleIconWI_C_TextureToType::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_TextureToType, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000003, "Member 'ConsoleIconWI_C_TextureToType::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_TextureToType, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000004, "Member 'ConsoleIconWI_C_TextureToType::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_TextureToType, CallFunc_EqualEqual_ObjectObject_ReturnValue_4) == 0x000005, "Member 'ConsoleIconWI_C_TextureToType::CallFunc_EqualEqual_ObjectObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_TextureToType, CallFunc_EqualEqual_ObjectObject_ReturnValue_5) == 0x000006, "Member 'ConsoleIconWI_C_TextureToType::CallFunc_EqualEqual_ObjectObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ConsoleIconWI_C_TextureToType, CallFunc_EqualEqual_ObjectObject_ReturnValue_6) == 0x000007, "Member 'ConsoleIconWI_C_TextureToType::CallFunc_EqualEqual_ObjectObject_ReturnValue_6' has a wrong offset!");

}

