#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConsoleIconWI

#include "Basic.hpp"

#include "ControllerButtonType_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConsoleIconWI.ConsoleIconWI_C
// 0x0030 (0x0290 - 0x0260)
class UConsoleIconWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UTextBlock*                             HoldText;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URadialProgressBar_C*                   RadialProgressBar;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture;                                       // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Holdable;                                          // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowHoldableText;                                  // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ConsoleIconWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetIcon();
	void InitializeProgressBar();
	void SetPercentage(float Value);
	void SetButtonType(class UTexture2D* Icon_0);
	void InitializeUI();
	void InitializeHoldText();

	void GetColor(struct FSlateColor* Color) const;
	void TextureToType(EControllerButtonType* NewParam) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ConsoleIconWI_C">();
	}
	static class UConsoleIconWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConsoleIconWI_C>();
	}
};
static_assert(alignof(UConsoleIconWI_C) == 0x000008, "Wrong alignment on UConsoleIconWI_C");
static_assert(sizeof(UConsoleIconWI_C) == 0x000290, "Wrong size on UConsoleIconWI_C");
static_assert(offsetof(UConsoleIconWI_C, UberGraphFrame) == 0x000260, "Member 'UConsoleIconWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UConsoleIconWI_C, HoldText) == 0x000268, "Member 'UConsoleIconWI_C::HoldText' has a wrong offset!");
static_assert(offsetof(UConsoleIconWI_C, Icon) == 0x000270, "Member 'UConsoleIconWI_C::Icon' has a wrong offset!");
static_assert(offsetof(UConsoleIconWI_C, RadialProgressBar) == 0x000278, "Member 'UConsoleIconWI_C::RadialProgressBar' has a wrong offset!");
static_assert(offsetof(UConsoleIconWI_C, IconTexture) == 0x000280, "Member 'UConsoleIconWI_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UConsoleIconWI_C, Holdable) == 0x000288, "Member 'UConsoleIconWI_C::Holdable' has a wrong offset!");
static_assert(offsetof(UConsoleIconWI_C, ShowHoldableText) == 0x000289, "Member 'UConsoleIconWI_C::ShowHoldableText' has a wrong offset!");

}

