#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControllerIconVruumbaWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ControllerIconVruumbaWI.ControllerIconVruumbaWI_C
// 0x0050 (0x0300 - 0x02B0)
class UControllerIconVruumbaWI_C final : public UControllerIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 ButtonImage;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GamepadHoldText;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadTextBox;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeyboardTextBox;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          OverrideKeyboardText;                              // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   KeyboardText;                                      // 0x02E0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          ShowButtonHoldText;                                // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_ControllerIconVruumbaWI(int32 EntryPoint);
	void ShowKeyboardDisplay(const class FText& KeyDisplayText);
	void ShowMouseDisplay(class UTexture2D* MouseIcon);
	void ShowGamepadDisplay(class UTexture2D* ButtonIcon);
	void ResetDisplay();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ControllerIconVruumbaWI_C">();
	}
	static class UControllerIconVruumbaWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControllerIconVruumbaWI_C>();
	}
};
static_assert(alignof(UControllerIconVruumbaWI_C) == 0x000008, "Wrong alignment on UControllerIconVruumbaWI_C");
static_assert(sizeof(UControllerIconVruumbaWI_C) == 0x000300, "Wrong size on UControllerIconVruumbaWI_C");
static_assert(offsetof(UControllerIconVruumbaWI_C, UberGraphFrame) == 0x0002B0, "Member 'UControllerIconVruumbaWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UControllerIconVruumbaWI_C, ButtonImage) == 0x0002B8, "Member 'UControllerIconVruumbaWI_C::ButtonImage' has a wrong offset!");
static_assert(offsetof(UControllerIconVruumbaWI_C, GamepadHoldText) == 0x0002C0, "Member 'UControllerIconVruumbaWI_C::GamepadHoldText' has a wrong offset!");
static_assert(offsetof(UControllerIconVruumbaWI_C, GamepadTextBox) == 0x0002C8, "Member 'UControllerIconVruumbaWI_C::GamepadTextBox' has a wrong offset!");
static_assert(offsetof(UControllerIconVruumbaWI_C, KeyboardTextBox) == 0x0002D0, "Member 'UControllerIconVruumbaWI_C::KeyboardTextBox' has a wrong offset!");
static_assert(offsetof(UControllerIconVruumbaWI_C, OverrideKeyboardText) == 0x0002D8, "Member 'UControllerIconVruumbaWI_C::OverrideKeyboardText' has a wrong offset!");
static_assert(offsetof(UControllerIconVruumbaWI_C, KeyboardText) == 0x0002E0, "Member 'UControllerIconVruumbaWI_C::KeyboardText' has a wrong offset!");
static_assert(offsetof(UControllerIconVruumbaWI_C, ShowButtonHoldText) == 0x0002F8, "Member 'UControllerIconVruumbaWI_C::ShowButtonHoldText' has a wrong offset!");

}

