#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoopActorWaiting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CoopActorWaiting.CoopActorWaiting_C
// 0x0020 (0x0280 - 0x0260)
class UCoopActorWaiting_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_67;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CompletionTime;                                    // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CoopActorWaiting(int32 EntryPoint);
	void Start_Waiting();
	void Start_Progress();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CoopActorWaiting_C">();
	}
	static class UCoopActorWaiting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoopActorWaiting_C>();
	}
};
static_assert(alignof(UCoopActorWaiting_C) == 0x000008, "Wrong alignment on UCoopActorWaiting_C");
static_assert(sizeof(UCoopActorWaiting_C) == 0x000280, "Wrong size on UCoopActorWaiting_C");
static_assert(offsetof(UCoopActorWaiting_C, UberGraphFrame) == 0x000260, "Member 'UCoopActorWaiting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCoopActorWaiting_C, NewAnimation) == 0x000268, "Member 'UCoopActorWaiting_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UCoopActorWaiting_C, TextBlock_67) == 0x000270, "Member 'UCoopActorWaiting_C::TextBlock_67' has a wrong offset!");
static_assert(offsetof(UCoopActorWaiting_C, CompletionTime) == 0x000278, "Member 'UCoopActorWaiting_C::CompletionTime' has a wrong offset!");

}

