#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoopKillCharacterGA

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SCT_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CoopKillCharacterGA.CoopKillCharacterGA_C.ExecuteUbergraph_CoopKillCharacterGA
// 0x03F0 (0x03F0 - 0x0000)
struct CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* NewGrabbingActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_1;                   // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_2;                   // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNetAuthority_ReturnValue;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNetAuthority_ReturnValue_1;             // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_NewGrabbingActor;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCoopKill_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_3;                   // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class ACharacterSCTBP_C*                K2Node_CustomEvent_Victim_1;                       // 0x0118(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Villain_1;                      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_TargetLocation;                 // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable_1;                       // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Owning_Actor;                   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_4;                   // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_5;                   // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_6;                   // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Calculate_Position_Target_TargetLocation; // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Calculate_Position_Target_TargetRotation; // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_214[0xC];                                      // 0x0214(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0268(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F6[0x2];                                      // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x02F8(0x0010)(ZeroConstructor, NoDestructor)
	class ACharacter*                             K2Node_CustomEvent_Victim;                         // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Villain;                        // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_2;            // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBpSCT_C*                           K2Node_DynamicCast_AsAnim_Bp_SCT;                  // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0xF];                                      // 0x0341(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0350(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimBpSCT_C*                           K2Node_DynamicCast_AsAnim_Bp_SCT_1;                // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x03C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_3;            // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA) == 0x000010, "Wrong alignment on CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA");
static_assert(sizeof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA) == 0x0003F0, "Wrong size on CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, EntryPoint) == 0x000000, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsIAnim_Bp) == 0x000030, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_1) == 0x000048, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_2) == 0x000060, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_2' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000078, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_Event_bWasCancelled) == 0x000080, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000088, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CreateDelegate_OutputDelegate_2) == 0x000094, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x0000A8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_WaitDelay_ReturnValue) == 0x0000B0, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_IsNetAuthority_ReturnValue) == 0x0000B9, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_IsNetAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_IsNetAuthority_ReturnValue_1) == 0x0000BA, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_IsNetAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_GetOwner_ReturnValue) == 0x0000C0, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CustomEvent_NewGrabbingActor) == 0x0000C8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CustomEvent_NewGrabbingActor' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x0000D0, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_4) == 0x0000D8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_CanCoopKill_ReturnValue) == 0x0000D9, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_CanCoopKill_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000DC, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0000E0, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E4, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_3) == 0x0000F8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_3' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_5) == 0x000108, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00010C, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CustomEvent_Victim_1) == 0x000118, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CustomEvent_Victim_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CustomEvent_Villain_1) == 0x000120, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CustomEvent_Villain_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CustomEvent_TargetLocation) == 0x000130, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CustomEvent_TargetLocation' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_RInterpTo_ReturnValue) == 0x000160, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_BreakTransform_Location) == 0x00016C, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_BreakTransform_Rotation) == 0x000178, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_BreakTransform_Scale) == 0x000184, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000190, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_IsValid_ReturnValue_3) == 0x000198, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CreateDelegate_OutputDelegate_4) == 0x00019C, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CustomEvent_Enable_1) == 0x0001AC, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CustomEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CustomEvent_Owning_Actor) == 0x0001B0, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CustomEvent_Owning_Actor' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_4) == 0x0001B8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_4' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_6) == 0x0001C8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_5) == 0x0001D0, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_5' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_7) == 0x0001E0, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_6) == 0x0001E8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_6' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_8) == 0x0001F8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_Calculate_Position_Target_TargetLocation) == 0x0001FC, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_Calculate_Position_Target_TargetLocation' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_Calculate_Position_Target_TargetRotation) == 0x000208, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_Calculate_Position_Target_TargetRotation' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_MakeTransform_ReturnValue) == 0x000220, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000250, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_VInterpTo_ReturnValue) == 0x00025C, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000268, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0002F4, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_IsDedicatedServer_ReturnValue) == 0x0002F5, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002F8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CustomEvent_Victim) == 0x000308, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CustomEvent_Victim' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CustomEvent_Villain) == 0x000310, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CustomEvent_Villain' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CustomEvent_Enable) == 0x000318, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP_2) == 0x000320, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP_2' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_9) == 0x000328, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_GetAnimInstance_ReturnValue) == 0x000330, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsAnim_Bp_SCT) == 0x000338, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsAnim_Bp_SCT' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_10) == 0x000340, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_GetSocketTransform_ReturnValue) == 0x000350, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_BreakTransform_Location_1) == 0x000380, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_BreakTransform_Rotation_1) == 0x00038C, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_BreakTransform_Scale_1) == 0x000398, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_Conv_FloatToString_ReturnValue) == 0x0003A8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsAnim_Bp_SCT_1) == 0x0003B8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsAnim_Bp_SCT_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_11) == 0x0003C0, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_CreateDelegate_OutputDelegate_6) == 0x0003C4, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0003D8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP_3) == 0x0003E0, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP_3' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, K2Node_DynamicCast_bSuccess_12) == 0x0003E8, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA, CallFunc_K2_CommitAbility_ReturnValue) == 0x0003E9, "Member 'CoopKillCharacterGA_C_ExecuteUbergraph_CoopKillCharacterGA::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function CoopKillCharacterGA.CoopKillCharacterGA_C.IK Positon
// 0x0018 (0x0018 - 0x0000)
struct CoopKillCharacterGA_C_IK_Positon final
{
public:
	class ACharacter*                             Victim_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Villain_0;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CoopKillCharacterGA_C_IK_Positon) == 0x000008, "Wrong alignment on CoopKillCharacterGA_C_IK_Positon");
static_assert(sizeof(CoopKillCharacterGA_C_IK_Positon) == 0x000018, "Wrong size on CoopKillCharacterGA_C_IK_Positon");
static_assert(offsetof(CoopKillCharacterGA_C_IK_Positon, Victim_0) == 0x000000, "Member 'CoopKillCharacterGA_C_IK_Positon::Victim_0' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_IK_Positon, Villain_0) == 0x000008, "Member 'CoopKillCharacterGA_C_IK_Positon::Villain_0' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_IK_Positon, Enable) == 0x000010, "Member 'CoopKillCharacterGA_C_IK_Positon::Enable' has a wrong offset!");

// Function CoopKillCharacterGA.CoopKillCharacterGA_C.MulticastDisableAnimIK
// 0x0010 (0x0010 - 0x0000)
struct CoopKillCharacterGA_C_MulticastDisableAnimIK final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owning_Actor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopKillCharacterGA_C_MulticastDisableAnimIK) == 0x000008, "Wrong alignment on CoopKillCharacterGA_C_MulticastDisableAnimIK");
static_assert(sizeof(CoopKillCharacterGA_C_MulticastDisableAnimIK) == 0x000010, "Wrong size on CoopKillCharacterGA_C_MulticastDisableAnimIK");
static_assert(offsetof(CoopKillCharacterGA_C_MulticastDisableAnimIK, Enable) == 0x000000, "Member 'CoopKillCharacterGA_C_MulticastDisableAnimIK::Enable' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_MulticastDisableAnimIK, Owning_Actor) == 0x000008, "Member 'CoopKillCharacterGA_C_MulticastDisableAnimIK::Owning_Actor' has a wrong offset!");

// Function CoopKillCharacterGA.CoopKillCharacterGA_C.MulticastStartGrab
// 0x0040 (0x0040 - 0x0000)
struct CoopKillCharacterGA_C_MulticastStartGrab final
{
public:
	const class ACharacterSCTBP_C*                Victim_0;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Villain_0;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TargetLocation;                                    // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CoopKillCharacterGA_C_MulticastStartGrab) == 0x000010, "Wrong alignment on CoopKillCharacterGA_C_MulticastStartGrab");
static_assert(sizeof(CoopKillCharacterGA_C_MulticastStartGrab) == 0x000040, "Wrong size on CoopKillCharacterGA_C_MulticastStartGrab");
static_assert(offsetof(CoopKillCharacterGA_C_MulticastStartGrab, Victim_0) == 0x000000, "Member 'CoopKillCharacterGA_C_MulticastStartGrab::Victim_0' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_MulticastStartGrab, Villain_0) == 0x000008, "Member 'CoopKillCharacterGA_C_MulticastStartGrab::Villain_0' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_MulticastStartGrab, TargetLocation) == 0x000010, "Member 'CoopKillCharacterGA_C_MulticastStartGrab::TargetLocation' has a wrong offset!");

// Function CoopKillCharacterGA.CoopKillCharacterGA_C.OnGrabbingActorChanged
// 0x0008 (0x0008 - 0x0000)
struct CoopKillCharacterGA_C_OnGrabbingActorChanged final
{
public:
	class AActor*                                 NewGrabbingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopKillCharacterGA_C_OnGrabbingActorChanged) == 0x000008, "Wrong alignment on CoopKillCharacterGA_C_OnGrabbingActorChanged");
static_assert(sizeof(CoopKillCharacterGA_C_OnGrabbingActorChanged) == 0x000008, "Wrong size on CoopKillCharacterGA_C_OnGrabbingActorChanged");
static_assert(offsetof(CoopKillCharacterGA_C_OnGrabbingActorChanged, NewGrabbingActor) == 0x000000, "Member 'CoopKillCharacterGA_C_OnGrabbingActorChanged::NewGrabbingActor' has a wrong offset!");

// Function CoopKillCharacterGA.CoopKillCharacterGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct CoopKillCharacterGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CoopKillCharacterGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on CoopKillCharacterGA_C_K2_OnEndAbility");
static_assert(sizeof(CoopKillCharacterGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on CoopKillCharacterGA_C_K2_OnEndAbility");
static_assert(offsetof(CoopKillCharacterGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'CoopKillCharacterGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function CoopKillCharacterGA.CoopKillCharacterGA_C.GetContextDescription
// 0x0020 (0x0020 - 0x0000)
struct CoopKillCharacterGA_C_GetContextDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_AreBothPersonoids_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CoopKillCharacterGA_C_GetContextDescription) == 0x000008, "Wrong alignment on CoopKillCharacterGA_C_GetContextDescription");
static_assert(sizeof(CoopKillCharacterGA_C_GetContextDescription) == 0x000020, "Wrong size on CoopKillCharacterGA_C_GetContextDescription");
static_assert(offsetof(CoopKillCharacterGA_C_GetContextDescription, ReturnValue) == 0x000000, "Member 'CoopKillCharacterGA_C_GetContextDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_GetContextDescription, CallFunc_AreBothPersonoids_ReturnValue) == 0x000018, "Member 'CoopKillCharacterGA_C_GetContextDescription::CallFunc_AreBothPersonoids_ReturnValue' has a wrong offset!");

// Function CoopKillCharacterGA.CoopKillCharacterGA_C.EnableCharacterMovement
// 0x00A0 (0x00A0 - 0x0000)
struct CoopKillCharacterGA_C_EnableCharacterMovement final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_1;                   // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CoopKillCharacterGA_C_EnableCharacterMovement) == 0x000008, "Wrong alignment on CoopKillCharacterGA_C_EnableCharacterMovement");
static_assert(sizeof(CoopKillCharacterGA_C_EnableCharacterMovement) == 0x0000A0, "Wrong size on CoopKillCharacterGA_C_EnableCharacterMovement");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, Enable) == 0x000000, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::Enable' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000010, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, K2Node_DynamicCast_AsCharacter) == 0x000018, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, K2Node_DynamicCast_AsIAnim_Bp) == 0x000028, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, K2Node_DynamicCast_AsIAnim_Bp_1) == 0x000040, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::K2Node_DynamicCast_AsIAnim_Bp_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000054, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, CallFunc_Normal_ReturnValue) == 0x00006C, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, CallFunc_MakeRotFromX_ReturnValue) == 0x000078, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, CallFunc_BreakRotator_Roll) == 0x000084, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, CallFunc_BreakRotator_Pitch) == 0x000088, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, CallFunc_BreakRotator_Yaw) == 0x00008C, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_EnableCharacterMovement, CallFunc_MakeRotator_ReturnValue) == 0x000090, "Member 'CoopKillCharacterGA_C_EnableCharacterMovement::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function CoopKillCharacterGA.CoopKillCharacterGA_C.AddScoreCoopKill
// 0x0068 (0x0068 - 0x0000)
struct CoopKillCharacterGA_C_AddScoreCoopKill final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IICharacterSCT_C>      CallFunc_IsPersonoidBPI_self_CastInput;            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_IsPersonoidBPI_IsPersonoid;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CoopKillCharacterGA_C_AddScoreCoopKill) == 0x000008, "Wrong alignment on CoopKillCharacterGA_C_AddScoreCoopKill");
static_assert(sizeof(CoopKillCharacterGA_C_AddScoreCoopKill) == 0x000068, "Wrong size on CoopKillCharacterGA_C_AddScoreCoopKill");
static_assert(offsetof(CoopKillCharacterGA_C_AddScoreCoopKill, Temp_bool_Variable) == 0x000000, "Member 'CoopKillCharacterGA_C_AddScoreCoopKill::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_AddScoreCoopKill, Temp_name_Variable) == 0x000004, "Member 'CoopKillCharacterGA_C_AddScoreCoopKill::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_AddScoreCoopKill, Temp_name_Variable_1) == 0x00000C, "Member 'CoopKillCharacterGA_C_AddScoreCoopKill::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_AddScoreCoopKill, Temp_bool_Variable_1) == 0x000014, "Member 'CoopKillCharacterGA_C_AddScoreCoopKill::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_AddScoreCoopKill, Temp_name_Variable_2) == 0x000018, "Member 'CoopKillCharacterGA_C_AddScoreCoopKill::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_AddScoreCoopKill, Temp_name_Variable_3) == 0x000020, "Member 'CoopKillCharacterGA_C_AddScoreCoopKill::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_AddScoreCoopKill, CallFunc_IsPersonoidBPI_self_CastInput) == 0x000028, "Member 'CoopKillCharacterGA_C_AddScoreCoopKill::CallFunc_IsPersonoidBPI_self_CastInput' has a wrong offset!");
static_assert(offsetof(CoopKillCharacterGA_C_AddScoreCoopKill, CallFunc_IsPersonoidBPI_IsPersonoid) == 0x000038, "Member 'CoopKillCharacterGA_C_AddScoreCoopKill::CallFunc_IsPersonoidBPI_IsPersonoid' has a wrong offset!");
