#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DanceALotAchievement

#include "Basic.hpp"


namespace SDK::Params
{

// Function DanceALotAchievement.DanceALotAchievement_C.ExecuteUbergraph_DanceALotAchievement
// 0x0048 (0x0048 - 0x0000)
struct DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* Controller)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_Controller;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsControllerSelf_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement) == 0x000008, "Wrong alignment on DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement");
static_assert(sizeof(DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement) == 0x000048, "Wrong size on DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement");
static_assert(offsetof(DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement, EntryPoint) == 0x000000, "Member 'DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement::EntryPoint' has a wrong offset!");
static_assert(offsetof(DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement, K2Node_CustomEvent_Controller) == 0x000018, "Member 'DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement::K2Node_CustomEvent_Controller' has a wrong offset!");
static_assert(offsetof(DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement, CallFunc_IsControllerSelf_ReturnValue) == 0x000028, "Member 'DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement::CallFunc_IsControllerSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000030, "Member 'DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000040, "Member 'DanceALotAchievement_C_ExecuteUbergraph_DanceALotAchievement::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function DanceALotAchievement.DanceALotAchievement_C.On Danced
// 0x0008 (0x0008 - 0x0000)
struct DanceALotAchievement_C_On_Danced final
{
public:
	class APlayerController*                      Controller_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DanceALotAchievement_C_On_Danced) == 0x000008, "Wrong alignment on DanceALotAchievement_C_On_Danced");
static_assert(sizeof(DanceALotAchievement_C_On_Danced) == 0x000008, "Wrong size on DanceALotAchievement_C_On_Danced");
static_assert(offsetof(DanceALotAchievement_C_On_Danced, Controller_0) == 0x000000, "Member 'DanceALotAchievement_C_On_Danced::Controller_0' has a wrong offset!");

}

