#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyMeetingComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function EmergencyMeetingComponent.EmergencyMeetingComponent_C.ExecuteUbergraph_EmergencyMeetingComponent
// 0x0068 (0x0068 - 0x0000)
struct EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AEmergencyMeetingSCTBP_C*         K2Node_CustomEvent_EmergencyMeetingActor_2;        // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Vote_4;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmergencyMeetingSCTBP_C*               K2Node_CustomEvent_Target_1;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Vote_3;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AEmergencyMeetingSCTBP_C*         K2Node_CustomEvent_EmergencyMeetingActor_1;        // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_VoteType;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Vote_2;                         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmergencyMeetingSCTBP_C*               K2Node_CustomEvent_EmergencyMeetingActor;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_VoteComesFrom_1;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Vote_1;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmergencyMeetingSCTBP_C*               K2Node_CustomEvent_Target;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_VoteComesFrom;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Vote;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent) == 0x000008, "Wrong alignment on EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent");
static_assert(sizeof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent) == 0x000068, "Wrong size on EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, EntryPoint) == 0x000000, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_EmergencyMeetingActor_2) == 0x000008, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_EmergencyMeetingActor_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_Vote_4) == 0x000010, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_Vote_4' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_Target_1) == 0x000018, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_Target_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_Vote_3) == 0x000020, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_Vote_3' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_EmergencyMeetingActor_1) == 0x000028, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_EmergencyMeetingActor_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_VoteType) == 0x000030, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_VoteType' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_Vote_2) == 0x000034, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_Vote_2' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_EmergencyMeetingActor) == 0x000038, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_EmergencyMeetingActor' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_VoteComesFrom_1) == 0x000040, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_VoteComesFrom_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_Vote_1) == 0x000048, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_Vote_1' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_Target) == 0x000050, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_VoteComesFrom) == 0x000058, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_VoteComesFrom' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent, K2Node_CustomEvent_Vote) == 0x000060, "Member 'EmergencyMeetingComponent_C_ExecuteUbergraph_EmergencyMeetingComponent::K2Node_CustomEvent_Vote' has a wrong offset!");

// Function EmergencyMeetingComponent.EmergencyMeetingComponent_C.EliminationVoteSERVER
// 0x0018 (0x0018 - 0x0000)
struct EmergencyMeetingComponent_C_EliminationVoteSERVER final
{
public:
	class AEmergencyMeetingSCTBP_C*               Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             VoteComesFrom;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Vote;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyMeetingComponent_C_EliminationVoteSERVER) == 0x000008, "Wrong alignment on EmergencyMeetingComponent_C_EliminationVoteSERVER");
static_assert(sizeof(EmergencyMeetingComponent_C_EliminationVoteSERVER) == 0x000018, "Wrong size on EmergencyMeetingComponent_C_EliminationVoteSERVER");
static_assert(offsetof(EmergencyMeetingComponent_C_EliminationVoteSERVER, Target) == 0x000000, "Member 'EmergencyMeetingComponent_C_EliminationVoteSERVER::Target' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_EliminationVoteSERVER, VoteComesFrom) == 0x000008, "Member 'EmergencyMeetingComponent_C_EliminationVoteSERVER::VoteComesFrom' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_EliminationVoteSERVER, Vote) == 0x000010, "Member 'EmergencyMeetingComponent_C_EliminationVoteSERVER::Vote' has a wrong offset!");

// Function EmergencyMeetingComponent.EmergencyMeetingComponent_C.EliminationVoteReroute
// 0x0018 (0x0018 - 0x0000)
struct EmergencyMeetingComponent_C_EliminationVoteReroute final
{
public:
	class AEmergencyMeetingSCTBP_C*               EmergencyMeetingActor;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             VoteComesFrom;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Vote;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyMeetingComponent_C_EliminationVoteReroute) == 0x000008, "Wrong alignment on EmergencyMeetingComponent_C_EliminationVoteReroute");
static_assert(sizeof(EmergencyMeetingComponent_C_EliminationVoteReroute) == 0x000018, "Wrong size on EmergencyMeetingComponent_C_EliminationVoteReroute");
static_assert(offsetof(EmergencyMeetingComponent_C_EliminationVoteReroute, EmergencyMeetingActor) == 0x000000, "Member 'EmergencyMeetingComponent_C_EliminationVoteReroute::EmergencyMeetingActor' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_EliminationVoteReroute, VoteComesFrom) == 0x000008, "Member 'EmergencyMeetingComponent_C_EliminationVoteReroute::VoteComesFrom' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_EliminationVoteReroute, Vote) == 0x000010, "Member 'EmergencyMeetingComponent_C_EliminationVoteReroute::Vote' has a wrong offset!");

// Function EmergencyMeetingComponent.EmergencyMeetingComponent_C.VoteTypeVoteReroute
// 0x0010 (0x0010 - 0x0000)
struct EmergencyMeetingComponent_C_VoteTypeVoteReroute final
{
public:
	const class AEmergencyMeetingSCTBP_C*         EmergencyMeetingActor;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VoteType;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Vote;                                              // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingComponent_C_VoteTypeVoteReroute) == 0x000008, "Wrong alignment on EmergencyMeetingComponent_C_VoteTypeVoteReroute");
static_assert(sizeof(EmergencyMeetingComponent_C_VoteTypeVoteReroute) == 0x000010, "Wrong size on EmergencyMeetingComponent_C_VoteTypeVoteReroute");
static_assert(offsetof(EmergencyMeetingComponent_C_VoteTypeVoteReroute, EmergencyMeetingActor) == 0x000000, "Member 'EmergencyMeetingComponent_C_VoteTypeVoteReroute::EmergencyMeetingActor' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_VoteTypeVoteReroute, VoteType) == 0x000008, "Member 'EmergencyMeetingComponent_C_VoteTypeVoteReroute::VoteType' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_VoteTypeVoteReroute, Vote) == 0x00000C, "Member 'EmergencyMeetingComponent_C_VoteTypeVoteReroute::Vote' has a wrong offset!");

// Function EmergencyMeetingComponent.EmergencyMeetingComponent_C.TrustVoteServer
// 0x0010 (0x0010 - 0x0000)
struct EmergencyMeetingComponent_C_TrustVoteServer final
{
public:
	class AEmergencyMeetingSCTBP_C*               Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Vote;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingComponent_C_TrustVoteServer) == 0x000008, "Wrong alignment on EmergencyMeetingComponent_C_TrustVoteServer");
static_assert(sizeof(EmergencyMeetingComponent_C_TrustVoteServer) == 0x000010, "Wrong size on EmergencyMeetingComponent_C_TrustVoteServer");
static_assert(offsetof(EmergencyMeetingComponent_C_TrustVoteServer, Target) == 0x000000, "Member 'EmergencyMeetingComponent_C_TrustVoteServer::Target' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_TrustVoteServer, Vote) == 0x000008, "Member 'EmergencyMeetingComponent_C_TrustVoteServer::Vote' has a wrong offset!");

// Function EmergencyMeetingComponent.EmergencyMeetingComponent_C.TrustVoteReroute
// 0x0010 (0x0010 - 0x0000)
struct EmergencyMeetingComponent_C_TrustVoteReroute final
{
public:
	const class AEmergencyMeetingSCTBP_C*         EmergencyMeetingActor;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Vote;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyMeetingComponent_C_TrustVoteReroute) == 0x000008, "Wrong alignment on EmergencyMeetingComponent_C_TrustVoteReroute");
static_assert(sizeof(EmergencyMeetingComponent_C_TrustVoteReroute) == 0x000010, "Wrong size on EmergencyMeetingComponent_C_TrustVoteReroute");
static_assert(offsetof(EmergencyMeetingComponent_C_TrustVoteReroute, EmergencyMeetingActor) == 0x000000, "Member 'EmergencyMeetingComponent_C_TrustVoteReroute::EmergencyMeetingActor' has a wrong offset!");
static_assert(offsetof(EmergencyMeetingComponent_C_TrustVoteReroute, Vote) == 0x000008, "Member 'EmergencyMeetingComponent_C_TrustVoteReroute::Vote' has a wrong offset!");

}

