#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyEvent_Base

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function EmergencyEvent_Base.EmergencyEvent_Base_C.On_Complete__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EmergencyEvent_Base_C_On_Complete__DelegateSignature final
{
public:
	class AEmergencyEvent_Base_C*                 EmergencyBase;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEvent_Base_C_On_Complete__DelegateSignature) == 0x000008, "Wrong alignment on EmergencyEvent_Base_C_On_Complete__DelegateSignature");
static_assert(sizeof(EmergencyEvent_Base_C_On_Complete__DelegateSignature) == 0x000008, "Wrong size on EmergencyEvent_Base_C_On_Complete__DelegateSignature");
static_assert(offsetof(EmergencyEvent_Base_C_On_Complete__DelegateSignature, EmergencyBase) == 0x000000, "Member 'EmergencyEvent_Base_C_On_Complete__DelegateSignature::EmergencyBase' has a wrong offset!");

// Function EmergencyEvent_Base.EmergencyEvent_Base_C.ExecuteUbergraph_EmergencyEvent_Base
// 0x0150 (0x0150 - 0x0000)
struct EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0078(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_1;              // 0x0090(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyEvent_ProgressbarWI_C*        K2Node_DynamicCast_AsEmergency_Event_Progressbar_WI; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload;                // 0x00D8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LastIndex;                      // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base) == 0x000008, "Wrong alignment on EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base");
static_assert(sizeof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base) == 0x000150, "Wrong size on EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, EntryPoint) == 0x000000, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_int_Variable) == 0x000004, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_float_Variable) == 0x00000C, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_float_Variable_1) == 0x000010, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_float_Variable_2) == 0x000014, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_float_Variable_3) == 0x000018, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_float_Variable_4) == 0x00001C, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_float_Variable_5) == 0x000020, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_struct_Variable) == 0x000028, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_delegate_Variable) == 0x000038, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_struct_Variable_1) == 0x000048, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_delegate_Variable_1) == 0x000058, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_struct_Variable_2) == 0x000068, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_delegate_Variable_2) == 0x000078, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_HasAuthority_ReturnValue) == 0x000088, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_IsDedicatedServer_ReturnValue) == 0x000089, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, K2Node_ComponentBoundEvent_payload_1) == 0x000090, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::K2Node_ComponentBoundEvent_payload_1' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_GetUserWidgetObject_ReturnValue) == 0x0000C0, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, K2Node_DynamicCast_AsEmergency_Event_Progressbar_WI) == 0x0000C8, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::K2Node_DynamicCast_AsEmergency_Event_Progressbar_WI' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_HasAuthority_ReturnValue_1) == 0x0000D1, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, K2Node_ComponentBoundEvent_payload) == 0x0000D8, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::K2Node_ComponentBoundEvent_payload' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, K2Node_ComponentBoundEvent_wasCancelled) == 0x000108, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::K2Node_ComponentBoundEvent_wasCancelled' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_Array_Contains_ReturnValue) == 0x000109, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_Array_Add_ReturnValue) == 0x00010C, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_Array_RemoveItem_ReturnValue) == 0x000114, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000115, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_bool_IsClosed_Variable) == 0x000116, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_Array_Length_ReturnValue_1) == 0x000118, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, K2Node_Select_Default) == 0x00011C, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000120, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_PlayAnimation_ReturnValue) == 0x000130, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_HasAuthority_ReturnValue_2) == 0x000138, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, Temp_bool_Has_Been_Initd_Variable) == 0x000139, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_PostAkEvent_ReturnValue) == 0x00013C, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_PostAkEvent_ReturnValue_1) == 0x000140, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, CallFunc_PostAkEvent_ReturnValue_2) == 0x000144, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base, K2Node_CustomEvent_LastIndex) == 0x000148, "Member 'EmergencyEvent_Base_C_ExecuteUbergraph_EmergencyEvent_Base::K2Node_CustomEvent_LastIndex' has a wrong offset!");

// Function EmergencyEvent_Base.EmergencyEvent_Base_C.Update Participants On Progressbar
// 0x0004 (0x0004 - 0x0000)
struct EmergencyEvent_Base_C_Update_Participants_On_Progressbar final
{
public:
	int32                                         LastIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEvent_Base_C_Update_Participants_On_Progressbar) == 0x000004, "Wrong alignment on EmergencyEvent_Base_C_Update_Participants_On_Progressbar");
static_assert(sizeof(EmergencyEvent_Base_C_Update_Participants_On_Progressbar) == 0x000004, "Wrong size on EmergencyEvent_Base_C_Update_Participants_On_Progressbar");
static_assert(offsetof(EmergencyEvent_Base_C_Update_Participants_On_Progressbar, LastIndex) == 0x000000, "Member 'EmergencyEvent_Base_C_Update_Participants_On_Progressbar::LastIndex' has a wrong offset!");

// Function EmergencyEvent_Base.EmergencyEvent_Base_C.BndEvt__Interaction Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature");
static_assert(sizeof(EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature) == 0x000038, "Wrong size on EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature");
static_assert(offsetof(EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature, Payload) == 0x000000, "Member 'EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature::Payload' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature, WasCancelled) == 0x000030, "Member 'EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_1_InteractionEndedDelegate__DelegateSignature::WasCancelled' has a wrong offset!");

// Function EmergencyEvent_Base.EmergencyEvent_Base_C.BndEvt__Interaction Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature");
static_assert(sizeof(EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature");
static_assert(offsetof(EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'EmergencyEvent_Base_C_BndEvt__Interaction_Component_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function EmergencyEvent_Base.EmergencyEvent_Base_C.OnRep_EmergencyActive
// 0x0002 (0x0002 - 0x0000)
struct EmergencyEvent_Base_C_OnRep_EmergencyActive final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyEvent_Base_C_OnRep_EmergencyActive) == 0x000001, "Wrong alignment on EmergencyEvent_Base_C_OnRep_EmergencyActive");
static_assert(sizeof(EmergencyEvent_Base_C_OnRep_EmergencyActive) == 0x000002, "Wrong size on EmergencyEvent_Base_C_OnRep_EmergencyActive");
static_assert(offsetof(EmergencyEvent_Base_C_OnRep_EmergencyActive, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'EmergencyEvent_Base_C_OnRep_EmergencyActive::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_Base_C_OnRep_EmergencyActive, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000001, "Member 'EmergencyEvent_Base_C_OnRep_EmergencyActive::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function EmergencyEvent_Base.EmergencyEvent_Base_C.OnRep_AmountHolding
// 0x0001 (0x0001 - 0x0000)
struct EmergencyEvent_Base_C_OnRep_AmountHolding final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyEvent_Base_C_OnRep_AmountHolding) == 0x000001, "Wrong alignment on EmergencyEvent_Base_C_OnRep_AmountHolding");
static_assert(sizeof(EmergencyEvent_Base_C_OnRep_AmountHolding) == 0x000001, "Wrong size on EmergencyEvent_Base_C_OnRep_AmountHolding");
static_assert(offsetof(EmergencyEvent_Base_C_OnRep_AmountHolding, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'EmergencyEvent_Base_C_OnRep_AmountHolding::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

}

