#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyEvent_ProgressbarWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EmergencyEvent_ProgressbarWI.EmergencyEvent_ProgressbarWI_C.ExecuteUbergraph_EmergencyEvent_ProgressbarWI
// 0x00D8 (0x00D8 - 0x0000)
struct EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_InPercent;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0010(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWi_OffScreenIndicator_EmergencyEvent_C* CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Amount;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyParticipantWI_C*              CallFunc_Create_ReturnValue_1;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_CustomEvent_InColorAndOpacity;              // 0x0078(0x0028)()
	struct FLinearColor                           K2Node_CustomEvent_InColor;                        // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InText;                         // 0x00B0(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetOrganizer*                       CallFunc_GetWidgetOrganizer_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI) == 0x000008, "Wrong alignment on EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI");
static_assert(sizeof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI) == 0x0000D8, "Wrong size on EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, EntryPoint) == 0x000000, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, K2Node_Event_IsDesignTime) == 0x000004, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, K2Node_CustomEvent_InPercent) == 0x000008, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::K2Node_CustomEvent_InPercent' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_Conv_FloatToText_ReturnValue) == 0x000010, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_Create_ReturnValue) == 0x000038, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, K2Node_CustomEvent_Amount) == 0x000040, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::K2Node_CustomEvent_Amount' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_GetPlayerController_ReturnValue_1) == 0x000048, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_Create_ReturnValue_1) == 0x000050, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_AddChild_ReturnValue) == 0x000060, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, Temp_int_Variable) == 0x000068, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006C, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, K2Node_CustomEvent_InColorAndOpacity) == 0x000078, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::K2Node_CustomEvent_InColorAndOpacity' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, K2Node_CustomEvent_InColor) == 0x0000A0, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::K2Node_CustomEvent_InColor' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, K2Node_CustomEvent_InText) == 0x0000B0, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000C8, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI, CallFunc_GetWidgetOrganizer_ReturnValue) == 0x0000D0, "Member 'EmergencyEvent_ProgressbarWI_C_ExecuteUbergraph_EmergencyEvent_ProgressbarWI::CallFunc_GetWidgetOrganizer_ReturnValue' has a wrong offset!");

// Function EmergencyEvent_ProgressbarWI.EmergencyEvent_ProgressbarWI_C.Set Color And Text
// 0x0050 (0x0050 - 0x0000)
struct EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text final
{
public:
	struct FSlateColor                            InColorAndOpacity;                                 // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           InColor;                                           // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text) == 0x000008, "Wrong alignment on EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text");
static_assert(sizeof(EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text) == 0x000050, "Wrong size on EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text, InColorAndOpacity) == 0x000000, "Member 'EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text::InColorAndOpacity' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text, InColor) == 0x000028, "Member 'EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text::InColor' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text, InText) == 0x000038, "Member 'EmergencyEvent_ProgressbarWI_C_Set_Color_And_Text::InText' has a wrong offset!");

// Function EmergencyEvent_ProgressbarWI.EmergencyEvent_ProgressbarWI_C.Set Participants
// 0x0004 (0x0004 - 0x0000)
struct EmergencyEvent_ProgressbarWI_C_Set_Participants final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEvent_ProgressbarWI_C_Set_Participants) == 0x000004, "Wrong alignment on EmergencyEvent_ProgressbarWI_C_Set_Participants");
static_assert(sizeof(EmergencyEvent_ProgressbarWI_C_Set_Participants) == 0x000004, "Wrong size on EmergencyEvent_ProgressbarWI_C_Set_Participants");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_Set_Participants, Amount) == 0x000000, "Member 'EmergencyEvent_ProgressbarWI_C_Set_Participants::Amount' has a wrong offset!");

// Function EmergencyEvent_ProgressbarWI.EmergencyEvent_ProgressbarWI_C.Set Percentage
// 0x0004 (0x0004 - 0x0000)
struct EmergencyEvent_ProgressbarWI_C_Set_Percentage final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEvent_ProgressbarWI_C_Set_Percentage) == 0x000004, "Wrong alignment on EmergencyEvent_ProgressbarWI_C_Set_Percentage");
static_assert(sizeof(EmergencyEvent_ProgressbarWI_C_Set_Percentage) == 0x000004, "Wrong size on EmergencyEvent_ProgressbarWI_C_Set_Percentage");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_Set_Percentage, InPercent) == 0x000000, "Member 'EmergencyEvent_ProgressbarWI_C_Set_Percentage::InPercent' has a wrong offset!");

// Function EmergencyEvent_ProgressbarWI.EmergencyEvent_ProgressbarWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct EmergencyEvent_ProgressbarWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyEvent_ProgressbarWI_C_PreConstruct) == 0x000001, "Wrong alignment on EmergencyEvent_ProgressbarWI_C_PreConstruct");
static_assert(sizeof(EmergencyEvent_ProgressbarWI_C_PreConstruct) == 0x000001, "Wrong size on EmergencyEvent_ProgressbarWI_C_PreConstruct");
static_assert(offsetof(EmergencyEvent_ProgressbarWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'EmergencyEvent_ProgressbarWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

