#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyVoteTrackerWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function EmergencyVoteTrackerWI.EmergencyVoteTrackerWI_C.ExecuteUbergraph_EmergencyVoteTrackerWI
// 0x0028 (0x0028 - 0x0000)
struct EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_LinearColorLinearColor_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCT*                          K2Node_DynamicCast_AsCharacter_SCT;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        CallFunc_GetSCTPlayerState_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI) == 0x000008, "Wrong alignment on EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI");
static_assert(sizeof(EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI) == 0x000028, "Wrong size on EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI");
static_assert(offsetof(EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI, EntryPoint) == 0x000000, "Member 'EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI, CallFunc_NotEqual_LinearColorLinearColor_ReturnValue) == 0x000004, "Member 'EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI::CallFunc_NotEqual_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI, K2Node_DynamicCast_AsCharacter_SCT) == 0x000008, "Member 'EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI::K2Node_DynamicCast_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI, CallFunc_GetSCTPlayerState_ReturnValue) == 0x000018, "Member 'EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI::CallFunc_GetSCTPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI, K2Node_Event_IsDesignTime) == 0x000020, "Member 'EmergencyVoteTrackerWI_C_ExecuteUbergraph_EmergencyVoteTrackerWI::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function EmergencyVoteTrackerWI.EmergencyVoteTrackerWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct EmergencyVoteTrackerWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyVoteTrackerWI_C_PreConstruct) == 0x000001, "Wrong alignment on EmergencyVoteTrackerWI_C_PreConstruct");
static_assert(sizeof(EmergencyVoteTrackerWI_C_PreConstruct) == 0x000001, "Wrong size on EmergencyVoteTrackerWI_C_PreConstruct");
static_assert(offsetof(EmergencyVoteTrackerWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'EmergencyVoteTrackerWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

