#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyEvent_DeathTimerWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function EmergencyEvent_DeathTimerWI.EmergencyEvent_DeathTimerWI_C.ExecuteUbergraph_EmergencyEvent_DeathTimerWI
// 0x0010 (0x0010 - 0x0000)
struct EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InPercent;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI) == 0x000008, "Wrong alignment on EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI");
static_assert(sizeof(EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI) == 0x000010, "Wrong size on EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI");
static_assert(offsetof(EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI, EntryPoint) == 0x000000, "Member 'EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI, K2Node_CustomEvent_InPercent) == 0x000004, "Member 'EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI::K2Node_CustomEvent_InPercent' has a wrong offset!");
static_assert(offsetof(EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'EmergencyEvent_DeathTimerWI_C_ExecuteUbergraph_EmergencyEvent_DeathTimerWI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function EmergencyEvent_DeathTimerWI.EmergencyEvent_DeathTimerWI_C.Set Percentage
// 0x0004 (0x0004 - 0x0000)
struct EmergencyEvent_DeathTimerWI_C_Set_Percentage final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEvent_DeathTimerWI_C_Set_Percentage) == 0x000004, "Wrong alignment on EmergencyEvent_DeathTimerWI_C_Set_Percentage");
static_assert(sizeof(EmergencyEvent_DeathTimerWI_C_Set_Percentage) == 0x000004, "Wrong size on EmergencyEvent_DeathTimerWI_C_Set_Percentage");
static_assert(offsetof(EmergencyEvent_DeathTimerWI_C_Set_Percentage, InPercent) == 0x000000, "Member 'EmergencyEvent_DeathTimerWI_C_Set_Percentage::InPercent' has a wrong offset!");

}

