#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyEliminationVoteWI

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.ExecuteUbergraph_EmergencyEliminationVoteWI
// 0x0130 (0x0130 - 0x0000)
struct EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerNameBPI_Name;                    // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0078(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0088(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEmergencyEliminationVoteWI_C*>  CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEmergencyMeetingWI_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UEmergencyEliminationVoteWI_C*          CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmergencyMeetingWI_C*                  CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmergencyMeetingWI_C*                  CallFunc_Array_Get_Item_2;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI) == 0x000008, "Wrong alignment on EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI");
static_assert(sizeof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI) == 0x000130, "Wrong size on EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, EntryPoint) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, Temp_int_Variable) == 0x000004, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, Temp_int_Variable_1) == 0x000008, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, Temp_int_Variable_2) == 0x000014, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, K2Node_DynamicCast_AsICharacter_SCT) == 0x000020, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_GetPlayerNameBPI_Name) == 0x000038, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_GetPlayerNameBPI_Name' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, K2Node_DynamicCast_AsSCTPlayer_State) == 0x000048, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::K2Node_DynamicCast_AsSCTPlayer_State' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, Temp_bool_Variable) == 0x000070, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, Temp_byte_Variable) == 0x000072, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, Temp_byte_Variable_1) == 0x000073, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, Temp_struct_Variable) == 0x000078, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, Temp_delegate_Variable) == 0x000088, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, K2Node_ComponentBoundEvent_bIsChecked) == 0x000098, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0000A0, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000B0, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x0000B8, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Array_Get_Item_2) == 0x0000E0, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Array_Length_ReturnValue_1) == 0x0000EC, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Array_Length_ReturnValue_2) == 0x0000F0, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F4, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000F5, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000F8, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000100, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_GetPlayerPawn_ReturnValue) == 0x000108, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, K2Node_Select_Default) == 0x000110, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000114, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000120, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI, CallFunc_PostAkEvent_ReturnValue) == 0x000128, "Member 'EmergencyEliminationVoteWI_C_ExecuteUbergraph_EmergencyEliminationVoteWI::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.BndEvt__VoteButton_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct EmergencyEliminationVoteWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyEliminationVoteWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on EmergencyEliminationVoteWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(EmergencyEliminationVoteWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on EmergencyEliminationVoteWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(EmergencyEliminationVoteWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_BndEvt__VoteButton_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.AddVote
// 0x0030 (0x0030 - 0x0000)
struct EmergencyEliminationVoteWI_C_AddVote final
{
public:
	class ACharacter*                             VoteFrom;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UEmergencyVoteTrackerWI_C*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEliminationVoteWI_C_AddVote) == 0x000008, "Wrong alignment on EmergencyEliminationVoteWI_C_AddVote");
static_assert(sizeof(EmergencyEliminationVoteWI_C_AddVote) == 0x000030, "Wrong size on EmergencyEliminationVoteWI_C_AddVote");
static_assert(offsetof(EmergencyEliminationVoteWI_C_AddVote, VoteFrom) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_AddVote::VoteFrom' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_AddVote, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'EmergencyEliminationVoteWI_C_AddVote::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_AddVote, K2Node_MakeStruct_Margin) == 0x000010, "Member 'EmergencyEliminationVoteWI_C_AddVote::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_AddVote, CallFunc_Create_ReturnValue) == 0x000020, "Member 'EmergencyEliminationVoteWI_C_AddVote::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_AddVote, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000028, "Member 'EmergencyEliminationVoteWI_C_AddVote::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.SetFactionText
// 0x00E0 (0x00E0 - 0x0000)
struct EmergencyEliminationVoteWI_C_SetFactionText final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	EPlayerFaction                                Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Temp_struct_Variable;                              // 0x0020(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0068(0x0018)()
	EPlayerFaction                                Temp_byte_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPersonoidInformationComponent*         CallFunc_GetPersonoidInformationComponent_OutputPin; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerFaction                                CallFunc_GetFaction_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0098(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x00B8(0x0028)()
};
static_assert(alignof(EmergencyEliminationVoteWI_C_SetFactionText) == 0x000008, "Wrong alignment on EmergencyEliminationVoteWI_C_SetFactionText");
static_assert(sizeof(EmergencyEliminationVoteWI_C_SetFactionText) == 0x0000E0, "Wrong size on EmergencyEliminationVoteWI_C_SetFactionText");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, Temp_text_Variable) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, Temp_byte_Variable) == 0x000018, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, Temp_struct_Variable) == 0x000020, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, Temp_text_Variable_1) == 0x000050, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, Temp_text_Variable_2) == 0x000068, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, Temp_byte_Variable_1) == 0x000080, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, CallFunc_GetPersonoidInformationComponent_OutputPin) == 0x000088, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::CallFunc_GetPersonoidInformationComponent_OutputPin' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, CallFunc_GetFaction_ReturnValue) == 0x000091, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::CallFunc_GetFaction_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000092, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, K2Node_Select_Default) == 0x000098, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000B0, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, CallFunc_BooleanOR_ReturnValue) == 0x0000B1, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionText, K2Node_Select_Default_1) == 0x0000B8, "Member 'EmergencyEliminationVoteWI_C_SetFactionText::K2Node_Select_Default_1' has a wrong offset!");

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.SetFactionTextVisibility
// 0x0020 (0x0020 - 0x0000)
struct EmergencyEliminationVoteWI_C_SetFactionTextVisibility final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0004(0x0008)(NoDestructor)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_1;                // 0x000C(0x0008)(NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEliminationVoteWI_C_SetFactionTextVisibility) == 0x000008, "Wrong alignment on EmergencyEliminationVoteWI_C_SetFactionTextVisibility");
static_assert(sizeof(EmergencyEliminationVoteWI_C_SetFactionTextVisibility) == 0x000020, "Wrong size on EmergencyEliminationVoteWI_C_SetFactionTextVisibility");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionTextVisibility, IsVisible_0) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_SetFactionTextVisibility::IsVisible_0' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionTextVisibility, K2Node_MakeStruct_SlateChildSize) == 0x000004, "Member 'EmergencyEliminationVoteWI_C_SetFactionTextVisibility::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionTextVisibility, K2Node_MakeStruct_SlateChildSize_1) == 0x00000C, "Member 'EmergencyEliminationVoteWI_C_SetFactionTextVisibility::K2Node_MakeStruct_SlateChildSize_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetFactionTextVisibility, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000018, "Member 'EmergencyEliminationVoteWI_C_SetFactionTextVisibility::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.SetButtonVisibility
// 0x0005 (0x0005 - 0x0000)
struct EmergencyEliminationVoteWI_C_SetButtonVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyEliminationVoteWI_C_SetButtonVisibility) == 0x000001, "Wrong alignment on EmergencyEliminationVoteWI_C_SetButtonVisibility");
static_assert(sizeof(EmergencyEliminationVoteWI_C_SetButtonVisibility) == 0x000005, "Wrong size on EmergencyEliminationVoteWI_C_SetButtonVisibility");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetButtonVisibility, Visible) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_SetButtonVisibility::Visible' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'EmergencyEliminationVoteWI_C_SetButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetButtonVisibility, Temp_byte_Variable) == 0x000002, "Member 'EmergencyEliminationVoteWI_C_SetButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetButtonVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'EmergencyEliminationVoteWI_C_SetButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_SetButtonVisibility, K2Node_Select_Default) == 0x000004, "Member 'EmergencyEliminationVoteWI_C_SetButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.ColorNameText
// 0x0040 (0x0040 - 0x0000)
struct EmergencyEliminationVoteWI_C_ColorNameText final
{
public:
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyEliminationVoteWI_C_ColorNameText) == 0x000008, "Wrong alignment on EmergencyEliminationVoteWI_C_ColorNameText");
static_assert(sizeof(EmergencyEliminationVoteWI_C_ColorNameText) == 0x000040, "Wrong size on EmergencyEliminationVoteWI_C_ColorNameText");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ColorNameText, K2Node_DynamicCast_AsSCTPlayer_State) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_ColorNameText::K2Node_DynamicCast_AsSCTPlayer_State' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ColorNameText, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'EmergencyEliminationVoteWI_C_ColorNameText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ColorNameText, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'EmergencyEliminationVoteWI_C_ColorNameText::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_ColorNameText, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'EmergencyEliminationVoteWI_C_ColorNameText::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.OnIdentificationColorChanged
// 0x0020 (0x0020 - 0x0000)
struct EmergencyEliminationVoteWI_C_OnIdentificationColorChanged final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnPlayerState_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyEliminationVoteWI_C_OnIdentificationColorChanged) == 0x000008, "Wrong alignment on EmergencyEliminationVoteWI_C_OnIdentificationColorChanged");
static_assert(sizeof(EmergencyEliminationVoteWI_C_OnIdentificationColorChanged) == 0x000020, "Wrong size on EmergencyEliminationVoteWI_C_OnIdentificationColorChanged");
static_assert(offsetof(EmergencyEliminationVoteWI_C_OnIdentificationColorChanged, PlayerState) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_OnIdentificationColorChanged::PlayerState' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_OnIdentificationColorChanged, Value) == 0x000008, "Member 'EmergencyEliminationVoteWI_C_OnIdentificationColorChanged::Value' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_OnIdentificationColorChanged, CallFunc_IsOwnPlayerState_ReturnValue) == 0x000018, "Member 'EmergencyEliminationVoteWI_C_OnIdentificationColorChanged::CallFunc_IsOwnPlayerState_ReturnValue' has a wrong offset!");

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.BindToIdentificationColorChanged
// 0x0028 (0x0028 - 0x0000)
struct EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged final
{
public:
	TDelegate<void(class APlayerState* PlayerState, const struct FLinearColor& Value)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                CallFunc_GetGlobalObject_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIdentificationColorGlobalEvent*        K2Node_DynamicCast_AsIdentification_Color_Global_Event; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged) == 0x000008, "Wrong alignment on EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged");
static_assert(sizeof(EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged) == 0x000028, "Wrong size on EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged");
static_assert(offsetof(EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged, CallFunc_GetGlobalObject_ReturnValue) == 0x000010, "Member 'EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged::CallFunc_GetGlobalObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged, K2Node_DynamicCast_AsIdentification_Color_Global_Event) == 0x000018, "Member 'EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged::K2Node_DynamicCast_AsIdentification_Color_Global_Event' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EmergencyEliminationVoteWI_C_BindToIdentificationColorChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.Navigate to Skip Button
// 0x0030 (0x0030 - 0x0000)
struct EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEmergencyMeetingWI_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UEmergencyMeetingWI_C*                  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button) == 0x000008, "Wrong alignment on EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button");
static_assert(sizeof(EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button) == 0x000030, "Wrong size on EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button");
static_assert(offsetof(EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button, Navigation_0) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button::Navigation_0' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button, ReturnValue) == 0x000008, "Member 'EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button::ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button, CallFunc_Array_Get_Item) == 0x000020, "Member 'EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'EmergencyEliminationVoteWI_C_Navigate_to_Skip_Button::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function EmergencyEliminationVoteWI.EmergencyEliminationVoteWI_C.IsOwnPlayerState
// 0x0010 (0x0010 - 0x0000)
struct EmergencyEliminationVoteWI_C_IsOwnPlayerState final
{
public:
	class APlayerState*                           Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmergencyEliminationVoteWI_C_IsOwnPlayerState) == 0x000008, "Wrong alignment on EmergencyEliminationVoteWI_C_IsOwnPlayerState");
static_assert(sizeof(EmergencyEliminationVoteWI_C_IsOwnPlayerState) == 0x000010, "Wrong size on EmergencyEliminationVoteWI_C_IsOwnPlayerState");
static_assert(offsetof(EmergencyEliminationVoteWI_C_IsOwnPlayerState, Target) == 0x000000, "Member 'EmergencyEliminationVoteWI_C_IsOwnPlayerState::Target' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_IsOwnPlayerState, ReturnValue) == 0x000008, "Member 'EmergencyEliminationVoteWI_C_IsOwnPlayerState::ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyEliminationVoteWI_C_IsOwnPlayerState, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'EmergencyEliminationVoteWI_C_IsOwnPlayerState::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

