#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmojiBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EmojiBase.EmojiBase_C
// 0x0048 (0x0268 - 0x0220)
class AEmojiBase_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UAkComponent*                           Ak;                                                // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             EmojiTexture;                                      // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Particles;                                         // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Sound;                                             // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EmojiBase(int32 EntryPoint);
	void Play_Emoji(float Duration);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmojiBase_C">();
	}
	static class AEmojiBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEmojiBase_C>();
	}
};
static_assert(alignof(AEmojiBase_C) == 0x000008, "Wrong alignment on AEmojiBase_C");
static_assert(sizeof(AEmojiBase_C) == 0x000268, "Wrong size on AEmojiBase_C");
static_assert(offsetof(AEmojiBase_C, UberGraphFrame) == 0x000220, "Member 'AEmojiBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEmojiBase_C, Ak) == 0x000228, "Member 'AEmojiBase_C::Ak' has a wrong offset!");
static_assert(offsetof(AEmojiBase_C, ParticleSystem) == 0x000230, "Member 'AEmojiBase_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AEmojiBase_C, Widget) == 0x000238, "Member 'AEmojiBase_C::Widget' has a wrong offset!");
static_assert(offsetof(AEmojiBase_C, DefaultSceneRoot) == 0x000240, "Member 'AEmojiBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEmojiBase_C, NewVar_0) == 0x000248, "Member 'AEmojiBase_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AEmojiBase_C, EmojiTexture) == 0x000250, "Member 'AEmojiBase_C::EmojiTexture' has a wrong offset!");
static_assert(offsetof(AEmojiBase_C, Particles) == 0x000258, "Member 'AEmojiBase_C::Particles' has a wrong offset!");
static_assert(offsetof(AEmojiBase_C, Sound) == 0x000260, "Member 'AEmojiBase_C::Sound' has a wrong offset!");

}

