#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmojiWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function EmojiWI.EmojiWI_C.ExecuteUbergraph_EmojiWI
// 0x0020 (0x0020 - 0x0000)
struct EmojiWI_C_ExecuteUbergraph_EmojiWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeShown;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmojiWI_C_ExecuteUbergraph_EmojiWI) == 0x000008, "Wrong alignment on EmojiWI_C_ExecuteUbergraph_EmojiWI");
static_assert(sizeof(EmojiWI_C_ExecuteUbergraph_EmojiWI) == 0x000020, "Wrong size on EmojiWI_C_ExecuteUbergraph_EmojiWI");
static_assert(offsetof(EmojiWI_C_ExecuteUbergraph_EmojiWI, EntryPoint) == 0x000000, "Member 'EmojiWI_C_ExecuteUbergraph_EmojiWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmojiWI_C_ExecuteUbergraph_EmojiWI, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'EmojiWI_C_ExecuteUbergraph_EmojiWI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmojiWI_C_ExecuteUbergraph_EmojiWI, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'EmojiWI_C_ExecuteUbergraph_EmojiWI::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmojiWI_C_ExecuteUbergraph_EmojiWI, K2Node_CustomEvent_TimeShown) == 0x000018, "Member 'EmojiWI_C_ExecuteUbergraph_EmojiWI::K2Node_CustomEvent_TimeShown' has a wrong offset!");

// Function EmojiWI.EmojiWI_C.Play Emoji
// 0x0004 (0x0004 - 0x0000)
struct EmojiWI_C_Play_Emoji final
{
public:
	float                                         TimeShown_0;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmojiWI_C_Play_Emoji) == 0x000004, "Wrong alignment on EmojiWI_C_Play_Emoji");
static_assert(sizeof(EmojiWI_C_Play_Emoji) == 0x000004, "Wrong size on EmojiWI_C_Play_Emoji");
static_assert(offsetof(EmojiWI_C_Play_Emoji, TimeShown_0) == 0x000000, "Member 'EmojiWI_C_Play_Emoji::TimeShown_0' has a wrong offset!");

}

