#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emote_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function Emote_Base.Emote_Base_C.ExecuteUbergraph_Emote_Base
// 0x0038 (0x0038 - 0x0000)
struct Emote_Base_C_ExecuteUbergraph_Emote_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCT_AnimBpSCT_C*                       K2Node_DynamicCast_AsSCT_Anim_Bp_SCT;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Emote_Base_C_ExecuteUbergraph_Emote_Base) == 0x000008, "Wrong alignment on Emote_Base_C_ExecuteUbergraph_Emote_Base");
static_assert(sizeof(Emote_Base_C_ExecuteUbergraph_Emote_Base) == 0x000038, "Wrong size on Emote_Base_C_ExecuteUbergraph_Emote_Base");
static_assert(offsetof(Emote_Base_C_ExecuteUbergraph_Emote_Base, EntryPoint) == 0x000000, "Member 'Emote_Base_C_ExecuteUbergraph_Emote_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Emote_Base_C_ExecuteUbergraph_Emote_Base, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Emote_Base_C_ExecuteUbergraph_Emote_Base::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emote_Base_C_ExecuteUbergraph_Emote_Base, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000010, "Member 'Emote_Base_C_ExecuteUbergraph_Emote_Base::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(Emote_Base_C_ExecuteUbergraph_Emote_Base, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Emote_Base_C_ExecuteUbergraph_Emote_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Emote_Base_C_ExecuteUbergraph_Emote_Base, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'Emote_Base_C_ExecuteUbergraph_Emote_Base::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emote_Base_C_ExecuteUbergraph_Emote_Base, K2Node_DynamicCast_AsSCT_Anim_Bp_SCT) == 0x000028, "Member 'Emote_Base_C_ExecuteUbergraph_Emote_Base::K2Node_DynamicCast_AsSCT_Anim_Bp_SCT' has a wrong offset!");
static_assert(offsetof(Emote_Base_C_ExecuteUbergraph_Emote_Base, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Emote_Base_C_ExecuteUbergraph_Emote_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

