#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmoteWheelV2EntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_Emote_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EmoteWheelV2EntryWI.EmoteWheelV2EntryWI_C
// 0x00D8 (0x0338 - 0x0260)
class UEmoteWheelV2EntryWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCanvasPanel*                           Canvas_Icon;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConsoleButtonImage;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PieImage;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     PieMaterial;                                       // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PieSize;                                           // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PieOffset;                                         // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FS_Emote                               EmoteDetails;                                      // 0x02A0(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         RenderAngle;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmoteWheelWI_C*                        ParentWidgetEmoteWheel;                            // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              IconScale;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              TextPosition;                                      // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsCustomizationMenu;                               // 0x0324(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSetCustomizationVisibility;                      // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSetCustomizationVisibility__DelegateSignature(ESlateVisibility InVisibility);
	void ExecuteUbergraph_EmoteWheelV2EntryWI(int32 EntryPoint);
	void SetConsoleVisibility(ESlateVisibility InVisibility);
	void Unhover();
	void Hover();
	void PreConstruct(bool IsDesignTime);
	void Initialize(const struct FS_Emote& Emote);
	void SetTextParameters();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmoteWheelV2EntryWI_C">();
	}
	static class UEmoteWheelV2EntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteWheelV2EntryWI_C>();
	}
};
static_assert(alignof(UEmoteWheelV2EntryWI_C) == 0x000008, "Wrong alignment on UEmoteWheelV2EntryWI_C");
static_assert(sizeof(UEmoteWheelV2EntryWI_C) == 0x000338, "Wrong size on UEmoteWheelV2EntryWI_C");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, UberGraphFrame) == 0x000260, "Member 'UEmoteWheelV2EntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, Canvas_Icon) == 0x000268, "Member 'UEmoteWheelV2EntryWI_C::Canvas_Icon' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, ConsoleButtonImage) == 0x000270, "Member 'UEmoteWheelV2EntryWI_C::ConsoleButtonImage' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, Icon) == 0x000278, "Member 'UEmoteWheelV2EntryWI_C::Icon' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, PieImage) == 0x000280, "Member 'UEmoteWheelV2EntryWI_C::PieImage' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, TextBlock_Name) == 0x000288, "Member 'UEmoteWheelV2EntryWI_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, PieMaterial) == 0x000290, "Member 'UEmoteWheelV2EntryWI_C::PieMaterial' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, PieSize) == 0x000298, "Member 'UEmoteWheelV2EntryWI_C::PieSize' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, PieOffset) == 0x00029C, "Member 'UEmoteWheelV2EntryWI_C::PieOffset' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, EmoteDetails) == 0x0002A0, "Member 'UEmoteWheelV2EntryWI_C::EmoteDetails' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, RenderAngle) == 0x000300, "Member 'UEmoteWheelV2EntryWI_C::RenderAngle' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, ParentWidgetEmoteWheel) == 0x000308, "Member 'UEmoteWheelV2EntryWI_C::ParentWidgetEmoteWheel' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, IconScale) == 0x000310, "Member 'UEmoteWheelV2EntryWI_C::IconScale' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, TextPosition) == 0x000318, "Member 'UEmoteWheelV2EntryWI_C::TextPosition' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, FontSize) == 0x000320, "Member 'UEmoteWheelV2EntryWI_C::FontSize' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, IsCustomizationMenu) == 0x000324, "Member 'UEmoteWheelV2EntryWI_C::IsCustomizationMenu' has a wrong offset!");
static_assert(offsetof(UEmoteWheelV2EntryWI_C, OnSetCustomizationVisibility) == 0x000328, "Member 'UEmoteWheelV2EntryWI_C::OnSetCustomizationVisibility' has a wrong offset!");

}

