#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipablePower_KeycardFinder

#include "Basic.hpp"

#include "E_KeyCardColors_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EquipablePower_KeycardFinder.EquipablePower_KeycardFinder_C.ExecuteUbergraph_EquipablePower_KeycardFinder
// 0x0218 (0x0218 - 0x0000)
struct EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_KeyCardColors                               Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_4;                            // 0x0078(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory_1; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_1;                   // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_wasCancelled;                         // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APickupActor_Keycard_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0120(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_2;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_2;                   // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APickupActor_Keycard_C*                 CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APickupActor_Keycard_C*                 CallFunc_GetClosestActor_ClosestKeycard;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestActor_Distance;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSquaredDistanceTo_ReturnValue;         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCT*                          K2Node_DynamicCast_AsCharacter_SCT;                // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x01B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x01B8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder) == 0x000008, "Wrong alignment on EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder");
static_assert(sizeof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder) == 0x000218, "Wrong size on EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, EntryPoint) == 0x000000, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::EntryPoint' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, Temp_delegate_Variable) == 0x000004, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_Lerp_ReturnValue) == 0x000024, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, Temp_byte_Variable) == 0x000031, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, Temp_struct_Variable) == 0x000034, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, Temp_struct_Variable_1) == 0x000044, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, Temp_struct_Variable_2) == 0x000054, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_IsValid_ReturnValue_1) == 0x000064, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, Temp_struct_Variable_3) == 0x000068, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, Temp_struct_Variable_4) == 0x000078, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_HasAuthority_ReturnValue) == 0x000088, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_IsLocallyControlled_ReturnValue) == 0x000089, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_HasAuthority_ReturnValue_1) == 0x00008A, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_HasAuthority_ReturnValue_2) == 0x000090, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetOwner_ReturnValue) == 0x000098, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_HasAuthority_ReturnValue_3) == 0x0000A0, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x0000A8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x0000B8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x0000C0, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_AsIAnim_Bp) == 0x0000C8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetOwner_ReturnValue_1) == 0x0000E0, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1) == 0x0000E8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetSCT_Player_Character_CharacterInventory_1) == 0x0000F0, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetSCT_Player_Character_CharacterInventory_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x0000F8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_AsIAnim_Bp_1) == 0x000108, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_AsIAnim_Bp_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_Event_wasCancelled) == 0x000119, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_Event_wasCancelled' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetAllActorsOfClass_OutActors) == 0x000120, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetOwner_ReturnValue_2) == 0x000130, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_AsCharacter_SCTBP_2) == 0x000138, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_AsCharacter_SCTBP_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_bSuccess_4) == 0x000140, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_AsIAnim_Bp_2) == 0x000148, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_AsIAnim_Bp_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_bSuccess_5) == 0x000158, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_PostAkEvent_ReturnValue) == 0x00015C, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, Temp_int_Array_Index_Variable) == 0x000160, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_Array_Get_Item) == 0x000168, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetClosestActor_ClosestKeycard) == 0x000170, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetClosestActor_ClosestKeycard' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetClosestActor_Distance) == 0x000178, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetClosestActor_Distance' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x00017C, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetOwner_ReturnValue_3) == 0x000180, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_GetSquaredDistanceTo_ReturnValue) == 0x000188, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_GetSquaredDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_AsCharacter_SCT) == 0x000190, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_DynamicCast_bSuccess_6) == 0x000198, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_CreateDelegate_OutputDelegate_1) == 0x00019C, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_HasAuthority_ReturnValue_4) == 0x0001AC, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0001B0, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, Temp_delegate_Variable_1) == 0x0001B8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001C8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001CC, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001D8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, Temp_int_Loop_Counter_Variable) == 0x0001E4, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001E8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_Vector_Distance_ReturnValue) == 0x0001F4, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_Less_IntInt_ReturnValue) == 0x0001F8, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_MapRangeClamped_ReturnValue) == 0x0001FC, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000200, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, CallFunc_Add_IntInt_ReturnValue) == 0x000204, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder, K2Node_Select_Default) == 0x000208, "Member 'EquipablePower_KeycardFinder_C_ExecuteUbergraph_EquipablePower_KeycardFinder::K2Node_Select_Default' has a wrong offset!");

// Function EquipablePower_KeycardFinder.EquipablePower_KeycardFinder_C.Deactivate
// 0x0001 (0x0001 - 0x0000)
struct EquipablePower_KeycardFinder_C_Deactivate final
{
public:
	bool                                          WasCancelled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipablePower_KeycardFinder_C_Deactivate) == 0x000001, "Wrong alignment on EquipablePower_KeycardFinder_C_Deactivate");
static_assert(sizeof(EquipablePower_KeycardFinder_C_Deactivate) == 0x000001, "Wrong size on EquipablePower_KeycardFinder_C_Deactivate");
static_assert(offsetof(EquipablePower_KeycardFinder_C_Deactivate, WasCancelled) == 0x000000, "Member 'EquipablePower_KeycardFinder_C_Deactivate::WasCancelled' has a wrong offset!");

// Function EquipablePower_KeycardFinder.EquipablePower_KeycardFinder_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct EquipablePower_KeycardFinder_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_KeycardFinder_C_UserConstructionScript) == 0x000008, "Wrong alignment on EquipablePower_KeycardFinder_C_UserConstructionScript");
static_assert(sizeof(EquipablePower_KeycardFinder_C_UserConstructionScript) == 0x000008, "Wrong size on EquipablePower_KeycardFinder_C_UserConstructionScript");
static_assert(offsetof(EquipablePower_KeycardFinder_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'EquipablePower_KeycardFinder_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function EquipablePower_KeycardFinder.EquipablePower_KeycardFinder_C.GetClosestActor
// 0x0040 (0x0040 - 0x0000)
struct EquipablePower_KeycardFinder_C_GetClosestActor final
{
public:
	class APickupActor_Keycard_C*                 ClosestKeycard_0;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x0010(0x0010)(ReferenceParm)
	TArray<class APickupActor_Keycard_C*>         CallFunc_Map_Keys_Keys;                            // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_MinOfFloatArray_IndexOfMinValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MinOfFloatArray_MinValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APickupActor_Keycard_C*                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_KeycardFinder_C_GetClosestActor) == 0x000008, "Wrong alignment on EquipablePower_KeycardFinder_C_GetClosestActor");
static_assert(sizeof(EquipablePower_KeycardFinder_C_GetClosestActor) == 0x000040, "Wrong size on EquipablePower_KeycardFinder_C_GetClosestActor");
static_assert(offsetof(EquipablePower_KeycardFinder_C_GetClosestActor, ClosestKeycard_0) == 0x000000, "Member 'EquipablePower_KeycardFinder_C_GetClosestActor::ClosestKeycard_0' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_GetClosestActor, Distance) == 0x000008, "Member 'EquipablePower_KeycardFinder_C_GetClosestActor::Distance' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_GetClosestActor, CallFunc_Map_Values_Values) == 0x000010, "Member 'EquipablePower_KeycardFinder_C_GetClosestActor::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_GetClosestActor, CallFunc_Map_Keys_Keys) == 0x000020, "Member 'EquipablePower_KeycardFinder_C_GetClosestActor::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_GetClosestActor, CallFunc_MinOfFloatArray_IndexOfMinValue) == 0x000030, "Member 'EquipablePower_KeycardFinder_C_GetClosestActor::CallFunc_MinOfFloatArray_IndexOfMinValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_GetClosestActor, CallFunc_MinOfFloatArray_MinValue) == 0x000034, "Member 'EquipablePower_KeycardFinder_C_GetClosestActor::CallFunc_MinOfFloatArray_MinValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_GetClosestActor, CallFunc_Array_Get_Item) == 0x000038, "Member 'EquipablePower_KeycardFinder_C_GetClosestActor::CallFunc_Array_Get_Item' has a wrong offset!");

// Function EquipablePower_KeycardFinder.EquipablePower_KeycardFinder_C.GetLookingAtDOT
// 0x0048 (0x0048 - 0x0000)
struct EquipablePower_KeycardFinder_C_GetLookingAtDOT final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_KeycardFinder_C_GetLookingAtDOT) == 0x000004, "Wrong alignment on EquipablePower_KeycardFinder_C_GetLookingAtDOT");
static_assert(sizeof(EquipablePower_KeycardFinder_C_GetLookingAtDOT) == 0x000048, "Wrong size on EquipablePower_KeycardFinder_C_GetLookingAtDOT");
static_assert(offsetof(EquipablePower_KeycardFinder_C_GetLookingAtDOT, ReturnValue) == 0x000000, "Member 'EquipablePower_KeycardFinder_C_GetLookingAtDOT::ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_KeycardFinder_C_GetLookingAtDOT, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'EquipablePower_KeycardFinder_C_GetLookingAtDOT::CallFunc_IsValid_ReturnValue' has a wrong offset!");
