#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipablePower_OxygenPotion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EquipablePower_OxygenPotion.EquipablePower_OxygenPotion_C
// 0x0028 (0x0260 - 0x0238)
class AEquipablePower_OxygenPotion_C final : public AEquipablePower
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAkComponent*                           Oxygen_kit_use;                                    // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 EffectToGrant;                                     // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EquipablePower_OxygenPotion(int32 EntryPoint);
	void Activate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EquipablePower_OxygenPotion_C">();
	}
	static class AEquipablePower_OxygenPotion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEquipablePower_OxygenPotion_C>();
	}
};
static_assert(alignof(AEquipablePower_OxygenPotion_C) == 0x000008, "Wrong alignment on AEquipablePower_OxygenPotion_C");
static_assert(sizeof(AEquipablePower_OxygenPotion_C) == 0x000260, "Wrong size on AEquipablePower_OxygenPotion_C");
static_assert(offsetof(AEquipablePower_OxygenPotion_C, UberGraphFrame) == 0x000238, "Member 'AEquipablePower_OxygenPotion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEquipablePower_OxygenPotion_C, StaticMesh) == 0x000240, "Member 'AEquipablePower_OxygenPotion_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AEquipablePower_OxygenPotion_C, Scene) == 0x000248, "Member 'AEquipablePower_OxygenPotion_C::Scene' has a wrong offset!");
static_assert(offsetof(AEquipablePower_OxygenPotion_C, Oxygen_kit_use) == 0x000250, "Member 'AEquipablePower_OxygenPotion_C::Oxygen_kit_use' has a wrong offset!");
static_assert(offsetof(AEquipablePower_OxygenPotion_C, EffectToGrant) == 0x000258, "Member 'AEquipablePower_OxygenPotion_C::EffectToGrant' has a wrong offset!");

}

