#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipablePower_Keycard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function EquipablePower_Keycard.EquipablePower_Keycard_C.ExecuteUbergraph_EquipablePower_Keycard
// 0x0138 (0x0138 - 0x0000)
struct EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x009C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_OwningPlayer;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPOI_OffScreenIndicatorWI_C*            CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPOI_WI_C*                              K2Node_DynamicCast_AsPOI_WI;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x00F0(0x0018)(ConstParm)
	class UWidgetOrganizer*                       CallFunc_GetWidgetOrganizer_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard) == 0x000008, "Wrong alignment on EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard");
static_assert(sizeof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard) == 0x000138, "Wrong size on EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, EntryPoint) == 0x000000, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::EntryPoint' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000040, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, Temp_struct_Variable) == 0x000048, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, Temp_delegate_Variable) == 0x000058, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000070, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_GetController_ReturnValue) == 0x000080, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000088, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_DynamicCast_AsPlayer_Controller) == 0x000090, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00009C, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_CustomEvent_OwningPlayer) == 0x0000A8, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_CustomEvent_OwningPlayer' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_GetUserWidgetObject_ReturnValue) == 0x0000B8, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_DynamicCast_AsPOI_WI) == 0x0000C0, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_DynamicCast_AsPOI_WI' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_PlayAnimation_ReturnValue) == 0x0000D0, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_HasAuthority_ReturnValue) == 0x0000D8, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_CustomEvent_DestroyedActor) == 0x0000E0, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_GetOwner_ReturnValue_1) == 0x0000E8, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, Temp_text_Variable) == 0x0000F0, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_GetWidgetOrganizer_ReturnValue) == 0x000108, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_GetWidgetOrganizer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_PostAkEvent_ReturnValue) == 0x000110, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, K2Node_CreateDelegate_OutputDelegate_3) == 0x000114, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000128, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard, CallFunc_HasAuthority_ReturnValue_1) == 0x000130, "Member 'EquipablePower_Keycard_C_ExecuteUbergraph_EquipablePower_Keycard::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");

// Function EquipablePower_Keycard.EquipablePower_Keycard_C.On Removed Card
// 0x0008 (0x0008 - 0x0000)
struct EquipablePower_Keycard_C_On_Removed_Card final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_Keycard_C_On_Removed_Card) == 0x000008, "Wrong alignment on EquipablePower_Keycard_C_On_Removed_Card");
static_assert(sizeof(EquipablePower_Keycard_C_On_Removed_Card) == 0x000008, "Wrong size on EquipablePower_Keycard_C_On_Removed_Card");
static_assert(offsetof(EquipablePower_Keycard_C_On_Removed_Card, DestroyedActor) == 0x000000, "Member 'EquipablePower_Keycard_C_On_Removed_Card::DestroyedActor' has a wrong offset!");

// Function EquipablePower_Keycard.EquipablePower_Keycard_C.Owner_Create Off Screen Indicator
// 0x0008 (0x0008 - 0x0000)
struct EquipablePower_Keycard_C_Owner_Create_Off_Screen_Indicator final
{
public:
	class APlayerController*                      OwningPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_Keycard_C_Owner_Create_Off_Screen_Indicator) == 0x000008, "Wrong alignment on EquipablePower_Keycard_C_Owner_Create_Off_Screen_Indicator");
static_assert(sizeof(EquipablePower_Keycard_C_Owner_Create_Off_Screen_Indicator) == 0x000008, "Wrong size on EquipablePower_Keycard_C_Owner_Create_Off_Screen_Indicator");
static_assert(offsetof(EquipablePower_Keycard_C_Owner_Create_Off_Screen_Indicator, OwningPlayer) == 0x000000, "Member 'EquipablePower_Keycard_C_Owner_Create_Off_Screen_Indicator::OwningPlayer' has a wrong offset!");

// Function EquipablePower_Keycard.EquipablePower_Keycard_C.UpdateOffScreenIndicator
// 0x0020 (0x0020 - 0x0000)
struct EquipablePower_Keycard_C_UpdateOffScreenIndicator final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_Keycard_C_UpdateOffScreenIndicator) == 0x000004, "Wrong alignment on EquipablePower_Keycard_C_UpdateOffScreenIndicator");
static_assert(sizeof(EquipablePower_Keycard_C_UpdateOffScreenIndicator) == 0x000020, "Wrong size on EquipablePower_Keycard_C_UpdateOffScreenIndicator");
static_assert(offsetof(EquipablePower_Keycard_C_UpdateOffScreenIndicator, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'EquipablePower_Keycard_C_UpdateOffScreenIndicator::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_UpdateOffScreenIndicator, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00000C, "Member 'EquipablePower_Keycard_C_UpdateOffScreenIndicator::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_UpdateOffScreenIndicator, CallFunc_Vector_Distance_ReturnValue) == 0x000018, "Member 'EquipablePower_Keycard_C_UpdateOffScreenIndicator::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_UpdateOffScreenIndicator, CallFunc_MapRangeClamped_ReturnValue) == 0x00001C, "Member 'EquipablePower_Keycard_C_UpdateOffScreenIndicator::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function EquipablePower_Keycard.EquipablePower_Keycard_C.OFFSI_SaveRequiredReferences
// 0x0028 (0x0028 - 0x0000)
struct EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences final
{
public:
	class AController*                            Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AKeySocket3in1BP_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class AKeySocket3in1BP_C*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences) == 0x000008, "Wrong alignment on EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences");
static_assert(sizeof(EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences) == 0x000028, "Wrong size on EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences");
static_assert(offsetof(EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences, Controller) == 0x000000, "Member 'EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences::Controller' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences, CallFunc_Array_Get_Item) == 0x000020, "Member 'EquipablePower_Keycard_C_OFFSI_SaveRequiredReferences::CallFunc_Array_Get_Item' has a wrong offset!");

// Function EquipablePower_Keycard.EquipablePower_Keycard_C.RemoveAllExistingKeycardOFFSI
// 0x0038 (0x0038 - 0x0000)
struct EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPOI_OffScreenIndicatorWI_C*>    CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPOI_OffScreenIndicatorWI_C*            CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI) == 0x000008, "Wrong alignment on EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI");
static_assert(sizeof(EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI) == 0x000038, "Wrong size on EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI");
static_assert(offsetof(EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI, Temp_int_Array_Index_Variable) == 0x000000, "Member 'EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI, CallFunc_Array_Get_Item) == 0x000028, "Member 'EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000031, "Member 'EquipablePower_Keycard_C_RemoveAllExistingKeycardOFFSI::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

