#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipablePower_Scanner

#include "Basic.hpp"

#include "E_ItemAnimation_structs.hpp"


namespace SDK::Params
{

// Function EquipablePower_Scanner.EquipablePower_Scanner_C.ExecuteUbergraph_EquipablePower_Scanner
// 0x0038 (0x0038 - 0x0000)
struct EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemAnimation                               K2Node_CustomEvent_ItemAnimation;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner) == 0x000008, "Wrong alignment on EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner");
static_assert(sizeof(EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner) == 0x000038, "Wrong size on EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner");
static_assert(offsetof(EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner, EntryPoint) == 0x000000, "Member 'EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner::EntryPoint' has a wrong offset!");
static_assert(offsetof(EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner, K2Node_CustomEvent_ItemAnimation) == 0x000010, "Member 'EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner::K2Node_CustomEvent_ItemAnimation' has a wrong offset!");
static_assert(offsetof(EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner, K2Node_DynamicCast_AsCharacter) == 0x000018, "Member 'EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000028, "Member 'EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'EquipablePower_Scanner_C_ExecuteUbergraph_EquipablePower_Scanner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function EquipablePower_Scanner.EquipablePower_Scanner_C.ItemAnimation
// 0x0001 (0x0001 - 0x0000)
struct EquipablePower_Scanner_C_ItemAnimation final
{
public:
	E_ItemAnimation                               ItemAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipablePower_Scanner_C_ItemAnimation) == 0x000001, "Wrong alignment on EquipablePower_Scanner_C_ItemAnimation");
static_assert(sizeof(EquipablePower_Scanner_C_ItemAnimation) == 0x000001, "Wrong size on EquipablePower_Scanner_C_ItemAnimation");
static_assert(offsetof(EquipablePower_Scanner_C_ItemAnimation, ItemAnimation_0) == 0x000000, "Member 'EquipablePower_Scanner_C_ItemAnimation::ItemAnimation_0' has a wrong offset!");

}

