#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCT_IntroWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FCT_IntroWI.FCT_IntroWI_C
// 0x0018 (0x0278 - 0x0260)
class UFCT_IntroWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UFCT_LogoWI_C*                          FCT_LogoWI;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USeizureWarningWI_C*                    SeizureWarningWI;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FCT_IntroWI(int32 EntryPoint);
	void Destruct();
	void On_Logo_Removed();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FCT_IntroWI_C">();
	}
	static class UFCT_IntroWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFCT_IntroWI_C>();
	}
};
static_assert(alignof(UFCT_IntroWI_C) == 0x000008, "Wrong alignment on UFCT_IntroWI_C");
static_assert(sizeof(UFCT_IntroWI_C) == 0x000278, "Wrong size on UFCT_IntroWI_C");
static_assert(offsetof(UFCT_IntroWI_C, UberGraphFrame) == 0x000260, "Member 'UFCT_IntroWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFCT_IntroWI_C, FCT_LogoWI) == 0x000268, "Member 'UFCT_IntroWI_C::FCT_LogoWI' has a wrong offset!");
static_assert(offsetof(UFCT_IntroWI_C, SeizureWarningWI) == 0x000270, "Member 'UFCT_IntroWI_C::SeizureWarningWI' has a wrong offset!");

}

