#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCTGameInstanceBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_Emote_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FCTGameInstanceBP.FCTGameInstanceBP_C
// 0x0388 (0x0650 - 0x02C8)
class UFCTGameInstanceBP_C final : public USCTGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	TArray<int32>                                 TrackedPlayers;                                    // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAkAudioEvent*>                  AKEventToReference;                                // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UsingGamepad;                                      // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ProfileAvatar;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IntroComplete;                                     // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NavigatingMenu;                                    // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              StartTime;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAkAudioEvent*>                  AKEventToReference_0;                              // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UDataTable>              FemaleBodyCustomizationDTSR;                       // 0x0320(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              FemaleFeetCustomizationDTSR;                       // 0x0348(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              FemaleHeadCustomizationDTSR;                       // 0x0370(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              FemaleLegsCustomizationDTSR;                       // 0x0398(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              FemaleAccessoryCustomizationDTSR;                  // 0x03C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              FemaleFacialHairCustomizationDTSR;                 // 0x03E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              FemaleEyewearCustomizationDTSR;                    // 0x0410(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              MaleBodyCustomizationDTSR;                         // 0x0438(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              MaleFeetCustomizationDTSR;                         // 0x0460(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              MaleHeadCustomizationDTSR;                         // 0x0488(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              MaleLegsCustomizationDTSR;                         // 0x04B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              MaleAccessoryCustomizationDTSR;                    // 0x04D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              MaleFacialHairCustomizationDTSR;                   // 0x0500(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              MaleEyewearCustomizationDTSR;                      // 0x0528(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UDataTable*>                     CustomizationDataTables;                           // 0x0550(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumberofCustomizationDTsToLoad;                    // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             FemaleBodyCustomizationDT;                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             FemaleFeetCustomizationDT;                         // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             FemaleHeadCustomizationDT;                         // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             FemaleLegsCustomizationDT;                         // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             FemaleAccessoryCustomizationDT;                    // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             FemaleFacialHairCustomizationDT;                   // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             FemaleEyewearCustomizationDT;                      // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleBodyCustomizationDT;                           // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleFeetCustomizationDT;                           // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleHeadCustomizationDT;                           // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleLegsCustomizationDT;                           // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_Emote>                       PlayerEmotes;                                      // 0x05C0(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           DefaultEmotes;                                     // 0x05D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnEmotesUsable;                                    // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UDataTable*                             MaleAccessoryCustomizationDT;                      // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleFacialHairCustomizationDT;                     // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MaleEyewearCustomizationDT;                        // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULanguageData*                          LanguageData;                                      // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnLanguageUpdated;                                 // 0x0610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 Matchmaker_Language;                               // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMatchmakingLanguageUpdated;                      // 0x0630(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMatchmakerLanguageData*                MatchmakerLanguageData;                            // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bControllerDisconnectEnabled;                      // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnEmotesUsable__DelegateSignature();
	void OnLanguageUpdated__DelegateSignature();
	void OnMatchmakingLanguageUpdated__DelegateSignature(const class FString& UpdatedLanguage);
	void ExecuteUbergraph_FCTGameInstanceBP(int32 EntryPoint);
	void K2_OnXboxUserLoggedOut();
	void BindToAccelByteGIS();
	void OnClientLoggedIn();
	void LoadCustomisationOptions_();
	void OnInitialLoadComplete();
	void AnyKey(const struct FKey& Key);
	void K2_OnControllerConnectionStateChanged(bool Connected, int32 UserId, int32 ControllerId);
	void ReceiveInit();
	void HandleNetworkError(ENetworkFailure FailureType, bool bIsServer);
	void OnLoaded_FFBB87FD4EEF67089A161D8DC616F5FA(class UObject* Loaded);
	void OnLoaded_B704ADDE4F0BD4E28420A09DB2070348(class UObject* Loaded);
	void OnLoaded_36D51B6F4B7B86707E9BE7924AE70ADE(class UObject* Loaded);
	void OnLoaded_611BA09843BC7A5DE4E48CA397EF78FA(class UObject* Loaded);
	void OnLoaded_F2D4C0AD4F1BDD5DE5E3F2AF3EBEB1EF(class UObject* Loaded);
	void OnLoaded_67A532C3437F66D8B32DAE9B7D4BCAE6(class UObject* Loaded);
	void OnSuccess_079B6E1B46494908CEC167890B9ACDFB(const struct FFCTCloudEmotesPayload& Payload, int32 Code, const class FString& Message);
	void OnError_079B6E1B46494908CEC167890B9ACDFB(const struct FFCTCloudEmotesPayload& Payload, int32 Code, const class FString& Message);
	void OnLoaded_79B948034E314D0EB990BAB185C44AC4(class UObject* Loaded);
	void OnLoaded_03D3662046C5C3AF803CCCA2251B09A3(class UObject* Loaded);
	void OnLoaded_3A09E1584EDAC54A3F77EFA6F79C5D9D(class UObject* Loaded);
	void OnLoaded_FF3DFA2B4739E6571383BAB03222C228(class UObject* Loaded);
	void OnLoaded_990E39E54786CEEF743C0897B06530B6(class UObject* Loaded);
	void OnLoaded_E2CA7AE0431B535DC434AB9F6BF6D1A4(class UObject* Loaded);
	void OnLoaded_975E13744BDEDFA41116A2BA72AFB21F(class UObject* Loaded);
	void OnLoaded_AB3D6BDD4BC95EF664A89CB788A6CC68(class UObject* Loaded);
	void ReferenceAkEvents();
	void SetDefaultSettings();
	void InitializeSaveSystem();
	void GetSaveIconPath(class FString* OutSaveIconPath);
	void HandleControllerDisconnect(bool Connected, int32 UserId, int32 ControllerId);
	void LoadUserSettings();
	void ForceLoadCustomizationDT(TSoftObjectPtr<class UDataTable> DataTableSoftReference, class UDataTable** LoadedDT);
	void IsAllCustomizationLoaded(bool* Result);
	void ForceLoadAllCustomizationDT();
	void AddToCustomizationDT(class UDataTable* Data_Table);
	void UpdateLanguageFromSaveData();
	void UpdateMatchLanguageFromSaveData();
	void UpdateSaveDataAfterXboxUserLogOut();
	void GetSaveSlotsToLoad(TArray<class FString>* SaveSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FCTGameInstanceBP_C">();
	}
	static class UFCTGameInstanceBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFCTGameInstanceBP_C>();
	}
};
static_assert(alignof(UFCTGameInstanceBP_C) == 0x000008, "Wrong alignment on UFCTGameInstanceBP_C");
static_assert(sizeof(UFCTGameInstanceBP_C) == 0x000650, "Wrong size on UFCTGameInstanceBP_C");
static_assert(offsetof(UFCTGameInstanceBP_C, UberGraphFrame) == 0x0002C8, "Member 'UFCTGameInstanceBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, TrackedPlayers) == 0x0002D0, "Member 'UFCTGameInstanceBP_C::TrackedPlayers' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, AKEventToReference) == 0x0002E0, "Member 'UFCTGameInstanceBP_C::AKEventToReference' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, UsingGamepad) == 0x0002F0, "Member 'UFCTGameInstanceBP_C::UsingGamepad' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, ProfileAvatar) == 0x0002F8, "Member 'UFCTGameInstanceBP_C::ProfileAvatar' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, IntroComplete) == 0x000300, "Member 'UFCTGameInstanceBP_C::IntroComplete' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, NavigatingMenu) == 0x000301, "Member 'UFCTGameInstanceBP_C::NavigatingMenu' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, StartTime) == 0x000308, "Member 'UFCTGameInstanceBP_C::StartTime' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, AKEventToReference_0) == 0x000310, "Member 'UFCTGameInstanceBP_C::AKEventToReference_0' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleBodyCustomizationDTSR) == 0x000320, "Member 'UFCTGameInstanceBP_C::FemaleBodyCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleFeetCustomizationDTSR) == 0x000348, "Member 'UFCTGameInstanceBP_C::FemaleFeetCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleHeadCustomizationDTSR) == 0x000370, "Member 'UFCTGameInstanceBP_C::FemaleHeadCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleLegsCustomizationDTSR) == 0x000398, "Member 'UFCTGameInstanceBP_C::FemaleLegsCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleAccessoryCustomizationDTSR) == 0x0003C0, "Member 'UFCTGameInstanceBP_C::FemaleAccessoryCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleFacialHairCustomizationDTSR) == 0x0003E8, "Member 'UFCTGameInstanceBP_C::FemaleFacialHairCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleEyewearCustomizationDTSR) == 0x000410, "Member 'UFCTGameInstanceBP_C::FemaleEyewearCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleBodyCustomizationDTSR) == 0x000438, "Member 'UFCTGameInstanceBP_C::MaleBodyCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleFeetCustomizationDTSR) == 0x000460, "Member 'UFCTGameInstanceBP_C::MaleFeetCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleHeadCustomizationDTSR) == 0x000488, "Member 'UFCTGameInstanceBP_C::MaleHeadCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleLegsCustomizationDTSR) == 0x0004B0, "Member 'UFCTGameInstanceBP_C::MaleLegsCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleAccessoryCustomizationDTSR) == 0x0004D8, "Member 'UFCTGameInstanceBP_C::MaleAccessoryCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleFacialHairCustomizationDTSR) == 0x000500, "Member 'UFCTGameInstanceBP_C::MaleFacialHairCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleEyewearCustomizationDTSR) == 0x000528, "Member 'UFCTGameInstanceBP_C::MaleEyewearCustomizationDTSR' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, CustomizationDataTables) == 0x000550, "Member 'UFCTGameInstanceBP_C::CustomizationDataTables' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, NumberofCustomizationDTsToLoad) == 0x000560, "Member 'UFCTGameInstanceBP_C::NumberofCustomizationDTsToLoad' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleBodyCustomizationDT) == 0x000568, "Member 'UFCTGameInstanceBP_C::FemaleBodyCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleFeetCustomizationDT) == 0x000570, "Member 'UFCTGameInstanceBP_C::FemaleFeetCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleHeadCustomizationDT) == 0x000578, "Member 'UFCTGameInstanceBP_C::FemaleHeadCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleLegsCustomizationDT) == 0x000580, "Member 'UFCTGameInstanceBP_C::FemaleLegsCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleAccessoryCustomizationDT) == 0x000588, "Member 'UFCTGameInstanceBP_C::FemaleAccessoryCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleFacialHairCustomizationDT) == 0x000590, "Member 'UFCTGameInstanceBP_C::FemaleFacialHairCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, FemaleEyewearCustomizationDT) == 0x000598, "Member 'UFCTGameInstanceBP_C::FemaleEyewearCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleBodyCustomizationDT) == 0x0005A0, "Member 'UFCTGameInstanceBP_C::MaleBodyCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleFeetCustomizationDT) == 0x0005A8, "Member 'UFCTGameInstanceBP_C::MaleFeetCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleHeadCustomizationDT) == 0x0005B0, "Member 'UFCTGameInstanceBP_C::MaleHeadCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleLegsCustomizationDT) == 0x0005B8, "Member 'UFCTGameInstanceBP_C::MaleLegsCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, PlayerEmotes) == 0x0005C0, "Member 'UFCTGameInstanceBP_C::PlayerEmotes' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, DefaultEmotes) == 0x0005D0, "Member 'UFCTGameInstanceBP_C::DefaultEmotes' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, OnEmotesUsable) == 0x0005E0, "Member 'UFCTGameInstanceBP_C::OnEmotesUsable' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleAccessoryCustomizationDT) == 0x0005F0, "Member 'UFCTGameInstanceBP_C::MaleAccessoryCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleFacialHairCustomizationDT) == 0x0005F8, "Member 'UFCTGameInstanceBP_C::MaleFacialHairCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MaleEyewearCustomizationDT) == 0x000600, "Member 'UFCTGameInstanceBP_C::MaleEyewearCustomizationDT' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, LanguageData) == 0x000608, "Member 'UFCTGameInstanceBP_C::LanguageData' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, OnLanguageUpdated) == 0x000610, "Member 'UFCTGameInstanceBP_C::OnLanguageUpdated' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, Matchmaker_Language) == 0x000620, "Member 'UFCTGameInstanceBP_C::Matchmaker_Language' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, OnMatchmakingLanguageUpdated) == 0x000630, "Member 'UFCTGameInstanceBP_C::OnMatchmakingLanguageUpdated' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, MatchmakerLanguageData) == 0x000640, "Member 'UFCTGameInstanceBP_C::MatchmakerLanguageData' has a wrong offset!");
static_assert(offsetof(UFCTGameInstanceBP_C, bControllerDisconnectEnabled) == 0x000648, "Member 'UFCTGameInstanceBP_C::bControllerDisconnectEnabled' has a wrong offset!");

}

