#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCTGameInstanceBP

#include "Basic.hpp"

#include "FCT_structs.hpp"
#include "S_Emote_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCT_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FCTGameInstanceBP.FCTGameInstanceBP_C.OnMatchmakingLanguageUpdated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct FCTGameInstanceBP_C_OnMatchmakingLanguageUpdated__DelegateSignature final
{
public:
	class FString                                 UpdatedLanguage;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FCTGameInstanceBP_C_OnMatchmakingLanguageUpdated__DelegateSignature) == 0x000008, "Wrong alignment on FCTGameInstanceBP_C_OnMatchmakingLanguageUpdated__DelegateSignature");
static_assert(sizeof(FCTGameInstanceBP_C_OnMatchmakingLanguageUpdated__DelegateSignature) == 0x000010, "Wrong size on FCTGameInstanceBP_C_OnMatchmakingLanguageUpdated__DelegateSignature");
static_assert(offsetof(FCTGameInstanceBP_C_OnMatchmakingLanguageUpdated__DelegateSignature, UpdatedLanguage) == 0x000000, "Member 'FCTGameInstanceBP_C_OnMatchmakingLanguageUpdated__DelegateSignature::UpdatedLanguage' has a wrong offset!");

// Function FCTGameInstanceBP.FCTGameInstanceBP_C.ExecuteUbergraph_FCTGameInstanceBP
// 0x05C0 (0x05C0 - 0x0000)
struct FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_10;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveControllerGIS*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_1;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_2;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_11;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_3;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_4;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_4;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_12;                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_5;                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_6;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_6;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_13;                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_6;                               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_7;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_7;                 // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_8;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_8;                 // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveControllerGIS*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInitialLoadComplete_ReturnValue;       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTCloudEmotesCallbackProxy*           CallFunc_GetEmotesFromCloud_ReturnValue;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCTCloudEmotesPayload                 Temp_struct_Variable;                              // 0x01E0(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Emote                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0218(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENetworkFailure                               K2Node_Event_FailureType;                          // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsServer;                            // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283[0x1];                                      // 0x0283(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0284(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_10;                              // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Connected;                            // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x2];                                      // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_UserID;                               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ControllerId;                         // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetProfileAvatar_ReturnValue;             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_CustomEvent_Key;                            // 0x02E8(0x0018)(HasGetValueTypeHash)
	struct FFCTCloudEmotesPayload                 K2Node_CustomEvent_Payload;                        // 0x0300(0x0010)()
	int32                                         K2Node_CustomEvent_Code;                           // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	class USaveGame*                              CallFunc_LoadGame_ReturnValue;                     // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               K2Node_DynamicCast_AsBp_Special_Options_Save;      // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0370(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x0380(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x0390(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x03A0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTCloudEmotesPayload& Payload, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x03B8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_10;           // 0x03DC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCTCloudEmotesPayload                 K2Node_CustomEvent_Payload_1;                      // 0x03F0(0x0010)()
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTCloudEmotesPayload& Payload, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x041C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_12;           // 0x042C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Emote                               CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0450(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B2[0x2];                                      // 0x04B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnected_ReturnValue;                  // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x04BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_14;           // 0x04CC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_9;                            // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_9;                 // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_15;           // 0x04F4(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_11;                // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_12;                // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_13;                // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_16;           // 0x0514(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_14;                // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_15;                // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_17;           // 0x052C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_6;                       // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_10;                           // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_7;                       // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_10;                // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_11;                           // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_8;                       // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_11;                // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581[0x3];                                      // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_13;                              // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_12;                           // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_9;                       // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_12;                // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_14;                              // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_13;                           // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_13;                // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP) == 0x000008, "Wrong alignment on FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP");
static_assert(sizeof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP) == 0x0005C0, "Wrong size on FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, EntryPoint) == 0x000000, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Loaded_10) == 0x000008, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Loaded_10' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable) == 0x000010, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable_1) == 0x000014, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000020, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_object_Variable) == 0x000028, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_object_Variable_1) == 0x000030, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_AsData_Table) == 0x000038, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_AsData_Table' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_AsData_Table_1) == 0x000048, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_AsData_Table_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Loaded) == 0x000058, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable_2) == 0x000060, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable_3) == 0x000064, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_object_Variable_2) == 0x000068, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Loaded_1) == 0x000070, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_AsData_Table_2) == 0x000078, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_AsData_Table_2' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Loaded_11) == 0x000088, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Loaded_11' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_object_Variable_3) == 0x000090, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Loaded_2) == 0x000098, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_AsData_Table_3) == 0x0000A0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_AsData_Table_3' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_bSuccess_3) == 0x0000A8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_object_Variable_4) == 0x0000B0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable_4) == 0x0000B8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_AsData_Table_4) == 0x0000C0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_AsData_Table_4' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_bSuccess_4) == 0x0000C8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Loaded_12) == 0x0000D0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Loaded_12' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_object_Variable_5) == 0x0000D8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Loaded_3) == 0x0000E0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_AsData_Table_5) == 0x0000E8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_AsData_Table_5' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_bSuccess_5) == 0x0000F0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_object_Variable_6) == 0x0000F8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_AsData_Table_6) == 0x000100, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_AsData_Table_6' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_bSuccess_6) == 0x000108, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable_5) == 0x00010C, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Loaded_13) == 0x000110, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Loaded_13' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable_6) == 0x000128, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Loop_Counter_Variable) == 0x00012C, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Add_IntInt_ReturnValue) == 0x000130, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Array_Index_Variable) == 0x000134, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_object_Variable_7) == 0x000138, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_AsData_Table_7) == 0x000140, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_AsData_Table_7' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_bSuccess_7) == 0x000148, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Loaded_4) == 0x000150, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_object_Variable_8) == 0x000158, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Loop_Counter_Variable_1) == 0x000160, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_AsData_Table_8) == 0x000168, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_AsData_Table_8' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_bSuccess_8) == 0x000170, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000174, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Array_Index_Variable_1) == 0x000178, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable_7) == 0x00017C, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Loaded_5) == 0x000180, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000188, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetInitialLoadComplete_ReturnValue) == 0x000190, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetInitialLoadComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000198, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable_8) == 0x0001A0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A4, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001B4, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001C4, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetEmotesFromCloud_ReturnValue) == 0x0001D8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetEmotesFromCloud_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_struct_Variable) == 0x0001E0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_IsValid_ReturnValue) == 0x0001F0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Array_Get_Item) == 0x0001F8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Conv_StringToName_ReturnValue) == 0x000208, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Array_Length_ReturnValue) == 0x000210, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetDataTableRowFromName_OutRow) == 0x000218, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000278, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Less_IntInt_ReturnValue) == 0x000279, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Array_Length_ReturnValue_1) == 0x00027C, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Greater_IntInt_ReturnValue) == 0x000280, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_Event_FailureType) == 0x000281, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_Event_FailureType' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_Event_bIsServer) == 0x000282, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_Event_bIsServer' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetEnumeratorName_ReturnValue) == 0x000284, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable_9) == 0x00028C, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Conv_NameToString_ReturnValue) == 0x000290, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Concat_StrStr_ReturnValue) == 0x0002A0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_string_Variable) == 0x0002B0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetGameUserSettings_ReturnValue) == 0x0002C0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x0002C8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, Temp_int_Variable_10) == 0x0002CC, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Not_PreBool_ReturnValue) == 0x0002D0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_Event_Connected) == 0x0002D1, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_Event_Connected' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_Event_UserID) == 0x0002D4, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_Event_UserID' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_Event_ControllerId) == 0x0002D8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_Event_ControllerId' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_GetProfileAvatar_ReturnValue) == 0x0002E0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_GetProfileAvatar_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Key) == 0x0002E8, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Key' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Payload) == 0x000300, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Code) == 0x000310, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CustomEvent_Message) == 0x000318, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CreateDelegate_OutputDelegate_4) == 0x000328, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_LoadGame_ReturnValue) == 0x000338, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_LoadGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_AsBp_Special_Options_Save) == 0x000340, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_AsBp_Special_Options_Save' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_DynamicCast_bSuccess_9) == 0x000348, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Conv_FloatToString_ReturnValue) == 0x000350, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000360, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CreateDelegate_OutputDelegate_5) == 0x000370, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CreateDelegate_OutputDelegate_6) == 0x000380, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CreateDelegate_OutputDelegate_7) == 0x000390, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP, K2Node_CreateDelegate_OutputDelegate_8) == 0x0003A0, "Member 'FCTGameInstanceBP_C_ExecuteUbergraph_FCTGameInstanceBP::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
