#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCTPostProcessVolume

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.ExecuteUbergraph_FCTPostProcessVolume
// 0x0040 (0x0040 - 0x0000)
struct FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Duration;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume) == 0x000008, "Wrong alignment on FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume");
static_assert(sizeof(FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume) == 0x000040, "Wrong size on FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume");
static_assert(offsetof(FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume, EntryPoint) == 0x000000, "Member 'FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume, K2Node_CustomEvent_Duration) == 0x000004, "Member 'FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume, CallFunc_LinearColorLerp_ReturnValue) == 0x000018, "Member 'FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1) == 0x000028, "Member 'FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume, CallFunc_IsDedicatedServer_ReturnValue) == 0x000038, "Member 'FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000039, "Member 'FCTPostProcessVolume_C_ExecuteUbergraph_FCTPostProcessVolume::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.StartPersonoidScan
// 0x0004 (0x0004 - 0x0000)
struct FCTPostProcessVolume_C_StartPersonoidScan final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCTPostProcessVolume_C_StartPersonoidScan) == 0x000004, "Wrong alignment on FCTPostProcessVolume_C_StartPersonoidScan");
static_assert(sizeof(FCTPostProcessVolume_C_StartPersonoidScan) == 0x000004, "Wrong size on FCTPostProcessVolume_C_StartPersonoidScan");
static_assert(offsetof(FCTPostProcessVolume_C_StartPersonoidScan, Duration) == 0x000000, "Member 'FCTPostProcessVolume_C_StartPersonoidScan::Duration' has a wrong offset!");

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.OutlineBlendable
// 0x0008 (0x0008 - 0x0000)
struct FCTPostProcessVolume_C_OutlineBlendable final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicInstance_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCTPostProcessVolume_C_OutlineBlendable) == 0x000008, "Wrong alignment on FCTPostProcessVolume_C_OutlineBlendable");
static_assert(sizeof(FCTPostProcessVolume_C_OutlineBlendable) == 0x000008, "Wrong size on FCTPostProcessVolume_C_OutlineBlendable");
static_assert(offsetof(FCTPostProcessVolume_C_OutlineBlendable, CallFunc_CreateDynamicInstance_ReturnValue) == 0x000000, "Member 'FCTPostProcessVolume_C_OutlineBlendable::CallFunc_CreateDynamicInstance_ReturnValue' has a wrong offset!");

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.AOHatchBlendable
// 0x0050 (0x0050 - 0x0000)
struct FCTPostProcessVolume_C_AOHatchBlendable final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default;                             // 0x0020(0x0028)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicInstance_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCTPostProcessVolume_C_AOHatchBlendable) == 0x000008, "Wrong alignment on FCTPostProcessVolume_C_AOHatchBlendable");
static_assert(sizeof(FCTPostProcessVolume_C_AOHatchBlendable) == 0x000050, "Wrong size on FCTPostProcessVolume_C_AOHatchBlendable");
static_assert(offsetof(FCTPostProcessVolume_C_AOHatchBlendable, Temp_bool_Variable) == 0x000000, "Member 'FCTPostProcessVolume_C_AOHatchBlendable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_AOHatchBlendable, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000008, "Member 'FCTPostProcessVolume_C_AOHatchBlendable::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_AOHatchBlendable, K2Node_DynamicCast_AsTexture) == 0x000010, "Member 'FCTPostProcessVolume_C_AOHatchBlendable::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_AOHatchBlendable, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'FCTPostProcessVolume_C_AOHatchBlendable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_AOHatchBlendable, K2Node_Select_Default) == 0x000020, "Member 'FCTPostProcessVolume_C_AOHatchBlendable::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_AOHatchBlendable, CallFunc_CreateDynamicInstance_ReturnValue) == 0x000048, "Member 'FCTPostProcessVolume_C_AOHatchBlendable::CallFunc_CreateDynamicInstance_ReturnValue' has a wrong offset!");

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.WorldOverlayBlendable
// 0x0020 (0x0020 - 0x0000)
struct FCTPostProcessVolume_C_WorldOverlayBlendable final
{
public:
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicInstance_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCTPostProcessVolume_C_WorldOverlayBlendable) == 0x000008, "Wrong alignment on FCTPostProcessVolume_C_WorldOverlayBlendable");
static_assert(sizeof(FCTPostProcessVolume_C_WorldOverlayBlendable) == 0x000020, "Wrong size on FCTPostProcessVolume_C_WorldOverlayBlendable");
static_assert(offsetof(FCTPostProcessVolume_C_WorldOverlayBlendable, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000000, "Member 'FCTPostProcessVolume_C_WorldOverlayBlendable::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_WorldOverlayBlendable, K2Node_DynamicCast_AsTexture) == 0x000008, "Member 'FCTPostProcessVolume_C_WorldOverlayBlendable::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_WorldOverlayBlendable, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'FCTPostProcessVolume_C_WorldOverlayBlendable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_WorldOverlayBlendable, CallFunc_CreateDynamicInstance_ReturnValue) == 0x000018, "Member 'FCTPostProcessVolume_C_WorldOverlayBlendable::CallFunc_CreateDynamicInstance_ReturnValue' has a wrong offset!");

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.CreateDynamicInstance
// 0x0068 (0x0068 - 0x0000)
struct FCTPostProcessVolume_C_CreateDynamicInstance final
{
public:
	TSoftObjectPtr<class UObject>                 InAsset;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         InBlendWeight;                                     // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(FCTPostProcessVolume_C_CreateDynamicInstance) == 0x000008, "Wrong alignment on FCTPostProcessVolume_C_CreateDynamicInstance");
static_assert(sizeof(FCTPostProcessVolume_C_CreateDynamicInstance) == 0x000068, "Wrong size on FCTPostProcessVolume_C_CreateDynamicInstance");
static_assert(offsetof(FCTPostProcessVolume_C_CreateDynamicInstance, InAsset) == 0x000000, "Member 'FCTPostProcessVolume_C_CreateDynamicInstance::InAsset' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_CreateDynamicInstance, InBlendWeight) == 0x000028, "Member 'FCTPostProcessVolume_C_CreateDynamicInstance::InBlendWeight' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_CreateDynamicInstance, ReturnValue) == 0x000030, "Member 'FCTPostProcessVolume_C_CreateDynamicInstance::ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_CreateDynamicInstance, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000038, "Member 'FCTPostProcessVolume_C_CreateDynamicInstance::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_CreateDynamicInstance, K2Node_DynamicCast_AsMaterial_Interface) == 0x000040, "Member 'FCTPostProcessVolume_C_CreateDynamicInstance::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_CreateDynamicInstance, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'FCTPostProcessVolume_C_CreateDynamicInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_CreateDynamicInstance, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'FCTPostProcessVolume_C_CreateDynamicInstance::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_CreateDynamicInstance, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000058, "Member 'FCTPostProcessVolume_C_CreateDynamicInstance::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.DistanceFogBlendable
// 0x0008 (0x0008 - 0x0000)
struct FCTPostProcessVolume_C_DistanceFogBlendable final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicInstance_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCTPostProcessVolume_C_DistanceFogBlendable) == 0x000008, "Wrong alignment on FCTPostProcessVolume_C_DistanceFogBlendable");
static_assert(sizeof(FCTPostProcessVolume_C_DistanceFogBlendable) == 0x000008, "Wrong size on FCTPostProcessVolume_C_DistanceFogBlendable");
static_assert(offsetof(FCTPostProcessVolume_C_DistanceFogBlendable, CallFunc_CreateDynamicInstance_ReturnValue) == 0x000000, "Member 'FCTPostProcessVolume_C_DistanceFogBlendable::CallFunc_CreateDynamicInstance_ReturnValue' has a wrong offset!");

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.SetFogFarColorAlpha
// 0x0018 (0x0018 - 0x0000)
struct FCTPostProcessVolume_C_SetFogFarColorAlpha final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCTPostProcessVolume_C_SetFogFarColorAlpha) == 0x000004, "Wrong alignment on FCTPostProcessVolume_C_SetFogFarColorAlpha");
static_assert(sizeof(FCTPostProcessVolume_C_SetFogFarColorAlpha) == 0x000018, "Wrong size on FCTPostProcessVolume_C_SetFogFarColorAlpha");
static_assert(offsetof(FCTPostProcessVolume_C_SetFogFarColorAlpha, Alpha) == 0x000000, "Member 'FCTPostProcessVolume_C_SetFogFarColorAlpha::Alpha' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_SetFogFarColorAlpha, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'FCTPostProcessVolume_C_SetFogFarColorAlpha::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_SetFogFarColorAlpha, K2Node_MakeStruct_LinearColor) == 0x000008, "Member 'FCTPostProcessVolume_C_SetFogFarColorAlpha::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.SetFogDistance
// 0x0008 (0x0008 - 0x0000)
struct FCTPostProcessVolume_C_SetFogDistance final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCTPostProcessVolume_C_SetFogDistance) == 0x000004, "Wrong alignment on FCTPostProcessVolume_C_SetFogDistance");
static_assert(sizeof(FCTPostProcessVolume_C_SetFogDistance) == 0x000008, "Wrong size on FCTPostProcessVolume_C_SetFogDistance");
static_assert(offsetof(FCTPostProcessVolume_C_SetFogDistance, Alpha) == 0x000000, "Member 'FCTPostProcessVolume_C_SetFogDistance::Alpha' has a wrong offset!");
static_assert(offsetof(FCTPostProcessVolume_C_SetFogDistance, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'FCTPostProcessVolume_C_SetFogDistance::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.UpdateDistanceFog
// 0x0001 (0x0001 - 0x0000)
struct FCTPostProcessVolume_C_UpdateDistanceFog final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FCTPostProcessVolume_C_UpdateDistanceFog) == 0x000001, "Wrong alignment on FCTPostProcessVolume_C_UpdateDistanceFog");
static_assert(sizeof(FCTPostProcessVolume_C_UpdateDistanceFog) == 0x000001, "Wrong size on FCTPostProcessVolume_C_UpdateDistanceFog");
static_assert(offsetof(FCTPostProcessVolume_C_UpdateDistanceFog, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'FCTPostProcessVolume_C_UpdateDistanceFog::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FCTPostProcessVolume.FCTPostProcessVolume_C.PersonoidVisionBlendable
// 0x0008 (0x0008 - 0x0000)
struct FCTPostProcessVolume_C_PersonoidVisionBlendable final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicInstance_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCTPostProcessVolume_C_PersonoidVisionBlendable) == 0x000008, "Wrong alignment on FCTPostProcessVolume_C_PersonoidVisionBlendable");
static_assert(sizeof(FCTPostProcessVolume_C_PersonoidVisionBlendable) == 0x000008, "Wrong size on FCTPostProcessVolume_C_PersonoidVisionBlendable");
static_assert(offsetof(FCTPostProcessVolume_C_PersonoidVisionBlendable, CallFunc_CreateDynamicInstance_ReturnValue) == 0x000000, "Member 'FCTPostProcessVolume_C_PersonoidVisionBlendable::CallFunc_CreateDynamicInstance_ReturnValue' has a wrong offset!");

}

