#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FireExtinguisherGA

#include "Basic.hpp"


namespace SDK::Params
{

// Function FireExtinguisherGA.FireExtinguisherGA_C.ExecuteUbergraph_FireExtinguisherGA
// 0x0030 (0x0030 - 0x0000)
struct FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA) == 0x000008, "Wrong alignment on FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA");
static_assert(sizeof(FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA) == 0x000030, "Wrong size on FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA");
static_assert(offsetof(FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA, EntryPoint) == 0x000000, "Member 'FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA, K2Node_CustomEvent_TimeHeld) == 0x000004, "Member 'FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA, Temp_float_Variable) == 0x000018, "Member 'FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA, CallFunc_WaitInputRelease_ReturnValue) == 0x000020, "Member 'FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA, K2Node_Event_bWasCancelled) == 0x00002A, "Member 'FireExtinguisherGA_C_ExecuteUbergraph_FireExtinguisherGA::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function FireExtinguisherGA.FireExtinguisherGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct FireExtinguisherGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FireExtinguisherGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on FireExtinguisherGA_C_K2_OnEndAbility");
static_assert(sizeof(FireExtinguisherGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on FireExtinguisherGA_C_K2_OnEndAbility");
static_assert(offsetof(FireExtinguisherGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'FireExtinguisherGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function FireExtinguisherGA.FireExtinguisherGA_C.OnRelease_0F8D299042BA2790E2F043A8BF9BAF5F
// 0x0004 (0x0004 - 0x0000)
struct FireExtinguisherGA_C_OnRelease_0F8D299042BA2790E2F043A8BF9BAF5F final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FireExtinguisherGA_C_OnRelease_0F8D299042BA2790E2F043A8BF9BAF5F) == 0x000004, "Wrong alignment on FireExtinguisherGA_C_OnRelease_0F8D299042BA2790E2F043A8BF9BAF5F");
static_assert(sizeof(FireExtinguisherGA_C_OnRelease_0F8D299042BA2790E2F043A8BF9BAF5F) == 0x000004, "Wrong size on FireExtinguisherGA_C_OnRelease_0F8D299042BA2790E2F043A8BF9BAF5F");
static_assert(offsetof(FireExtinguisherGA_C_OnRelease_0F8D299042BA2790E2F043A8BF9BAF5F, TimeHeld) == 0x000000, "Member 'FireExtinguisherGA_C_OnRelease_0F8D299042BA2790E2F043A8BF9BAF5F::TimeHeld' has a wrong offset!");

}

