#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Footer_WI

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function Footer_WI.Footer_WI_C.ExecuteUbergraph_Footer_WI
// 0x0038 (0x0038 - 0x0000)
struct Footer_WI_C_ExecuteUbergraph_Footer_WI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Footer_WI_C_ExecuteUbergraph_Footer_WI) == 0x000008, "Wrong alignment on Footer_WI_C_ExecuteUbergraph_Footer_WI");
static_assert(sizeof(Footer_WI_C_ExecuteUbergraph_Footer_WI) == 0x000038, "Wrong size on Footer_WI_C_ExecuteUbergraph_Footer_WI");
static_assert(offsetof(Footer_WI_C_ExecuteUbergraph_Footer_WI, EntryPoint) == 0x000000, "Member 'Footer_WI_C_ExecuteUbergraph_Footer_WI::EntryPoint' has a wrong offset!");
static_assert(offsetof(Footer_WI_C_ExecuteUbergraph_Footer_WI, Temp_struct_Variable) == 0x000008, "Member 'Footer_WI_C_ExecuteUbergraph_Footer_WI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Footer_WI_C_ExecuteUbergraph_Footer_WI, Temp_delegate_Variable) == 0x000018, "Member 'Footer_WI_C_ExecuteUbergraph_Footer_WI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Footer_WI_C_ExecuteUbergraph_Footer_WI, CallFunc_PostAkEvent_ReturnValue) == 0x000028, "Member 'Footer_WI_C_ExecuteUbergraph_Footer_WI::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Footer_WI_C_ExecuteUbergraph_Footer_WI, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000030, "Member 'Footer_WI_C_ExecuteUbergraph_Footer_WI::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");

// Function Footer_WI.Footer_WI_C.SetFooterButtonName
// 0x0018 (0x0018 - 0x0000)
struct Footer_WI_C_SetFooterButtonName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Footer_WI_C_SetFooterButtonName) == 0x000008, "Wrong alignment on Footer_WI_C_SetFooterButtonName");
static_assert(sizeof(Footer_WI_C_SetFooterButtonName) == 0x000018, "Wrong size on Footer_WI_C_SetFooterButtonName");
static_assert(offsetof(Footer_WI_C_SetFooterButtonName, InText) == 0x000000, "Member 'Footer_WI_C_SetFooterButtonName::InText' has a wrong offset!");

}

