#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericTextFeedbackEntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GenericTextFeedbackEntryWI.GenericTextFeedbackEntryWI_C
// 0x0050 (0x02B0 - 0x0260)
class UGenericTextFeedbackEntryWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_204;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URoundedBGBoxWI_C*                      RoundedBGBoxWI;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0298(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_GenericTextFeedbackEntryWI(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GenericTextFeedbackEntryWI_C">();
	}
	static class UGenericTextFeedbackEntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericTextFeedbackEntryWI_C>();
	}
};
static_assert(alignof(UGenericTextFeedbackEntryWI_C) == 0x000008, "Wrong alignment on UGenericTextFeedbackEntryWI_C");
static_assert(sizeof(UGenericTextFeedbackEntryWI_C) == 0x0002B0, "Wrong size on UGenericTextFeedbackEntryWI_C");
static_assert(offsetof(UGenericTextFeedbackEntryWI_C, UberGraphFrame) == 0x000260, "Member 'UGenericTextFeedbackEntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGenericTextFeedbackEntryWI_C, FadeOut) == 0x000268, "Member 'UGenericTextFeedbackEntryWI_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UGenericTextFeedbackEntryWI_C, FadeIn) == 0x000270, "Member 'UGenericTextFeedbackEntryWI_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UGenericTextFeedbackEntryWI_C, BackgroundImage) == 0x000278, "Member 'UGenericTextFeedbackEntryWI_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UGenericTextFeedbackEntryWI_C, RichTextBlock_204) == 0x000280, "Member 'UGenericTextFeedbackEntryWI_C::RichTextBlock_204' has a wrong offset!");
static_assert(offsetof(UGenericTextFeedbackEntryWI_C, RoundedBGBoxWI) == 0x000288, "Member 'UGenericTextFeedbackEntryWI_C::RoundedBGBoxWI' has a wrong offset!");
static_assert(offsetof(UGenericTextFeedbackEntryWI_C, Duration) == 0x000290, "Member 'UGenericTextFeedbackEntryWI_C::Duration' has a wrong offset!");
static_assert(offsetof(UGenericTextFeedbackEntryWI_C, Text) == 0x000298, "Member 'UGenericTextFeedbackEntryWI_C::Text' has a wrong offset!");

}

