#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GetSuperDrunkAchievement

#include "Basic.hpp"


namespace SDK::Params
{

// Function GetSuperDrunkAchievement.GetSuperDrunkAchievement_C.ExecuteUbergraph_GetSuperDrunkAchievement
// 0x0030 (0x0030 - 0x0000)
struct GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* Controller)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_Controller;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsControllerSelf_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement) == 0x000008, "Wrong alignment on GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement");
static_assert(sizeof(GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement) == 0x000030, "Wrong size on GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement");
static_assert(offsetof(GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement, EntryPoint) == 0x000000, "Member 'GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement::EntryPoint' has a wrong offset!");
static_assert(offsetof(GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement, Temp_int_Variable) == 0x000004, "Member 'GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement, K2Node_CustomEvent_Controller) == 0x000018, "Member 'GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement::K2Node_CustomEvent_Controller' has a wrong offset!");
static_assert(offsetof(GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement, CallFunc_IsControllerSelf_ReturnValue) == 0x000020, "Member 'GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement::CallFunc_IsControllerSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'GetSuperDrunkAchievement_C_ExecuteUbergraph_GetSuperDrunkAchievement::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function GetSuperDrunkAchievement.GetSuperDrunkAchievement_C.On Drink Consumed
// 0x0008 (0x0008 - 0x0000)
struct GetSuperDrunkAchievement_C_On_Drink_Consumed final
{
public:
	class APlayerController*                      Controller_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GetSuperDrunkAchievement_C_On_Drink_Consumed) == 0x000008, "Wrong alignment on GetSuperDrunkAchievement_C_On_Drink_Consumed");
static_assert(sizeof(GetSuperDrunkAchievement_C_On_Drink_Consumed) == 0x000008, "Wrong size on GetSuperDrunkAchievement_C_On_Drink_Consumed");
static_assert(offsetof(GetSuperDrunkAchievement_C_On_Drink_Consumed, Controller_0) == 0x000000, "Member 'GetSuperDrunkAchievement_C_On_Drink_Consumed::Controller_0' has a wrong offset!");

}

