#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrabCharacterGA

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GrabCharacterGA.GrabCharacterGA_C.ExecuteUbergraph_GrabCharacterGA
// 0x03E0 (0x03E0 - 0x0000)
struct GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_1;                   // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_2;                   // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue_1; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_3;                   // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetCharacterFromActorInfo_Character;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class ACharacter*                       K2Node_CustomEvent_Grabbed;                        // 0x00D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Grabbing;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_TargetLocation;                 // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_2;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_4;                   // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_5;                   // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_6;                   // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01C4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp_7;                   // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalculatePositionTarget_TargetLocation;   // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_CalculatePositionTarget_TargetRotation;   // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02C0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x02F4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_3;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNetAuthority_ReturnValue;               // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_322[0x6];                                      // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0338(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0350(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0358(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_4;            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_5;            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x039C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x03AC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x03BC(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x03CC(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA) == 0x000010, "Wrong alignment on GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA");
static_assert(sizeof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA) == 0x0003E0, "Wrong size on GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, EntryPoint) == 0x000000, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsIAnim_Bp) == 0x000020, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_1) == 0x000038, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000050, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_2) == 0x000060, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_2' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000078, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue) == 0x000080, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue_1) == 0x000084, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_3) == 0x000090, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_3' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_4) == 0x0000A0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A4, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_GetOwner_ReturnValue) == 0x0000B8, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x0000C0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_5) == 0x0000C8, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_GetCharacterFromActorInfo_Character) == 0x0000D0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_GetCharacterFromActorInfo_Character' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CustomEvent_Grabbed) == 0x0000D8, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CustomEvent_Grabbed' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CustomEvent_Grabbing) == 0x0000E0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CustomEvent_Grabbing' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CustomEvent_TargetLocation) == 0x0000F0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CustomEvent_TargetLocation' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_BreakTransform_Location) == 0x000120, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_BreakTransform_Rotation) == 0x00012C, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_BreakTransform_Scale) == 0x000138, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP_2) == 0x000148, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP_2' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_6) == 0x000150, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_4) == 0x000158, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_4' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_7) == 0x000168, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00016C, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_5) == 0x000178, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_5' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_8) == 0x000188, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CreateDelegate_OutputDelegate_2) == 0x00018C, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00019C, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_VInterpTo_ReturnValue) == 0x0001A0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_6) == 0x0001B0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_6' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_9) == 0x0001C0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0001C4, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000250, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsIAnim_Bp_7) == 0x000258, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsIAnim_Bp_7' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_10) == 0x000268, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CreateDelegate_OutputDelegate_3) == 0x00026C, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000280, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsCharacter) == 0x000288, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_11) == 0x000290, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_CalculatePositionTarget_TargetLocation) == 0x000294, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_CalculatePositionTarget_TargetLocation' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_CalculatePositionTarget_TargetRotation) == 0x0002A0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_CalculatePositionTarget_TargetRotation' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0002B0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_MakeTransform_ReturnValue) == 0x0002C0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_IsValid_ReturnValue_3) == 0x0002F0, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002F4, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000308, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000310, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP_3) == 0x000318, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP_3' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_12) == 0x000320, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_IsNetAuthority_ReturnValue) == 0x000321, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_IsNetAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000328, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_Event_bWasCancelled) == 0x000330, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_MakeEffectContext_ReturnValue) == 0x000338, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000350, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x000358, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_WaitDelay_ReturnValue) == 0x000360, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_IsValid_ReturnValue_4) == 0x000368, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000370, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP_4) == 0x000378, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP_4' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_13) == 0x000380, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000388, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP_5) == 0x000390, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP_5' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_DynamicCast_bSuccess_14) == 0x000398, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CreateDelegate_OutputDelegate_5) == 0x00039C, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CreateDelegate_OutputDelegate_6) == 0x0003AC, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, K2Node_CreateDelegate_OutputDelegate_7) == 0x0003BC, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0003CC, "Member 'GrabCharacterGA_C_ExecuteUbergraph_GrabCharacterGA::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GrabCharacterGA.GrabCharacterGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GrabCharacterGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GrabCharacterGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GrabCharacterGA_C_K2_OnEndAbility");
static_assert(sizeof(GrabCharacterGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on GrabCharacterGA_C_K2_OnEndAbility");
static_assert(offsetof(GrabCharacterGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GrabCharacterGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GrabCharacterGA.GrabCharacterGA_C.MulticastStartGrab
// 0x0040 (0x0040 - 0x0000)
struct GrabCharacterGA_C_MulticastStartGrab final
{
public:
	const class ACharacter*                       Grabbed;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Grabbing;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TargetLocation_0;                                  // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GrabCharacterGA_C_MulticastStartGrab) == 0x000010, "Wrong alignment on GrabCharacterGA_C_MulticastStartGrab");
static_assert(sizeof(GrabCharacterGA_C_MulticastStartGrab) == 0x000040, "Wrong size on GrabCharacterGA_C_MulticastStartGrab");
static_assert(offsetof(GrabCharacterGA_C_MulticastStartGrab, Grabbed) == 0x000000, "Member 'GrabCharacterGA_C_MulticastStartGrab::Grabbed' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_MulticastStartGrab, Grabbing) == 0x000008, "Member 'GrabCharacterGA_C_MulticastStartGrab::Grabbing' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_MulticastStartGrab, TargetLocation_0) == 0x000010, "Member 'GrabCharacterGA_C_MulticastStartGrab::TargetLocation_0' has a wrong offset!");

// Function GrabCharacterGA.GrabCharacterGA_C.DisableCollisionBetween
// 0x0018 (0x0018 - 0x0000)
struct GrabCharacterGA_C_DisableCollisionBetween final
{
public:
	class AActor*                                 ActorToIgnore;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GrabCharacterGA_C_DisableCollisionBetween) == 0x000008, "Wrong alignment on GrabCharacterGA_C_DisableCollisionBetween");
static_assert(sizeof(GrabCharacterGA_C_DisableCollisionBetween) == 0x000018, "Wrong size on GrabCharacterGA_C_DisableCollisionBetween");
static_assert(offsetof(GrabCharacterGA_C_DisableCollisionBetween, ActorToIgnore) == 0x000000, "Member 'GrabCharacterGA_C_DisableCollisionBetween::ActorToIgnore' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_DisableCollisionBetween, K2Node_DynamicCast_AsCharacter) == 0x000008, "Member 'GrabCharacterGA_C_DisableCollisionBetween::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_DisableCollisionBetween, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GrabCharacterGA_C_DisableCollisionBetween::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GrabCharacterGA.GrabCharacterGA_C.EnableCollisionBetween
// 0x0018 (0x0018 - 0x0000)
struct GrabCharacterGA_C_EnableCollisionBetween final
{
public:
	class AActor*                                 ActorToEnable;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GrabCharacterGA_C_EnableCollisionBetween) == 0x000008, "Wrong alignment on GrabCharacterGA_C_EnableCollisionBetween");
static_assert(sizeof(GrabCharacterGA_C_EnableCollisionBetween) == 0x000018, "Wrong size on GrabCharacterGA_C_EnableCollisionBetween");
static_assert(offsetof(GrabCharacterGA_C_EnableCollisionBetween, ActorToEnable) == 0x000000, "Member 'GrabCharacterGA_C_EnableCollisionBetween::ActorToEnable' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_EnableCollisionBetween, K2Node_DynamicCast_AsCharacter) == 0x000008, "Member 'GrabCharacterGA_C_EnableCollisionBetween::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_EnableCollisionBetween, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GrabCharacterGA_C_EnableCollisionBetween::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GrabCharacterGA.GrabCharacterGA_C.CalculatePositionTarget
// 0x0108 (0x0108 - 0x0000)
struct GrabCharacterGA_C_CalculatePositionTarget final
{
public:
	class AActor*                                 SelfCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherCharacter;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation_0;                                  // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetRotation_0;                                  // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter_1;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFemaleBPI_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GrabCharacterGA_C_CalculatePositionTarget) == 0x000008, "Wrong alignment on GrabCharacterGA_C_CalculatePositionTarget");
static_assert(sizeof(GrabCharacterGA_C_CalculatePositionTarget) == 0x000108, "Wrong size on GrabCharacterGA_C_CalculatePositionTarget");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, SelfCharacter) == 0x000000, "Member 'GrabCharacterGA_C_CalculatePositionTarget::SelfCharacter' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, OtherCharacter) == 0x000008, "Member 'GrabCharacterGA_C_CalculatePositionTarget::OtherCharacter' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, TargetLocation_0) == 0x000010, "Member 'GrabCharacterGA_C_CalculatePositionTarget::TargetLocation_0' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, TargetRotation_0) == 0x00001C, "Member 'GrabCharacterGA_C_CalculatePositionTarget::TargetRotation_0' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, K2Node_DynamicCast_AsCharacter) == 0x000028, "Member 'GrabCharacterGA_C_CalculatePositionTarget::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GrabCharacterGA_C_CalculatePositionTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, K2Node_DynamicCast_AsCharacter_1) == 0x000038, "Member 'GrabCharacterGA_C_CalculatePositionTarget::K2Node_DynamicCast_AsCharacter_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'GrabCharacterGA_C_CalculatePositionTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, K2Node_DynamicCast_AsICharacter_SCT) == 0x000048, "Member 'GrabCharacterGA_C_CalculatePositionTarget::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'GrabCharacterGA_C_CalculatePositionTarget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_IsFemaleBPI_ReturnValue) == 0x000068, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_IsFemaleBPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00006C, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000078, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000084, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_Normal_ReturnValue) == 0x000090, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_Normal_ReturnValue_1) == 0x00009C, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_MakeRotFromX_ReturnValue) == 0x0000A8, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0000B4, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_BreakRotator_Roll) == 0x0000C0, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_BreakRotator_Pitch) == 0x0000C4, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_BreakRotator_Yaw) == 0x0000C8, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000CC, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_MakeRotator_ReturnValue) == 0x0000D8, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000E4, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0000F0, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_CalculatePositionTarget, CallFunc_Add_VectorVector_ReturnValue) == 0x0000FC, "Member 'GrabCharacterGA_C_CalculatePositionTarget::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function GrabCharacterGA.GrabCharacterGA_C.GetContextDescription
// 0x0030 (0x0030 - 0x0000)
struct GrabCharacterGA_C_GetContextDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetDefaultContextDescriptionImplementation_ReturnValue; // 0x0018(0x0018)()
};
static_assert(alignof(GrabCharacterGA_C_GetContextDescription) == 0x000008, "Wrong alignment on GrabCharacterGA_C_GetContextDescription");
static_assert(sizeof(GrabCharacterGA_C_GetContextDescription) == 0x000030, "Wrong size on GrabCharacterGA_C_GetContextDescription");
static_assert(offsetof(GrabCharacterGA_C_GetContextDescription, ReturnValue) == 0x000000, "Member 'GrabCharacterGA_C_GetContextDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_GetContextDescription, CallFunc_GetDefaultContextDescriptionImplementation_ReturnValue) == 0x000018, "Member 'GrabCharacterGA_C_GetContextDescription::CallFunc_GetDefaultContextDescriptionImplementation_ReturnValue' has a wrong offset!");

// Function GrabCharacterGA.GrabCharacterGA_C.SetGrabbedCharacter
// 0x0038 (0x0038 - 0x0000)
struct GrabCharacterGA_C_SetGrabbedCharacter final
{
public:
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GrabCharacterGA_C_SetGrabbedCharacter) == 0x000008, "Wrong alignment on GrabCharacterGA_C_SetGrabbedCharacter");
static_assert(sizeof(GrabCharacterGA_C_SetGrabbedCharacter) == 0x000038, "Wrong size on GrabCharacterGA_C_SetGrabbedCharacter");
static_assert(offsetof(GrabCharacterGA_C_SetGrabbedCharacter, CallFunc_K2_HasAuthority_ReturnValue) == 0x000000, "Member 'GrabCharacterGA_C_SetGrabbedCharacter::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_SetGrabbedCharacter, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GrabCharacterGA_C_SetGrabbedCharacter::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrabCharacterGA_C_SetGrabbedCharacter, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'GrabCharacterGA_C_SetGrabbedCharacter::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
