#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HatTagWI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function HatTagWI.HatTagWI_C.ExecuteUbergraph_HatTagWI
// 0x0030 (0x0030 - 0x0000)
struct HatTagWI_C_ExecuteUbergraph_HatTagWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHatPickup_C*                           CallFunc_GetActorOfClass_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HatTagWI_C_ExecuteUbergraph_HatTagWI) == 0x000008, "Wrong alignment on HatTagWI_C_ExecuteUbergraph_HatTagWI");
static_assert(sizeof(HatTagWI_C_ExecuteUbergraph_HatTagWI) == 0x000030, "Wrong size on HatTagWI_C_ExecuteUbergraph_HatTagWI");
static_assert(offsetof(HatTagWI_C_ExecuteUbergraph_HatTagWI, EntryPoint) == 0x000000, "Member 'HatTagWI_C_ExecuteUbergraph_HatTagWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_ExecuteUbergraph_HatTagWI, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'HatTagWI_C_ExecuteUbergraph_HatTagWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_ExecuteUbergraph_HatTagWI, CallFunc_GetActorOfClass_ReturnValue) == 0x000018, "Member 'HatTagWI_C_ExecuteUbergraph_HatTagWI::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_ExecuteUbergraph_HatTagWI, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'HatTagWI_C_ExecuteUbergraph_HatTagWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_ExecuteUbergraph_HatTagWI, CallFunc_Array_Get_Item) == 0x000028, "Member 'HatTagWI_C_ExecuteUbergraph_HatTagWI::CallFunc_Array_Get_Item' has a wrong offset!");

// Function HatTagWI.HatTagWI_C.Player Score
// 0x00A8 (0x00A8 - 0x0000)
struct HatTagWI_C_Player_Score final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0018(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVruumbaSCTBP_C*                        K2Node_DynamicCast_AsVruumba_SCTBP;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0090(0x0018)()
};
static_assert(alignof(HatTagWI_C_Player_Score) == 0x000008, "Wrong alignment on HatTagWI_C_Player_Score");
static_assert(sizeof(HatTagWI_C_Player_Score) == 0x0000A8, "Wrong size on HatTagWI_C_Player_Score");
static_assert(offsetof(HatTagWI_C_Player_Score, ReturnValue) == 0x000000, "Member 'HatTagWI_C_Player_Score::ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Score, CallFunc_MakeLiteralText_ReturnValue) == 0x000018, "Member 'HatTagWI_C_Player_Score::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Score, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'HatTagWI_C_Player_Score::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Score, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000040, "Member 'HatTagWI_C_Player_Score::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Score, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'HatTagWI_C_Player_Score::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Score, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'HatTagWI_C_Player_Score::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Score, K2Node_DynamicCast_AsVruumba_SCTBP) == 0x000060, "Member 'HatTagWI_C_Player_Score::K2Node_DynamicCast_AsVruumba_SCTBP' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Score, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'HatTagWI_C_Player_Score::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Score, CallFunc_Conv_FloatToString_ReturnValue) == 0x000070, "Member 'HatTagWI_C_Player_Score::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Score, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'HatTagWI_C_Player_Score::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Score, CallFunc_Conv_StringToText_ReturnValue) == 0x000090, "Member 'HatTagWI_C_Player_Score::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function HatTagWI.HatTagWI_C.Player Holding Flag
// 0x0048 (0x0048 - 0x0000)
struct HatTagWI_C_Player_Holding_Flag final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(HatTagWI_C_Player_Holding_Flag) == 0x000008, "Wrong alignment on HatTagWI_C_Player_Holding_Flag");
static_assert(sizeof(HatTagWI_C_Player_Holding_Flag) == 0x000048, "Wrong size on HatTagWI_C_Player_Holding_Flag");
static_assert(offsetof(HatTagWI_C_Player_Holding_Flag, ReturnValue) == 0x000000, "Member 'HatTagWI_C_Player_Holding_Flag::ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Holding_Flag, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'HatTagWI_C_Player_Holding_Flag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Holding_Flag, CallFunc_GetPlayerName_ReturnValue) == 0x000020, "Member 'HatTagWI_C_Player_Holding_Flag::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Player_Holding_Flag, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'HatTagWI_C_Player_Holding_Flag::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function HatTagWI.HatTagWI_C.Highest score name
// 0x0040 (0x0040 - 0x0000)
struct HatTagWI_C_Highest_score_name final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(HatTagWI_C_Highest_score_name) == 0x000008, "Wrong alignment on HatTagWI_C_Highest_score_name");
static_assert(sizeof(HatTagWI_C_Highest_score_name) == 0x000040, "Wrong size on HatTagWI_C_Highest_score_name");
static_assert(offsetof(HatTagWI_C_Highest_score_name, ReturnValue) == 0x000000, "Member 'HatTagWI_C_Highest_score_name::ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Highest_score_name, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'HatTagWI_C_Highest_score_name::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Highest_score_name, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'HatTagWI_C_Highest_score_name::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function HatTagWI.HatTagWI_C.Get high score
// 0x00B8 (0x00B8 - 0x0000)
struct HatTagWI_C_Get_high_score final
{
public:
	class AVruumbaSCTBP_C*                        VruumbaPlayer;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVruumbaSCTBP_C*                        K2Node_DynamicCast_AsVruumba_SCTBP;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVruumbaSCTBP_C*                        K2Node_DynamicCast_AsVruumba_SCTBP_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        CallFunc_GetSCTPlayerState_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)(UObjectWrapper)
	TArray<class AVruumbaSCTBP_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVruumbaSCTBP_C*                        CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HatTagWI_C_Get_high_score) == 0x000008, "Wrong alignment on HatTagWI_C_Get_high_score");
static_assert(sizeof(HatTagWI_C_Get_high_score) == 0x0000B8, "Wrong size on HatTagWI_C_Get_high_score");
static_assert(offsetof(HatTagWI_C_Get_high_score, VruumbaPlayer) == 0x000000, "Member 'HatTagWI_C_Get_high_score::VruumbaPlayer' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'HatTagWI_C_Get_high_score::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'HatTagWI_C_Get_high_score::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, Temp_int_Array_Index_Variable) == 0x000010, "Member 'HatTagWI_C_Get_high_score::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'HatTagWI_C_Get_high_score::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'HatTagWI_C_Get_high_score::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, K2Node_DynamicCast_AsVruumba_SCTBP) == 0x000028, "Member 'HatTagWI_C_Get_high_score::K2Node_DynamicCast_AsVruumba_SCTBP' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'HatTagWI_C_Get_high_score::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, K2Node_DynamicCast_AsVruumba_SCTBP_1) == 0x000038, "Member 'HatTagWI_C_Get_high_score::K2Node_DynamicCast_AsVruumba_SCTBP_1' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'HatTagWI_C_Get_high_score::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000041, "Member 'HatTagWI_C_Get_high_score::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000042, "Member 'HatTagWI_C_Get_high_score::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_IsValid_ReturnValue_1) == 0x000043, "Member 'HatTagWI_C_Get_high_score::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_GetSCTPlayerState_ReturnValue) == 0x000048, "Member 'HatTagWI_C_Get_high_score::CallFunc_GetSCTPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_GetPlayerName_ReturnValue) == 0x000050, "Member 'HatTagWI_C_Get_high_score::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'HatTagWI_C_Get_high_score::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_GetAllActorsOfClass_OutActors) == 0x000088, "Member 'HatTagWI_C_Get_high_score::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000098, "Member 'HatTagWI_C_Get_high_score::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'HatTagWI_C_Get_high_score::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_IsValid_ReturnValue_2) == 0x0000A8, "Member 'HatTagWI_C_Get_high_score::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_Array_Length_ReturnValue) == 0x0000AC, "Member 'HatTagWI_C_Get_high_score::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Get_high_score, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'HatTagWI_C_Get_high_score::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function HatTagWI.HatTagWI_C.New Player Holding Flag
// 0x0098 (0x0098 - 0x0000)
struct HatTagWI_C_New_Player_Holding_Flag final
{
public:
	class FString                                 HolderName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           HolderColor;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0020(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)(UObjectWrapper)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
};
static_assert(alignof(HatTagWI_C_New_Player_Holding_Flag) == 0x000008, "Wrong alignment on HatTagWI_C_New_Player_Holding_Flag");
static_assert(sizeof(HatTagWI_C_New_Player_Holding_Flag) == 0x000098, "Wrong size on HatTagWI_C_New_Player_Holding_Flag");
static_assert(offsetof(HatTagWI_C_New_Player_Holding_Flag, HolderName) == 0x000000, "Member 'HatTagWI_C_New_Player_Holding_Flag::HolderName' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_New_Player_Holding_Flag, HolderColor) == 0x000010, "Member 'HatTagWI_C_New_Player_Holding_Flag::HolderColor' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_New_Player_Holding_Flag, CallFunc_MakeLiteralText_ReturnValue) == 0x000020, "Member 'HatTagWI_C_New_Player_Holding_Flag::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_New_Player_Holding_Flag, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'HatTagWI_C_New_Player_Holding_Flag::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_New_Player_Holding_Flag, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'HatTagWI_C_New_Player_Holding_Flag::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_New_Player_Holding_Flag, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'HatTagWI_C_New_Player_Holding_Flag::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_New_Player_Holding_Flag, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'HatTagWI_C_New_Player_Holding_Flag::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function HatTagWI.HatTagWI_C.Highest score number
// 0x0040 (0x0040 - 0x0000)
struct HatTagWI_C_Highest_score_number final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(HatTagWI_C_Highest_score_number) == 0x000008, "Wrong alignment on HatTagWI_C_Highest_score_number");
static_assert(sizeof(HatTagWI_C_Highest_score_number) == 0x000040, "Wrong size on HatTagWI_C_Highest_score_number");
static_assert(offsetof(HatTagWI_C_Highest_score_number, ReturnValue) == 0x000000, "Member 'HatTagWI_C_Highest_score_number::ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Highest_score_number, CallFunc_Conv_FloatToString_ReturnValue) == 0x000018, "Member 'HatTagWI_C_Highest_score_number::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatTagWI_C_Highest_score_number, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'HatTagWI_C_Highest_score_number::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

