#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HiddenAgendaWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function HiddenAgendaWI.HiddenAgendaWI_C.ExecuteUbergraph_HiddenAgendaWI
// 0x0018 (0x0018 - 0x0000)
struct HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI) == 0x000004, "Wrong alignment on HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI");
static_assert(sizeof(HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI) == 0x000018, "Wrong size on HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI");
static_assert(offsetof(HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI, EntryPoint) == 0x000000, "Member 'HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI, Temp_bool_Variable) == 0x000004, "Member 'HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI, Temp_float_Variable) == 0x000008, "Member 'HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI, Temp_float_Variable_1) == 0x00000C, "Member 'HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI, K2Node_Event_IsDesignTime) == 0x000010, "Member 'HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI, K2Node_Select_Default) == 0x000014, "Member 'HiddenAgendaWI_C_ExecuteUbergraph_HiddenAgendaWI::K2Node_Select_Default' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct HiddenAgendaWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HiddenAgendaWI_C_PreConstruct) == 0x000001, "Wrong alignment on HiddenAgendaWI_C_PreConstruct");
static_assert(sizeof(HiddenAgendaWI_C_PreConstruct) == 0x000001, "Wrong size on HiddenAgendaWI_C_PreConstruct");
static_assert(offsetof(HiddenAgendaWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'HiddenAgendaWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.UpdateAgendaText
// 0x0030 (0x0030 - 0x0000)
struct HiddenAgendaWI_C_UpdateAgendaText final
{
public:
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0000(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0018(0x0018)()
};
static_assert(alignof(HiddenAgendaWI_C_UpdateAgendaText) == 0x000008, "Wrong alignment on HiddenAgendaWI_C_UpdateAgendaText");
static_assert(sizeof(HiddenAgendaWI_C_UpdateAgendaText) == 0x000030, "Wrong size on HiddenAgendaWI_C_UpdateAgendaText");
static_assert(offsetof(HiddenAgendaWI_C_UpdateAgendaText, CallFunc_Conv_StringToText_ReturnValue) == 0x000000, "Member 'HiddenAgendaWI_C_UpdateAgendaText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_UpdateAgendaText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000018, "Member 'HiddenAgendaWI_C_UpdateAgendaText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.BindToEvents
// 0x0030 (0x0030 - 0x0000)
struct HiddenAgendaWI_C_BindToEvents final
{
public:
	TDelegate<void(const class FString& Value)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& Value)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAgendaObjectState State)>     K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(HiddenAgendaWI_C_BindToEvents) == 0x000004, "Wrong alignment on HiddenAgendaWI_C_BindToEvents");
static_assert(sizeof(HiddenAgendaWI_C_BindToEvents) == 0x000030, "Wrong size on HiddenAgendaWI_C_BindToEvents");
static_assert(offsetof(HiddenAgendaWI_C_BindToEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'HiddenAgendaWI_C_BindToEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_BindToEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'HiddenAgendaWI_C_BindToEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_BindToEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'HiddenAgendaWI_C_BindToEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.OnDescriptionChanged
// 0x0010 (0x0010 - 0x0000)
struct HiddenAgendaWI_C_OnDescriptionChanged final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(HiddenAgendaWI_C_OnDescriptionChanged) == 0x000008, "Wrong alignment on HiddenAgendaWI_C_OnDescriptionChanged");
static_assert(sizeof(HiddenAgendaWI_C_OnDescriptionChanged) == 0x000010, "Wrong size on HiddenAgendaWI_C_OnDescriptionChanged");
static_assert(offsetof(HiddenAgendaWI_C_OnDescriptionChanged, Value) == 0x000000, "Member 'HiddenAgendaWI_C_OnDescriptionChanged::Value' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.OnProgressionChanged
// 0x0010 (0x0010 - 0x0000)
struct HiddenAgendaWI_C_OnProgressionChanged final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(HiddenAgendaWI_C_OnProgressionChanged) == 0x000008, "Wrong alignment on HiddenAgendaWI_C_OnProgressionChanged");
static_assert(sizeof(HiddenAgendaWI_C_OnProgressionChanged) == 0x000010, "Wrong size on HiddenAgendaWI_C_OnProgressionChanged");
static_assert(offsetof(HiddenAgendaWI_C_OnProgressionChanged, Value) == 0x000000, "Member 'HiddenAgendaWI_C_OnProgressionChanged::Value' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.OnStateChanged
// 0x0001 (0x0001 - 0x0000)
struct HiddenAgendaWI_C_OnStateChanged final
{
public:
	EAgendaObjectState                            State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HiddenAgendaWI_C_OnStateChanged) == 0x000001, "Wrong alignment on HiddenAgendaWI_C_OnStateChanged");
static_assert(sizeof(HiddenAgendaWI_C_OnStateChanged) == 0x000001, "Wrong size on HiddenAgendaWI_C_OnStateChanged");
static_assert(offsetof(HiddenAgendaWI_C_OnStateChanged, State) == 0x000000, "Member 'HiddenAgendaWI_C_OnStateChanged::State' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.UpdateState
// 0x0050 (0x0050 - 0x0000)
struct HiddenAgendaWI_C_UpdateState final
{
public:
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetAgendaProgressionColor_ReturnValue;    // 0x0010(0x0028)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
};
static_assert(alignof(HiddenAgendaWI_C_UpdateState) == 0x000008, "Wrong alignment on HiddenAgendaWI_C_UpdateState");
static_assert(sizeof(HiddenAgendaWI_C_UpdateState) == 0x000050, "Wrong size on HiddenAgendaWI_C_UpdateState");
static_assert(offsetof(HiddenAgendaWI_C_UpdateState, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000000, "Member 'HiddenAgendaWI_C_UpdateState::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_UpdateState, CallFunc_GetAgendaProgressionColor_ReturnValue) == 0x000010, "Member 'HiddenAgendaWI_C_UpdateState::CallFunc_GetAgendaProgressionColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_UpdateState, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'HiddenAgendaWI_C_UpdateState::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.InitializePlayerState
// 0x0018 (0x0018 - 0x0000)
struct HiddenAgendaWI_C_InitializePlayerState final
{
public:
	class APlayerState*                           PlayerState_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HiddenAgendaWI_C_InitializePlayerState) == 0x000008, "Wrong alignment on HiddenAgendaWI_C_InitializePlayerState");
static_assert(sizeof(HiddenAgendaWI_C_InitializePlayerState) == 0x000018, "Wrong size on HiddenAgendaWI_C_InitializePlayerState");
static_assert(offsetof(HiddenAgendaWI_C_InitializePlayerState, PlayerState_0) == 0x000000, "Member 'HiddenAgendaWI_C_InitializePlayerState::PlayerState_0' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_InitializePlayerState, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP) == 0x000008, "Member 'HiddenAgendaWI_C_InitializePlayerState::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_InitializePlayerState, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'HiddenAgendaWI_C_InitializePlayerState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_InitializePlayerState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000011, "Member 'HiddenAgendaWI_C_InitializePlayerState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.BindToGetPlayerState
// 0x0028 (0x0028 - 0x0000)
struct HiddenAgendaWI_C_BindToGetPlayerState final
{
public:
	TDelegate<void(class ASCTPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerController*                   K2Node_DynamicCast_AsSCTPlayer_Controller;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HiddenAgendaWI_C_BindToGetPlayerState) == 0x000008, "Wrong alignment on HiddenAgendaWI_C_BindToGetPlayerState");
static_assert(sizeof(HiddenAgendaWI_C_BindToGetPlayerState) == 0x000028, "Wrong size on HiddenAgendaWI_C_BindToGetPlayerState");
static_assert(offsetof(HiddenAgendaWI_C_BindToGetPlayerState, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'HiddenAgendaWI_C_BindToGetPlayerState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_BindToGetPlayerState, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'HiddenAgendaWI_C_BindToGetPlayerState::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_BindToGetPlayerState, K2Node_DynamicCast_AsSCTPlayer_Controller) == 0x000018, "Member 'HiddenAgendaWI_C_BindToGetPlayerState::K2Node_DynamicCast_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_BindToGetPlayerState, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'HiddenAgendaWI_C_BindToGetPlayerState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.OnPlayerStateReceived
// 0x0008 (0x0008 - 0x0000)
struct HiddenAgendaWI_C_OnPlayerStateReceived final
{
public:
	class ASCTPlayerState*                        PlayerState_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HiddenAgendaWI_C_OnPlayerStateReceived) == 0x000008, "Wrong alignment on HiddenAgendaWI_C_OnPlayerStateReceived");
static_assert(sizeof(HiddenAgendaWI_C_OnPlayerStateReceived) == 0x000008, "Wrong size on HiddenAgendaWI_C_OnPlayerStateReceived");
static_assert(offsetof(HiddenAgendaWI_C_OnPlayerStateReceived, PlayerState_0) == 0x000000, "Member 'HiddenAgendaWI_C_OnPlayerStateReceived::PlayerState_0' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct HiddenAgendaWI_C_Initialize final
{
public:
	class ASCTPlayerState_MatchBP_C*              CallFunc_GetPlayerState_AsSCTPlayer_State_Match_BP; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HiddenAgendaWI_C_Initialize) == 0x000008, "Wrong alignment on HiddenAgendaWI_C_Initialize");
static_assert(sizeof(HiddenAgendaWI_C_Initialize) == 0x000010, "Wrong size on HiddenAgendaWI_C_Initialize");
static_assert(offsetof(HiddenAgendaWI_C_Initialize, CallFunc_GetPlayerState_AsSCTPlayer_State_Match_BP) == 0x000000, "Member 'HiddenAgendaWI_C_Initialize::CallFunc_GetPlayerState_AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'HiddenAgendaWI_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function HiddenAgendaWI.HiddenAgendaWI_C.GetPlayerState
// 0x0020 (0x0020 - 0x0000)
struct HiddenAgendaWI_C_GetPlayerState final
{
public:
	class ASCTPlayerState_MatchBP_C*              AsSCTPlayer_State_Match_BP;                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HiddenAgendaWI_C_GetPlayerState) == 0x000008, "Wrong alignment on HiddenAgendaWI_C_GetPlayerState");
static_assert(sizeof(HiddenAgendaWI_C_GetPlayerState) == 0x000020, "Wrong size on HiddenAgendaWI_C_GetPlayerState");
static_assert(offsetof(HiddenAgendaWI_C_GetPlayerState, AsSCTPlayer_State_Match_BP) == 0x000000, "Member 'HiddenAgendaWI_C_GetPlayerState::AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_GetPlayerState, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'HiddenAgendaWI_C_GetPlayerState::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_GetPlayerState, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP) == 0x000010, "Member 'HiddenAgendaWI_C_GetPlayerState::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(HiddenAgendaWI_C_GetPlayerState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'HiddenAgendaWI_C_GetPlayerState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

