#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_Extinguishable

#include "Basic.hpp"

#include "ExtinguisherTypes_structs.hpp"


namespace SDK::Params
{

// Function I_Extinguishable.I_Extinguishable_C.HitByExtinguisher
// 0x0010 (0x0010 - 0x0000)
struct I_Extinguishable_C_HitByExtinguisher final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ExtinguisherTypes                             Extinguisher_Type;                                 // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Void;                                              // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(I_Extinguishable_C_HitByExtinguisher) == 0x000008, "Wrong alignment on I_Extinguishable_C_HitByExtinguisher");
static_assert(sizeof(I_Extinguishable_C_HitByExtinguisher) == 0x000010, "Wrong size on I_Extinguishable_C_HitByExtinguisher");
static_assert(offsetof(I_Extinguishable_C_HitByExtinguisher, Character) == 0x000000, "Member 'I_Extinguishable_C_HitByExtinguisher::Character' has a wrong offset!");
static_assert(offsetof(I_Extinguishable_C_HitByExtinguisher, Damage) == 0x000008, "Member 'I_Extinguishable_C_HitByExtinguisher::Damage' has a wrong offset!");
static_assert(offsetof(I_Extinguishable_C_HitByExtinguisher, Extinguisher_Type) == 0x00000C, "Member 'I_Extinguishable_C_HitByExtinguisher::Extinguisher_Type' has a wrong offset!");
static_assert(offsetof(I_Extinguishable_C_HitByExtinguisher, Void) == 0x00000D, "Member 'I_Extinguishable_C_HitByExtinguisher::Void' has a wrong offset!");

// Function I_Extinguishable.I_Extinguishable_C.HitByFire
// 0x0001 (0x0001 - 0x0000)
struct I_Extinguishable_C_HitByFire final
{
public:
	bool                                          Void;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(I_Extinguishable_C_HitByFire) == 0x000001, "Wrong alignment on I_Extinguishable_C_HitByFire");
static_assert(sizeof(I_Extinguishable_C_HitByFire) == 0x000001, "Wrong size on I_Extinguishable_C_HitByFire");
static_assert(offsetof(I_Extinguishable_C_HitByFire, Void) == 0x000000, "Member 'I_Extinguishable_C_HitByFire::Void' has a wrong offset!");

}

