#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameReport

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function InGameReport.InGameReport_C.ExecuteUbergraph_InGameReport
// 0x0170 (0x0170 - 0x0000)
struct InGameReport_C_ExecuteUbergraph_InGameReport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInGameReportEntry_C*                   CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerController_MatchBP_C*         K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSonyEnterButtonSwapped_ReturnValue;    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClientInfoCacheGIS*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FClientPlayerInfo>              CallFunc_GetAllPlayerInfo_ReturnValue;             // 0x0060(0x0010)(ReferenceParm)
	struct FClientPlayerInfo                      CallFunc_Array_Get_Item;                           // 0x0070(0x0078)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGameReport_C_ExecuteUbergraph_InGameReport) == 0x000008, "Wrong alignment on InGameReport_C_ExecuteUbergraph_InGameReport");
static_assert(sizeof(InGameReport_C_ExecuteUbergraph_InGameReport) == 0x000170, "Wrong size on InGameReport_C_ExecuteUbergraph_InGameReport");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, EntryPoint) == 0x000000, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::EntryPoint' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, Temp_int_Array_Index_Variable) == 0x000020, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Create_ReturnValue) == 0x000028, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_GetPlayerController_ReturnValue_2) == 0x000038, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP) == 0x000040, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_GetSonyEnterButtonSwapped_ReturnValue) == 0x000054, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_GetSonyEnterButtonSwapped_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_GetAllPlayerInfo_ReturnValue) == 0x000060, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_GetAllPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Array_Get_Item) == 0x000070, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Conv_BoolToString_ReturnValue) == 0x0000F0, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Concat_StrStr_ReturnValue) == 0x000108, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000118, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000128, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Array_Length_ReturnValue_1) == 0x00012C, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_BooleanOR_ReturnValue) == 0x000130, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Conv_IntToString_ReturnValue) == 0x000138, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000148, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000158, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_AddChild_ReturnValue) == 0x000160, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_ExecuteUbergraph_InGameReport, CallFunc_Not_PreBool_ReturnValue) == 0x000168, "Member 'InGameReport_C_ExecuteUbergraph_InGameReport::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function InGameReport.InGameReport_C.AddDebugEntries
// 0x0060 (0x0060 - 0x0000)
struct InGameReport_C_AddDebugEntries final
{
public:
	int32                                         AmountToAdd;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GenerateRandomAccelByteProfileCode_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInGameReportEntry_C*                   CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameReport_C_AddDebugEntries) == 0x000008, "Wrong alignment on InGameReport_C_AddDebugEntries");
static_assert(sizeof(InGameReport_C_AddDebugEntries) == 0x000060, "Wrong size on InGameReport_C_AddDebugEntries");
static_assert(offsetof(InGameReport_C_AddDebugEntries, AmountToAdd) == 0x000000, "Member 'InGameReport_C_AddDebugEntries::AmountToAdd' has a wrong offset!");
static_assert(offsetof(InGameReport_C_AddDebugEntries, Temp_int_Variable) == 0x000004, "Member 'InGameReport_C_AddDebugEntries::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(InGameReport_C_AddDebugEntries, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'InGameReport_C_AddDebugEntries::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_AddDebugEntries, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'InGameReport_C_AddDebugEntries::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_AddDebugEntries, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'InGameReport_C_AddDebugEntries::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_AddDebugEntries, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'InGameReport_C_AddDebugEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_AddDebugEntries, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'InGameReport_C_AddDebugEntries::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_AddDebugEntries, CallFunc_GenerateRandomAccelByteProfileCode_ReturnValue) == 0x000038, "Member 'InGameReport_C_AddDebugEntries::CallFunc_GenerateRandomAccelByteProfileCode_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_AddDebugEntries, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'InGameReport_C_AddDebugEntries::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_AddDebugEntries, CallFunc_Create_ReturnValue) == 0x000050, "Member 'InGameReport_C_AddDebugEntries::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_AddDebugEntries, CallFunc_AddChild_ReturnValue_1) == 0x000058, "Member 'InGameReport_C_AddDebugEntries::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function InGameReport.InGameReport_C.UpdateListNavigation
// 0x0090 (0x0090 - 0x0000)
struct InGameReport_C_UpdateListNavigation final
{
public:
	TArray<class UInGameReportEntry_C*>           ReportEntryList;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInGameReportEntry_C*                   K2Node_DynamicCast_AsIn_Game_Report_Entry;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInGameReportEntry_C*                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetWidgetRight_WidgetRight;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInGameReportEntry_C*                   CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetRight_WidgetRight_1;             // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetWidgetRight_WidgetRight_2;             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameReport_C_UpdateListNavigation) == 0x000008, "Wrong alignment on InGameReport_C_UpdateListNavigation");
static_assert(sizeof(InGameReport_C_UpdateListNavigation) == 0x000090, "Wrong size on InGameReport_C_UpdateListNavigation");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, ReportEntryList) == 0x000000, "Member 'InGameReport_C_UpdateListNavigation::ReportEntryList' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, Temp_int_Variable) == 0x000010, "Member 'InGameReport_C_UpdateListNavigation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_GetChildrenCount_ReturnValue) == 0x000020, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, K2Node_DynamicCast_AsIn_Game_Report_Entry) == 0x000028, "Member 'InGameReport_C_UpdateListNavigation::K2Node_DynamicCast_AsIn_Game_Report_Entry' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'InGameReport_C_UpdateListNavigation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, Temp_int_Array_Index_Variable) == 0x000040, "Member 'InGameReport_C_UpdateListNavigation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000044, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000048, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004C, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Array_Get_Item) == 0x000050, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_GetWidgetRight_WidgetRight) == 0x000058, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_GetWidgetRight_WidgetRight' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'InGameReport_C_UpdateListNavigation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_GetWidgetRight_WidgetRight_1) == 0x000078, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_GetWidgetRight_WidgetRight_1' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_GetWidgetRight_WidgetRight_2) == 0x000080, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_GetWidgetRight_WidgetRight_2' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Add_IntInt_ReturnValue_1) == 0x000088, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGameReport_C_UpdateListNavigation, CallFunc_Array_AddUnique_ReturnValue) == 0x00008C, "Member 'InGameReport_C_UpdateListNavigation::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function InGameReport.InGameReport_C.DoCustomNavigation_0
// 0x0018 (0x0018 - 0x0000)
struct InGameReport_C_DoCustomNavigation_0 final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGameReport_C_DoCustomNavigation_0) == 0x000008, "Wrong alignment on InGameReport_C_DoCustomNavigation_0");
static_assert(sizeof(InGameReport_C_DoCustomNavigation_0) == 0x000018, "Wrong size on InGameReport_C_DoCustomNavigation_0");
static_assert(offsetof(InGameReport_C_DoCustomNavigation_0, Navigation_0) == 0x000000, "Member 'InGameReport_C_DoCustomNavigation_0::Navigation_0' has a wrong offset!");
static_assert(offsetof(InGameReport_C_DoCustomNavigation_0, ReturnValue) == 0x000008, "Member 'InGameReport_C_DoCustomNavigation_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameReport_C_DoCustomNavigation_0, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'InGameReport_C_DoCustomNavigation_0::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

