#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameReport

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InGameReport.InGameReport_C
// 0x0050 (0x02B0 - 0x0260)
class UInGameReport_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 BG;                                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsTabButtonWI_C*                  ButtonClose;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_ClickableSubTitleWI_C*              CM_ClickableSubTitleWI;                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PlayerContainer;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Players;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DebugEntries;                                      // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnReportClosed;                                    // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCM_ClickableSubTitleWI_C*              CloseButtonRef;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnReportClosed__DelegateSignature();
	void ExecuteUbergraph_InGameReport(int32 EntryPoint);
	void BndEvt__InGameReport_CM_ClickableSubTitleWI_K2Node_ComponentBoundEvent_0_OnButtonState__DelegateSignature();
	void Destruct();
	void On_Right_Face_Button_Pressed();
	void Set_Is_Closable();
	void Construct();
	void OnInitialized();
	void AddDebugEntries(int32 AmountToAdd);
	void UpdateListNavigation();
	class UWidget* DoCustomNavigation_0(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGameReport_C">();
	}
	static class UInGameReport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInGameReport_C>();
	}
};
static_assert(alignof(UInGameReport_C) == 0x000008, "Wrong alignment on UInGameReport_C");
static_assert(sizeof(UInGameReport_C) == 0x0002B0, "Wrong size on UInGameReport_C");
static_assert(offsetof(UInGameReport_C, UberGraphFrame) == 0x000260, "Member 'UInGameReport_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInGameReport_C, BG) == 0x000268, "Member 'UInGameReport_C::BG' has a wrong offset!");
static_assert(offsetof(UInGameReport_C, ButtonClose) == 0x000270, "Member 'UInGameReport_C::ButtonClose' has a wrong offset!");
static_assert(offsetof(UInGameReport_C, CM_ClickableSubTitleWI) == 0x000278, "Member 'UInGameReport_C::CM_ClickableSubTitleWI' has a wrong offset!");
static_assert(offsetof(UInGameReport_C, PlayerContainer) == 0x000280, "Member 'UInGameReport_C::PlayerContainer' has a wrong offset!");
static_assert(offsetof(UInGameReport_C, ScrollBox_Players) == 0x000288, "Member 'UInGameReport_C::ScrollBox_Players' has a wrong offset!");
static_assert(offsetof(UInGameReport_C, DebugEntries) == 0x000290, "Member 'UInGameReport_C::DebugEntries' has a wrong offset!");
static_assert(offsetof(UInGameReport_C, OnReportClosed) == 0x000298, "Member 'UInGameReport_C::OnReportClosed' has a wrong offset!");
static_assert(offsetof(UInGameReport_C, CloseButtonRef) == 0x0002A8, "Member 'UInGameReport_C::CloseButtonRef' has a wrong offset!");

}

