#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractableEntryWI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function InteractableEntryWI.InteractableEntryWI_C.ExecuteUbergraph_InteractableEntryWI
// 0x0098 (0x0098 - 0x0000)
struct InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_KeyToText_ReturnValue;                    // 0x0048(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESCTControllerType                            CallFunc_GetLastControllerType_ReturnValue;        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetControllerIconForKey_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetControllerIconForKey_ReturnValue_1;    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI) == 0x000008, "Wrong alignment on InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI");
static_assert(sizeof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI) == 0x000098, "Wrong size on InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, EntryPoint) == 0x000000, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, K2Node_Event_MyGeometry) == 0x000004, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, CallFunc_Key_IsGamepadKey_ReturnValue) == 0x000042, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::CallFunc_Key_IsGamepadKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, CallFunc_KeyToText_ReturnValue) == 0x000048, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::CallFunc_KeyToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, CallFunc_GetGameInstance_ReturnValue) == 0x000060, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, K2Node_DynamicCast_AsSCTGame_Instance) == 0x000068, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::K2Node_DynamicCast_AsSCTGame_Instance' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, CallFunc_GetLastControllerType_ReturnValue) == 0x000071, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::CallFunc_GetLastControllerType_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, CallFunc_GetControllerIconForKey_ReturnValue) == 0x000078, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::CallFunc_GetControllerIconForKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, CallFunc_GetControllerIconForKey_ReturnValue_1) == 0x000088, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::CallFunc_GetControllerIconForKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI, CallFunc_IsValid_ReturnValue_3) == 0x000090, "Member 'InteractableEntryWI_C_ExecuteUbergraph_InteractableEntryWI::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function InteractableEntryWI.InteractableEntryWI_C.Tick
// 0x003C (0x003C - 0x0000)
struct InteractableEntryWI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractableEntryWI_C_Tick) == 0x000004, "Wrong alignment on InteractableEntryWI_C_Tick");
static_assert(sizeof(InteractableEntryWI_C_Tick) == 0x00003C, "Wrong size on InteractableEntryWI_C_Tick");
static_assert(offsetof(InteractableEntryWI_C_Tick, MyGeometry) == 0x000000, "Member 'InteractableEntryWI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_Tick, InDeltaTime) == 0x000038, "Member 'InteractableEntryWI_C_Tick::InDeltaTime' has a wrong offset!");

// Function InteractableEntryWI.InteractableEntryWI_C.Update Cooldown Progress Bar
// 0x0020 (0x0020 - 0x0000)
struct InteractableEntryWI_C_Update_Cooldown_Progress_Bar final
{
public:
	float                                         CallFunc_GetPowerCooldownEndTime_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNetTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCooldownTotalDuration_ReturnValue;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCooldownTotalDuration_ReturnValue_1;   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractableEntryWI_C_Update_Cooldown_Progress_Bar) == 0x000004, "Wrong alignment on InteractableEntryWI_C_Update_Cooldown_Progress_Bar");
static_assert(sizeof(InteractableEntryWI_C_Update_Cooldown_Progress_Bar) == 0x000020, "Wrong size on InteractableEntryWI_C_Update_Cooldown_Progress_Bar");
static_assert(offsetof(InteractableEntryWI_C_Update_Cooldown_Progress_Bar, CallFunc_GetPowerCooldownEndTime_ReturnValue) == 0x000000, "Member 'InteractableEntryWI_C_Update_Cooldown_Progress_Bar::CallFunc_GetPowerCooldownEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_Update_Cooldown_Progress_Bar, CallFunc_GetNetTime_ReturnValue) == 0x000004, "Member 'InteractableEntryWI_C_Update_Cooldown_Progress_Bar::CallFunc_GetNetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_Update_Cooldown_Progress_Bar, CallFunc_GetCooldownTotalDuration_ReturnValue) == 0x000008, "Member 'InteractableEntryWI_C_Update_Cooldown_Progress_Bar::CallFunc_GetCooldownTotalDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_Update_Cooldown_Progress_Bar, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'InteractableEntryWI_C_Update_Cooldown_Progress_Bar::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_Update_Cooldown_Progress_Bar, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'InteractableEntryWI_C_Update_Cooldown_Progress_Bar::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_Update_Cooldown_Progress_Bar, CallFunc_GetCooldownTotalDuration_ReturnValue_1) == 0x000014, "Member 'InteractableEntryWI_C_Update_Cooldown_Progress_Bar::CallFunc_GetCooldownTotalDuration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_Update_Cooldown_Progress_Bar, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'InteractableEntryWI_C_Update_Cooldown_Progress_Bar::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_Update_Cooldown_Progress_Bar, CallFunc_FClamp_ReturnValue) == 0x00001C, "Member 'InteractableEntryWI_C_Update_Cooldown_Progress_Bar::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function InteractableEntryWI.InteractableEntryWI_C.Update Description
// 0x0018 (0x0018 - 0x0000)
struct InteractableEntryWI_C_Update_Description final
{
public:
	class FText                                   CallFunc_GetContextDescription_ReturnValue;        // 0x0000(0x0018)()
};
static_assert(alignof(InteractableEntryWI_C_Update_Description) == 0x000008, "Wrong alignment on InteractableEntryWI_C_Update_Description");
static_assert(sizeof(InteractableEntryWI_C_Update_Description) == 0x000018, "Wrong size on InteractableEntryWI_C_Update_Description");
static_assert(offsetof(InteractableEntryWI_C_Update_Description, CallFunc_GetContextDescription_ReturnValue) == 0x000000, "Member 'InteractableEntryWI_C_Update_Description::CallFunc_GetContextDescription_ReturnValue' has a wrong offset!");

// Function InteractableEntryWI.InteractableEntryWI_C.Set UI Visibility
// 0x0001 (0x0001 - 0x0000)
struct InteractableEntryWI_C_Set_UI_Visibility final
{
public:
	bool                                          CallFunc_ShouldShowContextUI_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InteractableEntryWI_C_Set_UI_Visibility) == 0x000001, "Wrong alignment on InteractableEntryWI_C_Set_UI_Visibility");
static_assert(sizeof(InteractableEntryWI_C_Set_UI_Visibility) == 0x000001, "Wrong size on InteractableEntryWI_C_Set_UI_Visibility");
static_assert(offsetof(InteractableEntryWI_C_Set_UI_Visibility, CallFunc_ShouldShowContextUI_ReturnValue) == 0x000000, "Member 'InteractableEntryWI_C_Set_UI_Visibility::CallFunc_ShouldShowContextUI_ReturnValue' has a wrong offset!");

// Function InteractableEntryWI.InteractableEntryWI_C.SetColor
// 0x00B8 (0x00B8 - 0x0000)
struct InteractableEntryWI_C_SetColor final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPretendPower_ReturnValue;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanActivateAbility_ReturnValue;           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPersonoidPower_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x0040(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_4;                           // 0x0068(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_5;                           // 0x0090(0x0028)()
};
static_assert(alignof(InteractableEntryWI_C_SetColor) == 0x000008, "Wrong alignment on InteractableEntryWI_C_SetColor");
static_assert(sizeof(InteractableEntryWI_C_SetColor) == 0x0000B8, "Wrong size on InteractableEntryWI_C_SetColor");
static_assert(offsetof(InteractableEntryWI_C_SetColor, Temp_bool_Variable) == 0x000000, "Member 'InteractableEntryWI_C_SetColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, Temp_bool_Variable_1) == 0x000001, "Member 'InteractableEntryWI_C_SetColor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, Temp_bool_Variable_2) == 0x000002, "Member 'InteractableEntryWI_C_SetColor::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, Temp_bool_Variable_3) == 0x000003, "Member 'InteractableEntryWI_C_SetColor::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, Temp_bool_Variable_4) == 0x000004, "Member 'InteractableEntryWI_C_SetColor::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, Temp_bool_Variable_5) == 0x000005, "Member 'InteractableEntryWI_C_SetColor::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, CallFunc_IsPretendPower_ReturnValue) == 0x000006, "Member 'InteractableEntryWI_C_SetColor::CallFunc_IsPretendPower_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, CallFunc_CanActivateAbility_ReturnValue) == 0x000007, "Member 'InteractableEntryWI_C_SetColor::CallFunc_CanActivateAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, CallFunc_IsPersonoidPower_ReturnValue) == 0x000008, "Member 'InteractableEntryWI_C_SetColor::CallFunc_IsPersonoidPower_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, K2Node_Select_Default) == 0x00000C, "Member 'InteractableEntryWI_C_SetColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, K2Node_Select_Default_1) == 0x00001C, "Member 'InteractableEntryWI_C_SetColor::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, K2Node_Select_Default_2) == 0x00002C, "Member 'InteractableEntryWI_C_SetColor::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, K2Node_Select_Default_3) == 0x000040, "Member 'InteractableEntryWI_C_SetColor::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, K2Node_Select_Default_4) == 0x000068, "Member 'InteractableEntryWI_C_SetColor::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_SetColor, K2Node_Select_Default_5) == 0x000090, "Member 'InteractableEntryWI_C_SetColor::K2Node_Select_Default_5' has a wrong offset!");

// Function InteractableEntryWI.InteractableEntryWI_C.IsPersonoidPower
// 0x0006 (0x0006 - 0x0000)
struct InteractableEntryWI_C_IsPersonoidPower final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InteractableEntryWI_C_IsPersonoidPower) == 0x000001, "Wrong alignment on InteractableEntryWI_C_IsPersonoidPower");
static_assert(sizeof(InteractableEntryWI_C_IsPersonoidPower) == 0x000006, "Wrong size on InteractableEntryWI_C_IsPersonoidPower");
static_assert(offsetof(InteractableEntryWI_C_IsPersonoidPower, ReturnValue) == 0x000000, "Member 'InteractableEntryWI_C_IsPersonoidPower::ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_IsPersonoidPower, CallFunc_HasTag_ReturnValue) == 0x000001, "Member 'InteractableEntryWI_C_IsPersonoidPower::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_IsPersonoidPower, CallFunc_HasTag_ReturnValue_1) == 0x000002, "Member 'InteractableEntryWI_C_IsPersonoidPower::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_IsPersonoidPower, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'InteractableEntryWI_C_IsPersonoidPower::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_IsPersonoidPower, CallFunc_BooleanOR_ReturnValue_1) == 0x000004, "Member 'InteractableEntryWI_C_IsPersonoidPower::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_IsPersonoidPower, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'InteractableEntryWI_C_IsPersonoidPower::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function InteractableEntryWI.InteractableEntryWI_C.IsPretendPower
// 0x0002 (0x0002 - 0x0000)
struct InteractableEntryWI_C_IsPretendPower final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPretendAction_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InteractableEntryWI_C_IsPretendPower) == 0x000001, "Wrong alignment on InteractableEntryWI_C_IsPretendPower");
static_assert(sizeof(InteractableEntryWI_C_IsPretendPower) == 0x000002, "Wrong size on InteractableEntryWI_C_IsPretendPower");
static_assert(offsetof(InteractableEntryWI_C_IsPretendPower, ReturnValue) == 0x000000, "Member 'InteractableEntryWI_C_IsPretendPower::ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableEntryWI_C_IsPretendPower, CallFunc_IsPretendAction_ReturnValue) == 0x000001, "Member 'InteractableEntryWI_C_IsPretendPower::CallFunc_IsPretendAction_ReturnValue' has a wrong offset!");

}

