#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractionWaveSkillcheckWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InteractionSkillcheckWIBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InteractionWaveSkillcheckWI.InteractionWaveSkillcheckWI_C
// 0x0010 (0x0440 - 0x0430)
class UInteractionWaveSkillcheckWI_C final : public UInteractionSkillcheckWIBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_InteractionWaveSkillcheckWI_C;      // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         TargetSequences;                                   // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SequencesCompleted;                                // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InteractionWaveSkillcheckWI(int32 EntryPoint);
	void StartSkillcheck();
	void Sequence_Completed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InteractionWaveSkillcheckWI_C">();
	}
	static class UInteractionWaveSkillcheckWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionWaveSkillcheckWI_C>();
	}
};
static_assert(alignof(UInteractionWaveSkillcheckWI_C) == 0x000008, "Wrong alignment on UInteractionWaveSkillcheckWI_C");
static_assert(sizeof(UInteractionWaveSkillcheckWI_C) == 0x000440, "Wrong size on UInteractionWaveSkillcheckWI_C");
static_assert(offsetof(UInteractionWaveSkillcheckWI_C, UberGraphFrame_InteractionWaveSkillcheckWI_C) == 0x000430, "Member 'UInteractionWaveSkillcheckWI_C::UberGraphFrame_InteractionWaveSkillcheckWI_C' has a wrong offset!");
static_assert(offsetof(UInteractionWaveSkillcheckWI_C, TargetSequences) == 0x000438, "Member 'UInteractionWaveSkillcheckWI_C::TargetSequences' has a wrong offset!");
static_assert(offsetof(UInteractionWaveSkillcheckWI_C, SequencesCompleted) == 0x00043C, "Member 'UInteractionWaveSkillcheckWI_C::SequencesCompleted' has a wrong offset!");

}

