#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractionComponentProgressBarWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InteractionComponentProgressBarWI.InteractionComponentProgressBarWI_C
// 0x0058 (0x0308 - 0x02B0)
class UInteractionComponentProgressBarWI_C final : public UProgressBarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ActionText;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_63;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_318;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           InteractProgressBar;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TimeStart;                                         // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InteractionComponentProgressBarWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void CalculateProgress();
	void ChangeState(const class FString& Description, float Duration_0);
	void StartProgress();
	void EndProgress();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InteractionComponentProgressBarWI_C">();
	}
	static class UInteractionComponentProgressBarWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionComponentProgressBarWI_C>();
	}
};
static_assert(alignof(UInteractionComponentProgressBarWI_C) == 0x000008, "Wrong alignment on UInteractionComponentProgressBarWI_C");
static_assert(sizeof(UInteractionComponentProgressBarWI_C) == 0x000308, "Wrong size on UInteractionComponentProgressBarWI_C");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, UberGraphFrame) == 0x0002B0, "Member 'UInteractionComponentProgressBarWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, FadeIn) == 0x0002B8, "Member 'UInteractionComponentProgressBarWI_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, ActionText) == 0x0002C0, "Member 'UInteractionComponentProgressBarWI_C::ActionText' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, BackgroundImage) == 0x0002C8, "Member 'UInteractionComponentProgressBarWI_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, Image) == 0x0002D0, "Member 'UInteractionComponentProgressBarWI_C::Image' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, Image_1) == 0x0002D8, "Member 'UInteractionComponentProgressBarWI_C::Image_1' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, Image_2) == 0x0002E0, "Member 'UInteractionComponentProgressBarWI_C::Image_2' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, Image_63) == 0x0002E8, "Member 'UInteractionComponentProgressBarWI_C::Image_63' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, Image_318) == 0x0002F0, "Member 'UInteractionComponentProgressBarWI_C::Image_318' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, InteractProgressBar) == 0x0002F8, "Member 'UInteractionComponentProgressBarWI_C::InteractProgressBar' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, TimeStart) == 0x000300, "Member 'UInteractionComponentProgressBarWI_C::TimeStart' has a wrong offset!");
static_assert(offsetof(UInteractionComponentProgressBarWI_C, Duration) == 0x000304, "Member 'UInteractionComponentProgressBarWI_C::Duration' has a wrong offset!");

}

