#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IPuzzleSolved

#include "Basic.hpp"


namespace SDK::Params
{

// Function IPuzzleSolved.IPuzzleSolved_C.CorrectlySolved
// 0x0008 (0x0008 - 0x0000)
struct IPuzzleSolved_C_CorrectlySolved final
{
public:
	class APlayerState*                           SolvingPlayer;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IPuzzleSolved_C_CorrectlySolved) == 0x000008, "Wrong alignment on IPuzzleSolved_C_CorrectlySolved");
static_assert(sizeof(IPuzzleSolved_C_CorrectlySolved) == 0x000008, "Wrong size on IPuzzleSolved_C_CorrectlySolved");
static_assert(offsetof(IPuzzleSolved_C_CorrectlySolved, SolvingPlayer) == 0x000000, "Member 'IPuzzleSolved_C_CorrectlySolved::SolvingPlayer' has a wrong offset!");

// Function IPuzzleSolved.IPuzzleSolved_C.IncorrectlySolved
// 0x0008 (0x0008 - 0x0000)
struct IPuzzleSolved_C_IncorrectlySolved final
{
public:
	class APlayerState*                           SolvingPlayer;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IPuzzleSolved_C_IncorrectlySolved) == 0x000008, "Wrong alignment on IPuzzleSolved_C_IncorrectlySolved");
static_assert(sizeof(IPuzzleSolved_C_IncorrectlySolved) == 0x000008, "Wrong size on IPuzzleSolved_C_IncorrectlySolved");
static_assert(offsetof(IPuzzleSolved_C_IncorrectlySolved, SolvingPlayer) == 0x000000, "Member 'IPuzzleSolved_C_IncorrectlySolved::SolvingPlayer' has a wrong offset!");

}

