#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemWheelV2EntryWI

#include "Basic.hpp"

#include "E_ItemSlotStates_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ItemWheelV2EntryWI.ItemWheelV2EntryWI_C.ExecuteUbergraph_ItemWheelV2EntryWI
// 0x0120 (0x0120 - 0x0000)
struct ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItem*                                  K2Node_DynamicCast_AsItem;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0080(0x0088)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI) == 0x000008, "Wrong alignment on ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI");
static_assert(sizeof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI) == 0x000120, "Wrong size on ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, EntryPoint) == 0x000000, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, K2Node_Event_IsDesignTime) == 0x000030, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000038, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000048, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_MakeVector2D_ReturnValue_1) == 0x00004C, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000058, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, K2Node_DynamicCast_AsItem) == 0x000060, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::K2Node_DynamicCast_AsItem' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_GetPosition_ReturnValue) == 0x00006C, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_BreakVector2D_X) == 0x000074, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_BreakVector2D_Y) == 0x000078, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, K2Node_MakeStruct_SlateBrush) == 0x000080, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_Add_FloatFloat_ReturnValue) == 0x000108, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_MakeVector2D_ReturnValue_2) == 0x00010C, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000114, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000118, "Member 'ItemWheelV2EntryWI_C_ExecuteUbergraph_ItemWheelV2EntryWI::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");

// Function ItemWheelV2EntryWI.ItemWheelV2EntryWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ItemWheelV2EntryWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemWheelV2EntryWI_C_PreConstruct) == 0x000001, "Wrong alignment on ItemWheelV2EntryWI_C_PreConstruct");
static_assert(sizeof(ItemWheelV2EntryWI_C_PreConstruct) == 0x000001, "Wrong size on ItemWheelV2EntryWI_C_PreConstruct");
static_assert(offsetof(ItemWheelV2EntryWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ItemWheelV2EntryWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ItemWheelV2EntryWI.ItemWheelV2EntryWI_C.UpdateDataOfV3Slot
// 0x0088 (0x0088 - 0x0000)
struct ItemWheelV2EntryWI_C_UpdateDataOfV3Slot final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
};
static_assert(alignof(ItemWheelV2EntryWI_C_UpdateDataOfV3Slot) == 0x000008, "Wrong alignment on ItemWheelV2EntryWI_C_UpdateDataOfV3Slot");
static_assert(sizeof(ItemWheelV2EntryWI_C_UpdateDataOfV3Slot) == 0x000088, "Wrong size on ItemWheelV2EntryWI_C_UpdateDataOfV3Slot");
static_assert(offsetof(ItemWheelV2EntryWI_C_UpdateDataOfV3Slot, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'ItemWheelV2EntryWI_C_UpdateDataOfV3Slot::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_UpdateDataOfV3Slot, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'ItemWheelV2EntryWI_C_UpdateDataOfV3Slot::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_UpdateDataOfV3Slot, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'ItemWheelV2EntryWI_C_UpdateDataOfV3Slot::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_UpdateDataOfV3Slot, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000040, "Member 'ItemWheelV2EntryWI_C_UpdateDataOfV3Slot::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_UpdateDataOfV3Slot, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'ItemWheelV2EntryWI_C_UpdateDataOfV3Slot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_UpdateDataOfV3Slot, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'ItemWheelV2EntryWI_C_UpdateDataOfV3Slot::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelV2EntryWI_C_UpdateDataOfV3Slot, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'ItemWheelV2EntryWI_C_UpdateDataOfV3Slot::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function ItemWheelV2EntryWI.ItemWheelV2EntryWI_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct ItemWheelV2EntryWI_C_Initialize final
{
public:
	class UItem*                                  Item_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelV2EntryWI_C_Initialize) == 0x000008, "Wrong alignment on ItemWheelV2EntryWI_C_Initialize");
static_assert(sizeof(ItemWheelV2EntryWI_C_Initialize) == 0x000008, "Wrong size on ItemWheelV2EntryWI_C_Initialize");
static_assert(offsetof(ItemWheelV2EntryWI_C_Initialize, Item_0) == 0x000000, "Member 'ItemWheelV2EntryWI_C_Initialize::Item_0' has a wrong offset!");

// Function ItemWheelV2EntryWI.ItemWheelV2EntryWI_C.Rebuild
// 0x0001 (0x0001 - 0x0000)
struct ItemWheelV2EntryWI_C_Rebuild final
{
public:
	E_ItemSlotStates                              Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelV2EntryWI_C_Rebuild) == 0x000001, "Wrong alignment on ItemWheelV2EntryWI_C_Rebuild");
static_assert(sizeof(ItemWheelV2EntryWI_C_Rebuild) == 0x000001, "Wrong size on ItemWheelV2EntryWI_C_Rebuild");
static_assert(offsetof(ItemWheelV2EntryWI_C_Rebuild, Selection) == 0x000000, "Member 'ItemWheelV2EntryWI_C_Rebuild::Selection' has a wrong offset!");

}

