#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemStacksWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemStacksWI.ItemStacksWI_C
// 0x0028 (0x0288 - 0x0260)
class UItemStacksWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Image_Infinity;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URoundedBGBoxWI_C*                      RoundedBGBoxWI;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Stacks;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInventory*                             OwningCharacterInventory;                          // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemStacksWI(int32 EntryPoint);
	void Construct();
	void UpdateItemStacks(EInventorySlotID SlotId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemStacksWI_C">();
	}
	static class UItemStacksWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemStacksWI_C>();
	}
};
static_assert(alignof(UItemStacksWI_C) == 0x000008, "Wrong alignment on UItemStacksWI_C");
static_assert(sizeof(UItemStacksWI_C) == 0x000288, "Wrong size on UItemStacksWI_C");
static_assert(offsetof(UItemStacksWI_C, UberGraphFrame) == 0x000260, "Member 'UItemStacksWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemStacksWI_C, Image_Infinity) == 0x000268, "Member 'UItemStacksWI_C::Image_Infinity' has a wrong offset!");
static_assert(offsetof(UItemStacksWI_C, RoundedBGBoxWI) == 0x000270, "Member 'UItemStacksWI_C::RoundedBGBoxWI' has a wrong offset!");
static_assert(offsetof(UItemStacksWI_C, Text_Stacks) == 0x000278, "Member 'UItemStacksWI_C::Text_Stacks' has a wrong offset!");
static_assert(offsetof(UItemStacksWI_C, OwningCharacterInventory) == 0x000280, "Member 'UItemStacksWI_C::OwningCharacterInventory' has a wrong offset!");

}

