#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeycardGA

#include "Basic.hpp"


namespace SDK::Params
{

// Function KeycardGA.KeycardGA_C.ExecuteUbergraph_KeycardGA
// 0x0004 (0x0004 - 0x0000)
struct KeycardGA_C_ExecuteUbergraph_KeycardGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeycardGA_C_ExecuteUbergraph_KeycardGA) == 0x000004, "Wrong alignment on KeycardGA_C_ExecuteUbergraph_KeycardGA");
static_assert(sizeof(KeycardGA_C_ExecuteUbergraph_KeycardGA) == 0x000004, "Wrong size on KeycardGA_C_ExecuteUbergraph_KeycardGA");
static_assert(offsetof(KeycardGA_C_ExecuteUbergraph_KeycardGA, EntryPoint) == 0x000000, "Member 'KeycardGA_C_ExecuteUbergraph_KeycardGA::EntryPoint' has a wrong offset!");

// Function KeycardGA.KeycardGA_C.OnRemoved
// 0x0001 (0x0001 - 0x0000)
struct KeycardGA_C_OnRemoved final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeycardGA_C_OnRemoved) == 0x000001, "Wrong alignment on KeycardGA_C_OnRemoved");
static_assert(sizeof(KeycardGA_C_OnRemoved) == 0x000001, "Wrong size on KeycardGA_C_OnRemoved");
static_assert(offsetof(KeycardGA_C_OnRemoved, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'KeycardGA_C_OnRemoved::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

