#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LanguageWI

#include "Basic.hpp"

#include "FCT_structs.hpp"
#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LanguageWI.LanguageWI_C.ExecuteUbergraph_LanguageWI
// 0x0250 (0x0250 - 0x0000)
struct LanguageWI_C_ExecuteUbergraph_LanguageWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitialLoadComplete_ReturnValue;          // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0074(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDefaultLocale_ReturnValue;             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0098(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGame_ReturnValue;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_1;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKeyIndex_ReturnValue;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindOptionIndex_ReturnValue;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetKeyAt_ReturnValue;                     // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLanguageDatum                         CallFunc_Map_Find_Value;                           // 0x0188(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x01AC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x01C0(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x01D0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x01E8(0x0010)(ConstParm, ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP_1;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0214(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0228(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Ubp_SpecialOptionsSave_C*               CallFunc_GetSpecialOptions_SpecialOptions_2;       // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKeyIndex_ReturnValue_1;                // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LanguageWI_C_ExecuteUbergraph_LanguageWI) == 0x000008, "Wrong alignment on LanguageWI_C_ExecuteUbergraph_LanguageWI");
static_assert(sizeof(LanguageWI_C_ExecuteUbergraph_LanguageWI) == 0x000250, "Wrong size on LanguageWI_C_ExecuteUbergraph_LanguageWI");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, EntryPoint) == 0x000000, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000030, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_ComponentBoundEvent_SelectedItem) == 0x000038, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_ComponentBoundEvent_SelectionType) == 0x000048, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_Event_IsDesignTime) == 0x00005C, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_InitialLoadComplete_ReturnValue) == 0x00005D, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_InitialLoadComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetGameInstance_ReturnValue) == 0x000060, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_DynamicCast_AsSCTGame_Instance) == 0x000068, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_DynamicCast_AsSCTGame_Instance' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, Temp_delegate_Variable) == 0x000074, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetDefaultLocale_ReturnValue) == 0x000088, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetDefaultLocale_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, Temp_struct_Variable) == 0x000098, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A8, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_PostAkEvent_ReturnValue) == 0x0000B8, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000C0, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetSpecialOptions_SpecialOptions) == 0x0000D0, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetSpecialOptions_SpecialOptions' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000D8, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_SaveGame_ReturnValue) == 0x0000E8, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_SaveGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetSpecialOptions_SpecialOptions_1) == 0x0000F0, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetSpecialOptions_SpecialOptions_1' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000F8, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_SelectString_ReturnValue) == 0x000100, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetKeyIndex_ReturnValue) == 0x000110, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetKeyIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Greater_IntInt_ReturnValue) == 0x000114, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_FindOptionIndex_ReturnValue) == 0x000118, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_FindOptionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetKeyAt_ReturnValue) == 0x000120, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetKeyAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000130, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000140, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_IsEmpty_ReturnValue) == 0x000150, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000158, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Not_PreBool_ReturnValue) == 0x000168, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetGameInstance_ReturnValue_1) == 0x000170, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_DynamicCast_AsFCTGame_Instance_BP) == 0x000178, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_DynamicCast_AsFCTGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Map_Find_Value) == 0x000188, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Map_Find_ReturnValue) == 0x0001A8, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, Temp_delegate_Variable_1) == 0x0001AC, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, Temp_struct_Variable_1) == 0x0001C0, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, Temp_delegate_Variable_2) == 0x0001D0, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001E0, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, Temp_struct_Variable_2) == 0x0001E8, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetGameInstance_ReturnValue_2) == 0x0001F8, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_PostAkEvent_ReturnValue_2) == 0x000200, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_DynamicCast_AsFCTGame_Instance_BP_1) == 0x000208, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_DynamicCast_AsFCTGame_Instance_BP_1' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, K2Node_DynamicCast_bSuccess_2) == 0x000210, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, Temp_delegate_Variable_3) == 0x000214, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, Temp_struct_Variable_3) == 0x000228, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_PostAkEvent_ReturnValue_3) == 0x000238, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetSpecialOptions_SpecialOptions_2) == 0x000240, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetSpecialOptions_SpecialOptions_2' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_GetKeyIndex_ReturnValue_1) == 0x000248, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_GetKeyIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_ExecuteUbergraph_LanguageWI, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00024C, "Member 'LanguageWI_C_ExecuteUbergraph_LanguageWI::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function LanguageWI.LanguageWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LanguageWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LanguageWI_C_PreConstruct) == 0x000001, "Wrong alignment on LanguageWI_C_PreConstruct");
static_assert(sizeof(LanguageWI_C_PreConstruct) == 0x000001, "Wrong size on LanguageWI_C_PreConstruct");
static_assert(offsetof(LanguageWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LanguageWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LanguageWI.LanguageWI_C.BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LanguageWI_C_BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LanguageWI_C_BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on LanguageWI_C_BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(LanguageWI_C_BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on LanguageWI_C_BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(LanguageWI_C_BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'LanguageWI_C_BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'LanguageWI_C_BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function LanguageWI.LanguageWI_C.GetSpecialOptions
// 0x0028 (0x0028 - 0x0000)
struct LanguageWI_C_GetSpecialOptions final
{
public:
	class Ubp_SpecialOptionsSave_C*               SpecialOptions;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGame_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_SpecialOptionsSave_C*               K2Node_DynamicCast_AsBp_Special_Options_Save;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LanguageWI_C_GetSpecialOptions) == 0x000008, "Wrong alignment on LanguageWI_C_GetSpecialOptions");
static_assert(sizeof(LanguageWI_C_GetSpecialOptions) == 0x000028, "Wrong size on LanguageWI_C_GetSpecialOptions");
static_assert(offsetof(LanguageWI_C_GetSpecialOptions, SpecialOptions) == 0x000000, "Member 'LanguageWI_C_GetSpecialOptions::SpecialOptions' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_GetSpecialOptions, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000008, "Member 'LanguageWI_C_GetSpecialOptions::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(LanguageWI_C_GetSpecialOptions, CallFunc_LoadGame_ReturnValue) == 0x000010, "Member 'LanguageWI_C_GetSpecialOptions::CallFunc_LoadGame_ReturnValue' has a wrong offset!");
