#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LanguageWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LanguageWI.LanguageWI_C
// 0x0038 (0x0298 - 0x0260)
class ULanguageWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UComboBoxString*                        ComboBoxString_159;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_118;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justification;                                     // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULanguageData*                          LanguageData;                                      // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowLanguageChange;                               // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LanguageWI(int32 EntryPoint);
	void OnLanguageUpdated();
	void OnInitialLoadComplete();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_0_OnOpeningEvent__DelegateSignature();
	void Audio_Select_Language();
	void BndEvt__ComboBoxString_159_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void GetSpecialOptions(class Ubp_SpecialOptionsSave_C** SpecialOptions);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LanguageWI_C">();
	}
	static class ULanguageWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULanguageWI_C>();
	}
};
static_assert(alignof(ULanguageWI_C) == 0x000008, "Wrong alignment on ULanguageWI_C");
static_assert(sizeof(ULanguageWI_C) == 0x000298, "Wrong size on ULanguageWI_C");
static_assert(offsetof(ULanguageWI_C, UberGraphFrame) == 0x000260, "Member 'ULanguageWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULanguageWI_C, ComboBoxString_159) == 0x000268, "Member 'ULanguageWI_C::ComboBoxString_159' has a wrong offset!");
static_assert(offsetof(ULanguageWI_C, TextBlock_118) == 0x000270, "Member 'ULanguageWI_C::TextBlock_118' has a wrong offset!");
static_assert(offsetof(ULanguageWI_C, Ak) == 0x000278, "Member 'ULanguageWI_C::Ak' has a wrong offset!");
static_assert(offsetof(ULanguageWI_C, Justification) == 0x000280, "Member 'ULanguageWI_C::Justification' has a wrong offset!");
static_assert(offsetof(ULanguageWI_C, LanguageData) == 0x000288, "Member 'ULanguageWI_C::LanguageData' has a wrong offset!");
static_assert(offsetof(ULanguageWI_C, AllowLanguageChange) == 0x000290, "Member 'ULanguageWI_C::AllowLanguageChange' has a wrong offset!");

}

