#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lazygodray_FX_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function lazygodray_FX_BP.lazygodray_FX_BP_C.UserConstructionScript
// 0x0300 (0x0300 - 0x0000)
struct Lazygodray_FX_BP_C_UserConstructionScript final
{
public:
	class UMaterialInstance*                      Godray_dust_MI;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FParticleSysParam>              Godray_dust_parameters;                            // 0x0008(0x0010)(Edit, BlueprintVisible)
	class UParticleSystemComponent*               Godray_dust;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dust_mtl_dynamic_instance;                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Godray_mtl_dynamic_instance;                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Godray_card_MI_convergent;                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Godray_card_MI;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAtan_ReturnValue;                      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00D8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_11;       // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0190(0x0080)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_2;         // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_12;       // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_3;         // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x0240(0x0080)(IsPlainOldData, NoDestructor, UObjectWrapper)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_13;       // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_14;       // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lazygodray_FX_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on Lazygodray_FX_BP_C_UserConstructionScript");
static_assert(sizeof(Lazygodray_FX_BP_C_UserConstructionScript) == 0x000300, "Wrong size on Lazygodray_FX_BP_C_UserConstructionScript");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, Godray_dust_MI) == 0x000000, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::Godray_dust_MI' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, Godray_dust_parameters) == 0x000008, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::Godray_dust_parameters' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, Godray_dust) == 0x000018, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::Godray_dust' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, Dust_mtl_dynamic_instance) == 0x000020, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::Dust_mtl_dynamic_instance' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, Godray_mtl_dynamic_instance) == 0x000028, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::Godray_mtl_dynamic_instance' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, Godray_card_MI_convergent) == 0x000030, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::Godray_card_MI_convergent' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, Godray_card_MI) == 0x000038, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::Godray_card_MI' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, Temp_struct_Variable) == 0x000040, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000078, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000080, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000084, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000088, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_DegAtan_ReturnValue) == 0x00008C, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_DegAtan_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x000090, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000094, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000098, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00009C, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0000A0, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x0000A4, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x0000A8, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x0000AC, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x0000B0, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x0000B4, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000B8, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0000BC, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_10) == 0x0000C8, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x0000CC, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000D8, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_11) == 0x000164, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000168, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00016C, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000170, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x00017C, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, K2Node_MakeStruct_ParticleSysParam) == 0x000190, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000210, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000214, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue_2) == 0x000218, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_12) == 0x000224, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue_3) == 0x000228, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000238, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, K2Node_MakeStruct_ParticleSysParam_1) == 0x000240, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_1) == 0x0002C0, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_13) == 0x0002C4, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_14) == 0x0002C8, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x0002CC, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_5) == 0x0002D0, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x0002D4, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x0002E0, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0002F0, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lazygodray_FX_BP_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x0002F8, "Member 'Lazygodray_FX_BP_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");

}

