#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lazygodray_FX_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass lazygodray_FX_BP.lazygodray_FX_BP_C
// 0x00F8 (0x0318 - 0x0220)
class ALazygodray_FX_BP_C final : public AActor
{
public:
	class USpotLightComponent*                    SpotLight;                                         // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        Spotlight_grp;                                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Godray_card_SM;                                    // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        Lazygodray_FX_BP;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Diameter_multiplier;                               // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Length_multiplier;                                 // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Tint_color;                                        // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Light_shaft_texture;                               // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Overall_intensity;                                 // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Overall_contrast;                                  // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Light_shaft_strength;                              // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Light_shaft_amount;                                // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Light_shaft_length;                                // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Depth_fade_distance;                               // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Fesnel_exponent;                                   // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Camera_fading_starting_distance;                   // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Camera_fading_transition_range;                    // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Vertical_falloff_midpoint;                         // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Vertical_falloff_exponent;                         // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Vertical_falloff_strength;                         // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_masking_exponent;                      // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_lightray_convergent;                           // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Lightray_convergent_rate;                          // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_dust_particle__cannot_be_toggled_during_runtime_; // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Particle_color;                                    // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Amount_multiplier;                                 // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_multiplier;                                   // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_minimum_percentage;                           // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Velocity_multiplier;                               // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Velocity_mininum_percentage;                       // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spawn_location_vertical_offset;                    // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spawn_radius_multiplier;                           // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spawn_length_multiplier;                           // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Revealing_distance;                                // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Revealing_transition;                              // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Culling_distance;                                  // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Culling_transition;                                // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_spotlight_component__cannot_be_toggled_during_runtime; // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Light_intensity_in_Lumens;                         // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Light_source_radius;                               // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attenuation_offset;                                // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Outer_cone_angle_offset;                           // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Inner_cone_angle;                                  // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Smoke_intensity;                                   // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Smoke_texture;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Smoke_texture_scale;                               // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Panning_speedX;                                    // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Panning_speedY;                                    // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"lazygodray_FX_BP_C">();
	}
	static class ALazygodray_FX_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALazygodray_FX_BP_C>();
	}
};
static_assert(alignof(ALazygodray_FX_BP_C) == 0x000008, "Wrong alignment on ALazygodray_FX_BP_C");
static_assert(sizeof(ALazygodray_FX_BP_C) == 0x000318, "Wrong size on ALazygodray_FX_BP_C");
static_assert(offsetof(ALazygodray_FX_BP_C, SpotLight) == 0x000220, "Member 'ALazygodray_FX_BP_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Spotlight_grp) == 0x000228, "Member 'ALazygodray_FX_BP_C::Spotlight_grp' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Godray_card_SM) == 0x000230, "Member 'ALazygodray_FX_BP_C::Godray_card_SM' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Lazygodray_FX_BP) == 0x000238, "Member 'ALazygodray_FX_BP_C::Lazygodray_FX_BP' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Diameter_multiplier) == 0x000240, "Member 'ALazygodray_FX_BP_C::Diameter_multiplier' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Length_multiplier) == 0x000244, "Member 'ALazygodray_FX_BP_C::Length_multiplier' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Tint_color) == 0x000248, "Member 'ALazygodray_FX_BP_C::Tint_color' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Light_shaft_texture) == 0x000258, "Member 'ALazygodray_FX_BP_C::Light_shaft_texture' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Overall_intensity) == 0x000260, "Member 'ALazygodray_FX_BP_C::Overall_intensity' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Overall_contrast) == 0x000264, "Member 'ALazygodray_FX_BP_C::Overall_contrast' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Light_shaft_strength) == 0x000268, "Member 'ALazygodray_FX_BP_C::Light_shaft_strength' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Light_shaft_amount) == 0x00026C, "Member 'ALazygodray_FX_BP_C::Light_shaft_amount' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Light_shaft_length) == 0x000270, "Member 'ALazygodray_FX_BP_C::Light_shaft_length' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Depth_fade_distance) == 0x000274, "Member 'ALazygodray_FX_BP_C::Depth_fade_distance' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Fesnel_exponent) == 0x000278, "Member 'ALazygodray_FX_BP_C::Fesnel_exponent' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Camera_fading_starting_distance) == 0x00027C, "Member 'ALazygodray_FX_BP_C::Camera_fading_starting_distance' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Camera_fading_transition_range) == 0x000280, "Member 'ALazygodray_FX_BP_C::Camera_fading_transition_range' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Vertical_falloff_midpoint) == 0x000284, "Member 'ALazygodray_FX_BP_C::Vertical_falloff_midpoint' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Vertical_falloff_exponent) == 0x000288, "Member 'ALazygodray_FX_BP_C::Vertical_falloff_exponent' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Vertical_falloff_strength) == 0x00028C, "Member 'ALazygodray_FX_BP_C::Vertical_falloff_strength' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Cylindrical_masking_exponent) == 0x000290, "Member 'ALazygodray_FX_BP_C::Cylindrical_masking_exponent' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Use_lightray_convergent) == 0x000294, "Member 'ALazygodray_FX_BP_C::Use_lightray_convergent' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Lightray_convergent_rate) == 0x000298, "Member 'ALazygodray_FX_BP_C::Lightray_convergent_rate' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Enable_dust_particle__cannot_be_toggled_during_runtime_) == 0x00029C, "Member 'ALazygodray_FX_BP_C::Enable_dust_particle__cannot_be_toggled_during_runtime_' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Particle_color) == 0x0002A0, "Member 'ALazygodray_FX_BP_C::Particle_color' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Amount_multiplier) == 0x0002B0, "Member 'ALazygodray_FX_BP_C::Amount_multiplier' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Size_multiplier) == 0x0002B4, "Member 'ALazygodray_FX_BP_C::Size_multiplier' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Size_minimum_percentage) == 0x0002B8, "Member 'ALazygodray_FX_BP_C::Size_minimum_percentage' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Velocity_multiplier) == 0x0002BC, "Member 'ALazygodray_FX_BP_C::Velocity_multiplier' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Velocity_mininum_percentage) == 0x0002C0, "Member 'ALazygodray_FX_BP_C::Velocity_mininum_percentage' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Spawn_location_vertical_offset) == 0x0002C4, "Member 'ALazygodray_FX_BP_C::Spawn_location_vertical_offset' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Spawn_radius_multiplier) == 0x0002C8, "Member 'ALazygodray_FX_BP_C::Spawn_radius_multiplier' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Spawn_length_multiplier) == 0x0002CC, "Member 'ALazygodray_FX_BP_C::Spawn_length_multiplier' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Revealing_distance) == 0x0002D0, "Member 'ALazygodray_FX_BP_C::Revealing_distance' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Revealing_transition) == 0x0002D4, "Member 'ALazygodray_FX_BP_C::Revealing_transition' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Culling_distance) == 0x0002D8, "Member 'ALazygodray_FX_BP_C::Culling_distance' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Culling_transition) == 0x0002DC, "Member 'ALazygodray_FX_BP_C::Culling_transition' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Enable_spotlight_component__cannot_be_toggled_during_runtime) == 0x0002E0, "Member 'ALazygodray_FX_BP_C::Enable_spotlight_component__cannot_be_toggled_during_runtime' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Light_intensity_in_Lumens) == 0x0002E4, "Member 'ALazygodray_FX_BP_C::Light_intensity_in_Lumens' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Light_source_radius) == 0x0002E8, "Member 'ALazygodray_FX_BP_C::Light_source_radius' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Attenuation_offset) == 0x0002EC, "Member 'ALazygodray_FX_BP_C::Attenuation_offset' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Outer_cone_angle_offset) == 0x0002F0, "Member 'ALazygodray_FX_BP_C::Outer_cone_angle_offset' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Inner_cone_angle) == 0x0002F4, "Member 'ALazygodray_FX_BP_C::Inner_cone_angle' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Smoke_intensity) == 0x0002F8, "Member 'ALazygodray_FX_BP_C::Smoke_intensity' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Smoke_texture) == 0x000300, "Member 'ALazygodray_FX_BP_C::Smoke_texture' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Smoke_texture_scale) == 0x000308, "Member 'ALazygodray_FX_BP_C::Smoke_texture_scale' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Panning_speedX) == 0x00030C, "Member 'ALazygodray_FX_BP_C::Panning_speedX' has a wrong offset!");
static_assert(offsetof(ALazygodray_FX_BP_C, Panning_speedY) == 0x000310, "Member 'ALazygodray_FX_BP_C::Panning_speedY' has a wrong offset!");

}

