#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lighter

#include "Basic.hpp"


namespace SDK::Params
{

// Function lighter.lighter_C.ExecuteUbergraph_lighter
// 0x0020 (0x0020 - 0x0000)
struct Lighter_C_ExecuteUbergraph_lighter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULighterRigAnim_Skeleton_AnimBP_C*      K2Node_DynamicCast_AsLighter_Rig_Anim_Skeleton_Anim_BP; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lighter_C_ExecuteUbergraph_lighter) == 0x000008, "Wrong alignment on Lighter_C_ExecuteUbergraph_lighter");
static_assert(sizeof(Lighter_C_ExecuteUbergraph_lighter) == 0x000020, "Wrong size on Lighter_C_ExecuteUbergraph_lighter");
static_assert(offsetof(Lighter_C_ExecuteUbergraph_lighter, EntryPoint) == 0x000000, "Member 'Lighter_C_ExecuteUbergraph_lighter::EntryPoint' has a wrong offset!");
static_assert(offsetof(Lighter_C_ExecuteUbergraph_lighter, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Lighter_C_ExecuteUbergraph_lighter::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lighter_C_ExecuteUbergraph_lighter, K2Node_DynamicCast_AsLighter_Rig_Anim_Skeleton_Anim_BP) == 0x000010, "Member 'Lighter_C_ExecuteUbergraph_lighter::K2Node_DynamicCast_AsLighter_Rig_Anim_Skeleton_Anim_BP' has a wrong offset!");
static_assert(offsetof(Lighter_C_ExecuteUbergraph_lighter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Lighter_C_ExecuteUbergraph_lighter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Lighter_C_ExecuteUbergraph_lighter, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'Lighter_C_ExecuteUbergraph_lighter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

