#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreenWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadingScreenWI.LoadingScreenWI_C
// 0x0020 (0x02A0 - 0x0280)
class ULoadingScreenWI_C final : public USCTLoadingScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             FailedText;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FullScreen;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Throbber_1;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoadingScreenWI(int32 EntryPoint);
	void Destruct();
	void Construct();
	void Start(const class FString& PendingURL);
	void ToggleSucceededLoadingTextureState(bool Succeeded);

	bool IsLoadedTextureValid(class UTexture2D* Texture) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadingScreenWI_C">();
	}
	static class ULoadingScreenWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreenWI_C>();
	}
};
static_assert(alignof(ULoadingScreenWI_C) == 0x000008, "Wrong alignment on ULoadingScreenWI_C");
static_assert(sizeof(ULoadingScreenWI_C) == 0x0002A0, "Wrong size on ULoadingScreenWI_C");
static_assert(offsetof(ULoadingScreenWI_C, UberGraphFrame) == 0x000280, "Member 'ULoadingScreenWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadingScreenWI_C, FailedText) == 0x000288, "Member 'ULoadingScreenWI_C::FailedText' has a wrong offset!");
static_assert(offsetof(ULoadingScreenWI_C, Image_FullScreen) == 0x000290, "Member 'ULoadingScreenWI_C::Image_FullScreen' has a wrong offset!");
static_assert(offsetof(ULoadingScreenWI_C, Throbber_1) == 0x000298, "Member 'ULoadingScreenWI_C::Throbber_1' has a wrong offset!");

}

