#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootStand_PassengerlogBP

#include "Basic.hpp"

#include "LootStandBP_classes.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "PassengerLogFactType_structs.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass LootStand_PassengerlogBP.LootStand_PassengerlogBP_C
// 0x00A0 (0x0408 - 0x0368)
class ALootStand_PassengerlogBP_C final : public ALootStandBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_LootStand_PassengerlogBP_C;         // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UStaticMeshComponent*                   XrayBillboard;                                     // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   XrayMesh;                                          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionProgressBarCreator*         InteractionProgressBarCreatorSabotage;             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent*                  Interaction_Component_secondary;                   // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UContextStaticMeshComponent*            SabotageContextStaticMesh;                         // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Fake_Loot;                                         // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          PassengerLogIdle;                                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          PassengerLogPickedUp;                              // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPassengerLogFactType                         FactType;                                          // 0x03B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          AlwaysSpawn;                                       // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 FoundPassengerLog;                                 // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APickupActor_PassengerLog_C*            SpawnedLog;                                        // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Generator;                                         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FPassengerLogInformation               SpawnedInformation;                                // 0x03D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPassengerLogGenerator*                 SpawnedGenerator;                                  // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasCreatedPassengerLog;                            // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanCreatePassengerLog;                             // 0x0401(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_LootStand_PassengerlogBP(int32 EntryPoint);
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_2_InteractionSuccessfulDelegate__DelegateSignature();
	void Confirmed_Empty_Or_Item_Looted();
	void BndEvt__Interaction_Component_secondary_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature(const struct FInteractionPayload& Payload, bool WasCancelled);
	void BndEvt__Interaction_Component_secondary_K2Node_ComponentBoundEvent_1_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void BndEvt__Interaction_Component_secondary_K2Node_ComponentBoundEvent_0_InteractionSuccessfulDelegate__DelegateSignature();
	void LootPickedUp_Cosmetic();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void RemoveLogAndPreventInteraction();
	void AutoGrantLoot(class UInventory* Instigator_Inventory);
	void OnCollected();
	void GrantPassengerLogInformation();
	void CreateLogInformation();
	void SabotageLog(const struct FInteractionPayload& Payload);
	void PrintInvalidLogTypeWarning();
	void DisablePassengerLog();
	void CheckDisablePassengerLog();
	void QueryInitializePassengerLog();
	void RenderXray(bool On);
	void PermanentlyDisableInteraction();
	void OnRep_CanCreatePassengerLog();
	void OpenStart_Cosmetic();

	class ASCTPlayerController* TryGetInteractingPlayerController(bool* IsValid) const;
	void TryGetInteractingPlayerState(class ASCTPlayerState** PlayerState, bool* Is_Valid) const;
	bool ShouldCreatePassengerLog() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LootStand_PassengerlogBP_C">();
	}
	static class ALootStand_PassengerlogBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALootStand_PassengerlogBP_C>();
	}
};
static_assert(alignof(ALootStand_PassengerlogBP_C) == 0x000008, "Wrong alignment on ALootStand_PassengerlogBP_C");
static_assert(sizeof(ALootStand_PassengerlogBP_C) == 0x000408, "Wrong size on ALootStand_PassengerlogBP_C");
static_assert(offsetof(ALootStand_PassengerlogBP_C, UberGraphFrame_LootStand_PassengerlogBP_C) == 0x000368, "Member 'ALootStand_PassengerlogBP_C::UberGraphFrame_LootStand_PassengerlogBP_C' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, XrayBillboard) == 0x000370, "Member 'ALootStand_PassengerlogBP_C::XrayBillboard' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, XrayMesh) == 0x000378, "Member 'ALootStand_PassengerlogBP_C::XrayMesh' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, InteractionProgressBarCreatorSabotage) == 0x000380, "Member 'ALootStand_PassengerlogBP_C::InteractionProgressBarCreatorSabotage' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, Interaction_Component_secondary) == 0x000388, "Member 'ALootStand_PassengerlogBP_C::Interaction_Component_secondary' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, SabotageContextStaticMesh) == 0x000390, "Member 'ALootStand_PassengerlogBP_C::SabotageContextStaticMesh' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, Fake_Loot) == 0x000398, "Member 'ALootStand_PassengerlogBP_C::Fake_Loot' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, PassengerLogIdle) == 0x0003A0, "Member 'ALootStand_PassengerlogBP_C::PassengerLogIdle' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, PassengerLogPickedUp) == 0x0003A8, "Member 'ALootStand_PassengerlogBP_C::PassengerLogPickedUp' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, FactType) == 0x0003B0, "Member 'ALootStand_PassengerlogBP_C::FactType' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, AlwaysSpawn) == 0x0003B1, "Member 'ALootStand_PassengerlogBP_C::AlwaysSpawn' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, FoundPassengerLog) == 0x0003B8, "Member 'ALootStand_PassengerlogBP_C::FoundPassengerLog' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, SpawnedLog) == 0x0003C0, "Member 'ALootStand_PassengerlogBP_C::SpawnedLog' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, Generator) == 0x0003C8, "Member 'ALootStand_PassengerlogBP_C::Generator' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, SpawnedInformation) == 0x0003D0, "Member 'ALootStand_PassengerlogBP_C::SpawnedInformation' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, SpawnedGenerator) == 0x0003F8, "Member 'ALootStand_PassengerlogBP_C::SpawnedGenerator' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, HasCreatedPassengerLog) == 0x000400, "Member 'ALootStand_PassengerlogBP_C::HasCreatedPassengerLog' has a wrong offset!");
static_assert(offsetof(ALootStand_PassengerlogBP_C, CanCreatePassengerLog) == 0x000401, "Member 'ALootStand_PassengerlogBP_C::CanCreatePassengerLog' has a wrong offset!");

}

