#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NameCanvasRenderTargetBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NameCanvasRenderTargetBP.NameCanvasRenderTargetBP_C.ExecuteUbergraph_NameCanvasRenderTargetBP
// 0x0060 (0x0060 - 0x0000)
struct NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                K2Node_Event_Canvas;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Width;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Height;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_K2_TextSize_ReturnValue;                  // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP) == 0x000008, "Wrong alignment on NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP");
static_assert(sizeof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP) == 0x000060, "Wrong size on NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, EntryPoint) == 0x000000, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, K2Node_Event_Canvas) == 0x000008, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::K2Node_Event_Canvas' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, K2Node_Event_Width) == 0x000010, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::K2Node_Event_Width' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, K2Node_Event_Height) == 0x000014, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::K2Node_Event_Height' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_K2_TextSize_ReturnValue) == 0x00001C, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_K2_TextSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_BreakVector2D_X) == 0x000024, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00002C, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_MakeVector2D_ReturnValue) == 0x000034, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000040, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_FMax_ReturnValue_1) == 0x000050, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000054, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP, CallFunc_MakeVector2D_ReturnValue_1) == 0x000058, "Member 'NameCanvasRenderTargetBP_C_ExecuteUbergraph_NameCanvasRenderTargetBP::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function NameCanvasRenderTargetBP.NameCanvasRenderTargetBP_C.ReceiveUpdate
// 0x0010 (0x0010 - 0x0000)
struct NameCanvasRenderTargetBP_C_ReceiveUpdate final
{
public:
	class UCanvas*                                Canvas_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Width;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Height;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NameCanvasRenderTargetBP_C_ReceiveUpdate) == 0x000008, "Wrong alignment on NameCanvasRenderTargetBP_C_ReceiveUpdate");
static_assert(sizeof(NameCanvasRenderTargetBP_C_ReceiveUpdate) == 0x000010, "Wrong size on NameCanvasRenderTargetBP_C_ReceiveUpdate");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ReceiveUpdate, Canvas_0) == 0x000000, "Member 'NameCanvasRenderTargetBP_C_ReceiveUpdate::Canvas_0' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ReceiveUpdate, Width) == 0x000008, "Member 'NameCanvasRenderTargetBP_C_ReceiveUpdate::Width' has a wrong offset!");
static_assert(offsetof(NameCanvasRenderTargetBP_C_ReceiveUpdate, Height) == 0x00000C, "Member 'NameCanvasRenderTargetBP_C_ReceiveUpdate::Height' has a wrong offset!");

}

