#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NameCanvasRenderTargetXboxOneBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NameCanvasRenderTargetXboxOneBP.NameCanvasRenderTargetXboxOneBP_C
// 0x0028 (0x0150 - 0x0128)
class UNameCanvasRenderTargetXboxOneBP_C final : public UCanvasRenderTarget2D
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class FString                                 Name_0;                                            // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFont*                                  RenderFont;                                        // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                Canvas;                                            // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NameCanvasRenderTargetXboxOneBP(int32 EntryPoint);
	void ReceiveUpdate(class UCanvas* Canvas_0, int32 Width, int32 Height);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NameCanvasRenderTargetXboxOneBP_C">();
	}
	static class UNameCanvasRenderTargetXboxOneBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNameCanvasRenderTargetXboxOneBP_C>();
	}
};
static_assert(alignof(UNameCanvasRenderTargetXboxOneBP_C) == 0x000008, "Wrong alignment on UNameCanvasRenderTargetXboxOneBP_C");
static_assert(sizeof(UNameCanvasRenderTargetXboxOneBP_C) == 0x000150, "Wrong size on UNameCanvasRenderTargetXboxOneBP_C");
static_assert(offsetof(UNameCanvasRenderTargetXboxOneBP_C, UberGraphFrame) == 0x000128, "Member 'UNameCanvasRenderTargetXboxOneBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNameCanvasRenderTargetXboxOneBP_C, Name_0) == 0x000130, "Member 'UNameCanvasRenderTargetXboxOneBP_C::Name_0' has a wrong offset!");
static_assert(offsetof(UNameCanvasRenderTargetXboxOneBP_C, RenderFont) == 0x000140, "Member 'UNameCanvasRenderTargetXboxOneBP_C::RenderFont' has a wrong offset!");
static_assert(offsetof(UNameCanvasRenderTargetXboxOneBP_C, Canvas) == 0x000148, "Member 'UNameCanvasRenderTargetXboxOneBP_C::Canvas' has a wrong offset!");

}

