#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsSliderWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCT_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsSliderWI.OptionsSliderWI_C
// 0x00C0 (0x0638 - 0x0578)
class UOptionsSliderWI_C : public UControllerSelectionStateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBorder*                                Border_0;                                          // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCM_SubMenuItemContainer_C*             CM_SubMenuItemContainer;                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                SliderBar;                                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SliderTextAmount;                                  // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         SliderValue;                                       // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SliderMin;                                         // 0x05AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SliderMax;                                         // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StepSize;                                          // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   SettingTitleText;                                  // 0x05B8(0x0018)(Edit, BlueprintVisible)
	bool                                          UsePercentDisplay;                                 // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnValueChanged;                                    // 0x05D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMouseCaptureBegin;                               // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMouseCaptureEnd;                                 // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnControllerCaptureBegin;                          // 0x0608(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnControllerCaptureEnd;                            // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Initializing;                                      // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ValueOld;                                          // 0x062C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ControllerCaptureEndRequested;                     // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnValueChanged__DelegateSignature(float Value);
	void OnMouseCaptureBegin__DelegateSignature();
	void OnMouseCaptureEnd__DelegateSignature();
	void OnControllerCaptureBegin__DelegateSignature();
	void OnControllerCaptureEnd__DelegateSignature();
	void ExecuteUbergraph_OptionsSliderWI(int32 EntryPoint);
	void Destruct();
	void K2_EventOnSetNormalCosmetics();
	void K2_EventOnSetHoveredCosmetics();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__SliderBar_K2Node_ComponentBoundEvent_4_OnControllerCaptureEndEvent__DelegateSignature();
	void BndEvt__SliderBar_K2Node_ComponentBoundEvent_3_OnControllerCaptureBeginEvent__DelegateSignature();
	void BndEvt__SliderBar_K2Node_ComponentBoundEvent_2_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__SliderBar_K2Node_ComponentBoundEvent_1_OnMouseCaptureBeginEvent__DelegateSignature();
	void BndEvt__SliderBar_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void UpdateSliderTextValue();
	void SetSliderValue(float SliderValue_0);
	void InitializeSlider(float SliderValue_0);
	struct FEventReply On_Mouse_Over(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Get_Slider_Bar_ValueAsFloat(float* OutValue);
	void SetSliderBarValueByFloat(float InValue);
	void Get_Slider_Bar_ValueAsInt(int32* OutValue);
	void SetSliderBarValueByInt(int32 InValue);
	void ResetSliderValue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsSliderWI_C">();
	}
	static class UOptionsSliderWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsSliderWI_C>();
	}
};
static_assert(alignof(UOptionsSliderWI_C) == 0x000008, "Wrong alignment on UOptionsSliderWI_C");
static_assert(sizeof(UOptionsSliderWI_C) == 0x000638, "Wrong size on UOptionsSliderWI_C");
static_assert(offsetof(UOptionsSliderWI_C, UberGraphFrame) == 0x000578, "Member 'UOptionsSliderWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, Border_0) == 0x000580, "Member 'UOptionsSliderWI_C::Border_0' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, CM_SubMenuItemContainer) == 0x000588, "Member 'UOptionsSliderWI_C::CM_SubMenuItemContainer' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, SliderBar) == 0x000590, "Member 'UOptionsSliderWI_C::SliderBar' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, SliderTextAmount) == 0x000598, "Member 'UOptionsSliderWI_C::SliderTextAmount' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, TitleText) == 0x0005A0, "Member 'UOptionsSliderWI_C::TitleText' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, SliderValue) == 0x0005A8, "Member 'UOptionsSliderWI_C::SliderValue' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, SliderMin) == 0x0005AC, "Member 'UOptionsSliderWI_C::SliderMin' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, SliderMax) == 0x0005B0, "Member 'UOptionsSliderWI_C::SliderMax' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, StepSize) == 0x0005B4, "Member 'UOptionsSliderWI_C::StepSize' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, SettingTitleText) == 0x0005B8, "Member 'UOptionsSliderWI_C::SettingTitleText' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, UsePercentDisplay) == 0x0005D0, "Member 'UOptionsSliderWI_C::UsePercentDisplay' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, OnValueChanged) == 0x0005D8, "Member 'UOptionsSliderWI_C::OnValueChanged' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, OnMouseCaptureBegin) == 0x0005E8, "Member 'UOptionsSliderWI_C::OnMouseCaptureBegin' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, OnMouseCaptureEnd) == 0x0005F8, "Member 'UOptionsSliderWI_C::OnMouseCaptureEnd' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, OnControllerCaptureBegin) == 0x000608, "Member 'UOptionsSliderWI_C::OnControllerCaptureBegin' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, OnControllerCaptureEnd) == 0x000618, "Member 'UOptionsSliderWI_C::OnControllerCaptureEnd' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, Initializing) == 0x000628, "Member 'UOptionsSliderWI_C::Initializing' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, ValueOld) == 0x00062C, "Member 'UOptionsSliderWI_C::ValueOld' has a wrong offset!");
static_assert(offsetof(UOptionsSliderWI_C, ControllerCaptureEndRequested) == 0x000630, "Member 'UOptionsSliderWI_C::ControllerCaptureEndRequested' has a wrong offset!");

}

