#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsDropdownWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function OptionsDropdownWI.OptionsDropdownWI_C.OnSelectionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature final
{
public:
	int32                                         SelectionIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SelectedItem;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature) == 0x000008, "Wrong alignment on OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature");
static_assert(sizeof(OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature) == 0x000020, "Wrong size on OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature");
static_assert(offsetof(OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature, SelectionIndex) == 0x000000, "Member 'OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature::SelectionIndex' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature, SelectedItem) == 0x000008, "Member 'OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature, SelectionType) == 0x000018, "Member 'OptionsDropdownWI_C_OnSelectionChanged__DelegateSignature::SelectionType' has a wrong offset!");

// Function OptionsDropdownWI.OptionsDropdownWI_C.ExecuteUbergraph_OptionsDropdownWI
// 0x0068 (0x0068 - 0x0000)
struct OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI) == 0x000008, "Wrong alignment on OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI");
static_assert(sizeof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI) == 0x000068, "Wrong size on OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, EntryPoint) == 0x000000, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, Temp_int_Array_Index_Variable) == 0x000004, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, K2Node_Event_IsDesignTime) == 0x000008, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, CallFunc_Array_Get_Item) == 0x000010, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, K2Node_ComponentBoundEvent_SelectedItem) == 0x000040, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, K2Node_ComponentBoundEvent_SelectionType) == 0x000050, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI, CallFunc_Array_Find_ReturnValue) == 0x000064, "Member 'OptionsDropdownWI_C_ExecuteUbergraph_OptionsDropdownWI::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function OptionsDropdownWI.OptionsDropdownWI_C.BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct OptionsDropdownWI_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsDropdownWI_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on OptionsDropdownWI_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(OptionsDropdownWI_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on OptionsDropdownWI_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(OptionsDropdownWI_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'OptionsDropdownWI_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(OptionsDropdownWI_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'OptionsDropdownWI_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function OptionsDropdownWI.OptionsDropdownWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct OptionsDropdownWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsDropdownWI_C_PreConstruct) == 0x000001, "Wrong alignment on OptionsDropdownWI_C_PreConstruct");
static_assert(sizeof(OptionsDropdownWI_C_PreConstruct) == 0x000001, "Wrong size on OptionsDropdownWI_C_PreConstruct");
static_assert(offsetof(OptionsDropdownWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'OptionsDropdownWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function OptionsDropdownWI.OptionsDropdownWI_C.Set Selected Dropdown
// 0x0004 (0x0004 - 0x0000)
struct OptionsDropdownWI_C_Set_Selected_Dropdown final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsDropdownWI_C_Set_Selected_Dropdown) == 0x000004, "Wrong alignment on OptionsDropdownWI_C_Set_Selected_Dropdown");
static_assert(sizeof(OptionsDropdownWI_C_Set_Selected_Dropdown) == 0x000004, "Wrong size on OptionsDropdownWI_C_Set_Selected_Dropdown");
static_assert(offsetof(OptionsDropdownWI_C_Set_Selected_Dropdown, Index_0) == 0x000000, "Member 'OptionsDropdownWI_C_Set_Selected_Dropdown::Index_0' has a wrong offset!");

// Function OptionsDropdownWI.OptionsDropdownWI_C.InitializeDropdown
// 0x0004 (0x0004 - 0x0000)
struct OptionsDropdownWI_C_InitializeDropdown final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsDropdownWI_C_InitializeDropdown) == 0x000004, "Wrong alignment on OptionsDropdownWI_C_InitializeDropdown");
static_assert(sizeof(OptionsDropdownWI_C_InitializeDropdown) == 0x000004, "Wrong size on OptionsDropdownWI_C_InitializeDropdown");
static_assert(offsetof(OptionsDropdownWI_C_InitializeDropdown, Index_0) == 0x000000, "Member 'OptionsDropdownWI_C_InitializeDropdown::Index_0' has a wrong offset!");

}

