#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsTabButtonWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OptionsTabButtonWI.OptionsTabButtonWI_C.ExecuteUbergraph_OptionsTabButtonWI
// 0x0398 (0x0398 - 0x0000)
struct OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0068(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0090(0x0088)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0120(0x0278)()
};
static_assert(alignof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI) == 0x000008, "Wrong alignment on OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI");
static_assert(sizeof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI) == 0x000398, "Wrong size on OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI");
static_assert(offsetof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI, EntryPoint) == 0x000000, "Member 'OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI, CallFunc_MakeVector2D_ReturnValue_1) == 0x000060, "Member 'OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI, K2Node_MakeStruct_SlateColor_2) == 0x000068, "Member 'OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI, K2Node_MakeStruct_SlateBrush) == 0x000090, "Member 'OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI, K2Node_Event_IsDesignTime) == 0x000118, "Member 'OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI, K2Node_MakeStruct_ButtonStyle) == 0x000120, "Member 'OptionsTabButtonWI_C_ExecuteUbergraph_OptionsTabButtonWI::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");

// Function OptionsTabButtonWI.OptionsTabButtonWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct OptionsTabButtonWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsTabButtonWI_C_PreConstruct) == 0x000001, "Wrong alignment on OptionsTabButtonWI_C_PreConstruct");
static_assert(sizeof(OptionsTabButtonWI_C_PreConstruct) == 0x000001, "Wrong size on OptionsTabButtonWI_C_PreConstruct");
static_assert(offsetof(OptionsTabButtonWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'OptionsTabButtonWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function OptionsTabButtonWI.OptionsTabButtonWI_C.GetNavigationWidget
// 0x0008 (0x0008 - 0x0000)
struct OptionsTabButtonWI_C_GetNavigationWidget final
{
public:
	class UWidget*                                NavigationWidget;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsTabButtonWI_C_GetNavigationWidget) == 0x000008, "Wrong alignment on OptionsTabButtonWI_C_GetNavigationWidget");
static_assert(sizeof(OptionsTabButtonWI_C_GetNavigationWidget) == 0x000008, "Wrong size on OptionsTabButtonWI_C_GetNavigationWidget");
static_assert(offsetof(OptionsTabButtonWI_C_GetNavigationWidget, NavigationWidget) == 0x000000, "Member 'OptionsTabButtonWI_C_GetNavigationWidget::NavigationWidget' has a wrong offset!");

// Function OptionsTabButtonWI.OptionsTabButtonWI_C.SetNavigationForDirection
// 0x0010 (0x0010 - 0x0000)
struct OptionsTabButtonWI_C_SetNavigationForDirection final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                WidgetTarget;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsTabButtonWI_C_SetNavigationForDirection) == 0x000008, "Wrong alignment on OptionsTabButtonWI_C_SetNavigationForDirection");
static_assert(sizeof(OptionsTabButtonWI_C_SetNavigationForDirection) == 0x000010, "Wrong size on OptionsTabButtonWI_C_SetNavigationForDirection");
static_assert(offsetof(OptionsTabButtonWI_C_SetNavigationForDirection, Direction) == 0x000000, "Member 'OptionsTabButtonWI_C_SetNavigationForDirection::Direction' has a wrong offset!");
static_assert(offsetof(OptionsTabButtonWI_C_SetNavigationForDirection, WidgetTarget) == 0x000008, "Member 'OptionsTabButtonWI_C_SetNavigationForDirection::WidgetTarget' has a wrong offset!");

}

