#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsSliderWI

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OptionsSliderWI.OptionsSliderWI_C.OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsSliderWI_C_OnValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsSliderWI_C_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on OptionsSliderWI_C_OnValueChanged__DelegateSignature");
static_assert(sizeof(OptionsSliderWI_C_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on OptionsSliderWI_C_OnValueChanged__DelegateSignature");
static_assert(offsetof(OptionsSliderWI_C_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'OptionsSliderWI_C_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.ExecuteUbergraph_OptionsSliderWI
// 0x0170 (0x0170 - 0x0000)
struct OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_GridSnap_Float_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0040(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0048(0x0008)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0050(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0088(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00F8(0x0070)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI) == 0x000008, "Wrong alignment on OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI");
static_assert(sizeof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI) == 0x000170, "Wrong size on OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, EntryPoint) == 0x000000, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, K2Node_ComponentBoundEvent_Value) == 0x000004, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, Temp_delegate_Variable) == 0x000008, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, CallFunc_GridSnap_Float_ReturnValue) == 0x000018, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::CallFunc_GridSnap_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, CallFunc_GridSnap_Float_ReturnValue_1) == 0x00001C, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::CallFunc_GridSnap_Float_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, Temp_struct_Variable) == 0x000028, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, CallFunc_PostEvent_ReturnValue) == 0x000038, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, K2Node_Event_InFocusEvent_1) == 0x000040, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, K2Node_Event_InFocusEvent) == 0x000048, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, K2Node_Event_MyGeometry) == 0x000050, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, K2Node_Event_MouseEvent_1) == 0x000088, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, K2Node_Event_MouseEvent) == 0x0000F8, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI, K2Node_Event_IsDesignTime) == 0x000168, "Member 'OptionsSliderWI_C_ExecuteUbergraph_OptionsSliderWI::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct OptionsSliderWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsSliderWI_C_PreConstruct) == 0x000001, "Wrong alignment on OptionsSliderWI_C_PreConstruct");
static_assert(sizeof(OptionsSliderWI_C_PreConstruct) == 0x000001, "Wrong size on OptionsSliderWI_C_PreConstruct");
static_assert(offsetof(OptionsSliderWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'OptionsSliderWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct OptionsSliderWI_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsSliderWI_C_OnMouseLeave) == 0x000008, "Wrong alignment on OptionsSliderWI_C_OnMouseLeave");
static_assert(sizeof(OptionsSliderWI_C_OnMouseLeave) == 0x000070, "Wrong size on OptionsSliderWI_C_OnMouseLeave");
static_assert(offsetof(OptionsSliderWI_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'OptionsSliderWI_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct OptionsSliderWI_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsSliderWI_C_OnMouseEnter) == 0x000008, "Wrong alignment on OptionsSliderWI_C_OnMouseEnter");
static_assert(sizeof(OptionsSliderWI_C_OnMouseEnter) == 0x0000A8, "Wrong size on OptionsSliderWI_C_OnMouseEnter");
static_assert(offsetof(OptionsSliderWI_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'OptionsSliderWI_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'OptionsSliderWI_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct OptionsSliderWI_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(OptionsSliderWI_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on OptionsSliderWI_C_OnRemovedFromFocusPath");
static_assert(sizeof(OptionsSliderWI_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on OptionsSliderWI_C_OnRemovedFromFocusPath");
static_assert(offsetof(OptionsSliderWI_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'OptionsSliderWI_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct OptionsSliderWI_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(OptionsSliderWI_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on OptionsSliderWI_C_OnAddedToFocusPath");
static_assert(sizeof(OptionsSliderWI_C_OnAddedToFocusPath) == 0x000008, "Wrong size on OptionsSliderWI_C_OnAddedToFocusPath");
static_assert(offsetof(OptionsSliderWI_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'OptionsSliderWI_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.BndEvt__SliderBar_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsSliderWI_C_BndEvt__SliderBar_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsSliderWI_C_BndEvt__SliderBar_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on OptionsSliderWI_C_BndEvt__SliderBar_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(OptionsSliderWI_C_BndEvt__SliderBar_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on OptionsSliderWI_C_BndEvt__SliderBar_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(OptionsSliderWI_C_BndEvt__SliderBar_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'OptionsSliderWI_C_BndEvt__SliderBar_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.UpdateSliderTextValue
// 0x0108 (0x0108 - 0x0000)
struct OptionsSliderWI_C_UpdateSliderTextValue final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00F0(0x0018)()
};
static_assert(alignof(OptionsSliderWI_C_UpdateSliderTextValue) == 0x000008, "Wrong alignment on OptionsSliderWI_C_UpdateSliderTextValue");
static_assert(sizeof(OptionsSliderWI_C_UpdateSliderTextValue) == 0x000108, "Wrong size on OptionsSliderWI_C_UpdateSliderTextValue");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, Temp_bool_Variable) == 0x000000, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, CallFunc_GetValue_ReturnValue) == 0x000004, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, CallFunc_GetValue_ReturnValue_1) == 0x000068, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, CallFunc_GridSnap_Float_ReturnValue) == 0x00006C, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::CallFunc_GridSnap_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, CallFunc_Conv_FloatToText_ReturnValue) == 0x000070, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, K2Node_MakeArray_Array) == 0x0000C8, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_UpdateSliderTextValue, K2Node_Select_Default) == 0x0000F0, "Member 'OptionsSliderWI_C_UpdateSliderTextValue::K2Node_Select_Default' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.SetSliderValue
// 0x0008 (0x0008 - 0x0000)
struct OptionsSliderWI_C_SetSliderValue final
{
public:
	float                                         SliderValue_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsSliderWI_C_SetSliderValue) == 0x000004, "Wrong alignment on OptionsSliderWI_C_SetSliderValue");
static_assert(sizeof(OptionsSliderWI_C_SetSliderValue) == 0x000008, "Wrong size on OptionsSliderWI_C_SetSliderValue");
static_assert(offsetof(OptionsSliderWI_C_SetSliderValue, SliderValue_0) == 0x000000, "Member 'OptionsSliderWI_C_SetSliderValue::SliderValue_0' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_SetSliderValue, CallFunc_GridSnap_Float_ReturnValue) == 0x000004, "Member 'OptionsSliderWI_C_SetSliderValue::CallFunc_GridSnap_Float_ReturnValue' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.InitializeSlider
// 0x0004 (0x0004 - 0x0000)
struct OptionsSliderWI_C_InitializeSlider final
{
public:
	float                                         SliderValue_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsSliderWI_C_InitializeSlider) == 0x000004, "Wrong alignment on OptionsSliderWI_C_InitializeSlider");
static_assert(sizeof(OptionsSliderWI_C_InitializeSlider) == 0x000004, "Wrong size on OptionsSliderWI_C_InitializeSlider");
static_assert(offsetof(OptionsSliderWI_C_InitializeSlider, SliderValue_0) == 0x000000, "Member 'OptionsSliderWI_C_InitializeSlider::SliderValue_0' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.On Mouse Over
// 0x0218 (0x0218 - 0x0000)
struct OptionsSliderWI_C_On_Mouse_Over final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)(UObjectWrapper)
};
static_assert(alignof(OptionsSliderWI_C_On_Mouse_Over) == 0x000008, "Wrong alignment on OptionsSliderWI_C_On_Mouse_Over");
static_assert(sizeof(OptionsSliderWI_C_On_Mouse_Over) == 0x000218, "Wrong size on OptionsSliderWI_C_On_Mouse_Over");
static_assert(offsetof(OptionsSliderWI_C_On_Mouse_Over, MyGeometry) == 0x000000, "Member 'OptionsSliderWI_C_On_Mouse_Over::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_On_Mouse_Over, MouseEvent) == 0x000038, "Member 'OptionsSliderWI_C_On_Mouse_Over::MouseEvent' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_On_Mouse_Over, ReturnValue) == 0x0000A8, "Member 'OptionsSliderWI_C_On_Mouse_Over::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_On_Mouse_Over, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'OptionsSliderWI_C_On_Mouse_Over::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.Get Slider Bar ValueAsFloat
// 0x0008 (0x0008 - 0x0000)
struct OptionsSliderWI_C_Get_Slider_Bar_ValueAsFloat final
{
public:
	float                                         OutValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsSliderWI_C_Get_Slider_Bar_ValueAsFloat) == 0x000004, "Wrong alignment on OptionsSliderWI_C_Get_Slider_Bar_ValueAsFloat");
static_assert(sizeof(OptionsSliderWI_C_Get_Slider_Bar_ValueAsFloat) == 0x000008, "Wrong size on OptionsSliderWI_C_Get_Slider_Bar_ValueAsFloat");
static_assert(offsetof(OptionsSliderWI_C_Get_Slider_Bar_ValueAsFloat, OutValue) == 0x000000, "Member 'OptionsSliderWI_C_Get_Slider_Bar_ValueAsFloat::OutValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_Get_Slider_Bar_ValueAsFloat, CallFunc_GetValue_ReturnValue) == 0x000004, "Member 'OptionsSliderWI_C_Get_Slider_Bar_ValueAsFloat::CallFunc_GetValue_ReturnValue' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.SetSliderBarValueByFloat
// 0x0020 (0x0020 - 0x0000)
struct OptionsSliderWI_C_SetSliderBarValueByFloat final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0008(0x0018)()
};
static_assert(alignof(OptionsSliderWI_C_SetSliderBarValueByFloat) == 0x000008, "Wrong alignment on OptionsSliderWI_C_SetSliderBarValueByFloat");
static_assert(sizeof(OptionsSliderWI_C_SetSliderBarValueByFloat) == 0x000020, "Wrong size on OptionsSliderWI_C_SetSliderBarValueByFloat");
static_assert(offsetof(OptionsSliderWI_C_SetSliderBarValueByFloat, InValue) == 0x000000, "Member 'OptionsSliderWI_C_SetSliderBarValueByFloat::InValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_SetSliderBarValueByFloat, CallFunc_Conv_FloatToText_ReturnValue) == 0x000008, "Member 'OptionsSliderWI_C_SetSliderBarValueByFloat::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.Get Slider Bar ValueAsInt
// 0x000C (0x000C - 0x0000)
struct OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt final
{
public:
	int32                                         OutValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Slider_Bar_ValueAsFloat_OutValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt) == 0x000004, "Wrong alignment on OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt");
static_assert(sizeof(OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt) == 0x00000C, "Wrong size on OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt");
static_assert(offsetof(OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt, OutValue) == 0x000000, "Member 'OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt::OutValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt, CallFunc_Get_Slider_Bar_ValueAsFloat_OutValue) == 0x000004, "Member 'OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt::CallFunc_Get_Slider_Bar_ValueAsFloat_OutValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt, CallFunc_FTrunc_ReturnValue) == 0x000008, "Member 'OptionsSliderWI_C_Get_Slider_Bar_ValueAsInt::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function OptionsSliderWI.OptionsSliderWI_C.SetSliderBarValueByInt
// 0x0008 (0x0008 - 0x0000)
struct OptionsSliderWI_C_SetSliderBarValueByInt final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsSliderWI_C_SetSliderBarValueByInt) == 0x000004, "Wrong alignment on OptionsSliderWI_C_SetSliderBarValueByInt");
static_assert(sizeof(OptionsSliderWI_C_SetSliderBarValueByInt) == 0x000008, "Wrong size on OptionsSliderWI_C_SetSliderBarValueByInt");
static_assert(offsetof(OptionsSliderWI_C_SetSliderBarValueByInt, InValue) == 0x000000, "Member 'OptionsSliderWI_C_SetSliderBarValueByInt::InValue' has a wrong offset!");
static_assert(offsetof(OptionsSliderWI_C_SetSliderBarValueByInt, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'OptionsSliderWI_C_SetSliderBarValueByInt::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

}

