#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OtherPersonoidsList

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function OtherPersonoidsList.OtherPersonoidsList_C.ExecuteUbergraph_OtherPersonoidsList
// 0x0020 (0x0020 - 0x0000)
struct OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomGameSettingsGIS*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ArePersonoidsHidden_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList) == 0x000008, "Wrong alignment on OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList");
static_assert(sizeof(OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList) == 0x000020, "Wrong size on OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList");
static_assert(offsetof(OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList, EntryPoint) == 0x000000, "Member 'OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList::EntryPoint' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList, CallFunc_ArePersonoidsHidden_ReturnValue) == 0x000018, "Member 'OtherPersonoidsList_C_ExecuteUbergraph_OtherPersonoidsList::CallFunc_ArePersonoidsHidden_ReturnValue' has a wrong offset!");

// Function OtherPersonoidsList.OtherPersonoidsList_C.CacheOtherPersonoidsPlayerStates
// 0x00C8 (0x00C8 - 0x0000)
struct OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController*                   CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPersonoidInformationPlayerData        CallFunc_Array_Get_Item;                           // 0x0020(0x0088)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState_MatchBP_C*              CallFunc_GetPlayerState_Array_Element;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates) == 0x000008, "Wrong alignment on OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates");
static_assert(sizeof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates) == 0x0000C8, "Wrong size on OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, Temp_int_Array_Index_Variable) == 0x000000, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller) == 0x000010, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_GetSCTPlayerController_AsSCTPlayer_Controller' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_GetPlayerControllerFromID_ReturnValue) == 0x000018, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_GetPlayerControllerFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_Array_Get_Item) == 0x000020, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000AD, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_GetPlayerState_Array_Element) == 0x0000B0, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_GetPlayerState_Array_Element' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates, CallFunc_BooleanAND_ReturnValue) == 0x0000C0, "Member 'OtherPersonoidsList_C_CacheOtherPersonoidsPlayerStates::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function OtherPersonoidsList.OtherPersonoidsList_C.InitializeOtherPersonoids
// 0x0030 (0x0030 - 0x0000)
struct OtherPersonoidsList_C_InitializeOtherPersonoids final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOtherPersonoidsEntry_C*                CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OtherPersonoidsList_C_InitializeOtherPersonoids) == 0x000008, "Wrong alignment on OtherPersonoidsList_C_InitializeOtherPersonoids");
static_assert(sizeof(OtherPersonoidsList_C_InitializeOtherPersonoids) == 0x000030, "Wrong size on OtherPersonoidsList_C_InitializeOtherPersonoids");
static_assert(offsetof(OtherPersonoidsList_C_InitializeOtherPersonoids, Temp_int_Array_Index_Variable) == 0x000000, "Member 'OtherPersonoidsList_C_InitializeOtherPersonoids::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_InitializeOtherPersonoids, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'OtherPersonoidsList_C_InitializeOtherPersonoids::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_InitializeOtherPersonoids, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'OtherPersonoidsList_C_InitializeOtherPersonoids::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_InitializeOtherPersonoids, CallFunc_Create_ReturnValue) == 0x000010, "Member 'OtherPersonoidsList_C_InitializeOtherPersonoids::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_InitializeOtherPersonoids, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'OtherPersonoidsList_C_InitializeOtherPersonoids::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_InitializeOtherPersonoids, CallFunc_Array_Get_Item) == 0x000020, "Member 'OtherPersonoidsList_C_InitializeOtherPersonoids::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_InitializeOtherPersonoids, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'OtherPersonoidsList_C_InitializeOtherPersonoids::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPersonoidsList_C_InitializeOtherPersonoids, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'OtherPersonoidsList_C_InitializeOtherPersonoids::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

