#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OverdoseSyringeGA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ContextItem_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass OverdoseSyringeGA.OverdoseSyringeGA_C
// 0x0038 (0x0478 - 0x0440)
class UOverdoseSyringeGA_C final : public UContextItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AEquipablePower_FireExtinguisher_C*     EquipablePower_FireExtinguisher;                   // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             LocalGrabbed;                                      // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      TargetCharacter;                                   // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeToCommit;                                      // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             LocalGrabbing;                                     // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OverdoseSyringeGA(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void MulticastStopGrab(class AActor* Owning_Actor);
	void InterpTransforms();
	void K2_ActivateAbility();
	void Audio_Spray_Foam_Stop();
	void Start();
	void Cancelled();
	void Completed();
	void MulticastStartGrab(class ACharacter* GrabbedCharacter, const struct FTransform& TargetTransform, class AActor* OwningActor);
	void Audio_Spray_Foam();
	void OnFinish_DCBC0D2443B3B10F420F1EBF515BAC89();
	void OnCompleted_431DE8EA4540A17BFF882785F226C0E4();
	void OnBlendOut_431DE8EA4540A17BFF882785F226C0E4();
	void OnInterrupted_431DE8EA4540A17BFF882785F226C0E4();
	void OnCancelled_431DE8EA4540A17BFF882785F226C0E4();
	void OnRelease_950F9AE4413484E8498DA2B3CF8C6B89(float TimeHeld);
	void IgnoreCollision(class ACharacter* GrabbedActor, class AActor* OwningActor);
	void EnableCollision(class ACharacter* GrabbedActor, class AActor* OwningActor);
	void CalculateTargetTransforms(class AActor* GrabbingActor, class AActor* GrabbedActor, struct FVector* TargetLocation, struct FRotator* TargetRotation);
	void GiveScore();
	void ServerCompleted();
	void ClientCompleted();
	void ServerClientCompleted();
	void ServerStart();
	void ServerClientStart();
	void ClientStart();
	void ServerClientDoCleanup();
	void ServerCancelled();
	void ClientCancelled();
	void ServerClientCancelled();
	void ClientDoCleanup();
	void ServerDoCleanup();
	void Player_State_Add_Syringe_Kill(class ACharacterSCTBP_C* Character);
	void StartGrabLogic(class ACharacter* Grabbed, class AActor* Grabbing);
	void StopGrabLogic();
	void OnTargetBecameUnconscious();
	void AddKarmaScorePersonoidOverdose();

	void GetTarget(class UAbilitySystemComponent** Target) const;
	struct FVector GetKillImpulseVector() const;
	bool IsSelfPersonoid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OverdoseSyringeGA_C">();
	}
	static class UOverdoseSyringeGA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverdoseSyringeGA_C>();
	}
};
static_assert(alignof(UOverdoseSyringeGA_C) == 0x000008, "Wrong alignment on UOverdoseSyringeGA_C");
static_assert(sizeof(UOverdoseSyringeGA_C) == 0x000478, "Wrong size on UOverdoseSyringeGA_C");
static_assert(offsetof(UOverdoseSyringeGA_C, UberGraphFrame) == 0x000440, "Member 'UOverdoseSyringeGA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOverdoseSyringeGA_C, EquipablePower_FireExtinguisher) == 0x000448, "Member 'UOverdoseSyringeGA_C::EquipablePower_FireExtinguisher' has a wrong offset!");
static_assert(offsetof(UOverdoseSyringeGA_C, LocalGrabbed) == 0x000450, "Member 'UOverdoseSyringeGA_C::LocalGrabbed' has a wrong offset!");
static_assert(offsetof(UOverdoseSyringeGA_C, TargetCharacter) == 0x000458, "Member 'UOverdoseSyringeGA_C::TargetCharacter' has a wrong offset!");
static_assert(offsetof(UOverdoseSyringeGA_C, TargetASC) == 0x000460, "Member 'UOverdoseSyringeGA_C::TargetASC' has a wrong offset!");
static_assert(offsetof(UOverdoseSyringeGA_C, TimeToCommit) == 0x000468, "Member 'UOverdoseSyringeGA_C::TimeToCommit' has a wrong offset!");
static_assert(offsetof(UOverdoseSyringeGA_C, LocalGrabbing) == 0x000470, "Member 'UOverdoseSyringeGA_C::LocalGrabbing' has a wrong offset!");

}

