#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OxygenKitHolder_Remaints

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass OxygenKitHolder_Remaints.OxygenKitHolder_Remaints_C
// 0x0038 (0x0258 - 0x0220)
class AOxygenKitHolder_Remaints_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UAkComponent*                           Ak;                                                // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Location_Alpha_A8874E77496B4B0E790624800DA02000;   // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Location__Direction_A8874E77496B4B0E790624800DA02000; // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Location;                                          // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OxygenKitHolder_Remaints(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Location__UpdateFunc();
	void Location__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OxygenKitHolder_Remaints_C">();
	}
	static class AOxygenKitHolder_Remaints_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOxygenKitHolder_Remaints_C>();
	}
};
static_assert(alignof(AOxygenKitHolder_Remaints_C) == 0x000008, "Wrong alignment on AOxygenKitHolder_Remaints_C");
static_assert(sizeof(AOxygenKitHolder_Remaints_C) == 0x000258, "Wrong size on AOxygenKitHolder_Remaints_C");
static_assert(offsetof(AOxygenKitHolder_Remaints_C, UberGraphFrame) == 0x000220, "Member 'AOxygenKitHolder_Remaints_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AOxygenKitHolder_Remaints_C, Ak) == 0x000228, "Member 'AOxygenKitHolder_Remaints_C::Ak' has a wrong offset!");
static_assert(offsetof(AOxygenKitHolder_Remaints_C, StaticMesh1) == 0x000230, "Member 'AOxygenKitHolder_Remaints_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AOxygenKitHolder_Remaints_C, StaticMesh) == 0x000238, "Member 'AOxygenKitHolder_Remaints_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AOxygenKitHolder_Remaints_C, DefaultSceneRoot) == 0x000240, "Member 'AOxygenKitHolder_Remaints_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AOxygenKitHolder_Remaints_C, Location_Alpha_A8874E77496B4B0E790624800DA02000) == 0x000248, "Member 'AOxygenKitHolder_Remaints_C::Location_Alpha_A8874E77496B4B0E790624800DA02000' has a wrong offset!");
static_assert(offsetof(AOxygenKitHolder_Remaints_C, Location__Direction_A8874E77496B4B0E790624800DA02000) == 0x00024C, "Member 'AOxygenKitHolder_Remaints_C::Location__Direction_A8874E77496B4B0E790624800DA02000' has a wrong offset!");
static_assert(offsetof(AOxygenKitHolder_Remaints_C, Location) == 0x000250, "Member 'AOxygenKitHolder_Remaints_C::Location' has a wrong offset!");

}

