#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OxygenOutletBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function OxygenOutletBP.OxygenOutletBP_C.ExecuteUbergraph_OxygenOutletBP
// 0x05C0 (0x05C0 - 0x0000)
struct OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class UParticleSystem*                        Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UCustomGameSettingsGIS*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0050(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetOxygenCanisterMultiplier_ReturnValue;  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x007C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0090(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_4;              // 0x00B8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_3;              // 0x00E8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled_1;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Character_1;                    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0128(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0168(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component_1;    // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_2;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsNoOneInside_NoOneInside;             // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0264(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item_1;                         // 0x0270(0x0030)(IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_RotatorToString_ReturnValue;         // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_CustomEvent_Character;                      // 0x0368(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_3;            // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_4;                            // 0x0380(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_396[0x2];                                      // 0x0396(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_2;              // 0x0398(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_1;              // 0x03C8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled;           // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Get_Oxygen_Amount_To_Add_From_Power_Percent_amount; // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message_1;                      // 0x0408(0x0018)()
	class FText                                   K2Node_CustomEvent_Message;                        // 0x0420(0x0018)()
	bool                                          K2Node_CustomEvent_Transfer;                       // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_Select_Default;                             // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_6;               // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A[0x6];                                      // 0x044A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload;                // 0x0450(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x0480(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_5;                            // 0x0490(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x04A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x04B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_7;               // 0x04B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B7[0x1];                                      // 0x04B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_6;                            // 0x04B8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_8;               // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CD[0x3];                                      // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x04D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x04E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ShouldShow;             // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPOI_WI_OxygenOutlet_C*                 K2Node_DynamicCast_AsPOI_WI_Oxygen_Outlet;         // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6;                          // 0x0504(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0518(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0524(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_6;                // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP) == 0x000010, "Wrong alignment on OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP");
static_assert(sizeof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP) == 0x0005C0, "Wrong size on OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, EntryPoint) == 0x000000, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_struct_Variable) == 0x000008, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_object_Variable) == 0x000018, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_object_Variable_1) == 0x000020, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_struct_Variable_1) == 0x000028, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_delegate_Variable) == 0x000038, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_delegate_Variable_1) == 0x000050, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_GetOxygenCanisterMultiplier_ReturnValue) == 0x000060, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_GetOxygenCanisterMultiplier_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000064, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_struct_Variable_2) == 0x000068, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000078, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_HasAuthority_ReturnValue) == 0x000079, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_delegate_Variable_2) == 0x00007C, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x00008C, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_struct_Variable_3) == 0x000090, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0000A0, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Lerp_ReturnValue) == 0x0000A4, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_PostAkEvent_ReturnValue) == 0x0000A8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_HasAuthority_ReturnValue_1) == 0x0000AC, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_bool_Variable) == 0x0000B4, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_payload_4) == 0x0000B8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_payload_4' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_payload_3) == 0x0000E8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_payload_3' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_wasCancelled_1) == 0x000118, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_wasCancelled_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_CustomEvent_Character_1) == 0x000120, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_delegate_Variable_3) == 0x000128, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000138, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000148, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000150, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000158, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000160, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_bFromSweep) == 0x000164, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_SweepResult) == 0x000168, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001F8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_OtherActor) == 0x000200, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_OtherComp) == 0x000208, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000210, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000218, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_AsSkeletal_Mesh_Component_1) == 0x000228, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_AsSkeletal_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_bSuccess_2) == 0x000230, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_GetOwner_ReturnValue) == 0x000238, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_GetOwner_ReturnValue_1) == 0x000240, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000248, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_bSuccess_3) == 0x000250, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_AsCharacter_SCTBP_2) == 0x000258, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_AsCharacter_SCTBP_2' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_bSuccess_4) == 0x000260, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_GetIsNoOneInside_NoOneInside) == 0x000261, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_GetIsNoOneInside_NoOneInside' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Array_Get_Item) == 0x000264, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Array_Get_Item_1) == 0x000270, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Conv_NameToString_ReturnValue) == 0x0002A0, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_BreakTransform_Location) == 0x0002B0, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_BreakTransform_Rotation) == 0x0002BC, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_BreakTransform_Scale) == 0x0002C8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Concat_StrStr_ReturnValue) == 0x0002D8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Conv_RotatorToString_ReturnValue) == 0x0002E8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Conv_RotatorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0002F8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Conv_VectorToString_ReturnValue) == 0x000308, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Array_Length_ReturnValue) == 0x000318, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000320, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_int_Loop_Counter_Variable) == 0x000330, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000338, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000348, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Less_IntInt_ReturnValue) == 0x000358, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Add_IntInt_ReturnValue) == 0x00035C, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_HasAuthority_ReturnValue_2) == 0x000360, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_CustomEvent_Character) == 0x000368, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_AsCharacter_SCTBP_3) == 0x000370, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_AsCharacter_SCTBP_3' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_bSuccess_5) == 0x000378, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_struct_Variable_4) == 0x000380, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_PostAkEvent_ReturnValue_1) == 0x000390, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_HasAuthority_ReturnValue_3) == 0x000394, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_HasAuthority_ReturnValue_4) == 0x000395, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_payload_2) == 0x000398, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_payload_2' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_payload_1) == 0x0003C8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_payload_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_wasCancelled) == 0x0003F8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_wasCancelled' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Get_Oxygen_Amount_To_Add_From_Power_Percent_amount) == 0x0003FC, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Get_Oxygen_Amount_To_Add_From_Power_Percent_amount' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000400, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_BooleanOR_ReturnValue) == 0x000404, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_CustomEvent_Message_1) == 0x000408, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_CustomEvent_Message) == 0x000420, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_CustomEvent_Transfer) == 0x000438, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_CustomEvent_Transfer' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_Select_Default) == 0x000440, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_HasAuthority_ReturnValue_5) == 0x000448, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_HasAuthority_ReturnValue_6) == 0x000449, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_HasAuthority_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_payload) == 0x000450, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_payload' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_delegate_Variable_4) == 0x000480, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_struct_Variable_5) == 0x000490, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_delegate_Variable_5) == 0x0004A0, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_PostAkEvent_ReturnValue_2) == 0x0004B0, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_CustomEvent_IsVisible) == 0x0004B4, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_CustomEvent_IsVisible' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Not_PreBool_ReturnValue) == 0x0004B5, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_HasAuthority_ReturnValue_7) == 0x0004B6, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_HasAuthority_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_struct_Variable_6) == 0x0004B8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_PostAkEvent_ReturnValue_3) == 0x0004C8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_HasAuthority_ReturnValue_8) == 0x0004CC, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_HasAuthority_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_CreateDelegate_OutputDelegate) == 0x0004D0, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0004E0, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_GetUserWidgetObject_ReturnValue) == 0x0004E8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_ComponentBoundEvent_ShouldShow) == 0x0004F0, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_ComponentBoundEvent_ShouldShow' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_AsPOI_WI_Oxygen_Outlet) == 0x0004F8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_AsPOI_WI_Oxygen_Outlet' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, K2Node_DynamicCast_bSuccess_6) == 0x000500, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, Temp_delegate_Variable_6) == 0x000504, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_Lerp_ReturnValue_1) == 0x000514, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_MakeVector_ReturnValue) == 0x000518, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000524, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_PostAkEvent_ReturnValue_4) == 0x0005B0, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_PostAkEvent_ReturnValue_5) == 0x0005B4, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_PostAkEvent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP, CallFunc_PostAkEvent_ReturnValue_6) == 0x0005B8, "Member 'OxygenOutletBP_C_ExecuteUbergraph_OxygenOutletBP::CallFunc_PostAkEvent_ReturnValue_6' has a wrong offset!");

// Function OxygenOutletBP.OxygenOutletBP_C.BndEvt__ContextStaticMeshRefill_K2Node_ComponentBoundEvent_9_ToggleHighlightEffect__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct OxygenOutletBP_C_BndEvt__ContextStaticMeshRefill_K2Node_ComponentBoundEvent_9_ToggleHighlightEffect__DelegateSignature final
{
public:
	bool                                          ShouldShow;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenOutletBP_C_BndEvt__ContextStaticMeshRefill_K2Node_ComponentBoundEvent_9_ToggleHighlightEffect__DelegateSignature) == 0x000001, "Wrong alignment on OxygenOutletBP_C_BndEvt__ContextStaticMeshRefill_K2Node_ComponentBoundEvent_9_ToggleHighlightEffect__DelegateSignature");
static_assert(sizeof(OxygenOutletBP_C_BndEvt__ContextStaticMeshRefill_K2Node_ComponentBoundEvent_9_ToggleHighlightEffect__DelegateSignature) == 0x000001, "Wrong size on OxygenOutletBP_C_BndEvt__ContextStaticMeshRefill_K2Node_ComponentBoundEvent_9_ToggleHighlightEffect__DelegateSignature");
static_assert(offsetof(OxygenOutletBP_C_BndEvt__ContextStaticMeshRefill_K2Node_ComponentBoundEvent_9_ToggleHighlightEffect__DelegateSignature, ShouldShow) == 0x000000, "Member 'OxygenOutletBP_C_BndEvt__ContextStaticMeshRefill_K2Node_ComponentBoundEvent_9_ToggleHighlightEffect__DelegateSignature::ShouldShow' has a wrong offset!");

// Function OxygenOutletBP.OxygenOutletBP_C.Oxygen Flask Change Visibility
// 0x0001 (0x0001 - 0x0000)
struct OxygenOutletBP_C_Oxygen_Flask_Change_Visibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenOutletBP_C_Oxygen_Flask_Change_Visibility) == 0x000001, "Wrong alignment on OxygenOutletBP_C_Oxygen_Flask_Change_Visibility");
static_assert(sizeof(OxygenOutletBP_C_Oxygen_Flask_Change_Visibility) == 0x000001, "Wrong size on OxygenOutletBP_C_Oxygen_Flask_Change_Visibility");
static_assert(offsetof(OxygenOutletBP_C_Oxygen_Flask_Change_Visibility, IsVisible) == 0x000000, "Member 'OxygenOutletBP_C_Oxygen_Flask_Change_Visibility::IsVisible' has a wrong offset!");

// Function OxygenOutletBP.OxygenOutletBP_C.BndEvt__OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_8_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct OxygenOutletBP_C_BndEvt__OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_8_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(OxygenOutletBP_C_BndEvt__OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_8_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on OxygenOutletBP_C_BndEvt__OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_8_InteractionDelegate__DelegateSignature");
static_assert(sizeof(OxygenOutletBP_C_BndEvt__OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_8_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on OxygenOutletBP_C_BndEvt__OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_8_InteractionDelegate__DelegateSignature");
static_assert(offsetof(OxygenOutletBP_C_BndEvt__OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_8_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'OxygenOutletBP_C_BndEvt__OxygenFlaskInteractionComponentRefill_K2Node_ComponentBoundEvent_8_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function OxygenOutletBP.OxygenOutletBP_C.Show Message To All Players
// 0x0020 (0x0020 - 0x0000)
struct OxygenOutletBP_C_Show_Message_To_All_Players final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Transfer;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenOutletBP_C_Show_Message_To_All_Players) == 0x000008, "Wrong alignment on OxygenOutletBP_C_Show_Message_To_All_Players");
static_assert(sizeof(OxygenOutletBP_C_Show_Message_To_All_Players) == 0x000020, "Wrong size on OxygenOutletBP_C_Show_Message_To_All_Players");
static_assert(offsetof(OxygenOutletBP_C_Show_Message_To_All_Players, Message) == 0x000000, "Member 'OxygenOutletBP_C_Show_Message_To_All_Players::Message' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_Show_Message_To_All_Players, Transfer) == 0x000018, "Member 'OxygenOutletBP_C_Show_Message_To_All_Players::Transfer' has a wrong offset!");

// Function OxygenOutletBP.OxygenOutletBP_C.Show Failed Message Activating Player
// 0x0018 (0x0018 - 0x0000)
struct OxygenOutletBP_C_Show_Failed_Message_Activating_Player final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(OxygenOutletBP_C_Show_Failed_Message_Activating_Player) == 0x000008, "Wrong alignment on OxygenOutletBP_C_Show_Failed_Message_Activating_Player");
static_assert(sizeof(OxygenOutletBP_C_Show_Failed_Message_Activating_Player) == 0x000018, "Wrong size on OxygenOutletBP_C_Show_Failed_Message_Activating_Player");
static_assert(offsetof(OxygenOutletBP_C_Show_Failed_Message_Activating_Player, Message) == 0x000000, "Member 'OxygenOutletBP_C_Show_Failed_Message_Activating_Player::Message' has a wrong offset!");

// Function OxygenOutletBP.OxygenOutletBP_C.BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct OxygenOutletBP_C_BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenOutletBP_C_BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on OxygenOutletBP_C_BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature");
static_assert(sizeof(OxygenOutletBP_C_BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature) == 0x000038, "Wrong size on OxygenOutletBP_C_BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature");
static_assert(offsetof(OxygenOutletBP_C_BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature, Payload) == 0x000000, "Member 'OxygenOutletBP_C_BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature::Payload' has a wrong offset!");
static_assert(offsetof(OxygenOutletBP_C_BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature, WasCancelled) == 0x000030, "Member 'OxygenOutletBP_C_BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_3_InteractionEndedDelegate__DelegateSignature::WasCancelled' has a wrong offset!");

// Function OxygenOutletBP.OxygenOutletBP_C.BndEvt__OxygenPotionInteractionComponent_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
