#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OxygenPotionGA

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function OxygenPotionGA.OxygenPotionGA_C.ExecuteUbergraph_OxygenPotionGA
// 0x0008 (0x0008 - 0x0000)
struct OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA) == 0x000004, "Wrong alignment on OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA");
static_assert(sizeof(OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA) == 0x000008, "Wrong size on OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA");
static_assert(offsetof(OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA, EntryPoint) == 0x000000, "Member 'OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA, K2Node_Event_bWasCancelled) == 0x000005, "Member 'OxygenPotionGA_C_ExecuteUbergraph_OxygenPotionGA::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function OxygenPotionGA.OxygenPotionGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct OxygenPotionGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenPotionGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on OxygenPotionGA_C_K2_OnEndAbility");
static_assert(sizeof(OxygenPotionGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on OxygenPotionGA_C_K2_OnEndAbility");
static_assert(offsetof(OxygenPotionGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'OxygenPotionGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function OxygenPotionGA.OxygenPotionGA_C.K2_CanActivateAbility
// 0x0070 (0x0070 - 0x0000)
struct OxygenPotionGA_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0048(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OxygenPotionGA_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on OxygenPotionGA_C_K2_CanActivateAbility");
static_assert(sizeof(OxygenPotionGA_C_K2_CanActivateAbility) == 0x000070, "Wrong size on OxygenPotionGA_C_K2_CanActivateAbility");
static_assert(offsetof(OxygenPotionGA_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'OxygenPotionGA_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(OxygenPotionGA_C_K2_CanActivateAbility, RelevantTags) == 0x000048, "Member 'OxygenPotionGA_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(OxygenPotionGA_C_K2_CanActivateAbility, ReturnValue) == 0x000068, "Member 'OxygenPotionGA_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");

}

