#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OxygenFlaskForTransferFailedBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function OxygenFlaskForTransferFailedBP.OxygenFlaskForTransferFailedBP_C.ExecuteUbergraph_OxygenFlaskForTransferFailedBP
// 0x0008 (0x0008 - 0x0000)
struct OxygenFlaskForTransferFailedBP_C_ExecuteUbergraph_OxygenFlaskForTransferFailedBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OxygenFlaskForTransferFailedBP_C_ExecuteUbergraph_OxygenFlaskForTransferFailedBP) == 0x000004, "Wrong alignment on OxygenFlaskForTransferFailedBP_C_ExecuteUbergraph_OxygenFlaskForTransferFailedBP");
static_assert(sizeof(OxygenFlaskForTransferFailedBP_C_ExecuteUbergraph_OxygenFlaskForTransferFailedBP) == 0x000008, "Wrong size on OxygenFlaskForTransferFailedBP_C_ExecuteUbergraph_OxygenFlaskForTransferFailedBP");
static_assert(offsetof(OxygenFlaskForTransferFailedBP_C_ExecuteUbergraph_OxygenFlaskForTransferFailedBP, EntryPoint) == 0x000000, "Member 'OxygenFlaskForTransferFailedBP_C_ExecuteUbergraph_OxygenFlaskForTransferFailedBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(OxygenFlaskForTransferFailedBP_C_ExecuteUbergraph_OxygenFlaskForTransferFailedBP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'OxygenFlaskForTransferFailedBP_C_ExecuteUbergraph_OxygenFlaskForTransferFailedBP::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function OxygenFlaskForTransferFailedBP.OxygenFlaskForTransferFailedBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct OxygenFlaskForTransferFailedBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OxygenFlaskForTransferFailedBP_C_ReceiveTick) == 0x000004, "Wrong alignment on OxygenFlaskForTransferFailedBP_C_ReceiveTick");
static_assert(sizeof(OxygenFlaskForTransferFailedBP_C_ReceiveTick) == 0x000004, "Wrong size on OxygenFlaskForTransferFailedBP_C_ReceiveTick");
static_assert(offsetof(OxygenFlaskForTransferFailedBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'OxygenFlaskForTransferFailedBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

