#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassengerLogDisplayWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PassengerLogDisplayWI.PassengerLogDisplayWI_C
// 0x0058 (0x02B8 - 0x0260)
class UPassengerLogDisplayWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Circleframe;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circleinnerbg;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circleinnerfront;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         FactText;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_58;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_118;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URoundedBGBoxWI_C*                      RoundedBGBoxWI;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TargetText;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PassengerLogDisplayWI(int32 EntryPoint);
	void Audio_PassengerLog_FadeOut();
	void Audio_PassengerLog_FadeIn();
	void Fade(bool In, float OptionalDuration);
	void PreConstruct(bool IsDesignTime);
	void Initialize(const struct FPassengerLogInformation& Information);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PassengerLogDisplayWI_C">();
	}
	static class UPassengerLogDisplayWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassengerLogDisplayWI_C>();
	}
};
static_assert(alignof(UPassengerLogDisplayWI_C) == 0x000008, "Wrong alignment on UPassengerLogDisplayWI_C");
static_assert(sizeof(UPassengerLogDisplayWI_C) == 0x0002B8, "Wrong size on UPassengerLogDisplayWI_C");
static_assert(offsetof(UPassengerLogDisplayWI_C, UberGraphFrame) == 0x000260, "Member 'UPassengerLogDisplayWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplayWI_C, FadeIn) == 0x000268, "Member 'UPassengerLogDisplayWI_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplayWI_C, Circleframe) == 0x000270, "Member 'UPassengerLogDisplayWI_C::Circleframe' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplayWI_C, Circleinnerbg) == 0x000278, "Member 'UPassengerLogDisplayWI_C::Circleinnerbg' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplayWI_C, Circleinnerfront) == 0x000280, "Member 'UPassengerLogDisplayWI_C::Circleinnerfront' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplayWI_C, FactText) == 0x000288, "Member 'UPassengerLogDisplayWI_C::FactText' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplayWI_C, Image) == 0x000290, "Member 'UPassengerLogDisplayWI_C::Image' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplayWI_C, Image_58) == 0x000298, "Member 'UPassengerLogDisplayWI_C::Image_58' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplayWI_C, Image_118) == 0x0002A0, "Member 'UPassengerLogDisplayWI_C::Image_118' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplayWI_C, RoundedBGBoxWI) == 0x0002A8, "Member 'UPassengerLogDisplayWI_C::RoundedBGBoxWI' has a wrong offset!");
static_assert(offsetof(UPassengerLogDisplayWI_C, TargetText) == 0x0002B0, "Member 'UPassengerLogDisplayWI_C::TargetText' has a wrong offset!");

}

