#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveItemWI

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function PassiveItemWI.PassiveItemWI_C.ExecuteUbergraph_PassiveItemWI
// 0x0060 (0x0060 - 0x0000)
struct PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPower* PowerChanged, int32 NewStackSize)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UPower* PowerChanged)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPower*                                 K2Node_CustomEvent_PowerChanged_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewStackSize;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory_1; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPower*                                 K2Node_CustomEvent_PowerChanged;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI) == 0x000008, "Wrong alignment on PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI");
static_assert(sizeof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI) == 0x000060, "Wrong size on PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI");
static_assert(offsetof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI, EntryPoint) == 0x000000, "Member 'PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000028, "Member 'PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000030, "Member 'PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI, K2Node_CustomEvent_PowerChanged_1) == 0x000038, "Member 'PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI::K2Node_CustomEvent_PowerChanged_1' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI, K2Node_CustomEvent_NewStackSize) == 0x000040, "Member 'PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI::K2Node_CustomEvent_NewStackSize' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI, CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1) == 0x000048, "Member 'PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI::CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI, CallFunc_GetSCT_Player_Character_CharacterInventory_1) == 0x000050, "Member 'PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI::CallFunc_GetSCT_Player_Character_CharacterInventory_1' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI, K2Node_CustomEvent_PowerChanged) == 0x000058, "Member 'PassiveItemWI_C_ExecuteUbergraph_PassiveItemWI::K2Node_CustomEvent_PowerChanged' has a wrong offset!");

// Function PassiveItemWI.PassiveItemWI_C.OnPowerRemoved
// 0x0008 (0x0008 - 0x0000)
struct PassiveItemWI_C_OnPowerRemoved final
{
public:
	class UPower*                                 PowerChanged;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassiveItemWI_C_OnPowerRemoved) == 0x000008, "Wrong alignment on PassiveItemWI_C_OnPowerRemoved");
static_assert(sizeof(PassiveItemWI_C_OnPowerRemoved) == 0x000008, "Wrong size on PassiveItemWI_C_OnPowerRemoved");
static_assert(offsetof(PassiveItemWI_C_OnPowerRemoved, PowerChanged) == 0x000000, "Member 'PassiveItemWI_C_OnPowerRemoved::PowerChanged' has a wrong offset!");

// Function PassiveItemWI.PassiveItemWI_C.OnNewPowerAdded
// 0x0010 (0x0010 - 0x0000)
struct PassiveItemWI_C_OnNewPowerAdded final
{
public:
	class UPower*                                 PowerChanged;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewStackSize;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassiveItemWI_C_OnNewPowerAdded) == 0x000008, "Wrong alignment on PassiveItemWI_C_OnNewPowerAdded");
static_assert(sizeof(PassiveItemWI_C_OnNewPowerAdded) == 0x000010, "Wrong size on PassiveItemWI_C_OnNewPowerAdded");
static_assert(offsetof(PassiveItemWI_C_OnNewPowerAdded, PowerChanged) == 0x000000, "Member 'PassiveItemWI_C_OnNewPowerAdded::PowerChanged' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_OnNewPowerAdded, NewStackSize) == 0x000008, "Member 'PassiveItemWI_C_OnNewPowerAdded::NewStackSize' has a wrong offset!");

// Function PassiveItemWI.PassiveItemWI_C.New Passive Power Added
// 0x0040 (0x0040 - 0x0000)
struct PassiveItemWI_C_New_Passive_Power_Added final
{
public:
	class UPower*                                 Power;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItem*                                  K2Node_DynamicCast_AsItem;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPassiveItemEntryWI_C*                  CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Is_Passive_Item_isPassive;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveItemWI_C_New_Passive_Power_Added) == 0x000008, "Wrong alignment on PassiveItemWI_C_New_Passive_Power_Added");
static_assert(sizeof(PassiveItemWI_C_New_Passive_Power_Added) == 0x000040, "Wrong size on PassiveItemWI_C_New_Passive_Power_Added");
static_assert(offsetof(PassiveItemWI_C_New_Passive_Power_Added, Power) == 0x000000, "Member 'PassiveItemWI_C_New_Passive_Power_Added::Power' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_New_Passive_Power_Added, K2Node_DynamicCast_AsItem) == 0x000008, "Member 'PassiveItemWI_C_New_Passive_Power_Added::K2Node_DynamicCast_AsItem' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_New_Passive_Power_Added, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PassiveItemWI_C_New_Passive_Power_Added::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_New_Passive_Power_Added, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'PassiveItemWI_C_New_Passive_Power_Added::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_New_Passive_Power_Added, CallFunc_Create_ReturnValue) == 0x000020, "Member 'PassiveItemWI_C_New_Passive_Power_Added::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_New_Passive_Power_Added, CallFunc_Get_Is_Passive_Item_isPassive) == 0x000028, "Member 'PassiveItemWI_C_New_Passive_Power_Added::CallFunc_Get_Is_Passive_Item_isPassive' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_New_Passive_Power_Added, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000030, "Member 'PassiveItemWI_C_New_Passive_Power_Added::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_New_Passive_Power_Added, CallFunc_Map_Contains_ReturnValue) == 0x000038, "Member 'PassiveItemWI_C_New_Passive_Power_Added::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");

// Function PassiveItemWI.PassiveItemWI_C.PassivePowerRemoved
// 0x0028 (0x0028 - 0x0000)
struct PassiveItemWI_C_PassivePowerRemoved final
{
public:
	class UPower*                                 Power;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItem*                                  K2Node_DynamicCast_AsItem;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_Is_Passive_Item_isPassive;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassiveItemEntryWI_C*                  CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveItemWI_C_PassivePowerRemoved) == 0x000008, "Wrong alignment on PassiveItemWI_C_PassivePowerRemoved");
static_assert(sizeof(PassiveItemWI_C_PassivePowerRemoved) == 0x000028, "Wrong size on PassiveItemWI_C_PassivePowerRemoved");
static_assert(offsetof(PassiveItemWI_C_PassivePowerRemoved, Power) == 0x000000, "Member 'PassiveItemWI_C_PassivePowerRemoved::Power' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_PassivePowerRemoved, K2Node_DynamicCast_AsItem) == 0x000008, "Member 'PassiveItemWI_C_PassivePowerRemoved::K2Node_DynamicCast_AsItem' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_PassivePowerRemoved, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PassiveItemWI_C_PassivePowerRemoved::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_PassivePowerRemoved, CallFunc_Get_Is_Passive_Item_isPassive) == 0x000011, "Member 'PassiveItemWI_C_PassivePowerRemoved::CallFunc_Get_Is_Passive_Item_isPassive' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_PassivePowerRemoved, CallFunc_Map_Remove_ReturnValue) == 0x000012, "Member 'PassiveItemWI_C_PassivePowerRemoved::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_PassivePowerRemoved, CallFunc_Map_Find_Value) == 0x000018, "Member 'PassiveItemWI_C_PassivePowerRemoved::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_PassivePowerRemoved, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'PassiveItemWI_C_PassivePowerRemoved::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_PassivePowerRemoved, CallFunc_RemoveChild_ReturnValue) == 0x000021, "Member 'PassiveItemWI_C_PassivePowerRemoved::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function PassiveItemWI.PassiveItemWI_C.Get Is Passive Item
// 0x0068 (0x0068 - 0x0000)
struct PassiveItemWI_C_Get_Is_Passive_Item final
{
public:
	class UItem*                                  Item_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPassive;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDetails                           CallFunc_GetItemDetails_ReturnValue;               // 0x0010(0x0050)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveItemWI_C_Get_Is_Passive_Item) == 0x000008, "Wrong alignment on PassiveItemWI_C_Get_Is_Passive_Item");
static_assert(sizeof(PassiveItemWI_C_Get_Is_Passive_Item) == 0x000068, "Wrong size on PassiveItemWI_C_Get_Is_Passive_Item");
static_assert(offsetof(PassiveItemWI_C_Get_Is_Passive_Item, Item_0) == 0x000000, "Member 'PassiveItemWI_C_Get_Is_Passive_Item::Item_0' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Get_Is_Passive_Item, IsPassive) == 0x000008, "Member 'PassiveItemWI_C_Get_Is_Passive_Item::IsPassive' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Get_Is_Passive_Item, CallFunc_GetItemDetails_ReturnValue) == 0x000010, "Member 'PassiveItemWI_C_Get_Is_Passive_Item::CallFunc_GetItemDetails_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Get_Is_Passive_Item, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'PassiveItemWI_C_Get_Is_Passive_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PassiveItemWI.PassiveItemWI_C.Add Item Entries On New Level
// 0x0090 (0x0090 - 0x0000)
struct PassiveItemWI_C_Add_Item_Entries_On_New_Level final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FItemDetails>                   CallFunc_GetAllItems_ReturnValue;                  // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDetails                           CallFunc_Array_Get_Item;                           // 0x0038(0x0050)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveItemWI_C_Add_Item_Entries_On_New_Level) == 0x000008, "Wrong alignment on PassiveItemWI_C_Add_Item_Entries_On_New_Level");
static_assert(sizeof(PassiveItemWI_C_Add_Item_Entries_On_New_Level) == 0x000090, "Wrong size on PassiveItemWI_C_Add_Item_Entries_On_New_Level");
static_assert(offsetof(PassiveItemWI_C_Add_Item_Entries_On_New_Level, Temp_int_Array_Index_Variable) == 0x000000, "Member 'PassiveItemWI_C_Add_Item_Entries_On_New_Level::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Add_Item_Entries_On_New_Level, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'PassiveItemWI_C_Add_Item_Entries_On_New_Level::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Add_Item_Entries_On_New_Level, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PassiveItemWI_C_Add_Item_Entries_On_New_Level::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Add_Item_Entries_On_New_Level, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000010, "Member 'PassiveItemWI_C_Add_Item_Entries_On_New_Level::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Add_Item_Entries_On_New_Level, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000018, "Member 'PassiveItemWI_C_Add_Item_Entries_On_New_Level::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Add_Item_Entries_On_New_Level, CallFunc_GetAllItems_ReturnValue) == 0x000020, "Member 'PassiveItemWI_C_Add_Item_Entries_On_New_Level::CallFunc_GetAllItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Add_Item_Entries_On_New_Level, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'PassiveItemWI_C_Add_Item_Entries_On_New_Level::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Add_Item_Entries_On_New_Level, CallFunc_Array_Get_Item) == 0x000038, "Member 'PassiveItemWI_C_Add_Item_Entries_On_New_Level::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PassiveItemWI_C_Add_Item_Entries_On_New_Level, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'PassiveItemWI_C_Add_Item_Entries_On_New_Level::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

