#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassengerLogDisplay_Tutorial_WI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PassengerLogFactType_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PassengerLogDisplay_Tutorial_WI.PassengerLogDisplay_Tutorial_WI_C.ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI
// 0x00C8 (0x00C8 - 0x0000)
struct PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_In;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_OptionalDuration;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPassengerLogFactType                         K2Node_CustomEvent_FactType;                       // 0x0028(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_Players;                        // 0x0030(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              CallFunc_GetPlayerState_Array_Element;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	class FText                                   CallFunc_FactTypeToText_Text;                      // 0x0080(0x0018)()
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI) == 0x000008, "Wrong alignment on PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI");
static_assert(sizeof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI) == 0x0000C8, "Wrong size on PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, EntryPoint) == 0x000000, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, Temp_int_Array_Index_Variable) == 0x000004, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, K2Node_Event_IsDesignTime) == 0x000010, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, K2Node_CustomEvent_In) == 0x000011, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::K2Node_CustomEvent_In' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, K2Node_CustomEvent_OptionalDuration) == 0x000014, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::K2Node_CustomEvent_OptionalDuration' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, K2Node_CustomEvent_FactType) == 0x000028, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::K2Node_CustomEvent_FactType' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, K2Node_CustomEvent_Players) == 0x000030, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::K2Node_CustomEvent_Players' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_Array_Get_Item) == 0x000040, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_GetPlayerState_Array_Element) == 0x000048, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_GetPlayerState_Array_Element' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_GetPlayerName_ReturnValue) == 0x000058, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_FactTypeToText_Text) == 0x000080, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_FactTypeToText_Text' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000098, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x0000A0, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, Temp_int_Variable) == 0x0000A8, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B0, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, K2Node_MultiGate_FirstRun) == 0x0000B4, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::K2Node_MultiGate_FirstRun' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, K2Node_MultiGate_Data) == 0x0000B8, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::K2Node_MultiGate_Data' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, K2Node_MultiGate_ScratchBool) == 0x0000BC, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::K2Node_MultiGate_ScratchBool' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI, K2Node_MultiGate_ScratchIndex) == 0x0000C0, "Member 'PassengerLogDisplay_Tutorial_WI_C_ExecuteUbergraph_PassengerLogDisplay_Tutorial_WI::K2Node_MultiGate_ScratchIndex' has a wrong offset!");

// Function PassengerLogDisplay_Tutorial_WI.PassengerLogDisplay_Tutorial_WI_C.AddEntry
// 0x0018 (0x0018 - 0x0000)
struct PassengerLogDisplay_Tutorial_WI_C_AddEntry final
{
public:
	EPassengerLogFactType                         FactType;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Players;                                           // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PassengerLogDisplay_Tutorial_WI_C_AddEntry) == 0x000008, "Wrong alignment on PassengerLogDisplay_Tutorial_WI_C_AddEntry");
static_assert(sizeof(PassengerLogDisplay_Tutorial_WI_C_AddEntry) == 0x000018, "Wrong size on PassengerLogDisplay_Tutorial_WI_C_AddEntry");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_AddEntry, FactType) == 0x000000, "Member 'PassengerLogDisplay_Tutorial_WI_C_AddEntry::FactType' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_AddEntry, Players) == 0x000008, "Member 'PassengerLogDisplay_Tutorial_WI_C_AddEntry::Players' has a wrong offset!");

// Function PassengerLogDisplay_Tutorial_WI.PassengerLogDisplay_Tutorial_WI_C.fade
// 0x0008 (0x0008 - 0x0000)
struct PassengerLogDisplay_Tutorial_WI_C_Fade final
{
public:
	bool                                          In;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OptionalDuration;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassengerLogDisplay_Tutorial_WI_C_Fade) == 0x000004, "Wrong alignment on PassengerLogDisplay_Tutorial_WI_C_Fade");
static_assert(sizeof(PassengerLogDisplay_Tutorial_WI_C_Fade) == 0x000008, "Wrong size on PassengerLogDisplay_Tutorial_WI_C_Fade");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_Fade, In) == 0x000000, "Member 'PassengerLogDisplay_Tutorial_WI_C_Fade::In' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_Fade, OptionalDuration) == 0x000004, "Member 'PassengerLogDisplay_Tutorial_WI_C_Fade::OptionalDuration' has a wrong offset!");

// Function PassengerLogDisplay_Tutorial_WI.PassengerLogDisplay_Tutorial_WI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PassengerLogDisplay_Tutorial_WI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassengerLogDisplay_Tutorial_WI_C_PreConstruct) == 0x000001, "Wrong alignment on PassengerLogDisplay_Tutorial_WI_C_PreConstruct");
static_assert(sizeof(PassengerLogDisplay_Tutorial_WI_C_PreConstruct) == 0x000001, "Wrong size on PassengerLogDisplay_Tutorial_WI_C_PreConstruct");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PassengerLogDisplay_Tutorial_WI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PassengerLogDisplay_Tutorial_WI.PassengerLogDisplay_Tutorial_WI_C.AddPlayerEntry
// 0x0050 (0x0050 - 0x0000)
struct PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry final
{
public:
	class FText                                   CharacterName;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         Padding_0;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IdentificationColor;                               // 0x001C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassengerLogEntryWI_C*                 CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry) == 0x000008, "Wrong alignment on PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry");
static_assert(sizeof(PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry) == 0x000050, "Wrong size on PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry, CharacterName) == 0x000000, "Member 'PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry::CharacterName' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry, Padding_0) == 0x000018, "Member 'PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry::Padding_0' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry, IdentificationColor) == 0x00001C, "Member 'PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry::IdentificationColor' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry, CallFunc_Create_ReturnValue) == 0x000030, "Member 'PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry, K2Node_MakeStruct_Margin) == 0x000038, "Member 'PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000048, "Member 'PassengerLogDisplay_Tutorial_WI_C_AddPlayerEntry::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

}

