#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassengerLogVoteEntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PassengerLogVoteEntryWI.PassengerLogVoteEntryWI_C
// 0x0030 (0x0290 - 0x0260)
class UPassengerLogVoteEntryWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCheckBox*                              PassengerLogButton;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PassengerLogName;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ACharacter*                             CharacterMonitored;                                // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAirlockWI_C*                           OwningAirlock;                                     // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                 AirlockActor;                                      // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PassengerLogVoteEntryWI(int32 EntryPoint);
	void BndEvt__PassengerLogButton_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void Construct();
	void DisableButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PassengerLogVoteEntryWI_C">();
	}
	static class UPassengerLogVoteEntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassengerLogVoteEntryWI_C>();
	}
};
static_assert(alignof(UPassengerLogVoteEntryWI_C) == 0x000008, "Wrong alignment on UPassengerLogVoteEntryWI_C");
static_assert(sizeof(UPassengerLogVoteEntryWI_C) == 0x000290, "Wrong size on UPassengerLogVoteEntryWI_C");
static_assert(offsetof(UPassengerLogVoteEntryWI_C, UberGraphFrame) == 0x000260, "Member 'UPassengerLogVoteEntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassengerLogVoteEntryWI_C, PassengerLogButton) == 0x000268, "Member 'UPassengerLogVoteEntryWI_C::PassengerLogButton' has a wrong offset!");
static_assert(offsetof(UPassengerLogVoteEntryWI_C, PassengerLogName) == 0x000270, "Member 'UPassengerLogVoteEntryWI_C::PassengerLogName' has a wrong offset!");
static_assert(offsetof(UPassengerLogVoteEntryWI_C, CharacterMonitored) == 0x000278, "Member 'UPassengerLogVoteEntryWI_C::CharacterMonitored' has a wrong offset!");
static_assert(offsetof(UPassengerLogVoteEntryWI_C, OwningAirlock) == 0x000280, "Member 'UPassengerLogVoteEntryWI_C::OwningAirlock' has a wrong offset!");
static_assert(offsetof(UPassengerLogVoteEntryWI_C, AirlockActor) == 0x000288, "Member 'UPassengerLogVoteEntryWI_C::AirlockActor' has a wrong offset!");

}

