#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassengerLogEntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PassengerLogEntryWI.PassengerLogEntryWI_C
// 0x0038 (0x0298 - 0x0260)
class UPassengerLogEntryWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UTextBlock*                             PlayerName;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CharacterName;                                     // 0x0270(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FLinearColor                           IdentificationColor;                               // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PassengerLogEntryWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PassengerLogEntryWI_C">();
	}
	static class UPassengerLogEntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassengerLogEntryWI_C>();
	}
};
static_assert(alignof(UPassengerLogEntryWI_C) == 0x000008, "Wrong alignment on UPassengerLogEntryWI_C");
static_assert(sizeof(UPassengerLogEntryWI_C) == 0x000298, "Wrong size on UPassengerLogEntryWI_C");
static_assert(offsetof(UPassengerLogEntryWI_C, UberGraphFrame) == 0x000260, "Member 'UPassengerLogEntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassengerLogEntryWI_C, PlayerName) == 0x000268, "Member 'UPassengerLogEntryWI_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UPassengerLogEntryWI_C, CharacterName) == 0x000270, "Member 'UPassengerLogEntryWI_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UPassengerLogEntryWI_C, IdentificationColor) == 0x000288, "Member 'UPassengerLogEntryWI_C::IdentificationColor' has a wrong offset!");

}

