#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PersonoidMainMenuSCTBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function PersonoidMainMenuSCTBP.PersonoidMainMenuSCTBP_C.ExecuteUbergraph_PersonoidMainMenuSCTBP
// 0x00B8 (0x00B8 - 0x0000)
struct PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Reverse;                        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP) == 0x000008, "Wrong alignment on PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP");
static_assert(sizeof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP) == 0x0000B8, "Wrong size on PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, EntryPoint) == 0x000000, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, Temp_int_Variable) == 0x000004, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, Temp_int_Variable_1) == 0x000008, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, Temp_struct_Variable) == 0x000018, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, Temp_delegate_Variable) == 0x000028, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, Temp_bool_Variable) == 0x000038, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, Temp_float_Variable) == 0x00003C, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, Temp_float_Variable_1) == 0x000040, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000044, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, Temp_bool_Variable_1) == 0x000045, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Not_PreBool_ReturnValue) == 0x000046, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_GetComponentBounds_Origin) == 0x000048, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_GetComponentBounds_BoxExtent) == 0x000054, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_GetComponentBounds_SphereRadius) == 0x000060, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Array_Get_Item) == 0x000068, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_BreakVector_X) == 0x000070, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_BreakVector_Y) == 0x000074, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_BreakVector_Z) == 0x000078, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x00007C, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Array_Length_ReturnValue_1) == 0x000094, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000098, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00009C, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000A0, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000A4, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, K2Node_CustomEvent_Reverse) == 0x0000A8, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::K2Node_CustomEvent_Reverse' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, K2Node_Select_Default) == 0x0000AC, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP, CallFunc_PostAkEvent_ReturnValue) == 0x0000B0, "Member 'PersonoidMainMenuSCTBP_C_ExecuteUbergraph_PersonoidMainMenuSCTBP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function PersonoidMainMenuSCTBP.PersonoidMainMenuSCTBP_C.Audio Transform
// 0x0001 (0x0001 - 0x0000)
struct PersonoidMainMenuSCTBP_C_Audio_Transform final
{
public:
	bool                                          Reverse;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PersonoidMainMenuSCTBP_C_Audio_Transform) == 0x000001, "Wrong alignment on PersonoidMainMenuSCTBP_C_Audio_Transform");
static_assert(sizeof(PersonoidMainMenuSCTBP_C_Audio_Transform) == 0x000001, "Wrong size on PersonoidMainMenuSCTBP_C_Audio_Transform");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_Audio_Transform, Reverse) == 0x000000, "Member 'PersonoidMainMenuSCTBP_C_Audio_Transform::Reverse' has a wrong offset!");

// Function PersonoidMainMenuSCTBP.PersonoidMainMenuSCTBP_C.UserConstructionScript
// 0x0118 (0x0118 - 0x0000)
struct PersonoidMainMenuSCTBP_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_3;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_4;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PersonoidMainMenuSCTBP_C_UserConstructionScript) == 0x000008, "Wrong alignment on PersonoidMainMenuSCTBP_C_UserConstructionScript");
static_assert(sizeof(PersonoidMainMenuSCTBP_C_UserConstructionScript) == 0x000118, "Wrong size on PersonoidMainMenuSCTBP_C_UserConstructionScript");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'PersonoidMainMenuSCTBP_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PersonoidMainMenuSCTBP_C_UserConstructionScript, Temp_int_Variable_1) == 0x000004, "Member 'PersonoidMainMenuSCTBP_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
