#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickupActor

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PickupActor.PickupActor_C.ExecuteUbergraph_PickupActor
// 0x04A8 (0x04A8 - 0x0000)
struct PickupActor_C_ExecuteUbergraph_PickupActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APickupActor_Keycard_C*                 K2Node_DynamicCast_AsPickup_Actor_Keycard;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FInteractionPayload                    K2Node_CustomEvent_InteractionPayload_1;           // 0x00E8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	class ACharacterSCT*                          K2Node_DynamicCast_AsCharacter_SCT;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_CustomEvent_InteractionPayload;             // 0x0150(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPower*                                 CallFunc_TryGetPowerFromType_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D0(0x0018)()
	bool                                          CallFunc_HasUniqueItem_HasUnique;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPowerData*                             CallFunc_HasUniqueItem_UniqueData;                 // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringContainedColor_String;           // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_13;             // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ACharacterSCT*                          K2Node_DynamicCast_AsCharacter_SCT_1;              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_14;             // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_15;             // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_2;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_3;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB[0x5];                                      // 0x02AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload_1;              // 0x02B0(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPayload                    K2Node_ComponentBoundEvent_payload;                // 0x02E8(0x0030)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_wasCancelled;           // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPowerRuntimeData                      K2Node_Event_runtimeData;                          // 0x031C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_16;             // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_17;             // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_18;             // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_19;             // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringContainedColor_String_1;         // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_20;             // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_21;             // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_22;             // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_23;             // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_24;             // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPickupUnique_IsUnique;                 // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPowerData*                             CallFunc_GetPickupUnique_Data;                     // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_25;             // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_26;             // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0418(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_6;          // 0x0430(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0440(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_27;             // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_7;          // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_28;             // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_29;             // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_30;             // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PickupActor_C_ExecuteUbergraph_PickupActor) == 0x000008, "Wrong alignment on PickupActor_C_ExecuteUbergraph_PickupActor");
static_assert(sizeof(PickupActor_C_ExecuteUbergraph_PickupActor) == 0x0004A8, "Wrong size on PickupActor_C_ExecuteUbergraph_PickupActor");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, EntryPoint) == 0x000000, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000030, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_AsPickup_Actor_Keycard) == 0x000048, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_AsPickup_Actor_Keycard' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000058, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000098, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000A8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000B8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000C8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0000D8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_CustomEvent_InteractionPayload_1) == 0x0000E8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_CustomEvent_InteractionPayload_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_AsCharacter_SCT) == 0x000118, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000128, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_GetController_ReturnValue) == 0x000138, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_AsPlayer_Controller) == 0x000140, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_bSuccess_3) == 0x000148, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_CustomEvent_InteractionPayload) == 0x000150, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_CustomEvent_InteractionPayload' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000180, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000190, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_TryGetPowerFromType_ReturnValue) == 0x0001A0, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_TryGetPowerFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_10) == 0x0001A8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_IsValid_ReturnValue) == 0x0001B8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_11) == 0x0001C0, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D0, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_HasUniqueItem_HasUnique) == 0x0001E8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_HasUniqueItem_HasUnique' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_HasUniqueItem_UniqueData) == 0x0001F0, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_HasUniqueItem_UniqueData' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0001F8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_GetStringContainedColor_String) == 0x000208, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_GetStringContainedColor_String' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_12) == 0x000218, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_GetOwner_ReturnValue_1) == 0x000228, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_13) == 0x000230, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_AsCharacter_SCT_1) == 0x000240, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_AsCharacter_SCT_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_bSuccess_4) == 0x000248, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_14) == 0x000250, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_GetController_ReturnValue_1) == 0x000260, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_15) == 0x000268, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_AsPlayer_Controller_1) == 0x000278, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_AsPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_bSuccess_5) == 0x000280, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_GetController_ReturnValue_2) == 0x000288, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_GetController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_AsPlayer_Controller_2) == 0x000290, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_AsPlayer_Controller_2' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_bSuccess_6) == 0x000298, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_AsPlayer_Controller_3) == 0x0002A0, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_AsPlayer_Controller_3' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_DynamicCast_bSuccess_7) == 0x0002A8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_HasAuthority_ReturnValue) == 0x0002A9, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_IsDedicatedServer_ReturnValue) == 0x0002AA, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_ComponentBoundEvent_payload_1) == 0x0002B0, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_ComponentBoundEvent_payload_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0002E0, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_ComponentBoundEvent_payload) == 0x0002E8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_ComponentBoundEvent_payload' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_ComponentBoundEvent_wasCancelled) == 0x000318, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_ComponentBoundEvent_wasCancelled' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, K2Node_Event_runtimeData) == 0x00031C, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::K2Node_Event_runtimeData' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000328, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_16) == 0x000338, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_17) == 0x000348, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_18) == 0x000358, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Conv_TextToString_ReturnValue_5) == 0x000368, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Conv_TextToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_19) == 0x000378, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_GetStringContainedColor_String_1) == 0x000388, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_GetStringContainedColor_String_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_20) == 0x000398, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_21) == 0x0003A8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_22) == 0x0003B8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_23) == 0x0003C8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_24) == 0x0003D8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_GetPickupUnique_IsUnique) == 0x0003E8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_GetPickupUnique_IsUnique' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_GetPickupUnique_Data) == 0x0003F0, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_GetPickupUnique_Data' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_25) == 0x0003F8, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_26) == 0x000408, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000418, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Conv_TextToString_ReturnValue_6) == 0x000430, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Conv_TextToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000440, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_27) == 0x000458, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Conv_TextToString_ReturnValue_7) == 0x000468, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Conv_TextToString_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_28) == 0x000478, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_29) == 0x000488, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ExecuteUbergraph_PickupActor, CallFunc_Concat_StrStr_ReturnValue_30) == 0x000498, "Member 'PickupActor_C_ExecuteUbergraph_PickupActor::CallFunc_Concat_StrStr_ReturnValue_30' has a wrong offset!");

// Function PickupActor.PickupActor_C.CacheRuntimeData
// 0x0008 (0x0008 - 0x0000)
struct PickupActor_C_CacheRuntimeData final
{
public:
	struct FPowerRuntimeData                      RuntimeData;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupActor_C_CacheRuntimeData) == 0x000004, "Wrong alignment on PickupActor_C_CacheRuntimeData");
static_assert(sizeof(PickupActor_C_CacheRuntimeData) == 0x000008, "Wrong size on PickupActor_C_CacheRuntimeData");
static_assert(offsetof(PickupActor_C_CacheRuntimeData, RuntimeData) == 0x000000, "Member 'PickupActor_C_CacheRuntimeData::RuntimeData' has a wrong offset!");

// Function PickupActor.PickupActor_C.BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature");
static_assert(sizeof(PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature) == 0x000038, "Wrong size on PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature");
static_assert(offsetof(PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature, Payload) == 0x000000, "Member 'PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature::Payload' has a wrong offset!");
static_assert(offsetof(PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature, WasCancelled) == 0x000030, "Member 'PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_4_InteractionEndedDelegate__DelegateSignature::WasCancelled' has a wrong offset!");

// Function PickupActor.PickupActor_C.BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature final
{
public:
	struct FInteractionPayload                    Payload;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature");
static_assert(sizeof(PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature) == 0x000030, "Wrong size on PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature");
static_assert(offsetof(PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature, Payload) == 0x000000, "Member 'PickupActor_C_BndEvt__PickupComponentBC_K2Node_ComponentBoundEvent_3_InteractionDelegate__DelegateSignature::Payload' has a wrong offset!");

// Function PickupActor.PickupActor_C.Pickup
// 0x0030 (0x0030 - 0x0000)
struct PickupActor_C_Pickup final
{
public:
	struct FInteractionPayload                    InteractionPayload;                                // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PickupActor_C_Pickup) == 0x000008, "Wrong alignment on PickupActor_C_Pickup");
static_assert(sizeof(PickupActor_C_Pickup) == 0x000030, "Wrong size on PickupActor_C_Pickup");
static_assert(offsetof(PickupActor_C_Pickup, InteractionPayload) == 0x000000, "Member 'PickupActor_C_Pickup::InteractionPayload' has a wrong offset!");

// Function PickupActor.PickupActor_C.Add Score
// 0x0030 (0x0030 - 0x0000)
struct PickupActor_C_Add_Score final
{
public:
	struct FInteractionPayload                    InteractionPayload;                                // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PickupActor_C_Add_Score) == 0x000008, "Wrong alignment on PickupActor_C_Add_Score");
static_assert(sizeof(PickupActor_C_Add_Score) == 0x000030, "Wrong size on PickupActor_C_Add_Score");
static_assert(offsetof(PickupActor_C_Add_Score, InteractionPayload) == 0x000000, "Member 'PickupActor_C_Add_Score::InteractionPayload' has a wrong offset!");

// Function PickupActor.PickupActor_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct PickupActor_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorFloat_ReturnValue;              // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0064(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PickupActor_C_UserConstructionScript) == 0x000004, "Wrong alignment on PickupActor_C_UserConstructionScript");
static_assert(sizeof(PickupActor_C_UserConstructionScript) == 0x0000F0, "Wrong size on PickupActor_C_UserConstructionScript");
static_assert(offsetof(PickupActor_C_UserConstructionScript, CallFunc_GetComponentBounds_Origin) == 0x000000, "Member 'PickupActor_C_UserConstructionScript::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(PickupActor_C_UserConstructionScript, CallFunc_GetComponentBounds_BoxExtent) == 0x00000C, "Member 'PickupActor_C_UserConstructionScript::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(PickupActor_C_UserConstructionScript, CallFunc_GetComponentBounds_SphereRadius) == 0x000018, "Member 'PickupActor_C_UserConstructionScript::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(PickupActor_C_UserConstructionScript, CallFunc_GetLocalBounds_Min) == 0x00001C, "Member 'PickupActor_C_UserConstructionScript::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(PickupActor_C_UserConstructionScript, CallFunc_GetLocalBounds_Max) == 0x000028, "Member 'PickupActor_C_UserConstructionScript::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(PickupActor_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000034, "Member 'PickupActor_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'PickupActor_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_UserConstructionScript, CallFunc_Add_VectorFloat_ReturnValue) == 0x00004C, "Member 'PickupActor_C_UserConstructionScript::CallFunc_Add_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue_1) == 0x000058, "Member 'PickupActor_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000064, "Member 'PickupActor_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function PickupActor.PickupActor_C.GetStringContainedColor
// 0x0028 (0x0028 - 0x0000)
struct PickupActor_C_GetStringContainedColor final
{
public:
	class FString                                 SearchIn;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 String;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PickupActor_C_GetStringContainedColor) == 0x000008, "Wrong alignment on PickupActor_C_GetStringContainedColor");
static_assert(sizeof(PickupActor_C_GetStringContainedColor) == 0x000028, "Wrong size on PickupActor_C_GetStringContainedColor");
static_assert(offsetof(PickupActor_C_GetStringContainedColor, SearchIn) == 0x000000, "Member 'PickupActor_C_GetStringContainedColor::SearchIn' has a wrong offset!");
static_assert(offsetof(PickupActor_C_GetStringContainedColor, String) == 0x000010, "Member 'PickupActor_C_GetStringContainedColor::String' has a wrong offset!");
static_assert(offsetof(PickupActor_C_GetStringContainedColor, CallFunc_Contains_ReturnValue) == 0x000020, "Member 'PickupActor_C_GetStringContainedColor::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_GetStringContainedColor, CallFunc_Contains_ReturnValue_1) == 0x000021, "Member 'PickupActor_C_GetStringContainedColor::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickupActor_C_GetStringContainedColor, CallFunc_Contains_ReturnValue_2) == 0x000022, "Member 'PickupActor_C_GetStringContainedColor::CallFunc_Contains_ReturnValue_2' has a wrong offset!");

// Function PickupActor.PickupActor_C.ShowPickUpWidget
// 0x0050 (0x0050 - 0x0000)
struct PickupActor_C_ShowPickUpWidget final
{
public:
	class APlayerController*                      OwningPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPickupComponentBC_C*                   PickupComponent;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UContextStaticMeshComponent*            ContextStaticMesh_0;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 InString;                                          // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class UAkAudioEvent*                          CallFunc_GetAKEventFromSource_AKAudioEvent;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPickUpItemWI_C*                        CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PickupActor_C_ShowPickUpWidget) == 0x000008, "Wrong alignment on PickupActor_C_ShowPickUpWidget");
static_assert(sizeof(PickupActor_C_ShowPickUpWidget) == 0x000050, "Wrong size on PickupActor_C_ShowPickUpWidget");
static_assert(offsetof(PickupActor_C_ShowPickUpWidget, OwningPlayer) == 0x000000, "Member 'PickupActor_C_ShowPickUpWidget::OwningPlayer' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ShowPickUpWidget, PickupComponent) == 0x000008, "Member 'PickupActor_C_ShowPickUpWidget::PickupComponent' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ShowPickUpWidget, ContextStaticMesh_0) == 0x000010, "Member 'PickupActor_C_ShowPickUpWidget::ContextStaticMesh_0' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ShowPickUpWidget, InString) == 0x000018, "Member 'PickupActor_C_ShowPickUpWidget::InString' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ShowPickUpWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'PickupActor_C_ShowPickUpWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ShowPickUpWidget, CallFunc_GetAKEventFromSource_AKAudioEvent) == 0x000040, "Member 'PickupActor_C_ShowPickUpWidget::CallFunc_GetAKEventFromSource_AKAudioEvent' has a wrong offset!");
static_assert(offsetof(PickupActor_C_ShowPickUpWidget, CallFunc_Create_ReturnValue) == 0x000048, "Member 'PickupActor_C_ShowPickUpWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function PickupActor.PickupActor_C.GetAkEventStringFromPickupComponent
// 0x0018 (0x0018 - 0x0000)
struct PickupActor_C_GetAkEventStringFromPickupComponent final
{
public:
	class FString                                 AkEvent;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PickupActor_C_GetAkEventStringFromPickupComponent) == 0x000008, "Wrong alignment on PickupActor_C_GetAkEventStringFromPickupComponent");
static_assert(sizeof(PickupActor_C_GetAkEventStringFromPickupComponent) == 0x000018, "Wrong size on PickupActor_C_GetAkEventStringFromPickupComponent");
static_assert(offsetof(PickupActor_C_GetAkEventStringFromPickupComponent, AkEvent) == 0x000000, "Member 'PickupActor_C_GetAkEventStringFromPickupComponent::AkEvent' has a wrong offset!");
static_assert(offsetof(PickupActor_C_GetAkEventStringFromPickupComponent, CallFunc_Array_Get_Item) == 0x000010, "Member 'PickupActor_C_GetAkEventStringFromPickupComponent::CallFunc_Array_Get_Item' has a wrong offset!");

// Function PickupActor.PickupActor_C.HasUniqueItem
// 0x0098 (0x0098 - 0x0000)
struct PickupActor_C_HasUniqueItem final
{
public:
	class UInventory*                             Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasUnique;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPowerData*                             UniqueData;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPowerData*                             L_Data;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_Unique;                                          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPowerDetails>                  CallFunc_GetAllPowers_ReturnValue;                 // 0x0028(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPowerDetails                          CallFunc_Array_Get_Item;                           // 0x0040(0x0048)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PickupActor_C_HasUniqueItem) == 0x000008, "Wrong alignment on PickupActor_C_HasUniqueItem");
static_assert(sizeof(PickupActor_C_HasUniqueItem) == 0x000098, "Wrong size on PickupActor_C_HasUniqueItem");
static_assert(offsetof(PickupActor_C_HasUniqueItem, Inventory) == 0x000000, "Member 'PickupActor_C_HasUniqueItem::Inventory' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, HasUnique) == 0x000008, "Member 'PickupActor_C_HasUniqueItem::HasUnique' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, UniqueData) == 0x000010, "Member 'PickupActor_C_HasUniqueItem::UniqueData' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, L_Data) == 0x000018, "Member 'PickupActor_C_HasUniqueItem::L_Data' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, L_Unique) == 0x000020, "Member 'PickupActor_C_HasUniqueItem::L_Unique' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, CallFunc_GetAllPowers_ReturnValue) == 0x000028, "Member 'PickupActor_C_HasUniqueItem::CallFunc_GetAllPowers_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, Temp_int_Array_Index_Variable) == 0x000038, "Member 'PickupActor_C_HasUniqueItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'PickupActor_C_HasUniqueItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, CallFunc_Array_Get_Item) == 0x000040, "Member 'PickupActor_C_HasUniqueItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'PickupActor_C_HasUniqueItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'PickupActor_C_HasUniqueItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickupActor_C_HasUniqueItem, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'PickupActor_C_HasUniqueItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function PickupActor.PickupActor_C.GetPickupUnique
// 0x0018 (0x0018 - 0x0000)
struct PickupActor_C_GetPickupUnique final
{
public:
	bool                                          IsUnique;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPowerData*                             Data;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PickupActor_C_GetPickupUnique) == 0x000008, "Wrong alignment on PickupActor_C_GetPickupUnique");
static_assert(sizeof(PickupActor_C_GetPickupUnique) == 0x000018, "Wrong size on PickupActor_C_GetPickupUnique");
static_assert(offsetof(PickupActor_C_GetPickupUnique, IsUnique) == 0x000000, "Member 'PickupActor_C_GetPickupUnique::IsUnique' has a wrong offset!");
static_assert(offsetof(PickupActor_C_GetPickupUnique, Data) == 0x000008, "Member 'PickupActor_C_GetPickupUnique::Data' has a wrong offset!");
static_assert(offsetof(PickupActor_C_GetPickupUnique, CallFunc_Array_Get_Item) == 0x000010, "Member 'PickupActor_C_GetPickupUnique::CallFunc_Array_Get_Item' has a wrong offset!");

}

