#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickupActor_OxygenKit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PickupActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PickupActor_OxygenKit.PickupActor_OxygenKit_C
// 0x0030 (0x02A8 - 0x0278)
class APickupActor_OxygenKit_C : public APickupActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PickupActor_OxygenKit_C;            // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class USceneComponent*                        Trace1;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        Trace;                                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          WallMounted;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_PickupActor_OxygenKit(int32 EntryPoint);
	void ReceiveBeginPlay();
	void IsCloseToGround(bool* Close);
	void OnRep_WallMounted();
	void Picked_up();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PickupActor_OxygenKit_C">();
	}
	static class APickupActor_OxygenKit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APickupActor_OxygenKit_C>();
	}
};
static_assert(alignof(APickupActor_OxygenKit_C) == 0x000008, "Wrong alignment on APickupActor_OxygenKit_C");
static_assert(sizeof(APickupActor_OxygenKit_C) == 0x0002A8, "Wrong size on APickupActor_OxygenKit_C");
static_assert(offsetof(APickupActor_OxygenKit_C, UberGraphFrame_PickupActor_OxygenKit_C) == 0x000278, "Member 'APickupActor_OxygenKit_C::UberGraphFrame_PickupActor_OxygenKit_C' has a wrong offset!");
static_assert(offsetof(APickupActor_OxygenKit_C, Trace1) == 0x000280, "Member 'APickupActor_OxygenKit_C::Trace1' has a wrong offset!");
static_assert(offsetof(APickupActor_OxygenKit_C, Trace) == 0x000288, "Member 'APickupActor_OxygenKit_C::Trace' has a wrong offset!");
static_assert(offsetof(APickupActor_OxygenKit_C, StaticMesh2) == 0x000290, "Member 'APickupActor_OxygenKit_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(APickupActor_OxygenKit_C, StaticMesh1) == 0x000298, "Member 'APickupActor_OxygenKit_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(APickupActor_OxygenKit_C, WallMounted) == 0x0002A0, "Member 'APickupActor_OxygenKit_C::WallMounted' has a wrong offset!");

}

