#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pivot_AnimNotifyState

#include "Basic.hpp"


namespace SDK::Params
{

// Function Pivot_AnimNotifyState.Pivot_AnimNotifyState_C.Received_NotifyBegin
// 0x0038 (0x0038 - 0x0000)
struct Pivot_AnimNotifyState_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIAnimBp_C>            K2Node_DynamicCast_AsIAnim_Bp;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pivot_AnimNotifyState_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on Pivot_AnimNotifyState_C_Received_NotifyBegin");
static_assert(sizeof(Pivot_AnimNotifyState_C_Received_NotifyBegin) == 0x000038, "Wrong size on Pivot_AnimNotifyState_C_Received_NotifyBegin");
static_assert(offsetof(Pivot_AnimNotifyState_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'Pivot_AnimNotifyState_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(Pivot_AnimNotifyState_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'Pivot_AnimNotifyState_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(Pivot_AnimNotifyState_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'Pivot_AnimNotifyState_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(Pivot_AnimNotifyState_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'Pivot_AnimNotifyState_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(Pivot_AnimNotifyState_C_Received_NotifyBegin, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'Pivot_AnimNotifyState_C_Received_NotifyBegin::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pivot_AnimNotifyState_C_Received_NotifyBegin, K2Node_DynamicCast_AsIAnim_Bp) == 0x000020, "Member 'Pivot_AnimNotifyState_C_Received_NotifyBegin::K2Node_DynamicCast_AsIAnim_Bp' has a wrong offset!");
static_assert(offsetof(Pivot_AnimNotifyState_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Pivot_AnimNotifyState_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

