#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: POI_OffScreenIndicatorWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function POI_OffScreenIndicatorWI.POI_OffScreenIndicatorWI_C.ExecuteUbergraph_POI_OffScreenIndicatorWI
// 0x0110 (0x0110 - 0x0000)
struct POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindScreenEdgeLocationForWorldLocation_OnTheEdge; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_FindScreenEdgeLocationForWorldLocation_ScreenPosition; // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindScreenEdgeLocationForWorldLocation_Angle; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0028)(UObjectWrapper)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0080(0x0088)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI) == 0x000008, "Wrong alignment on POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI");
static_assert(sizeof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI) == 0x000110, "Wrong size on POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI, EntryPoint) == 0x000000, "Member 'POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI, K2Node_Event_MyGeometry) == 0x000004, "Member 'POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI, CallFunc_FindScreenEdgeLocationForWorldLocation_OnTheEdge) == 0x000040, "Member 'POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI::CallFunc_FindScreenEdgeLocationForWorldLocation_OnTheEdge' has a wrong offset!");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI, CallFunc_FindScreenEdgeLocationForWorldLocation_ScreenPosition) == 0x000044, "Member 'POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI::CallFunc_FindScreenEdgeLocationForWorldLocation_ScreenPosition' has a wrong offset!");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI, CallFunc_FindScreenEdgeLocationForWorldLocation_Angle) == 0x00004C, "Member 'POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI::CallFunc_FindScreenEdgeLocationForWorldLocation_Angle' has a wrong offset!");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI, K2Node_MakeStruct_SlateBrush) == 0x000080, "Member 'POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI, CallFunc_PlayAnimation_ReturnValue_1) == 0x000108, "Member 'POI_OffScreenIndicatorWI_C_ExecuteUbergraph_POI_OffScreenIndicatorWI::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function POI_OffScreenIndicatorWI.POI_OffScreenIndicatorWI_C.Tick
// 0x003C (0x003C - 0x0000)
struct POI_OffScreenIndicatorWI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(POI_OffScreenIndicatorWI_C_Tick) == 0x000004, "Wrong alignment on POI_OffScreenIndicatorWI_C_Tick");
static_assert(sizeof(POI_OffScreenIndicatorWI_C_Tick) == 0x00003C, "Wrong size on POI_OffScreenIndicatorWI_C_Tick");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_Tick, MyGeometry) == 0x000000, "Member 'POI_OffScreenIndicatorWI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(POI_OffScreenIndicatorWI_C_Tick, InDeltaTime) == 0x000038, "Member 'POI_OffScreenIndicatorWI_C_Tick::InDeltaTime' has a wrong offset!");

}

