#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: POI_OffScreenIndicatorWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass POI_OffScreenIndicatorWI.POI_OffScreenIndicatorWI_C
// 0x0070 (0x02F0 - 0x0280)
class UPOI_OffScreenIndicatorWI_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       NewPulse;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pulse;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_Holder;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img;                                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Arrow;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector                                InLocation;                                        // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   IndicatorText;                                     // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UObject*                                IndicatorImage;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_POI_OffScreenIndicatorWI(int32 EntryPoint);
	void Animate_Pulse();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"POI_OffScreenIndicatorWI_C">();
	}
	static class UPOI_OffScreenIndicatorWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPOI_OffScreenIndicatorWI_C>();
	}
};
static_assert(alignof(UPOI_OffScreenIndicatorWI_C) == 0x000008, "Wrong alignment on UPOI_OffScreenIndicatorWI_C");
static_assert(sizeof(UPOI_OffScreenIndicatorWI_C) == 0x0002F0, "Wrong size on UPOI_OffScreenIndicatorWI_C");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, UberGraphFrame) == 0x000280, "Member 'UPOI_OffScreenIndicatorWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, NewPulse) == 0x000288, "Member 'UPOI_OffScreenIndicatorWI_C::NewPulse' has a wrong offset!");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, Pulse) == 0x000290, "Member 'UPOI_OffScreenIndicatorWI_C::Pulse' has a wrong offset!");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, FadeIn) == 0x000298, "Member 'UPOI_OffScreenIndicatorWI_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, Canvas_Holder) == 0x0002A0, "Member 'UPOI_OffScreenIndicatorWI_C::Canvas_Holder' has a wrong offset!");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, Img) == 0x0002A8, "Member 'UPOI_OffScreenIndicatorWI_C::Img' has a wrong offset!");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, Img_Arrow) == 0x0002B0, "Member 'UPOI_OffScreenIndicatorWI_C::Img_Arrow' has a wrong offset!");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, Text) == 0x0002B8, "Member 'UPOI_OffScreenIndicatorWI_C::Text' has a wrong offset!");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, InLocation) == 0x0002C0, "Member 'UPOI_OffScreenIndicatorWI_C::InLocation' has a wrong offset!");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, IndicatorText) == 0x0002D0, "Member 'UPOI_OffScreenIndicatorWI_C::IndicatorText' has a wrong offset!");
static_assert(offsetof(UPOI_OffScreenIndicatorWI_C, IndicatorImage) == 0x0002E8, "Member 'UPOI_OffScreenIndicatorWI_C::IndicatorImage' has a wrong offset!");

}

