#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: POI_WidgetComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function POI_WidgetComponent.POI_WidgetComponent_C.ExecuteUbergraph_POI_WidgetComponent
// 0x0028 (0x0028 - 0x0000)
struct POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Event_initializedWidget;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPOI_WI_C*                              K2Node_DynamicCast_AsPOI_WI;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPOIState_Visible;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent) == 0x000008, "Wrong alignment on POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent");
static_assert(sizeof(POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent) == 0x000028, "Wrong size on POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent");
static_assert(offsetof(POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent, EntryPoint) == 0x000000, "Member 'POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent, K2Node_Event_initializedWidget) == 0x000010, "Member 'POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent::K2Node_Event_initializedWidget' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent, K2Node_DynamicCast_AsPOI_WI) == 0x000018, "Member 'POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent::K2Node_DynamicCast_AsPOI_WI' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent, CallFunc_GetPOIState_Visible) == 0x000021, "Member 'POI_WidgetComponent_C_ExecuteUbergraph_POI_WidgetComponent::CallFunc_GetPOIState_Visible' has a wrong offset!");

// Function POI_WidgetComponent.POI_WidgetComponent_C.K2_InitWidget
// 0x0008 (0x0008 - 0x0000)
struct POI_WidgetComponent_C_K2_InitWidget final
{
public:
	class UWidget*                                InitializedWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(POI_WidgetComponent_C_K2_InitWidget) == 0x000008, "Wrong alignment on POI_WidgetComponent_C_K2_InitWidget");
static_assert(sizeof(POI_WidgetComponent_C_K2_InitWidget) == 0x000008, "Wrong size on POI_WidgetComponent_C_K2_InitWidget");
static_assert(offsetof(POI_WidgetComponent_C_K2_InitWidget, InitializedWidget) == 0x000000, "Member 'POI_WidgetComponent_C_K2_InitWidget::InitializedWidget' has a wrong offset!");

// Function POI_WidgetComponent.POI_WidgetComponent_C.SetVisibilityState
// 0x0001 (0x0001 - 0x0000)
struct POI_WidgetComponent_C_SetVisibilityState final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(POI_WidgetComponent_C_SetVisibilityState) == 0x000001, "Wrong alignment on POI_WidgetComponent_C_SetVisibilityState");
static_assert(sizeof(POI_WidgetComponent_C_SetVisibilityState) == 0x000001, "Wrong size on POI_WidgetComponent_C_SetVisibilityState");
static_assert(offsetof(POI_WidgetComponent_C_SetVisibilityState, Visibility) == 0x000000, "Member 'POI_WidgetComponent_C_SetVisibilityState::Visibility' has a wrong offset!");

// Function POI_WidgetComponent.POI_WidgetComponent_C.SubscribeToPOIEvent
// 0x0028 (0x0028 - 0x0000)
struct POI_WidgetComponent_C_SubscribeToPOIEvent final
{
public:
	TDelegate<void(bool Value)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                CallFunc_GetGlobalObject_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOnPOIStateChanged_C*                   K2Node_DynamicCast_AsOn_POIState_Changed;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(POI_WidgetComponent_C_SubscribeToPOIEvent) == 0x000008, "Wrong alignment on POI_WidgetComponent_C_SubscribeToPOIEvent");
static_assert(sizeof(POI_WidgetComponent_C_SubscribeToPOIEvent) == 0x000028, "Wrong size on POI_WidgetComponent_C_SubscribeToPOIEvent");
static_assert(offsetof(POI_WidgetComponent_C_SubscribeToPOIEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'POI_WidgetComponent_C_SubscribeToPOIEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_SubscribeToPOIEvent, CallFunc_GetGlobalObject_ReturnValue) == 0x000010, "Member 'POI_WidgetComponent_C_SubscribeToPOIEvent::CallFunc_GetGlobalObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_SubscribeToPOIEvent, K2Node_DynamicCast_AsOn_POIState_Changed) == 0x000018, "Member 'POI_WidgetComponent_C_SubscribeToPOIEvent::K2Node_DynamicCast_AsOn_POIState_Changed' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_SubscribeToPOIEvent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'POI_WidgetComponent_C_SubscribeToPOIEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function POI_WidgetComponent.POI_WidgetComponent_C.GetPOIState
// 0x0020 (0x0020 - 0x0000)
struct POI_WidgetComponent_C_GetPOIState final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetGlobalObject_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPOI_State_C*                           K2Node_DynamicCast_AsPOI_State;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsVisible_Visible;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(POI_WidgetComponent_C_GetPOIState) == 0x000008, "Wrong alignment on POI_WidgetComponent_C_GetPOIState");
static_assert(sizeof(POI_WidgetComponent_C_GetPOIState) == 0x000020, "Wrong size on POI_WidgetComponent_C_GetPOIState");
static_assert(offsetof(POI_WidgetComponent_C_GetPOIState, Visible) == 0x000000, "Member 'POI_WidgetComponent_C_GetPOIState::Visible' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_GetPOIState, CallFunc_GetGlobalObject_ReturnValue) == 0x000008, "Member 'POI_WidgetComponent_C_GetPOIState::CallFunc_GetGlobalObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_GetPOIState, K2Node_DynamicCast_AsPOI_State) == 0x000010, "Member 'POI_WidgetComponent_C_GetPOIState::K2Node_DynamicCast_AsPOI_State' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_GetPOIState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'POI_WidgetComponent_C_GetPOIState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(POI_WidgetComponent_C_GetPOIState, CallFunc_GetIsVisible_Visible) == 0x000019, "Member 'POI_WidgetComponent_C_GetPOIState::CallFunc_GetIsVisible_Visible' has a wrong offset!");

}

