#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: POITriggerSCT

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function POITriggerSCT.POITriggerSCT_C.ExecuteUbergraph_POITriggerSCT
// 0x0128 (0x0128 - 0x0000)
struct POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0030(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UKeycardObjectiveWI_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeycardObjectiveWI_C*                  CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT) == 0x000008, "Wrong alignment on POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT");
static_assert(sizeof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT) == 0x000128, "Wrong size on POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, EntryPoint) == 0x000000, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::EntryPoint' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, Temp_int_Array_Index_Variable) == 0x000004, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000010, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_ComponentBoundEvent_OtherActor) == 0x000018, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_ComponentBoundEvent_OtherComp) == 0x000020, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000028, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_ComponentBoundEvent_bFromSweep) == 0x00002C, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_ComponentBoundEvent_SweepResult) == 0x000030, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, CallFunc_GetPlayerController_ReturnValue) == 0x0000C0, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x0000C8, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, CallFunc_GetOwner_ReturnValue) == 0x0000D8, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0000E0, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x0000F0, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, CallFunc_Array_Get_Item) == 0x000100, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, CallFunc_GetController_ReturnValue) == 0x000108, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_DynamicCast_AsPlayer_Controller) == 0x000110, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, CallFunc_Array_Length_ReturnValue) == 0x00011C, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000120, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT, CallFunc_Less_IntInt_ReturnValue) == 0x000121, "Member 'POITriggerSCT_C_ExecuteUbergraph_POITriggerSCT::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function POITriggerSCT.POITriggerSCT_C.BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'POITriggerSCT_C_BndEvt__Cube_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function POITriggerSCT.POITriggerSCT_C.ShowKeycardObjectives
// 0x0038 (0x0038 - 0x0000)
struct POITriggerSCT_C_ShowKeycardObjectives final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCharacterWI_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterWI_C*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(POITriggerSCT_C_ShowKeycardObjectives) == 0x000008, "Wrong alignment on POITriggerSCT_C_ShowKeycardObjectives");
static_assert(sizeof(POITriggerSCT_C_ShowKeycardObjectives) == 0x000038, "Wrong size on POITriggerSCT_C_ShowKeycardObjectives");
static_assert(offsetof(POITriggerSCT_C_ShowKeycardObjectives, Temp_int_Array_Index_Variable) == 0x000000, "Member 'POITriggerSCT_C_ShowKeycardObjectives::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ShowKeycardObjectives, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'POITriggerSCT_C_ShowKeycardObjectives::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ShowKeycardObjectives, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'POITriggerSCT_C_ShowKeycardObjectives::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ShowKeycardObjectives, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'POITriggerSCT_C_ShowKeycardObjectives::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ShowKeycardObjectives, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'POITriggerSCT_C_ShowKeycardObjectives::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ShowKeycardObjectives, CallFunc_Array_Get_Item) == 0x000028, "Member 'POITriggerSCT_C_ShowKeycardObjectives::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_ShowKeycardObjectives, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'POITriggerSCT_C_ShowKeycardObjectives::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function POITriggerSCT.POITriggerSCT_C.MakeKeySocketPOI_Visible
// 0x0040 (0x0040 - 0x0000)
struct POITriggerSCT_C_MakeKeySocketPOI_Visible final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPOI_WI_C*                              K2Node_DynamicCast_AsPOI_WI;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AKeySocket3in1BP_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AKeySocket3in1BP_C*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(POITriggerSCT_C_MakeKeySocketPOI_Visible) == 0x000008, "Wrong alignment on POITriggerSCT_C_MakeKeySocketPOI_Visible");
static_assert(sizeof(POITriggerSCT_C_MakeKeySocketPOI_Visible) == 0x000040, "Wrong size on POITriggerSCT_C_MakeKeySocketPOI_Visible");
static_assert(offsetof(POITriggerSCT_C_MakeKeySocketPOI_Visible, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'POITriggerSCT_C_MakeKeySocketPOI_Visible::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_MakeKeySocketPOI_Visible, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'POITriggerSCT_C_MakeKeySocketPOI_Visible::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_MakeKeySocketPOI_Visible, K2Node_DynamicCast_AsPOI_WI) == 0x000010, "Member 'POITriggerSCT_C_MakeKeySocketPOI_Visible::K2Node_DynamicCast_AsPOI_WI' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_MakeKeySocketPOI_Visible, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'POITriggerSCT_C_MakeKeySocketPOI_Visible::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_MakeKeySocketPOI_Visible, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'POITriggerSCT_C_MakeKeySocketPOI_Visible::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_MakeKeySocketPOI_Visible, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'POITriggerSCT_C_MakeKeySocketPOI_Visible::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_MakeKeySocketPOI_Visible, CallFunc_Array_Get_Item) == 0x000038, "Member 'POITriggerSCT_C_MakeKeySocketPOI_Visible::CallFunc_Array_Get_Item' has a wrong offset!");

// Function POITriggerSCT.POITriggerSCT_C.KeySocketOpacityPOIBasedOnDistance
// 0x0008 (0x0008 - 0x0000)
struct POITriggerSCT_C_KeySocketOpacityPOIBasedOnDistance final
{
public:
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(POITriggerSCT_C_KeySocketOpacityPOIBasedOnDistance) == 0x000004, "Wrong alignment on POITriggerSCT_C_KeySocketOpacityPOIBasedOnDistance");
static_assert(sizeof(POITriggerSCT_C_KeySocketOpacityPOIBasedOnDistance) == 0x000008, "Wrong size on POITriggerSCT_C_KeySocketOpacityPOIBasedOnDistance");
static_assert(offsetof(POITriggerSCT_C_KeySocketOpacityPOIBasedOnDistance, CallFunc_GetDistanceTo_ReturnValue) == 0x000000, "Member 'POITriggerSCT_C_KeySocketOpacityPOIBasedOnDistance::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_KeySocketOpacityPOIBasedOnDistance, CallFunc_MapRangeClamped_ReturnValue) == 0x000004, "Member 'POITriggerSCT_C_KeySocketOpacityPOIBasedOnDistance::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function POITriggerSCT.POITriggerSCT_C.SetPOIState
// 0x0038 (0x0038 - 0x0000)
struct POITriggerSCT_C_SetPOIState final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetGlobalObject_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetGlobalObject_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOnPOIStateChanged_C*                   K2Node_DynamicCast_AsOn_POIState_Changed;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPOI_State_C*                           K2Node_DynamicCast_AsPOI_State;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPOIState_Visible;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(POITriggerSCT_C_SetPOIState) == 0x000008, "Wrong alignment on POITriggerSCT_C_SetPOIState");
static_assert(sizeof(POITriggerSCT_C_SetPOIState) == 0x000038, "Wrong size on POITriggerSCT_C_SetPOIState");
static_assert(offsetof(POITriggerSCT_C_SetPOIState, NewState) == 0x000000, "Member 'POITriggerSCT_C_SetPOIState::NewState' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_SetPOIState, CallFunc_GetGlobalObject_ReturnValue) == 0x000008, "Member 'POITriggerSCT_C_SetPOIState::CallFunc_GetGlobalObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_SetPOIState, CallFunc_GetGlobalObject_ReturnValue_1) == 0x000010, "Member 'POITriggerSCT_C_SetPOIState::CallFunc_GetGlobalObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_SetPOIState, K2Node_DynamicCast_AsOn_POIState_Changed) == 0x000018, "Member 'POITriggerSCT_C_SetPOIState::K2Node_DynamicCast_AsOn_POIState_Changed' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_SetPOIState, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'POITriggerSCT_C_SetPOIState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_SetPOIState, K2Node_DynamicCast_AsPOI_State) == 0x000028, "Member 'POITriggerSCT_C_SetPOIState::K2Node_DynamicCast_AsPOI_State' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_SetPOIState, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'POITriggerSCT_C_SetPOIState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_SetPOIState, CallFunc_GetPOIState_Visible) == 0x000031, "Member 'POITriggerSCT_C_SetPOIState::CallFunc_GetPOIState_Visible' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_SetPOIState, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000032, "Member 'POITriggerSCT_C_SetPOIState::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function POITriggerSCT.POITriggerSCT_C.GetPOIState
// 0x0020 (0x0020 - 0x0000)
struct POITriggerSCT_C_GetPOIState final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetGlobalObject_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPOI_State_C*                           K2Node_DynamicCast_AsPOI_State;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsVisible_Visible;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(POITriggerSCT_C_GetPOIState) == 0x000008, "Wrong alignment on POITriggerSCT_C_GetPOIState");
static_assert(sizeof(POITriggerSCT_C_GetPOIState) == 0x000020, "Wrong size on POITriggerSCT_C_GetPOIState");
static_assert(offsetof(POITriggerSCT_C_GetPOIState, Visible) == 0x000000, "Member 'POITriggerSCT_C_GetPOIState::Visible' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_GetPOIState, CallFunc_GetGlobalObject_ReturnValue) == 0x000008, "Member 'POITriggerSCT_C_GetPOIState::CallFunc_GetGlobalObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(POITriggerSCT_C_GetPOIState, K2Node_DynamicCast_AsPOI_State) == 0x000010, "Member 'POITriggerSCT_C_GetPOIState::K2Node_DynamicCast_AsPOI_State' has a wrong offset!");
