#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PushCharacterGA

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PushCharacterGA.PushCharacterGA_C.ExecuteUbergraph_PushCharacterGA
// 0x0068 (0x0068 - 0x0000)
struct PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_CalculatePushVelocity_TargetCharacter;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalculatePushVelocity_LaunchVelocity;     // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharacterSCT_C>      K2Node_DynamicCast_AsICharacter_SCT;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP_1;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA) == 0x000008, "Wrong alignment on PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA");
static_assert(sizeof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA) == 0x000068, "Wrong size on PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, EntryPoint) == 0x000000, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, CallFunc_CalculatePushVelocity_TargetCharacter) == 0x000008, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::CallFunc_CalculatePushVelocity_TargetCharacter' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, CallFunc_CalculatePushVelocity_LaunchVelocity) == 0x000010, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::CallFunc_CalculatePushVelocity_LaunchVelocity' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, K2Node_DynamicCast_AsICharacter_SCT) == 0x000020, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::K2Node_DynamicCast_AsICharacter_SCT' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000040, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000050, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, K2Node_DynamicCast_AsCharacter_SCTBP_1) == 0x000058, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::K2Node_DynamicCast_AsCharacter_SCTBP_1' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA, CallFunc_K2_CommitAbility_ReturnValue) == 0x000061, "Member 'PushCharacterGA_C_ExecuteUbergraph_PushCharacterGA::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function PushCharacterGA.PushCharacterGA_C.CalculatePushVelocity
// 0x0050 (0x0050 - 0x0000)
struct PushCharacterGA_C_CalculatePushVelocity final
{
public:
	class AActor*                                 TargetCharacter;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaunchVelocity;                                    // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetCharacterFromActorInfo_Character;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlternatePushForce_Force;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PushCharacterGA_C_CalculatePushVelocity) == 0x000008, "Wrong alignment on PushCharacterGA_C_CalculatePushVelocity");
static_assert(sizeof(PushCharacterGA_C_CalculatePushVelocity) == 0x000050, "Wrong size on PushCharacterGA_C_CalculatePushVelocity");
static_assert(offsetof(PushCharacterGA_C_CalculatePushVelocity, TargetCharacter) == 0x000000, "Member 'PushCharacterGA_C_CalculatePushVelocity::TargetCharacter' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_CalculatePushVelocity, LaunchVelocity) == 0x000008, "Member 'PushCharacterGA_C_CalculatePushVelocity::LaunchVelocity' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_CalculatePushVelocity, CallFunc_GetCharacterFromActorInfo_Character) == 0x000018, "Member 'PushCharacterGA_C_CalculatePushVelocity::CallFunc_GetCharacterFromActorInfo_Character' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_CalculatePushVelocity, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'PushCharacterGA_C_CalculatePushVelocity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_CalculatePushVelocity, K2Node_DynamicCast_AsCharacter) == 0x000028, "Member 'PushCharacterGA_C_CalculatePushVelocity::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_CalculatePushVelocity, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PushCharacterGA_C_CalculatePushVelocity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_CalculatePushVelocity, CallFunc_GetForwardVector_ReturnValue) == 0x000034, "Member 'PushCharacterGA_C_CalculatePushVelocity::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_CalculatePushVelocity, CallFunc_GetAlternatePushForce_Force) == 0x000040, "Member 'PushCharacterGA_C_CalculatePushVelocity::CallFunc_GetAlternatePushForce_Force' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_CalculatePushVelocity, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000044, "Member 'PushCharacterGA_C_CalculatePushVelocity::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function PushCharacterGA.PushCharacterGA_C.GetAlternatePushForce
// 0x0024 (0x0024 - 0x0000)
struct PushCharacterGA_C_GetAlternatePushForce final
{
public:
	struct FVector                                InForward;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Force;                                             // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PushCharacterGA_C_GetAlternatePushForce) == 0x000004, "Wrong alignment on PushCharacterGA_C_GetAlternatePushForce");
static_assert(sizeof(PushCharacterGA_C_GetAlternatePushForce) == 0x000024, "Wrong size on PushCharacterGA_C_GetAlternatePushForce");
static_assert(offsetof(PushCharacterGA_C_GetAlternatePushForce, InForward) == 0x000000, "Member 'PushCharacterGA_C_GetAlternatePushForce::InForward' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetAlternatePushForce, Force) == 0x00000C, "Member 'PushCharacterGA_C_GetAlternatePushForce::Force' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetAlternatePushForce, CallFunc_Dot_VectorVector_ReturnValue) == 0x000010, "Member 'PushCharacterGA_C_GetAlternatePushForce::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetAlternatePushForce, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'PushCharacterGA_C_GetAlternatePushForce::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetAlternatePushForce, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'PushCharacterGA_C_GetAlternatePushForce::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetAlternatePushForce, CallFunc_GetFloatValue_ReturnValue) == 0x00001C, "Member 'PushCharacterGA_C_GetAlternatePushForce::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetAlternatePushForce, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000020, "Member 'PushCharacterGA_C_GetAlternatePushForce::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function PushCharacterGA.PushCharacterGA_C.GetPushForce
// 0x0020 (0x0020 - 0x0000)
struct PushCharacterGA_C_GetPushForce final
{
public:
	struct FVector                                Forward;                                           // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PushCharacterGA_C_GetPushForce) == 0x000004, "Wrong alignment on PushCharacterGA_C_GetPushForce");
static_assert(sizeof(PushCharacterGA_C_GetPushForce) == 0x000020, "Wrong size on PushCharacterGA_C_GetPushForce");
static_assert(offsetof(PushCharacterGA_C_GetPushForce, Forward) == 0x000000, "Member 'PushCharacterGA_C_GetPushForce::Forward' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetPushForce, ReturnValue) == 0x00000C, "Member 'PushCharacterGA_C_GetPushForce::ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetPushForce, CallFunc_Dot_VectorVector_ReturnValue) == 0x000010, "Member 'PushCharacterGA_C_GetPushForce::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetPushForce, CallFunc_Abs_ReturnValue) == 0x000014, "Member 'PushCharacterGA_C_GetPushForce::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetPushForce, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'PushCharacterGA_C_GetPushForce::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PushCharacterGA_C_GetPushForce, CallFunc_Lerp_ReturnValue) == 0x00001C, "Member 'PushCharacterGA_C_GetPushForce::CallFunc_Lerp_ReturnValue' has a wrong offset!");

}

