#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RegionSelectedNotificationWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "VivoxImpl_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RegionSelectedNotificationWI.RegionSelectedNotificationWI_C
// 0x0048 (0x02A8 - 0x0260)
class URegionSelectedNotificationWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class URoundedBGBoxWI_C*                      RoundedBGBoxWI_1;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RegionNotification;                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ChinaRegionSelected;                               // 0x0278(0x0018)(Edit, BlueprintVisible)
	class FText                                   GlobalRegionSelected;                              // 0x0290(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_RegionSelectedNotificationWI(int32 EntryPoint);
	void Construct();
	void OnLogin(ELoginRegion Region);
	void OnInitialized();
	void Destruct();
	void UpdateNotificationText(ELoginRegion Region);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RegionSelectedNotificationWI_C">();
	}
	static class URegionSelectedNotificationWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URegionSelectedNotificationWI_C>();
	}
};
static_assert(alignof(URegionSelectedNotificationWI_C) == 0x000008, "Wrong alignment on URegionSelectedNotificationWI_C");
static_assert(sizeof(URegionSelectedNotificationWI_C) == 0x0002A8, "Wrong size on URegionSelectedNotificationWI_C");
static_assert(offsetof(URegionSelectedNotificationWI_C, UberGraphFrame) == 0x000260, "Member 'URegionSelectedNotificationWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URegionSelectedNotificationWI_C, RoundedBGBoxWI_1) == 0x000268, "Member 'URegionSelectedNotificationWI_C::RoundedBGBoxWI_1' has a wrong offset!");
static_assert(offsetof(URegionSelectedNotificationWI_C, TextBlock_RegionNotification) == 0x000270, "Member 'URegionSelectedNotificationWI_C::TextBlock_RegionNotification' has a wrong offset!");
static_assert(offsetof(URegionSelectedNotificationWI_C, ChinaRegionSelected) == 0x000278, "Member 'URegionSelectedNotificationWI_C::ChinaRegionSelected' has a wrong offset!");
static_assert(offsetof(URegionSelectedNotificationWI_C, GlobalRegionSelected) == 0x000290, "Member 'URegionSelectedNotificationWI_C::GlobalRegionSelected' has a wrong offset!");

}

