#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScannerDisplayWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScannerDisplayWI.ScannerDisplayWI_C
// 0x0058 (0x02B8 - 0x0260)
class UScannerDisplayWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Circleframe;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circleinnerbg;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circleinnerfront;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_118;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Linebottom;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Linetop;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlayerList;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         ResultText;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          PersonoidDetected;                                 // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_ScannerDisplayWI(int32 EntryPoint);
	void Audio_Post_Event(class UAkAudioEvent* AkEvent);
	void Scramble_Text();
	void Fade(bool In);
	void PreConstruct(bool IsDesignTime);
	void AddPlayerEntry(const class FText& CharacterName, float Padding_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScannerDisplayWI_C">();
	}
	static class UScannerDisplayWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScannerDisplayWI_C>();
	}
};
static_assert(alignof(UScannerDisplayWI_C) == 0x000008, "Wrong alignment on UScannerDisplayWI_C");
static_assert(sizeof(UScannerDisplayWI_C) == 0x0002B8, "Wrong size on UScannerDisplayWI_C");
static_assert(offsetof(UScannerDisplayWI_C, UberGraphFrame) == 0x000260, "Member 'UScannerDisplayWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScannerDisplayWI_C, FadeIn) == 0x000268, "Member 'UScannerDisplayWI_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UScannerDisplayWI_C, Circleframe) == 0x000270, "Member 'UScannerDisplayWI_C::Circleframe' has a wrong offset!");
static_assert(offsetof(UScannerDisplayWI_C, Circleinnerbg) == 0x000278, "Member 'UScannerDisplayWI_C::Circleinnerbg' has a wrong offset!");
static_assert(offsetof(UScannerDisplayWI_C, Circleinnerfront) == 0x000280, "Member 'UScannerDisplayWI_C::Circleinnerfront' has a wrong offset!");
static_assert(offsetof(UScannerDisplayWI_C, Image_118) == 0x000288, "Member 'UScannerDisplayWI_C::Image_118' has a wrong offset!");
static_assert(offsetof(UScannerDisplayWI_C, Linebottom) == 0x000290, "Member 'UScannerDisplayWI_C::Linebottom' has a wrong offset!");
static_assert(offsetof(UScannerDisplayWI_C, Linetop) == 0x000298, "Member 'UScannerDisplayWI_C::Linetop' has a wrong offset!");
static_assert(offsetof(UScannerDisplayWI_C, PlayerList) == 0x0002A0, "Member 'UScannerDisplayWI_C::PlayerList' has a wrong offset!");
static_assert(offsetof(UScannerDisplayWI_C, ResultText) == 0x0002A8, "Member 'UScannerDisplayWI_C::ResultText' has a wrong offset!");
static_assert(offsetof(UScannerDisplayWI_C, PersonoidDetected) == 0x0002B0, "Member 'UScannerDisplayWI_C::PersonoidDetected' has a wrong offset!");

}

