#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScannerGA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ContextItem_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ScannerGA.ScannerGA_C
// 0x0018 (0x0458 - 0x0440)
class UScannerGA_C final : public UContextItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACharacterSCTBP_C*                      ScannedPlayer;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAgendaCoopPowerEvent*                  CoopActionEvent;                                   // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ScannerGA(int32 EntryPoint);
	void Server_Scan_Score();
	void Audio_Post_Event(class UAkAudioEvent* AkEvent);
	void Start_Scan(bool IsPersonoid);
	void K2_ActivateAbility();
	void OnFinish_1357372548FE9F29870BEC9071104B56();
	void GiveScore();
	void CallEvent();
	void Add_Personoid_Scanned_Timestamp_To_Player_State();
	void AddGotScannedTimestampToPlayerState(class ACharacterSCTBP_C* Scanned_Player);
	void AddLastPlayerScannedToSelf();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScannerGA_C">();
	}
	static class UScannerGA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScannerGA_C>();
	}
};
static_assert(alignof(UScannerGA_C) == 0x000008, "Wrong alignment on UScannerGA_C");
static_assert(sizeof(UScannerGA_C) == 0x000458, "Wrong size on UScannerGA_C");
static_assert(offsetof(UScannerGA_C, UberGraphFrame) == 0x000440, "Member 'UScannerGA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScannerGA_C, ScannedPlayer) == 0x000448, "Member 'UScannerGA_C::ScannedPlayer' has a wrong offset!");
static_assert(offsetof(UScannerGA_C, CoopActionEvent) == 0x000450, "Member 'UScannerGA_C::CoopActionEvent' has a wrong offset!");

}

