#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreDetailsWI

#include "Basic.hpp"

#include "S_Score_structs.hpp"
#include "AkAudio_structs.hpp"
#include "E_ScoreCategories_structs.hpp"
#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function ScoreDetailsWI.ScoreDetailsWI_C.ExecuteUbergraph_ScoreDetailsWI
// 0x0208 (0x0208 - 0x0000)
struct ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ScoreCategories                             Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UScoreDetailsBoxWI_C*                   Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0068(0x0018)()
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0080(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0090(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScoreDetailsEntryWI_C*                 CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScoreEntry                            CallFunc_Array_Get_Item;                           // 0x00D8(0x000C)(NoDestructor)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScoreDetailsBoxWI_C*                   Temp_object_Variable_1;                            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00F0(0x0018)()
	struct FS_Score                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0108(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_ScoreCategories                             Temp_byte_Variable_1;                              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UScoreDetailsBoxWI_C*                   K2Node_Select_Default;                             // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScoreDetailsBoxWI_C*                   K2Node_Select_Default_1;                           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_2;                           // 0x0160(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0180(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x01A0(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Ubp_wi_EndScreen_Score_Entry_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x01C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubp_wi_EndScreen_Score_Entry_C*         CallFunc_Array_Get_Item_1;                         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerController_MatchBP_C*         K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSonyEnterButtonSwapped_ReturnValue;    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue;             // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue_1;             // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue_1;           // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI) == 0x000008, "Wrong alignment on ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI");
static_assert(sizeof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI) == 0x000208, "Wrong size on ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, EntryPoint) == 0x000000, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_byte_Variable) == 0x000004, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_object_Variable) == 0x000008, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_bool_Variable) == 0x000010, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_text_Variable) == 0x000018, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_text_Variable_1) == 0x000030, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_bool_Variable_1) == 0x000048, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_text_Variable_2) == 0x000050, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_text_Variable_3) == 0x000068, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_struct_Variable) == 0x000080, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_delegate_Variable) == 0x000090, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_GetPlayerController_ReturnValue) == 0x0000C0, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_int_Array_Index_Variable) == 0x0000D4, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_object_Variable_1) == 0x0000E8, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_Conv_IntToText_ReturnValue) == 0x0000F0, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_GetDataTableRowFromName_OutRow) == 0x000108, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000138, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_byte_Variable_1) == 0x000139, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, K2Node_Select_Default) == 0x000140, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, K2Node_Select_Default_1) == 0x000148, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_AddChild_ReturnValue) == 0x000150, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_AddChild_ReturnValue_1) == 0x000158, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, K2Node_Select_Default_2) == 0x000160, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_bool_Variable_2) == 0x000178, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, K2Node_Select_Default_3) == 0x00017C, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000180, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, Temp_int_Loop_Counter_Variable) == 0x000198, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_Less_IntInt_ReturnValue) == 0x00019C, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, K2Node_Select_Default_4) == 0x0001A0, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_Add_IntInt_ReturnValue) == 0x0001B8, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, K2Node_Event_IsDesignTime) == 0x0001BC, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0001C0, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x0001D0, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_Array_Get_Item_1) == 0x0001D8, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_IsValid_ReturnValue) == 0x0001E0, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_PostAkEvent_ReturnValue) == 0x0001E4, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001E8, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP) == 0x0001F0, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::K2Node_DynamicCast_AsSCTPlayer_Controller_Match_BP' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_GetSonyEnterButtonSwapped_ReturnValue) == 0x0001F9, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_GetSonyEnterButtonSwapped_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_IsXboxPlatform_ReturnValue) == 0x0001FA, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_IsXboxPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_IsWinGDKPlatform_ReturnValue) == 0x0001FB, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_IsWinGDKPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_BooleanOR_ReturnValue) == 0x0001FC, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_IsXboxPlatform_ReturnValue_1) == 0x0001FD, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_IsXboxPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_IsWinGDKPlatform_ReturnValue_1) == 0x0001FE, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_IsWinGDKPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_BooleanOR_ReturnValue_1) == 0x0001FF, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_IsEmpty_ReturnValue) == 0x000200, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_IsEmpty_ReturnValue_1) == 0x000201, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_Not_PreBool_ReturnValue) == 0x000202, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_Not_PreBool_ReturnValue_1) == 0x000203, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_BooleanAND_ReturnValue) == 0x000204, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI, CallFunc_BooleanAND_ReturnValue_1) == 0x000205, "Member 'ScoreDetailsWI_C_ExecuteUbergraph_ScoreDetailsWI::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function ScoreDetailsWI.ScoreDetailsWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ScoreDetailsWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScoreDetailsWI_C_PreConstruct) == 0x000001, "Wrong alignment on ScoreDetailsWI_C_PreConstruct");
static_assert(sizeof(ScoreDetailsWI_C_PreConstruct) == 0x000001, "Wrong size on ScoreDetailsWI_C_PreConstruct");
static_assert(offsetof(ScoreDetailsWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ScoreDetailsWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

