#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreDetailsEntryWI

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ScoreDetailsEntryWI.ScoreDetailsEntryWI_C.ExecuteUbergraph_ScoreDetailsEntryWI
// 0x0028 (0x0028 - 0x0000)
struct ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI) == 0x000008, "Wrong alignment on ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI");
static_assert(sizeof(ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI) == 0x000028, "Wrong size on ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI");
static_assert(offsetof(ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI, EntryPoint) == 0x000000, "Member 'ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI, Temp_bool_Variable) == 0x000004, "Member 'ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI, Temp_byte_Variable) == 0x000005, "Member 'ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI, Temp_byte_Variable_1) == 0x000006, "Member 'ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000020, "Member 'ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI, K2Node_Select_Default) == 0x000021, "Member 'ScoreDetailsEntryWI_C_ExecuteUbergraph_ScoreDetailsEntryWI::K2Node_Select_Default' has a wrong offset!");

}

