#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCT

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SCT_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function SCT.AccelByteUtilsFunctionLibrary.CreateCustomizationPacket
// 0x0078 (0x0078 - 0x0000)
struct AccelByteUtilsFunctionLibrary_CreateCustomizationPacket final
{
public:
	class ACustomizationOptions*                  Options;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayerCustomizationType                      Category;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCloudCustomizationPayload             Payload;                                           // 0x000C(0x0044)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FCloudCustomizationPacket              ReturnValue;                                       // 0x0050(0x0028)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteUtilsFunctionLibrary_CreateCustomizationPacket) == 0x000008, "Wrong alignment on AccelByteUtilsFunctionLibrary_CreateCustomizationPacket");
static_assert(sizeof(AccelByteUtilsFunctionLibrary_CreateCustomizationPacket) == 0x000078, "Wrong size on AccelByteUtilsFunctionLibrary_CreateCustomizationPacket");
static_assert(offsetof(AccelByteUtilsFunctionLibrary_CreateCustomizationPacket, Options) == 0x000000, "Member 'AccelByteUtilsFunctionLibrary_CreateCustomizationPacket::Options' has a wrong offset!");
static_assert(offsetof(AccelByteUtilsFunctionLibrary_CreateCustomizationPacket, Category) == 0x000008, "Member 'AccelByteUtilsFunctionLibrary_CreateCustomizationPacket::Category' has a wrong offset!");
static_assert(offsetof(AccelByteUtilsFunctionLibrary_CreateCustomizationPacket, Payload) == 0x00000C, "Member 'AccelByteUtilsFunctionLibrary_CreateCustomizationPacket::Payload' has a wrong offset!");
static_assert(offsetof(AccelByteUtilsFunctionLibrary_CreateCustomizationPacket, ReturnValue) == 0x000050, "Member 'AccelByteUtilsFunctionLibrary_CreateCustomizationPacket::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteUtilsFunctionLibrary.FormatAccelByteDateTimeToUnrealDateTime
// 0x0018 (0x0018 - 0x0000)
struct AccelByteUtilsFunctionLibrary_FormatAccelByteDateTimeToUnrealDateTime final
{
public:
	class FString                                 InConvertToDateTime;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteUtilsFunctionLibrary_FormatAccelByteDateTimeToUnrealDateTime) == 0x000008, "Wrong alignment on AccelByteUtilsFunctionLibrary_FormatAccelByteDateTimeToUnrealDateTime");
static_assert(sizeof(AccelByteUtilsFunctionLibrary_FormatAccelByteDateTimeToUnrealDateTime) == 0x000018, "Wrong size on AccelByteUtilsFunctionLibrary_FormatAccelByteDateTimeToUnrealDateTime");
static_assert(offsetof(AccelByteUtilsFunctionLibrary_FormatAccelByteDateTimeToUnrealDateTime, InConvertToDateTime) == 0x000000, "Member 'AccelByteUtilsFunctionLibrary_FormatAccelByteDateTimeToUnrealDateTime::InConvertToDateTime' has a wrong offset!");
static_assert(offsetof(AccelByteUtilsFunctionLibrary_FormatAccelByteDateTimeToUnrealDateTime, ReturnValue) == 0x000010, "Member 'AccelByteUtilsFunctionLibrary_FormatAccelByteDateTimeToUnrealDateTime::ReturnValue' has a wrong offset!");

// Function SCT.AbilitySystemComponentSCT.RemoveGameplayEffectsUsingType
// 0x0008 (0x0008 - 0x0000)
struct AbilitySystemComponentSCT_RemoveGameplayEffectsUsingType final
{
public:
	TSubclassOf<class UGameplayEffect>            EffectType;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponentSCT_RemoveGameplayEffectsUsingType) == 0x000008, "Wrong alignment on AbilitySystemComponentSCT_RemoveGameplayEffectsUsingType");
static_assert(sizeof(AbilitySystemComponentSCT_RemoveGameplayEffectsUsingType) == 0x000008, "Wrong size on AbilitySystemComponentSCT_RemoveGameplayEffectsUsingType");
static_assert(offsetof(AbilitySystemComponentSCT_RemoveGameplayEffectsUsingType, EffectType) == 0x000000, "Member 'AbilitySystemComponentSCT_RemoveGameplayEffectsUsingType::EffectType' has a wrong offset!");

// Function SCT.AbilitySystemComponentSCT.GetEffectInstigator
// 0x0010 (0x0010 - 0x0000)
struct AbilitySystemComponentSCT_GetEffectInstigator final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponentSCT_GetEffectInstigator) == 0x000008, "Wrong alignment on AbilitySystemComponentSCT_GetEffectInstigator");
static_assert(sizeof(AbilitySystemComponentSCT_GetEffectInstigator) == 0x000010, "Wrong size on AbilitySystemComponentSCT_GetEffectInstigator");
static_assert(offsetof(AbilitySystemComponentSCT_GetEffectInstigator, Tag) == 0x000000, "Member 'AbilitySystemComponentSCT_GetEffectInstigator::Tag' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponentSCT_GetEffectInstigator, ReturnValue) == 0x000008, "Member 'AbilitySystemComponentSCT_GetEffectInstigator::ReturnValue' has a wrong offset!");

// Function SCT.AgendaGenericEvent.Call
// 0x0008 (0x0008 - 0x0000)
struct AgendaGenericEvent_Call final
{
public:
	class AActor*                                 WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AgendaGenericEvent_Call) == 0x000008, "Wrong alignment on AgendaGenericEvent_Call");
static_assert(sizeof(AgendaGenericEvent_Call) == 0x000008, "Wrong size on AgendaGenericEvent_Call");
static_assert(offsetof(AgendaGenericEvent_Call, WorldContextObject) == 0x000000, "Member 'AgendaGenericEvent_Call::WorldContextObject' has a wrong offset!");

// Function SCT.FCTGetBlockedPlayerListCallbackProxy.GetBlockedPlayerList
// 0x0008 (0x0008 - 0x0000)
struct FCTGetBlockedPlayerListCallbackProxy_GetBlockedPlayerList final
{
public:
	class UFCTGetBlockedPlayerListCallbackProxy*  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCTGetBlockedPlayerListCallbackProxy_GetBlockedPlayerList) == 0x000008, "Wrong alignment on FCTGetBlockedPlayerListCallbackProxy_GetBlockedPlayerList");
static_assert(sizeof(FCTGetBlockedPlayerListCallbackProxy_GetBlockedPlayerList) == 0x000008, "Wrong size on FCTGetBlockedPlayerListCallbackProxy_GetBlockedPlayerList");
static_assert(offsetof(FCTGetBlockedPlayerListCallbackProxy_GetBlockedPlayerList, ReturnValue) == 0x000000, "Member 'FCTGetBlockedPlayerListCallbackProxy_GetBlockedPlayerList::ReturnValue' has a wrong offset!");

// Function SCT.AbilitySystemUtility.SendGameplayEvent
// 0x00C0 (0x00C0 - 0x0000)
struct AbilitySystemUtility_SendGameplayEvent final
{
public:
	class UAbilitySystemComponent*                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EventTag;                                          // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEventData                     Payload;                                           // 0x0010(0x00B0)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemUtility_SendGameplayEvent) == 0x000008, "Wrong alignment on AbilitySystemUtility_SendGameplayEvent");
static_assert(sizeof(AbilitySystemUtility_SendGameplayEvent) == 0x0000C0, "Wrong size on AbilitySystemUtility_SendGameplayEvent");
static_assert(offsetof(AbilitySystemUtility_SendGameplayEvent, Target) == 0x000000, "Member 'AbilitySystemUtility_SendGameplayEvent::Target' has a wrong offset!");
static_assert(offsetof(AbilitySystemUtility_SendGameplayEvent, EventTag) == 0x000008, "Member 'AbilitySystemUtility_SendGameplayEvent::EventTag' has a wrong offset!");
static_assert(offsetof(AbilitySystemUtility_SendGameplayEvent, Payload) == 0x000010, "Member 'AbilitySystemUtility_SendGameplayEvent::Payload' has a wrong offset!");

// Function SCT.CharacterSCT.DisableCameraRotationForDuration
// 0x0004 (0x0004 - 0x0000)
struct CharacterSCT_DisableCameraRotationForDuration final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_DisableCameraRotationForDuration) == 0x000004, "Wrong alignment on CharacterSCT_DisableCameraRotationForDuration");
static_assert(sizeof(CharacterSCT_DisableCameraRotationForDuration) == 0x000004, "Wrong size on CharacterSCT_DisableCameraRotationForDuration");
static_assert(offsetof(CharacterSCT_DisableCameraRotationForDuration, Duration) == 0x000000, "Member 'CharacterSCT_DisableCameraRotationForDuration::Duration' has a wrong offset!");

// Function SCT.CharacterSCT.DisableMovementForFrames
// 0x0004 (0x0004 - 0x0000)
struct CharacterSCT_DisableMovementForFrames final
{
public:
	int32                                         Frames;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_DisableMovementForFrames) == 0x000004, "Wrong alignment on CharacterSCT_DisableMovementForFrames");
static_assert(sizeof(CharacterSCT_DisableMovementForFrames) == 0x000004, "Wrong size on CharacterSCT_DisableMovementForFrames");
static_assert(offsetof(CharacterSCT_DisableMovementForFrames, Frames) == 0x000000, "Member 'CharacterSCT_DisableMovementForFrames::Frames' has a wrong offset!");

// Function SCT.CharacterSCT.IsUsingPower
// 0x0001 (0x0001 - 0x0000)
struct CharacterSCT_IsUsingPower final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_IsUsingPower) == 0x000001, "Wrong alignment on CharacterSCT_IsUsingPower");
static_assert(sizeof(CharacterSCT_IsUsingPower) == 0x000001, "Wrong size on CharacterSCT_IsUsingPower");
static_assert(offsetof(CharacterSCT_IsUsingPower, ReturnValue) == 0x000000, "Member 'CharacterSCT_IsUsingPower::ReturnValue' has a wrong offset!");

// Function SCT.CharacterSCT.K2_OnNameChanged
// 0x0010 (0x0010 - 0x0000)
struct CharacterSCT_K2_OnNameChanged final
{
public:
	class FString                                 NewName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_K2_OnNameChanged) == 0x000008, "Wrong alignment on CharacterSCT_K2_OnNameChanged");
static_assert(sizeof(CharacterSCT_K2_OnNameChanged) == 0x000010, "Wrong size on CharacterSCT_K2_OnNameChanged");
static_assert(offsetof(CharacterSCT_K2_OnNameChanged, NewName) == 0x000000, "Member 'CharacterSCT_K2_OnNameChanged::NewName' has a wrong offset!");

// Function SCT.CharacterSCT.K2_OnRepPlayerState
// 0x0001 (0x0001 - 0x0000)
struct CharacterSCT_K2_OnRepPlayerState final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_K2_OnRepPlayerState) == 0x000001, "Wrong alignment on CharacterSCT_K2_OnRepPlayerState");
static_assert(sizeof(CharacterSCT_K2_OnRepPlayerState) == 0x000001, "Wrong size on CharacterSCT_K2_OnRepPlayerState");
static_assert(offsetof(CharacterSCT_K2_OnRepPlayerState, IsValid) == 0x000000, "Member 'CharacterSCT_K2_OnRepPlayerState::IsValid' has a wrong offset!");

// Function SCT.CharacterSCT.K2_OnSetCustomization
// 0x0010 (0x0010 - 0x0000)
struct CharacterSCT_K2_OnSetCustomization final
{
public:
	class FString                                 PlayerAccelByteID;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_K2_OnSetCustomization) == 0x000008, "Wrong alignment on CharacterSCT_K2_OnSetCustomization");
static_assert(sizeof(CharacterSCT_K2_OnSetCustomization) == 0x000010, "Wrong size on CharacterSCT_K2_OnSetCustomization");
static_assert(offsetof(CharacterSCT_K2_OnSetCustomization, PlayerAccelByteID) == 0x000000, "Member 'CharacterSCT_K2_OnSetCustomization::PlayerAccelByteID' has a wrong offset!");

// Function SCT.CharacterSCT.OnDamaged
// 0x00C0 (0x00C0 - 0x0000)
struct CharacterSCT_OnDamaged final
{
public:
	float                                         DamageAmount;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitInfo;                                           // 0x0004(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0090(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class ACharacterSCT*                          InstigatorCharacter;                               // 0x00B0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x00B8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_OnDamaged) == 0x000008, "Wrong alignment on CharacterSCT_OnDamaged");
static_assert(sizeof(CharacterSCT_OnDamaged) == 0x0000C0, "Wrong size on CharacterSCT_OnDamaged");
static_assert(offsetof(CharacterSCT_OnDamaged, DamageAmount) == 0x000000, "Member 'CharacterSCT_OnDamaged::DamageAmount' has a wrong offset!");
static_assert(offsetof(CharacterSCT_OnDamaged, HitInfo) == 0x000004, "Member 'CharacterSCT_OnDamaged::HitInfo' has a wrong offset!");
static_assert(offsetof(CharacterSCT_OnDamaged, DamageTags) == 0x000090, "Member 'CharacterSCT_OnDamaged::DamageTags' has a wrong offset!");
static_assert(offsetof(CharacterSCT_OnDamaged, InstigatorCharacter) == 0x0000B0, "Member 'CharacterSCT_OnDamaged::InstigatorCharacter' has a wrong offset!");
static_assert(offsetof(CharacterSCT_OnDamaged, DamageCauser) == 0x0000B8, "Member 'CharacterSCT_OnDamaged::DamageCauser' has a wrong offset!");

// Function SCT.CharacterSCT.OnHealthChanged
// 0x0028 (0x0028 - 0x0000)
struct CharacterSCT_OnHealthChanged final
{
public:
	float                                         DeltaValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  EventTags;                                         // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_OnHealthChanged) == 0x000008, "Wrong alignment on CharacterSCT_OnHealthChanged");
static_assert(sizeof(CharacterSCT_OnHealthChanged) == 0x000028, "Wrong size on CharacterSCT_OnHealthChanged");
static_assert(offsetof(CharacterSCT_OnHealthChanged, DeltaValue) == 0x000000, "Member 'CharacterSCT_OnHealthChanged::DeltaValue' has a wrong offset!");
static_assert(offsetof(CharacterSCT_OnHealthChanged, EventTags) == 0x000008, "Member 'CharacterSCT_OnHealthChanged::EventTags' has a wrong offset!");

// Function SCT.CharacterSCT.OnManaChanged
// 0x0028 (0x0028 - 0x0000)
struct CharacterSCT_OnManaChanged final
{
public:
	float                                         DeltaValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  EventTags;                                         // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_OnManaChanged) == 0x000008, "Wrong alignment on CharacterSCT_OnManaChanged");
static_assert(sizeof(CharacterSCT_OnManaChanged) == 0x000028, "Wrong size on CharacterSCT_OnManaChanged");
static_assert(offsetof(CharacterSCT_OnManaChanged, DeltaValue) == 0x000000, "Member 'CharacterSCT_OnManaChanged::DeltaValue' has a wrong offset!");
static_assert(offsetof(CharacterSCT_OnManaChanged, EventTags) == 0x000008, "Member 'CharacterSCT_OnManaChanged::EventTags' has a wrong offset!");

// Function SCT.CharacterSCT.OnMoveSpeedChanged
// 0x0004 (0x0004 - 0x0000)
struct CharacterSCT_OnMoveSpeedChanged final
{
public:
	float                                         MovementSpeed;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_OnMoveSpeedChanged) == 0x000004, "Wrong alignment on CharacterSCT_OnMoveSpeedChanged");
static_assert(sizeof(CharacterSCT_OnMoveSpeedChanged) == 0x000004, "Wrong size on CharacterSCT_OnMoveSpeedChanged");
static_assert(offsetof(CharacterSCT_OnMoveSpeedChanged, MovementSpeed) == 0x000000, "Member 'CharacterSCT_OnMoveSpeedChanged::MovementSpeed' has a wrong offset!");

// Function SCT.CharacterSCT.OnNameChanged
// 0x0010 (0x0010 - 0x0000)
struct CharacterSCT_OnNameChanged final
{
public:
	class FString                                 NewName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_OnNameChanged) == 0x000008, "Wrong alignment on CharacterSCT_OnNameChanged");
static_assert(sizeof(CharacterSCT_OnNameChanged) == 0x000010, "Wrong size on CharacterSCT_OnNameChanged");
static_assert(offsetof(CharacterSCT_OnNameChanged, NewName) == 0x000000, "Member 'CharacterSCT_OnNameChanged::NewName' has a wrong offset!");

// Function SCT.CharacterSCT.Silence
// 0x0004 (0x0004 - 0x0000)
struct CharacterSCT_Silence final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_Silence) == 0x000004, "Wrong alignment on CharacterSCT_Silence");
static_assert(sizeof(CharacterSCT_Silence) == 0x000004, "Wrong size on CharacterSCT_Silence");
static_assert(offsetof(CharacterSCT_Silence, Duration) == 0x000000, "Member 'CharacterSCT_Silence::Duration' has a wrong offset!");

// Function SCT.CharacterSCT.CanRotateCamera
// 0x0001 (0x0001 - 0x0000)
struct CharacterSCT_CanRotateCamera final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_CanRotateCamera) == 0x000001, "Wrong alignment on CharacterSCT_CanRotateCamera");
static_assert(sizeof(CharacterSCT_CanRotateCamera) == 0x000001, "Wrong size on CharacterSCT_CanRotateCamera");
static_assert(offsetof(CharacterSCT_CanRotateCamera, ReturnValue) == 0x000000, "Member 'CharacterSCT_CanRotateCamera::ReturnValue' has a wrong offset!");

// Function SCT.CharacterSCT.CanRotateCharacter
// 0x0001 (0x0001 - 0x0000)
struct CharacterSCT_CanRotateCharacter final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_CanRotateCharacter) == 0x000001, "Wrong alignment on CharacterSCT_CanRotateCharacter");
static_assert(sizeof(CharacterSCT_CanRotateCharacter) == 0x000001, "Wrong size on CharacterSCT_CanRotateCharacter");
static_assert(offsetof(CharacterSCT_CanRotateCharacter, ReturnValue) == 0x000000, "Member 'CharacterSCT_CanRotateCharacter::ReturnValue' has a wrong offset!");

// Function SCT.CharacterSCT.GetCharacerLevel
// 0x0004 (0x0004 - 0x0000)
struct CharacterSCT_GetCharacerLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_GetCharacerLevel) == 0x000004, "Wrong alignment on CharacterSCT_GetCharacerLevel");
static_assert(sizeof(CharacterSCT_GetCharacerLevel) == 0x000004, "Wrong size on CharacterSCT_GetCharacerLevel");
static_assert(offsetof(CharacterSCT_GetCharacerLevel, ReturnValue) == 0x000000, "Member 'CharacterSCT_GetCharacerLevel::ReturnValue' has a wrong offset!");

// Function SCT.CharacterSCT.GetFate
// 0x0001 (0x0001 - 0x0000)
struct CharacterSCT_GetFate final
{
public:
	EFate                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_GetFate) == 0x000001, "Wrong alignment on CharacterSCT_GetFate");
static_assert(sizeof(CharacterSCT_GetFate) == 0x000001, "Wrong size on CharacterSCT_GetFate");
static_assert(offsetof(CharacterSCT_GetFate, ReturnValue) == 0x000000, "Member 'CharacterSCT_GetFate::ReturnValue' has a wrong offset!");

// Function SCT.CharacterSCT.GetSCTPlayerState
// 0x0008 (0x0008 - 0x0000)
struct CharacterSCT_GetSCTPlayerState final
{
public:
	class ASCTPlayerState*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_GetSCTPlayerState) == 0x000008, "Wrong alignment on CharacterSCT_GetSCTPlayerState");
static_assert(sizeof(CharacterSCT_GetSCTPlayerState) == 0x000008, "Wrong size on CharacterSCT_GetSCTPlayerState");
static_assert(offsetof(CharacterSCT_GetSCTPlayerState, ReturnValue) == 0x000000, "Member 'CharacterSCT_GetSCTPlayerState::ReturnValue' has a wrong offset!");

// Function SCT.CharacterSCT.IsAlive
// 0x0001 (0x0001 - 0x0000)
struct CharacterSCT_IsAlive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_IsAlive) == 0x000001, "Wrong alignment on CharacterSCT_IsAlive");
static_assert(sizeof(CharacterSCT_IsAlive) == 0x000001, "Wrong size on CharacterSCT_IsAlive");
static_assert(offsetof(CharacterSCT_IsAlive, ReturnValue) == 0x000000, "Member 'CharacterSCT_IsAlive::ReturnValue' has a wrong offset!");

// Function SCT.CharacterSCT.IsFateKnown
// 0x0001 (0x0001 - 0x0000)
struct CharacterSCT_IsFateKnown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_IsFateKnown) == 0x000001, "Wrong alignment on CharacterSCT_IsFateKnown");
static_assert(sizeof(CharacterSCT_IsFateKnown) == 0x000001, "Wrong size on CharacterSCT_IsFateKnown");
static_assert(offsetof(CharacterSCT_IsFateKnown, ReturnValue) == 0x000000, "Member 'CharacterSCT_IsFateKnown::ReturnValue' has a wrong offset!");

// Function SCT.CharacterSCT.IsImmovable
// 0x0001 (0x0001 - 0x0000)
struct CharacterSCT_IsImmovable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_IsImmovable) == 0x000001, "Wrong alignment on CharacterSCT_IsImmovable");
static_assert(sizeof(CharacterSCT_IsImmovable) == 0x000001, "Wrong size on CharacterSCT_IsImmovable");
static_assert(offsetof(CharacterSCT_IsImmovable, ReturnValue) == 0x000000, "Member 'CharacterSCT_IsImmovable::ReturnValue' has a wrong offset!");

// Function SCT.CharacterSCT.IsInactive
// 0x0001 (0x0001 - 0x0000)
struct CharacterSCT_IsInactive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_IsInactive) == 0x000001, "Wrong alignment on CharacterSCT_IsInactive");
static_assert(sizeof(CharacterSCT_IsInactive) == 0x000001, "Wrong size on CharacterSCT_IsInactive");
static_assert(offsetof(CharacterSCT_IsInactive, ReturnValue) == 0x000000, "Member 'CharacterSCT_IsInactive::ReturnValue' has a wrong offset!");

// Function SCT.CharacterSCT.K2_CanCrouch
// 0x0001 (0x0001 - 0x0000)
struct CharacterSCT_K2_CanCrouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSCT_K2_CanCrouch) == 0x000001, "Wrong alignment on CharacterSCT_K2_CanCrouch");
static_assert(sizeof(CharacterSCT_K2_CanCrouch) == 0x000001, "Wrong size on CharacterSCT_K2_CanCrouch");
static_assert(offsetof(CharacterSCT_K2_CanCrouch, ReturnValue) == 0x000000, "Member 'CharacterSCT_K2_CanCrouch::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteGIS.AddNewAchievementToQueue
// 0x0008 (0x0008 - 0x0000)
struct AccelByteGIS_AddNewAchievementToQueue final
{
public:
	class UFCTAchievement*                        NewAchievement;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_AddNewAchievementToQueue) == 0x000008, "Wrong alignment on AccelByteGIS_AddNewAchievementToQueue");
static_assert(sizeof(AccelByteGIS_AddNewAchievementToQueue) == 0x000008, "Wrong size on AccelByteGIS_AddNewAchievementToQueue");
static_assert(offsetof(AccelByteGIS_AddNewAchievementToQueue, NewAchievement) == 0x000000, "Member 'AccelByteGIS_AddNewAchievementToQueue::NewAchievement' has a wrong offset!");

// Function SCT.AccelByteGIS.CachePlayedWithLastMatchUser
// 0x0010 (0x0010 - 0x0000)
struct AccelByteGIS_CachePlayedWithLastMatchUser final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_CachePlayedWithLastMatchUser) == 0x000008, "Wrong alignment on AccelByteGIS_CachePlayedWithLastMatchUser");
static_assert(sizeof(AccelByteGIS_CachePlayedWithLastMatchUser) == 0x000010, "Wrong size on AccelByteGIS_CachePlayedWithLastMatchUser");
static_assert(offsetof(AccelByteGIS_CachePlayedWithLastMatchUser, UserId) == 0x000000, "Member 'AccelByteGIS_CachePlayedWithLastMatchUser::UserId' has a wrong offset!");

// Function SCT.AccelByteGIS.GetCachedLastMatchUsers
// 0x0010 (0x0010 - 0x0000)
struct AccelByteGIS_GetCachedLastMatchUsers final
{
public:
	struct FFCTRecentlyPlayedWithPayload          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_GetCachedLastMatchUsers) == 0x000008, "Wrong alignment on AccelByteGIS_GetCachedLastMatchUsers");
static_assert(sizeof(AccelByteGIS_GetCachedLastMatchUsers) == 0x000010, "Wrong size on AccelByteGIS_GetCachedLastMatchUsers");
static_assert(offsetof(AccelByteGIS_GetCachedLastMatchUsers, ReturnValue) == 0x000000, "Member 'AccelByteGIS_GetCachedLastMatchUsers::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteGIS.GetGameCrossplayEnabled
// 0x0001 (0x0001 - 0x0000)
struct AccelByteGIS_GetGameCrossplayEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_GetGameCrossplayEnabled) == 0x000001, "Wrong alignment on AccelByteGIS_GetGameCrossplayEnabled");
static_assert(sizeof(AccelByteGIS_GetGameCrossplayEnabled) == 0x000001, "Wrong size on AccelByteGIS_GetGameCrossplayEnabled");
static_assert(offsetof(AccelByteGIS_GetGameCrossplayEnabled, ReturnValue) == 0x000000, "Member 'AccelByteGIS_GetGameCrossplayEnabled::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteGIS.GetPlatformPlayerNickname
// 0x0010 (0x0010 - 0x0000)
struct AccelByteGIS_GetPlatformPlayerNickname final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_GetPlatformPlayerNickname) == 0x000008, "Wrong alignment on AccelByteGIS_GetPlatformPlayerNickname");
static_assert(sizeof(AccelByteGIS_GetPlatformPlayerNickname) == 0x000010, "Wrong size on AccelByteGIS_GetPlatformPlayerNickname");
static_assert(offsetof(AccelByteGIS_GetPlatformPlayerNickname, ReturnValue) == 0x000000, "Member 'AccelByteGIS_GetPlatformPlayerNickname::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteGIS.GetSyncPlatformPurchasesRateLimited
// 0x0001 (0x0001 - 0x0000)
struct AccelByteGIS_GetSyncPlatformPurchasesRateLimited final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_GetSyncPlatformPurchasesRateLimited) == 0x000001, "Wrong alignment on AccelByteGIS_GetSyncPlatformPurchasesRateLimited");
static_assert(sizeof(AccelByteGIS_GetSyncPlatformPurchasesRateLimited) == 0x000001, "Wrong size on AccelByteGIS_GetSyncPlatformPurchasesRateLimited");
static_assert(offsetof(AccelByteGIS_GetSyncPlatformPurchasesRateLimited, ReturnValue) == 0x000000, "Member 'AccelByteGIS_GetSyncPlatformPurchasesRateLimited::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteGIS.GetXboxCrossPlayRestricted
// 0x0001 (0x0001 - 0x0000)
struct AccelByteGIS_GetXboxCrossPlayRestricted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_GetXboxCrossPlayRestricted) == 0x000001, "Wrong alignment on AccelByteGIS_GetXboxCrossPlayRestricted");
static_assert(sizeof(AccelByteGIS_GetXboxCrossPlayRestricted) == 0x000001, "Wrong size on AccelByteGIS_GetXboxCrossPlayRestricted");
static_assert(offsetof(AccelByteGIS_GetXboxCrossPlayRestricted, ReturnValue) == 0x000000, "Member 'AccelByteGIS_GetXboxCrossPlayRestricted::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteGIS.HasPendingConsoleLaunchIntent
// 0x0001 (0x0001 - 0x0000)
struct AccelByteGIS_HasPendingConsoleLaunchIntent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_HasPendingConsoleLaunchIntent) == 0x000001, "Wrong alignment on AccelByteGIS_HasPendingConsoleLaunchIntent");
static_assert(sizeof(AccelByteGIS_HasPendingConsoleLaunchIntent) == 0x000001, "Wrong size on AccelByteGIS_HasPendingConsoleLaunchIntent");
static_assert(offsetof(AccelByteGIS_HasPendingConsoleLaunchIntent, ReturnValue) == 0x000000, "Member 'AccelByteGIS_HasPendingConsoleLaunchIntent::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteGIS.HasPendingConsoleLaunchMultiplayerIntent
// 0x0001 (0x0001 - 0x0000)
struct AccelByteGIS_HasPendingConsoleLaunchMultiplayerIntent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_HasPendingConsoleLaunchMultiplayerIntent) == 0x000001, "Wrong alignment on AccelByteGIS_HasPendingConsoleLaunchMultiplayerIntent");
static_assert(sizeof(AccelByteGIS_HasPendingConsoleLaunchMultiplayerIntent) == 0x000001, "Wrong size on AccelByteGIS_HasPendingConsoleLaunchMultiplayerIntent");
static_assert(offsetof(AccelByteGIS_HasPendingConsoleLaunchMultiplayerIntent, ReturnValue) == 0x000000, "Member 'AccelByteGIS_HasPendingConsoleLaunchMultiplayerIntent::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteGIS.HasPendingConsoleSessionInvite
// 0x0001 (0x0001 - 0x0000)
struct AccelByteGIS_HasPendingConsoleSessionInvite final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_HasPendingConsoleSessionInvite) == 0x000001, "Wrong alignment on AccelByteGIS_HasPendingConsoleSessionInvite");
static_assert(sizeof(AccelByteGIS_HasPendingConsoleSessionInvite) == 0x000001, "Wrong size on AccelByteGIS_HasPendingConsoleSessionInvite");
static_assert(offsetof(AccelByteGIS_HasPendingConsoleSessionInvite, ReturnValue) == 0x000000, "Member 'AccelByteGIS_HasPendingConsoleSessionInvite::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteGIS.IsLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct AccelByteGIS_IsLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_IsLoggedIn) == 0x000001, "Wrong alignment on AccelByteGIS_IsLoggedIn");
static_assert(sizeof(AccelByteGIS_IsLoggedIn) == 0x000001, "Wrong size on AccelByteGIS_IsLoggedIn");
static_assert(offsetof(AccelByteGIS_IsLoggedIn, ReturnValue) == 0x000000, "Member 'AccelByteGIS_IsLoggedIn::ReturnValue' has a wrong offset!");

// Function SCT.AccelByteGIS.LoginClientWithDelay
// 0x0004 (0x0004 - 0x0000)
struct AccelByteGIS_LoginClientWithDelay final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_LoginClientWithDelay) == 0x000004, "Wrong alignment on AccelByteGIS_LoginClientWithDelay");
static_assert(sizeof(AccelByteGIS_LoginClientWithDelay) == 0x000004, "Wrong size on AccelByteGIS_LoginClientWithDelay");
static_assert(offsetof(AccelByteGIS_LoginClientWithDelay, Delay) == 0x000000, "Member 'AccelByteGIS_LoginClientWithDelay::Delay' has a wrong offset!");

// Function SCT.AccelByteGIS.OnAchievementPopUpCreated
// 0x0008 (0x0008 - 0x0000)
struct AccelByteGIS_OnAchievementPopUpCreated final
{
public:
	class UTexture2DDynamic*                      IconTexture;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_OnAchievementPopUpCreated) == 0x000008, "Wrong alignment on AccelByteGIS_OnAchievementPopUpCreated");
static_assert(sizeof(AccelByteGIS_OnAchievementPopUpCreated) == 0x000008, "Wrong size on AccelByteGIS_OnAchievementPopUpCreated");
static_assert(offsetof(AccelByteGIS_OnAchievementPopUpCreated, IconTexture) == 0x000000, "Member 'AccelByteGIS_OnAchievementPopUpCreated::IconTexture' has a wrong offset!");

// Function SCT.AccelByteGIS.SetGameCrossplayEnabled
// 0x0001 (0x0001 - 0x0000)
struct AccelByteGIS_SetGameCrossplayEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_SetGameCrossplayEnabled) == 0x000001, "Wrong alignment on AccelByteGIS_SetGameCrossplayEnabled");
static_assert(sizeof(AccelByteGIS_SetGameCrossplayEnabled) == 0x000001, "Wrong size on AccelByteGIS_SetGameCrossplayEnabled");
static_assert(offsetof(AccelByteGIS_SetGameCrossplayEnabled, bInEnabled) == 0x000000, "Member 'AccelByteGIS_SetGameCrossplayEnabled::bInEnabled' has a wrong offset!");

// Function SCT.AccelByteGIS.SetXboxCrossPlayRestricted
// 0x0001 (0x0001 - 0x0000)
struct AccelByteGIS_SetXboxCrossPlayRestricted final
{
public:
	bool                                          bInRestricted;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteGIS_SetXboxCrossPlayRestricted) == 0x000001, "Wrong alignment on AccelByteGIS_SetXboxCrossPlayRestricted");
static_assert(sizeof(AccelByteGIS_SetXboxCrossPlayRestricted) == 0x000001, "Wrong size on AccelByteGIS_SetXboxCrossPlayRestricted");
static_assert(offsetof(AccelByteGIS_SetXboxCrossPlayRestricted, bInRestricted) == 0x000000, "Member 'AccelByteGIS_SetXboxCrossPlayRestricted::bInRestricted' has a wrong offset!");

// Function SCT.AccelByteGIS.UpdatePlatformAchievementProgress
// 0x0018 (0x0018 - 0x0000)
struct AccelByteGIS_UpdatePlatformAchievementProgress final
{
public:
	class FString                                 AchievementID;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Progress;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AccelByteGIS_UpdatePlatformAchievementProgress) == 0x000008, "Wrong alignment on AccelByteGIS_UpdatePlatformAchievementProgress");
static_assert(sizeof(AccelByteGIS_UpdatePlatformAchievementProgress) == 0x000018, "Wrong size on AccelByteGIS_UpdatePlatformAchievementProgress");
static_assert(offsetof(AccelByteGIS_UpdatePlatformAchievementProgress, AchievementID) == 0x000000, "Member 'AccelByteGIS_UpdatePlatformAchievementProgress::AchievementID' has a wrong offset!");
static_assert(offsetof(AccelByteGIS_UpdatePlatformAchievementProgress, Progress) == 0x000010, "Member 'AccelByteGIS_UpdatePlatformAchievementProgress::Progress' has a wrong offset!");

// Function SCT.ProgressionObject.GetCharacter
// 0x0008 (0x0008 - 0x0000)
struct ProgressionObject_GetCharacter final
{
public:
	class ACharacterSCT*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProgressionObject_GetCharacter) == 0x000008, "Wrong alignment on ProgressionObject_GetCharacter");
static_assert(sizeof(ProgressionObject_GetCharacter) == 0x000008, "Wrong size on ProgressionObject_GetCharacter");
static_assert(offsetof(ProgressionObject_GetCharacter, ReturnValue) == 0x000000, "Member 'ProgressionObject_GetCharacter::ReturnValue' has a wrong offset!");

// Function SCT.ProgressionObject.GetController
// 0x0008 (0x0008 - 0x0000)
struct ProgressionObject_GetController final
{
public:
	class ASCTPlayerController*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProgressionObject_GetController) == 0x000008, "Wrong alignment on ProgressionObject_GetController");
static_assert(sizeof(ProgressionObject_GetController) == 0x000008, "Wrong size on ProgressionObject_GetController");
static_assert(offsetof(ProgressionObject_GetController, ReturnValue) == 0x000000, "Member 'ProgressionObject_GetController::ReturnValue' has a wrong offset!");

// Function SCT.ProgressionObject.GetGameState
// 0x0008 (0x0008 - 0x0000)
struct ProgressionObject_GetGameState final
{
public:
	class ASCTGameState*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProgressionObject_GetGameState) == 0x000008, "Wrong alignment on ProgressionObject_GetGameState");
static_assert(sizeof(ProgressionObject_GetGameState) == 0x000008, "Wrong size on ProgressionObject_GetGameState");
static_assert(offsetof(ProgressionObject_GetGameState, ReturnValue) == 0x000000, "Member 'ProgressionObject_GetGameState::ReturnValue' has a wrong offset!");

// Function SCT.ProgressionObject.GetMaxNumberOfPlayers
// 0x0004 (0x0004 - 0x0000)
struct ProgressionObject_GetMaxNumberOfPlayers final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProgressionObject_GetMaxNumberOfPlayers) == 0x000004, "Wrong alignment on ProgressionObject_GetMaxNumberOfPlayers");
static_assert(sizeof(ProgressionObject_GetMaxNumberOfPlayers) == 0x000004, "Wrong size on ProgressionObject_GetMaxNumberOfPlayers");
static_assert(offsetof(ProgressionObject_GetMaxNumberOfPlayers, ReturnValue) == 0x000000, "Member 'ProgressionObject_GetMaxNumberOfPlayers::ReturnValue' has a wrong offset!");

// Function SCT.ProgressionObject.GetPlayerState
// 0x0008 (0x0008 - 0x0000)
struct ProgressionObject_GetPlayerState final
{
public:
	class ASCTPlayerState*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProgressionObject_GetPlayerState) == 0x000008, "Wrong alignment on ProgressionObject_GetPlayerState");
static_assert(sizeof(ProgressionObject_GetPlayerState) == 0x000008, "Wrong size on ProgressionObject_GetPlayerState");
static_assert(offsetof(ProgressionObject_GetPlayerState, ReturnValue) == 0x000000, "Member 'ProgressionObject_GetPlayerState::ReturnValue' has a wrong offset!");

// Function SCT.ProgressionObject.GetRandomOtherPlayer
// 0x0008 (0x0008 - 0x0000)
struct ProgressionObject_GetRandomOtherPlayer final
{
public:
	class ASCTPlayerState*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProgressionObject_GetRandomOtherPlayer) == 0x000008, "Wrong alignment on ProgressionObject_GetRandomOtherPlayer");
static_assert(sizeof(ProgressionObject_GetRandomOtherPlayer) == 0x000008, "Wrong size on ProgressionObject_GetRandomOtherPlayer");
static_assert(offsetof(ProgressionObject_GetRandomOtherPlayer, ReturnValue) == 0x000000, "Member 'ProgressionObject_GetRandomOtherPlayer::ReturnValue' has a wrong offset!");

// Function SCT.ProgressionObject.GetRandomPlayer
// 0x0018 (0x0018 - 0x0000)
struct ProgressionObject_GetRandomPlayer final
{
public:
	TArray<class APlayerState*>                   Ignore;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class ASCTPlayerState*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProgressionObject_GetRandomPlayer) == 0x000008, "Wrong alignment on ProgressionObject_GetRandomPlayer");
static_assert(sizeof(ProgressionObject_GetRandomPlayer) == 0x000018, "Wrong size on ProgressionObject_GetRandomPlayer");
static_assert(offsetof(ProgressionObject_GetRandomPlayer, Ignore) == 0x000000, "Member 'ProgressionObject_GetRandomPlayer::Ignore' has a wrong offset!");
static_assert(offsetof(ProgressionObject_GetRandomPlayer, ReturnValue) == 0x000010, "Member 'ProgressionObject_GetRandomPlayer::ReturnValue' has a wrong offset!");

// Function SCT.ProgressionObject.GetWorldContextObject
// 0x0008 (0x0008 - 0x0000)
struct ProgressionObject_GetWorldContextObject final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProgressionObject_GetWorldContextObject) == 0x000008, "Wrong alignment on ProgressionObject_GetWorldContextObject");
static_assert(sizeof(ProgressionObject_GetWorldContextObject) == 0x000008, "Wrong size on ProgressionObject_GetWorldContextObject");
static_assert(offsetof(ProgressionObject_GetWorldContextObject, ReturnValue) == 0x000000, "Member 'ProgressionObject_GetWorldContextObject::ReturnValue' has a wrong offset!");

// Function SCT.ProgressionObject.IsControllerSelf
// 0x0010 (0x0010 - 0x0000)
struct ProgressionObject_IsControllerSelf final
{
public:
	class APlayerController*                      Other;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProgressionObject_IsControllerSelf) == 0x000008, "Wrong alignment on ProgressionObject_IsControllerSelf");
static_assert(sizeof(ProgressionObject_IsControllerSelf) == 0x000010, "Wrong size on ProgressionObject_IsControllerSelf");
static_assert(offsetof(ProgressionObject_IsControllerSelf, Other) == 0x000000, "Member 'ProgressionObject_IsControllerSelf::Other' has a wrong offset!");
static_assert(offsetof(ProgressionObject_IsControllerSelf, ReturnValue) == 0x000008, "Member 'ProgressionObject_IsControllerSelf::ReturnValue' has a wrong offset!");

// Function SCT.ProgressionObject.IsPlayerStateSelf
// 0x0010 (0x0010 - 0x0000)
struct ProgressionObject_IsPlayerStateSelf final
{
public:
	class APlayerState*                           Other;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProgressionObject_IsPlayerStateSelf) == 0x000008, "Wrong alignment on ProgressionObject_IsPlayerStateSelf");
static_assert(sizeof(ProgressionObject_IsPlayerStateSelf) == 0x000010, "Wrong size on ProgressionObject_IsPlayerStateSelf");
static_assert(offsetof(ProgressionObject_IsPlayerStateSelf, Other) == 0x000000, "Member 'ProgressionObject_IsPlayerStateSelf::Other' has a wrong offset!");
static_assert(offsetof(ProgressionObject_IsPlayerStateSelf, ReturnValue) == 0x000008, "Member 'ProgressionObject_IsPlayerStateSelf::ReturnValue' has a wrong offset!");

// Function SCT.CustomizationScrollBoxUserWidgetBase.SwapItemCardSelectedStates
// 0x0010 (0x0010 - 0x0000)
struct CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStates final
{
public:
	class FString                                 NewItemRowName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStates) == 0x000008, "Wrong alignment on CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStates");
static_assert(sizeof(CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStates) == 0x000010, "Wrong size on CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStates");
static_assert(offsetof(CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStates, NewItemRowName) == 0x000000, "Member 'CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStates::NewItemRowName' has a wrong offset!");

// Function SCT.CustomizationScrollBoxUserWidgetBase.SwapItemCardSelectedStatesByGrid
// 0x0028 (0x0028 - 0x0000)
struct CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid final
{
public:
	class UGridPanel*                             Grid;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentItemRowName;                                // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewItemRowName;                                    // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid) == 0x000008, "Wrong alignment on CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid");
static_assert(sizeof(CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid) == 0x000028, "Wrong size on CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid");
static_assert(offsetof(CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid, Grid) == 0x000000, "Member 'CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid::Grid' has a wrong offset!");
static_assert(offsetof(CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid, CurrentItemRowName) == 0x000008, "Member 'CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid::CurrentItemRowName' has a wrong offset!");
static_assert(offsetof(CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid, NewItemRowName) == 0x000018, "Member 'CustomizationScrollBoxUserWidgetBase_SwapItemCardSelectedStatesByGrid::NewItemRowName' has a wrong offset!");

// Function SCT.CustomizationScrollBoxUserWidgetBase.UpdateCategoryVisibility
// 0x0008 (0x0008 - 0x0000)
struct CustomizationScrollBoxUserWidgetBase_UpdateCategoryVisibility final
{
public:
	class UGridPanel*                             CategoryGrid;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizationScrollBoxUserWidgetBase_UpdateCategoryVisibility) == 0x000008, "Wrong alignment on CustomizationScrollBoxUserWidgetBase_UpdateCategoryVisibility");
static_assert(sizeof(CustomizationScrollBoxUserWidgetBase_UpdateCategoryVisibility) == 0x000008, "Wrong size on CustomizationScrollBoxUserWidgetBase_UpdateCategoryVisibility");
static_assert(offsetof(CustomizationScrollBoxUserWidgetBase_UpdateCategoryVisibility, CategoryGrid) == 0x000000, "Member 'CustomizationScrollBoxUserWidgetBase_UpdateCategoryVisibility::CategoryGrid' has a wrong offset!");

// Function SCT.CustomizationScrollBoxUserWidgetBase.VerticalBoundaryHit
// 0x0010 (0x0010 - 0x0000)
struct CustomizationScrollBoxUserWidgetBase_VerticalBoundaryHit final
{
public:
	EUINavigation                                 InNavigation;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizationScrollBoxUserWidgetBase_VerticalBoundaryHit) == 0x000008, "Wrong alignment on CustomizationScrollBoxUserWidgetBase_VerticalBoundaryHit");
static_assert(sizeof(CustomizationScrollBoxUserWidgetBase_VerticalBoundaryHit) == 0x000010, "Wrong size on CustomizationScrollBoxUserWidgetBase_VerticalBoundaryHit");
static_assert(offsetof(CustomizationScrollBoxUserWidgetBase_VerticalBoundaryHit, InNavigation) == 0x000000, "Member 'CustomizationScrollBoxUserWidgetBase_VerticalBoundaryHit::InNavigation' has a wrong offset!");
static_assert(offsetof(CustomizationScrollBoxUserWidgetBase_VerticalBoundaryHit, ReturnValue) == 0x000008, "Member 'CustomizationScrollBoxUserWidgetBase_VerticalBoundaryHit::ReturnValue' has a wrong offset!");

// Function SCT.CustomizationScrollBoxUserWidget.AppearanceVerticalBoundaryHit
// 0x0010 (0x0010 - 0x0000)
struct CustomizationScrollBoxUserWidget_AppearanceVerticalBoundaryHit final
{
public:
	EUINavigation                                 InNavigation;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizationScrollBoxUserWidget_AppearanceVerticalBoundaryHit) == 0x000008, "Wrong alignment on CustomizationScrollBoxUserWidget_AppearanceVerticalBoundaryHit");
static_assert(sizeof(CustomizationScrollBoxUserWidget_AppearanceVerticalBoundaryHit) == 0x000010, "Wrong size on CustomizationScrollBoxUserWidget_AppearanceVerticalBoundaryHit");
static_assert(offsetof(CustomizationScrollBoxUserWidget_AppearanceVerticalBoundaryHit, InNavigation) == 0x000000, "Member 'CustomizationScrollBoxUserWidget_AppearanceVerticalBoundaryHit::InNavigation' has a wrong offset!");
static_assert(offsetof(CustomizationScrollBoxUserWidget_AppearanceVerticalBoundaryHit, ReturnValue) == 0x000008, "Member 'CustomizationScrollBoxUserWidget_AppearanceVerticalBoundaryHit::ReturnValue' has a wrong offset!");

// Function SCT.CustomizationScrollBoxUserWidget.HorizontalBoundaryHit
// 0x0010 (0x0010 - 0x0000)
struct CustomizationScrollBoxUserWidget_HorizontalBoundaryHit final
{
public:
	EUINavigation                                 InNavigation;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizationScrollBoxUserWidget_HorizontalBoundaryHit) == 0x000008, "Wrong alignment on CustomizationScrollBoxUserWidget_HorizontalBoundaryHit");
static_assert(sizeof(CustomizationScrollBoxUserWidget_HorizontalBoundaryHit) == 0x000010, "Wrong size on CustomizationScrollBoxUserWidget_HorizontalBoundaryHit");
static_assert(offsetof(CustomizationScrollBoxUserWidget_HorizontalBoundaryHit, InNavigation) == 0x000000, "Member 'CustomizationScrollBoxUserWidget_HorizontalBoundaryHit::InNavigation' has a wrong offset!");
