#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCT_accessoriesAnimBp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SCT_accessoriesAnimBp.SCT_accessoriesAnimBp_C.ExecuteUbergraph_SCT_accessoriesAnimBp
// 0x0004 (0x0004 - 0x0000)
struct SCT_accessoriesAnimBp_C_ExecuteUbergraph_SCT_accessoriesAnimBp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCT_accessoriesAnimBp_C_ExecuteUbergraph_SCT_accessoriesAnimBp) == 0x000004, "Wrong alignment on SCT_accessoriesAnimBp_C_ExecuteUbergraph_SCT_accessoriesAnimBp");
static_assert(sizeof(SCT_accessoriesAnimBp_C_ExecuteUbergraph_SCT_accessoriesAnimBp) == 0x000004, "Wrong size on SCT_accessoriesAnimBp_C_ExecuteUbergraph_SCT_accessoriesAnimBp");
static_assert(offsetof(SCT_accessoriesAnimBp_C_ExecuteUbergraph_SCT_accessoriesAnimBp, EntryPoint) == 0x000000, "Member 'SCT_accessoriesAnimBp_C_ExecuteUbergraph_SCT_accessoriesAnimBp::EntryPoint' has a wrong offset!");

// Function SCT_accessoriesAnimBp.SCT_accessoriesAnimBp_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SCT_accessoriesAnimBp_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SCT_accessoriesAnimBp_C_AnimGraph) == 0x000008, "Wrong alignment on SCT_accessoriesAnimBp_C_AnimGraph");
static_assert(sizeof(SCT_accessoriesAnimBp_C_AnimGraph) == 0x000010, "Wrong size on SCT_accessoriesAnimBp_C_AnimGraph");
static_assert(offsetof(SCT_accessoriesAnimBp_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'SCT_accessoriesAnimBp_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

