#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCT

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum SCT.EFate
// NumValues: 0x0019
enum class EFate : uint8
{
	Unspecified                              = 0,
	Spaced                                   = 1,
	KilledByPlayer                           = 2,
	EnvironmentHazard                        = 3,
	DeathBySyringe                           = 4,
	Escaped                                  = 5,
	Disconnected                             = 6,
	Suffocated                               = 7,
	TrustConsensus                           = 8,
	ShutdownCAIN                             = 9,
	LastResidentStanding                     = 10,
	ResidentEliminated                       = 11,
	Electrocuted                             = 12,
	Crushed                                  = 13,
	Drowned                                  = 14,
	Burned                                   = 15,
	Frozen                                   = 16,
	Deceived                                 = 17,
	MasterOfDeception                        = 18,
	Outsmarted                               = 19,
	Reserved1                                = 20,
	Reserved2                                = 21,
	Reserved3                                = 22,
	None                                     = 23,
	EFate_MAX                                = 24,
};

// Enum SCT.EOxygenState
// NumValues: 0x0006
enum class EOxygenState : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	Low                                      = 2,
	Critical                                 = 3,
	Empty                                    = 4,
	EOxygenState_MAX                         = 5,
};

// Enum SCT.EInventorySlotID
// NumValues: 0x0004
enum class EInventorySlotID : uint8
{
	None                                     = 0,
	Slot1                                    = 1,
	Slot2                                    = 2,
	EInventorySlotID_MAX                     = 3,
};

// Enum SCT.EInteractionCoopReceiverState
// NumValues: 0x0005
enum class EInteractionCoopReceiverState : uint8
{
	AwaitingStartConditions                  = 0,
	Ready                                    = 1,
	OnCooldown                               = 2,
	Disabled                                 = 3,
	EInteractionCoopReceiverState_MAX        = 4,
};

// Enum SCT.EEndConditions
// NumValues: 0x0009
enum class EEndConditions : uint8
{
	None                                     = 0,
	OnlyPersonoidsRemain                     = 1,
	AllPlayersAreDead                        = 2,
	CAINWasShutDown                          = 3,
	CAINReachedButPersonoidPresent           = 4,
	AllVoteYesInAirlock_OnlyResidents        = 5,
	AllVoteYesInAirlock_PersonoidPresent     = 6,
	OnlyOneResidentAlive                     = 7,
	EEndConditions_MAX                       = 8,
};

// Enum SCT.EPlayerFaction
// NumValues: 0x0004
enum class EPlayerFaction : uint8
{
	None                                     = 0,
	Personoid                                = 1,
	Resident                                 = 2,
	EPlayerFaction_MAX                       = 3,
};

// Enum SCT.EPlayerCustomizationGender
// NumValues: 0x0004
enum class EPlayerCustomizationGender : uint8
{
	Male                                     = 0,
	Female                                   = 1,
	Both                                     = 2,
	EPlayerCustomizationGender_MAX           = 3,
};

// Enum SCT.EPlayerCustomizationType
// NumValues: 0x0009
enum class EPlayerCustomizationType : uint8
{
	Head                                     = 0,
	Body                                     = 1,
	Legs                                     = 2,
	Feet                                     = 3,
	Eyewear                                  = 4,
	Accessory                                = 5,
	FacialHair                               = 6,
	Appearance                               = 7,
	EPlayerCustomizationType_MAX             = 8,
};

// Enum SCT.EScoreCondition
// NumValues: 0x0003
enum class EScoreCondition : uint8
{
	None                                     = 0,
	OnSuccessful                             = 1,
	EScoreCondition_MAX                      = 2,
};

// Enum SCT.EAgendaObjectState
// NumValues: 0x0005
enum class EAgendaObjectState : uint8
{
	None                                     = 0,
	InProgress                               = 1,
	Succeeded                                = 2,
	Failed                                   = 3,
	EAgendaObjectState_MAX                   = 4,
};

// Enum SCT.ECharacterInput
// NumValues: 0x000C
enum class ECharacterInput : uint8
{
	None                                     = 0,
	ConfirmAbility                           = 1,
	CancelAbility                            = 2,
	PrimaryUseRoleItem                       = 3,
	SecondaryUseRoleItem                     = 4,
	PrimaryInteract                          = 5,
	SecondaryInteract                        = 6,
	FirstSkill                               = 7,
	SecondSkill                              = 8,
	ThirdSkill                               = 9,
	WalkSlowly                               = 10,
	ECharacterInput_MAX                      = 11,
};

// Enum SCT.EContextPriority
// NumValues: 0x0004
enum class EContextPriority : uint8
{
	Low                                      = 0,
	Normal                                   = 50,
	High                                     = 100,
	EContextPriority_MAX                     = 101,
};

// Enum SCT.ESCTControllerType
// NumValues: 0x0005
enum class ESCTControllerType : uint8
{
	Keyboard                                 = 0,
	Xbox                                     = 1,
	PS4                                      = 2,
	PS5                                      = 3,
	ESCTControllerType_MAX                   = 4,
};

// Enum SCT.ECustomizationOption
// NumValues: 0x000B
enum class ECustomizationOption : uint8
{
	Head                                     = 0,
	Body                                     = 1,
	Legs                                     = 2,
	Feet                                     = 3,
	Eyewear                                  = 4,
	Accessory                                = 5,
	Preset                                   = 6,
	SkinTone                                 = 7,
	HairColor                                = 8,
	EyeColor                                 = 9,
	ECustomizationOption_MAX                 = 10,
};

// Enum SCT.EVruumbaCustomizationType
// NumValues: 0x0004
enum class EVruumbaCustomizationType : uint8
{
	Body                                     = 0,
	Antenna                                  = 1,
	Particles                                = 2,
	EVruumbaCustomizationType_MAX            = 3,
};

// Enum SCT.EItemQuality
// NumValues: 0x0006
enum class EItemQuality : uint8
{
	Classic                                  = 0,
	Elegant                                  = 1,
	Luxurious                                = 2,
	Extravagent                              = 3,
	Premium                                  = 4,
	EItemQuality_MAX                         = 5,
};

// Enum SCT.EUserRecordType
// NumValues: 0x0008
enum class EUserRecordType : uint8
{
	PublicProfileInfo                        = 0,
	PrivateProfileInfo                       = 1,
	VirtualPurchasesInfo                     = 2,
	CustomizationInfo                        = 3,
	BoundPlatformIDsInfo                     = 4,
	EmotesInfo                               = 5,
	RecentlyPlayedWithInfo                   = 6,
	EUserRecordType_MAX                      = 7,
};

// Enum SCT.FFCTFriendListType
// NumValues: 0x0007
enum class EFFCTFriendListType : uint8
{
	FriendList                               = 0,
	IncomingList                             = 1,
	OutgoingList                             = 2,
	SearchList                               = 3,
	RecentList                               = 4,
	PartyList                                = 5,
	FFCTFriendListType_MAX                   = 6,
};

// Enum SCT.ERankedType
// NumValues: 0x0003
enum class ERankedType : uint8
{
	UserRanked                               = 0,
	TopRanked                                = 1,
	ERankedType_MAX                          = 2,
};

// Enum SCT.EFriendsSortType
// NumValues: 0x0005
enum class EFriendsSortType : uint8
{
	Ascending                                = 0,
	Descending                               = 1,
	OnlineOnly                               = 2,
	Platform                                 = 3,
	EFriendsSortType_MAX                     = 4,
};

// Enum SCT.EPremiumCurrency
// NumValues: 0x0003
enum class EPremiumCurrency : uint8
{
	InfinityCoin                             = 0,
	MoonDust                                 = 1,
	EPremiumCurrency_MAX                     = 2,
};

// Enum SCT.EWinningFaction
// NumValues: 0x0004
enum class EWinningFaction : uint8
{
	RESIDENT                                 = 0,
	PERSONOID                                = 1,
	TIE                                      = 2,
	EWinningFaction_MAX                      = 3,
};

// Enum SCT.EMatchEndReason
// NumValues: 0x0004
enum class EMatchEndReason : uint8
{
	MATCHENDED                               = 0,
	SERVERTIMEOUT                            = 1,
	SERVERSHUTDOWN                           = 2,
	EMatchEndReason_MAX                      = 3,
};

// Enum SCT.EMapName
// NumValues: 0x0008
enum class EMapName : uint8
{
	LOBBY                                    = 0,
	MALL                                     = 1,
	RESTAURANT                               = 2,
	CASINO                                   = 3,
	RESORT                                   = 4,
	BOTANICAL_GARDEN                         = 5,
	SERVER_ROOM                              = 6,
	EMapName_MAX                             = 7,
};

// Enum SCT.ECustomizationSavedGender
// NumValues: 0x0004
enum class ECustomizationSavedGender : uint8
{
	Random                                   = 0,
	Male                                     = 1,
	Female                                   = 2,
	ECustomizationSavedGender_MAX            = 3,
};

// Enum SCT.EGlobalServerStatistics
// NumValues: 0x0022
enum class EGlobalServerStatistics : uint8
{
	PersonoidWins                            = 0,
	ResidentWins                             = 1,
	BottlesThrown                            = 2,
	KeycardsUsed                             = 3,
	EndCond_None                             = 4,
	EndCond_OnlyPersonoidsRemain             = 5,
	EndCond_AllPlayersAreDead                = 6,
	EndCond_CainWasShutdown                  = 7,
	EndCond_CainReachedButPersonoidPresent   = 8,
	EndCond_AllVoteYesInAirlockOnlyResidents = 9,
	EndCond_AllVoteYesInAirlockPersonoidsPresent = 10,
	EndCond_OnlyOneResidentAlive             = 11,
	Fate_None                                = 12,
	Fate_Unspecified                         = 13,
	Fate_Spaced                              = 14,
	Fate_KilledByPlayer                      = 15,
	Fate_EnvironmentalHazard                 = 16,
	Fate_DeathBySyringe                      = 17,
	Fate_Escaped                             = 18,
	Fate_Disconnected                        = 19,
	Fate_Suffocated                          = 20,
	Fate_TrustConcensus                      = 21,
	Fate_ShutdownCain                        = 22,
	Fate_LastResidentStanding                = 23,
	Fate_ResidentEliminated                  = 24,
	Fate_Electrocuted                        = 25,
	Fate_Crushed                             = 26,
	Fate_Drowned                             = 27,
	Fate_Burned                              = 28,
	Fate_Frozen                              = 29,
	Fate_Deceived                            = 30,
	Fate_MasterOfDeception                   = 31,
	Fate_Outsmarted                          = 32,
	EGlobalServerStatistics_MAX              = 33,
};

// Enum SCT.EBoolExecs
// NumValues: 0x0004
enum class EBoolExecs : uint8
{
	Execute                                  = 0,
	Success                                  = 1,
	Fail                                     = 2,
	EBoolExecs_MAX                           = 3,
};

// Enum SCT.EGlobalClientStatistics
// NumValues: 0x0005
enum class EGlobalClientStatistics : uint8
{
	BottlesThrown                            = 0,
	KeycardsUsed                             = 1,
	VivoxLoginSuccess                        = 2,
	VivoxLoginFail                           = 3,
	EGlobalClientStatistics_MAX              = 4,
};

// Enum SCT.EItemAction
// NumValues: 0x0005
enum class EItemAction : uint8
{
	PICKEDUP                                 = 0,
	DROPPED                                  = 1,
	USED                                     = 2,
	USED_ON                                  = 3,
	EItemAction_MAX                          = 4,
};

// Enum SCT.EGameRecordType
// NumValues: 0x0002
enum class EGameRecordType : uint8
{
	PlayerGlobals                            = 0,
	EGameRecordType_MAX                      = 1,
};

// Enum SCT.EDispatcherState
// NumValues: 0x0004
enum class EDispatcherState : uint8
{
	Idle                                     = 0,
	Active                                   = 1,
	Succeeded                                = 2,
	EDispatcherState_MAX                     = 3,
};

// Enum SCT.EInteractionType
// NumValues: 0x0012
enum class EInteractionType : uint8
{
	None                                     = 0,
	GrabItem                                 = 1,
	Hacking                                  = 2,
	OxygenOutlet                             = 3,
	PushButton                               = 4,
	RepairButton                             = 5,
	GrabItemFast                             = 6,
	PickupSyringe                            = 7,
	WallShortcutEnter                        = 8,
	WallShortcutExit                         = 9,
	Fiddle                                   = 10,
	PassengerLog                             = 11,
	FixOxygen                                = 12,
	LightFire                                = 13,
	ThrowLifeBuoy                            = 14,
	KeycardHandin                            = 15,
	PickupSyringePadLocked                   = 16,
	EInteractionType_MAX                     = 17,
};

// Enum SCT.EVoteState
// NumValues: 0x0004
enum class SCT::EVoteState : uint32
{
	NotStarted                               = 0,
	InProgress                               = 1,
	Finished                                 = 2,
	EVoteState_MAX                           = 3,
};

// Enum SCT.EModal
// NumValues: 0x000E
enum class EModal : uint16
{
	None                                     = 0,
	InGame                                   = 1,
	Airlock                                  = 2,
	SkillCheck                               = 4,
	Puzzle                                   = 8,
	ItemWheel                                = 16,
	Character                                = 32,
	ThumbVote                                = 64,
	SpectatorHUD                             = 128,
	EmergencyMeeting                         = 256,
	EmoteWheel                               = 512,
	PlayerList                               = 1024,
	MapVoting                                = 2048,
	EModal_MAX                               = 2049,
};

// Enum SCT.EPS5GameStatsClientCommand
// NumValues: 0x0002
enum class EPS5GameStatsClientCommand : uint8
{
	AddStat                                  = 0,
	EPS5GameStatsClientCommand_MAX           = 1,
};

// Enum SCT.EPS5GameStatType
// NumValues: 0x0005
enum class EPS5GameStatType : uint8
{
	None                                     = 0,
	FireExtinguish                           = 1,
	OxygenRefill                             = 2,
	KeycardInsert                            = 3,
	EPS5GameStatType_MAX                     = 4,
};

// Enum SCT.EPS5MatchClientCommand
// NumValues: 0x0009
enum class EPS5MatchClientCommand : uint8
{
	CreateMatch                              = 0,
	UpdateInitialMatchDetails                = 1,
	ClientJoinMatch                          = 2,
	UpdateStatusStartMatch                   = 3,
	UpdateClientStates                       = 4,
	UpdateDetailsEndMatch                    = 5,
	ReportMatchEnd                           = 6,
	ClientFinishMatch                        = 7,
	EPS5MatchClientCommand_MAX               = 8,
};

// Enum SCT.EPS5MatchServerCommandResult
// NumValues: 0x0010
enum class EPS5MatchServerCommandResult : uint8
{
	CreatedMatch                             = 0,
	CreateMatchFailed                        = 1,
	UpdatedInitialMatchDetails               = 2,
	UpdateInitialMatchDetailsFailed          = 3,
	ClientJoinedMatch                        = 4,
	ClientJoinMatchFailed                    = 5,
	ClientLeftMatch                          = 6,
	UpdatedStatusStartMatch                  = 7,
	UpdateStatusStartMatchFailed             = 8,
	UpdatedClientStates                      = 9,
	UpdateClientStatesFailed                 = 10,
	UpdatedDetailsEndMatch                   = 11,
	UpdateDetailsEndMatchFailed              = 12,
	ReportedMatchEnd                         = 13,
	ReportMatchEndFailed                     = 14,
	EPS5MatchServerCommandResult_MAX         = 15,
};

// Enum SCT.EPS5MatchClientState
// NumValues: 0x0008
enum class EPS5MatchClientState : uint8
{
	None                                     = 0,
	RequestJoinMatch                         = 1,
	RequestingJoinMatch                      = 2,
	JoinedMatch                              = 3,
	JoinedMatchNonPS5                        = 4,
	LeftMatch                                = 5,
	LeftMatchNonPS5                          = 6,
	EPS5MatchClientState_MAX                 = 7,
};

// Enum SCT.EPS5MatchServerState
// NumValues: 0x0010
enum class EPS5MatchServerState : uint8
{
	None                                     = 0,
	RequestNewMatch                          = 1,
	RequestingNewMatch                       = 2,
	RequestUpdateInitialMatchDetails         = 3,
	RequestingUpdateInitialMatchDetails      = 4,
	DoJoins                                  = 5,
	WaitStartMatch                           = 6,
	RequestUpdateStatusStartMatch            = 7,
	RequestingUpdateStatusStartMatch         = 8,
	PlayingMatch                             = 9,
	RequestUpdateDetailsEndMatch             = 10,
	RequestingUpdateDetailsEndMatch          = 11,
	RequestMatchEndReport                    = 12,
	RequestingMatchEndReport                 = 13,
	MatchEnded                               = 14,
	EPS5MatchServerState_MAX                 = 15,
};

// Enum SCT.ESkillcheckEndCondition
// NumValues: 0x0004
enum class ESkillcheckEndCondition : uint8
{
	None                                     = 0,
	Infinite                                 = 1,
	Waves                                    = 2,
	ESkillcheckEndCondition_MAX              = 3,
};

// Enum SCT.ETag
// NumValues: 0x0022
enum class ETag : uint8
{
	None                                     = 0,
	Item_Passive                             = 1,
	Item_Unique                              = 2,
	Item_PassengerLog                        = 3,
	Buff_GodLungs                            = 4,
	Skill_Hidden                             = 5,
	Interaction_Type                         = 6,
	Interaction_Type_Duration                = 7,
	Interaction_Type_Immediate               = 8,
	Interaction_Trigger_OnDispatched         = 9,
	Effect_Cooldown                          = 10,
	Effect_Silence                           = 11,
	Effect_SetByCaller_Oxygen                = 12,
	ContextSensitive                         = 13,
	ContextSensitive_Tangible                = 14,
	ContextSensitive_Interactable            = 15,
	CharacterType_Resident                   = 16,
	CharacterType_Personoid                  = 17,
	CharacterType_Spectator                  = 18,
	CharacterState_UsingPower                = 19,
	State_CharacterState_Dead                = 20,
	State_CharacterState_Grabbed             = 21,
	State_CharacterState_Consciousness_Unconscious = 22,
	State_CharacterState_Immovable           = 23,
	State_CharacterState_LockRotation        = 24,
	State_CharacterState_DeathTimerImmunity  = 25,
	State_CharacterState_Inactive            = 26,
	State_CharacterState_Inactive_LevelTransition = 27,
	State_CharacterState_Inactive_Airlock    = 28,
	State_CharacterState_Burning             = 29,
	State_CharacterState_Freezing            = 30,
	State_CharacterState_Drowning            = 31,
	State_CharacterState_Electrocuting       = 32,
	ETag_MAX                                 = 33,
};

// Enum SCT.EWidgetBehaviour
// NumValues: 0x0003
enum class EWidgetBehaviour : uint8
{
	None                                     = 0,
	DestroyOnServerTravel                    = 1,
	EWidgetBehaviour_MAX                     = 2,
};

// Enum SCT.EXboxGameSessionClientCommand
// NumValues: 0x0005
enum class EXboxGameSessionClientCommand : uint8
{
	CreateGameSession                        = 0,
	ClientCreateGameSessionReservation       = 1,
	ClientJoinGameSession                    = 2,
	ClientFinishGameSession                  = 3,
	EXboxGameSessionClientCommand_MAX        = 4,
};

// Enum SCT.EXboxGameSessionServerCommandResult
// NumValues: 0x0008
enum class EXboxGameSessionServerCommandResult : uint8
{
	CreatedGameSession                       = 0,
	CreateGameSessionFailed                  = 1,
	ClientGameSessionReserved                = 2,
	ClientGameSessionReservationFailed       = 3,
	ClientJoinedGameSession                  = 4,
	ClientJoinGameSessionFailed              = 5,
	ClientLeftGameSession                    = 6,
	EXboxGameSessionServerCommandResult_MAX  = 7,
};

// Enum SCT.EXboxGameSessionClientState
// NumValues: 0x000A
enum class EXboxGameSessionClientState : uint8
{
	None                                     = 0,
	RequestGameSessionReservation            = 1,
	RequestingGameSessionReservation         = 2,
	RequestJoinGameSession                   = 3,
	RequestingJoinGameSession                = 4,
	JoinedGameSession                        = 5,
	JoinedGameSessionNonXbox                 = 6,
	LeftGameSession                          = 7,
	LeftGameSessionNonXbox                   = 9,
	EXboxGameSessionClientState_MAX          = 10,
};

// Enum SCT.EXboxGameSessionServerState
// NumValues: 0x000B
enum class EXboxGameSessionServerState : uint8
{
	None                                     = 0,
	RequestNewGameSession                    = 1,
	RequestingNewGameSession                 = 2,
	DoReservations                           = 3,
	DoingReservations                        = 4,
	DoJoins                                  = 5,
	WaitStartGameSession                     = 6,
	PlayingGameSession                       = 7,
	RequestingGameSessionEnd                 = 8,
	GameSessionEnded                         = 9,
	EXboxGameSessionServerState_MAX          = 10,
};

// ScriptStruct SCT.PlayerCategoryStringList
// 0x0010 (0x0010 - 0x0000)
struct FPlayerCategoryStringList final
{
public:
	TArray<class FString>                         ItemNames;                                         // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlayerCategoryStringList) == 0x000008, "Wrong alignment on FPlayerCategoryStringList");
static_assert(sizeof(FPlayerCategoryStringList) == 0x000010, "Wrong size on FPlayerCategoryStringList");
static_assert(offsetof(FPlayerCategoryStringList, ItemNames) == 0x000000, "Member 'FPlayerCategoryStringList::ItemNames' has a wrong offset!");

// ScriptStruct SCT.CachedAxes
// 0x0050 (0x0050 - 0x0000)
struct FCachedAxes final
{
public:
	struct FInputAxisKeyMapping                   Keyboard;                                          // 0x0000(0x0028)(NativeAccessSpecifierPublic)
	struct FInputAxisKeyMapping                   Gamepad;                                           // 0x0028(0x0028)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FCachedAxes) == 0x000008, "Wrong alignment on FCachedAxes");
static_assert(sizeof(FCachedAxes) == 0x000050, "Wrong size on FCachedAxes");
static_assert(offsetof(FCachedAxes, Keyboard) == 0x000000, "Member 'FCachedAxes::Keyboard' has a wrong offset!");
static_assert(offsetof(FCachedAxes, Gamepad) == 0x000028, "Member 'FCachedAxes::Gamepad' has a wrong offset!");

// ScriptStruct SCT.CachedActions
// 0x0050 (0x0050 - 0x0000)
struct FCachedActions final
{
public:
	struct FInputActionKeyMapping                 Keyboard;                                          // 0x0000(0x0028)(NativeAccessSpecifierPublic)
	struct FInputActionKeyMapping                 Gamepad;                                           // 0x0028(0x0028)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FCachedActions) == 0x000008, "Wrong alignment on FCachedActions");
static_assert(sizeof(FCachedActions) == 0x000050, "Wrong size on FCachedActions");
static_assert(offsetof(FCachedActions, Keyboard) == 0x000000, "Member 'FCachedActions::Keyboard' has a wrong offset!");
static_assert(offsetof(FCachedActions, Gamepad) == 0x000028, "Member 'FCachedActions::Gamepad' has a wrong offset!");

// ScriptStruct SCT.CachedInput
// 0x00A8 (0x00A8 - 0x0000)
struct FCachedInput final
{
public:
	struct FCachedAxes                            Axes;                                              // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	struct FCachedActions                         Actions;                                           // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	bool                                          Toggle;                                            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCachedInput) == 0x000008, "Wrong alignment on FCachedInput");
static_assert(sizeof(FCachedInput) == 0x0000A8, "Wrong size on FCachedInput");
static_assert(offsetof(FCachedInput, Axes) == 0x000000, "Member 'FCachedInput::Axes' has a wrong offset!");
static_assert(offsetof(FCachedInput, Actions) == 0x000050, "Member 'FCachedInput::Actions' has a wrong offset!");
static_assert(offsetof(FCachedInput, Toggle) == 0x0000A0, "Member 'FCachedInput::Toggle' has a wrong offset!");

// ScriptStruct SCT.ContextSpec
// 0x00C0 (0x00C0 - 0x0000)
struct FContextSpec final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnDistanceChanged;                                 // 0x0008(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVisibilityChanged;                               // 0x0018(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCenterChanged;                                   // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnDotProductChanged;                               // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnChanged;                                         // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnRemoved;                                         // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnScreenPositionChanged;                           // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UContextStaticMeshComponent> Target;                                            // 0x0078(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVisible;                                        // 0x0080(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Distance;                                          // 0x0084(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DotProduct;                                        // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Center;                                            // 0x008C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistToScreenCenter;                                // 0x0098(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SensorActor;                                       // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UContextSensor*                         Sensor;                                            // 0x00A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                       Camera;                                            // 0x00B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FContextSpec) == 0x000008, "Wrong alignment on FContextSpec");
static_assert(sizeof(FContextSpec) == 0x0000C0, "Wrong size on FContextSpec");
static_assert(offsetof(FContextSpec, OnDistanceChanged) == 0x000008, "Member 'FContextSpec::OnDistanceChanged' has a wrong offset!");
static_assert(offsetof(FContextSpec, OnVisibilityChanged) == 0x000018, "Member 'FContextSpec::OnVisibilityChanged' has a wrong offset!");
static_assert(offsetof(FContextSpec, OnCenterChanged) == 0x000028, "Member 'FContextSpec::OnCenterChanged' has a wrong offset!");
static_assert(offsetof(FContextSpec, OnDotProductChanged) == 0x000038, "Member 'FContextSpec::OnDotProductChanged' has a wrong offset!");
static_assert(offsetof(FContextSpec, OnChanged) == 0x000048, "Member 'FContextSpec::OnChanged' has a wrong offset!");
static_assert(offsetof(FContextSpec, OnRemoved) == 0x000058, "Member 'FContextSpec::OnRemoved' has a wrong offset!");
static_assert(offsetof(FContextSpec, OnScreenPositionChanged) == 0x000068, "Member 'FContextSpec::OnScreenPositionChanged' has a wrong offset!");
static_assert(offsetof(FContextSpec, Target) == 0x000078, "Member 'FContextSpec::Target' has a wrong offset!");
static_assert(offsetof(FContextSpec, bIsVisible) == 0x000080, "Member 'FContextSpec::bIsVisible' has a wrong offset!");
static_assert(offsetof(FContextSpec, Distance) == 0x000084, "Member 'FContextSpec::Distance' has a wrong offset!");
static_assert(offsetof(FContextSpec, DotProduct) == 0x000088, "Member 'FContextSpec::DotProduct' has a wrong offset!");
static_assert(offsetof(FContextSpec, Center) == 0x00008C, "Member 'FContextSpec::Center' has a wrong offset!");
static_assert(offsetof(FContextSpec, DistToScreenCenter) == 0x000098, "Member 'FContextSpec::DistToScreenCenter' has a wrong offset!");
static_assert(offsetof(FContextSpec, SensorActor) == 0x0000A0, "Member 'FContextSpec::SensorActor' has a wrong offset!");
static_assert(offsetof(FContextSpec, Sensor) == 0x0000A8, "Member 'FContextSpec::Sensor' has a wrong offset!");
static_assert(offsetof(FContextSpec, Camera) == 0x0000B0, "Member 'FContextSpec::Camera' has a wrong offset!");

// ScriptStruct SCT.FCTServerTelemetryEndMatchModel
// 0x0030 (0x0030 - 0x0000)
struct FFCTServerTelemetryEndMatchModel final
{
public:
	class FString                                 WinningFaction;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionDuration;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EndReason;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFCTServerTelemetryEndMatchModel) == 0x000008, "Wrong alignment on FFCTServerTelemetryEndMatchModel");
static_assert(sizeof(FFCTServerTelemetryEndMatchModel) == 0x000030, "Wrong size on FFCTServerTelemetryEndMatchModel");
static_assert(offsetof(FFCTServerTelemetryEndMatchModel, WinningFaction) == 0x000000, "Member 'FFCTServerTelemetryEndMatchModel::WinningFaction' has a wrong offset!");
static_assert(offsetof(FFCTServerTelemetryEndMatchModel, SessionDuration) == 0x000010, "Member 'FFCTServerTelemetryEndMatchModel::SessionDuration' has a wrong offset!");
static_assert(offsetof(FFCTServerTelemetryEndMatchModel, EndReason) == 0x000020, "Member 'FFCTServerTelemetryEndMatchModel::EndReason' has a wrong offset!");

// ScriptStruct SCT.FCTUserBan
// 0x0088 (0x0088 - 0x0000)
struct FFCTUserBan final
{
public:
	class FString                                 Ban;                                               // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BanId;                                             // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Comment;                                           // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CreatedAt;                                         // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EndDate;                                           // 0x0048(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisabledDate;                                      // 0x0058(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Reason;                                            // 0x0068(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0078(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFCTUserBan) == 0x000008, "Wrong alignment on FFCTUserBan");
static_assert(sizeof(FFCTUserBan) == 0x000088, "Wrong size on FFCTUserBan");
static_assert(offsetof(FFCTUserBan, Ban) == 0x000000, "Member 'FFCTUserBan::Ban' has a wrong offset!");
static_assert(offsetof(FFCTUserBan, BanId) == 0x000010, "Member 'FFCTUserBan::BanId' has a wrong offset!");
static_assert(offsetof(FFCTUserBan, Comment) == 0x000020, "Member 'FFCTUserBan::Comment' has a wrong offset!");
static_assert(offsetof(FFCTUserBan, CreatedAt) == 0x000030, "Member 'FFCTUserBan::CreatedAt' has a wrong offset!");
static_assert(offsetof(FFCTUserBan, Enabled) == 0x000040, "Member 'FFCTUserBan::Enabled' has a wrong offset!");
static_assert(offsetof(FFCTUserBan, EndDate) == 0x000048, "Member 'FFCTUserBan::EndDate' has a wrong offset!");
static_assert(offsetof(FFCTUserBan, DisabledDate) == 0x000058, "Member 'FFCTUserBan::DisabledDate' has a wrong offset!");
static_assert(offsetof(FFCTUserBan, Reason) == 0x000068, "Member 'FFCTUserBan::Reason' has a wrong offset!");
static_assert(offsetof(FFCTUserBan, UserId) == 0x000078, "Member 'FFCTUserBan::UserId' has a wrong offset!");

// ScriptStruct SCT.CustomGameSettings
// 0x0034 (0x0034 - 0x0000)
struct FCustomGameSettings final
{
public:
	int32                                         MinPersonoids;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPersonoids;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntermediateLevels;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfSyringes;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OxygenMultiplier;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OxygenCanisterMultiplier;                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OxygenOutletSabotageMultiplier;                    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OxygenGeneratorRepairMultiplier;                   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OxygenGeneratorSabotageMultiplier;                 // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OxygenGeneratorFailedMultiplier;                   // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHiddenPersonoids;                                 // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCatastropheEventEnabled;                          // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PassengerLogSpawnMultiplier;                       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDefault;                                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCustomGameSettings) == 0x000004, "Wrong alignment on FCustomGameSettings");
static_assert(sizeof(FCustomGameSettings) == 0x000034, "Wrong size on FCustomGameSettings");
static_assert(offsetof(FCustomGameSettings, MinPersonoids) == 0x000000, "Member 'FCustomGameSettings::MinPersonoids' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, MaxPersonoids) == 0x000004, "Member 'FCustomGameSettings::MaxPersonoids' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, IntermediateLevels) == 0x000008, "Member 'FCustomGameSettings::IntermediateLevels' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, AmountOfSyringes) == 0x00000C, "Member 'FCustomGameSettings::AmountOfSyringes' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, OxygenMultiplier) == 0x000010, "Member 'FCustomGameSettings::OxygenMultiplier' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, OxygenCanisterMultiplier) == 0x000014, "Member 'FCustomGameSettings::OxygenCanisterMultiplier' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, OxygenOutletSabotageMultiplier) == 0x000018, "Member 'FCustomGameSettings::OxygenOutletSabotageMultiplier' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, OxygenGeneratorRepairMultiplier) == 0x00001C, "Member 'FCustomGameSettings::OxygenGeneratorRepairMultiplier' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, OxygenGeneratorSabotageMultiplier) == 0x000020, "Member 'FCustomGameSettings::OxygenGeneratorSabotageMultiplier' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, OxygenGeneratorFailedMultiplier) == 0x000024, "Member 'FCustomGameSettings::OxygenGeneratorFailedMultiplier' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, bHiddenPersonoids) == 0x000028, "Member 'FCustomGameSettings::bHiddenPersonoids' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, bCatastropheEventEnabled) == 0x000029, "Member 'FCustomGameSettings::bCatastropheEventEnabled' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, PassengerLogSpawnMultiplier) == 0x00002C, "Member 'FCustomGameSettings::PassengerLogSpawnMultiplier' has a wrong offset!");
static_assert(offsetof(FCustomGameSettings, bIsDefault) == 0x000030, "Member 'FCustomGameSettings::bIsDefault' has a wrong offset!");

// ScriptStruct SCT.BoundContextSpec
// 0x0040 (0x0040 - 0x0000)
struct FBoundContextSpec final
{
public:
	TWeakObjectPtr<class UContextStaticMeshComponent> Target;                                            // 0x0000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionKeyMapping                 KeyMapping;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bIsResident;                                       // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPersonoid;                                      // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPower*                                 Power;                                             // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBoundContextSpec) == 0x000008, "Wrong alignment on FBoundContextSpec");
static_assert(sizeof(FBoundContextSpec) == 0x000040, "Wrong size on FBoundContextSpec");
static_assert(offsetof(FBoundContextSpec, Target) == 0x000000, "Member 'FBoundContextSpec::Target' has a wrong offset!");
static_assert(offsetof(FBoundContextSpec, KeyMapping) == 0x000008, "Member 'FBoundContextSpec::KeyMapping' has a wrong offset!");
static_assert(offsetof(FBoundContextSpec, bIsResident) == 0x000030, "Member 'FBoundContextSpec::bIsResident' has a wrong offset!");
static_assert(offsetof(FBoundContextSpec, bIsPersonoid) == 0x000031, "Member 'FBoundContextSpec::bIsPersonoid' has a wrong offset!");
static_assert(offsetof(FBoundContextSpec, Power) == 0x000038, "Member 'FBoundContextSpec::Power' has a wrong offset!");

// ScriptStruct SCT.CustomizationQualityItemTableRow
// 0x0008 (0x0010 - 0x0008)
struct FCustomizationQualityItemTableRow : public FTableRowBase
{
public:
	EItemQuality                                  Quality;                                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCustomizationQualityItemTableRow) == 0x000008, "Wrong alignment on FCustomizationQualityItemTableRow");
static_assert(sizeof(FCustomizationQualityItemTableRow) == 0x000010, "Wrong size on FCustomizationQualityItemTableRow");
static_assert(offsetof(FCustomizationQualityItemTableRow, Quality) == 0x000008, "Member 'FCustomizationQualityItemTableRow::Quality' has a wrong offset!");

// ScriptStruct SCT.VruumbaCustomizationTableRow
// 0x0058 (0x0068 - 0x0010)
struct FVruumbaCustomizationTableRow : public FCustomizationQualityItemTableRow
{
public:
	int32                                         UnlockLevel;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TokenCost;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             IconThumbnail;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AchievementCode;                                   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EntitlementCode;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Sku;                                               // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0050(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVruumbaCustomizationTableRow) == 0x000008, "Wrong alignment on FVruumbaCustomizationTableRow");
static_assert(sizeof(FVruumbaCustomizationTableRow) == 0x000068, "Wrong size on FVruumbaCustomizationTableRow");
static_assert(offsetof(FVruumbaCustomizationTableRow, UnlockLevel) == 0x000010, "Member 'FVruumbaCustomizationTableRow::UnlockLevel' has a wrong offset!");
static_assert(offsetof(FVruumbaCustomizationTableRow, TokenCost) == 0x000014, "Member 'FVruumbaCustomizationTableRow::TokenCost' has a wrong offset!");
static_assert(offsetof(FVruumbaCustomizationTableRow, IconThumbnail) == 0x000018, "Member 'FVruumbaCustomizationTableRow::IconThumbnail' has a wrong offset!");
static_assert(offsetof(FVruumbaCustomizationTableRow, AchievementCode) == 0x000020, "Member 'FVruumbaCustomizationTableRow::AchievementCode' has a wrong offset!");
static_assert(offsetof(FVruumbaCustomizationTableRow, EntitlementCode) == 0x000030, "Member 'FVruumbaCustomizationTableRow::EntitlementCode' has a wrong offset!");
static_assert(offsetof(FVruumbaCustomizationTableRow, Sku) == 0x000040, "Member 'FVruumbaCustomizationTableRow::Sku' has a wrong offset!");
static_assert(offsetof(FVruumbaCustomizationTableRow, Description) == 0x000050, "Member 'FVruumbaCustomizationTableRow::Description' has a wrong offset!");

// ScriptStruct SCT.VruumbaParticlesCustomizationItemTableRow
// 0x0008 (0x0070 - 0x0068)
struct FVruumbaParticlesCustomizationItemTableRow final : public FVruumbaCustomizationTableRow
{
public:
	class UParticleSystem*                        ParticleSystem;                                    // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVruumbaParticlesCustomizationItemTableRow) == 0x000008, "Wrong alignment on FVruumbaParticlesCustomizationItemTableRow");
static_assert(sizeof(FVruumbaParticlesCustomizationItemTableRow) == 0x000070, "Wrong size on FVruumbaParticlesCustomizationItemTableRow");
static_assert(offsetof(FVruumbaParticlesCustomizationItemTableRow, ParticleSystem) == 0x000068, "Member 'FVruumbaParticlesCustomizationItemTableRow::ParticleSystem' has a wrong offset!");

// ScriptStruct SCT.FCTUserBansPayload
// 0x0010 (0x0010 - 0x0000)
struct FFCTUserBansPayload final
{
public:
	TArray<struct FFCTUserBan>                    Data;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFCTUserBansPayload) == 0x000008, "Wrong alignment on FFCTUserBansPayload");
static_assert(sizeof(FFCTUserBansPayload) == 0x000010, "Wrong size on FFCTUserBansPayload");
static_assert(offsetof(FFCTUserBansPayload, Data) == 0x000000, "Member 'FFCTUserBansPayload::Data' has a wrong offset!");

// ScriptStruct SCT.Destiny
// 0x0010 (0x0010 - 0x0000)
struct FDestiny final
{
public:
	EFate                                         Fate;                                              // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OptionalImpulse;                                   // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDestiny) == 0x000004, "Wrong alignment on FDestiny");
static_assert(sizeof(FDestiny) == 0x000010, "Wrong size on FDestiny");
static_assert(offsetof(FDestiny, Fate) == 0x000000, "Member 'FDestiny::Fate' has a wrong offset!");
static_assert(offsetof(FDestiny, OptionalImpulse) == 0x000004, "Member 'FDestiny::OptionalImpulse' has a wrong offset!");

// ScriptStruct SCT.ExternalLocalizationData
// 0x00C0 (0x00C0 - 0x0000)
struct FExternalLocalizationData final
{
public:
	class FString                                 En;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Pt;                                                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Zh;                                                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Yi;                                                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Fr;                                                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 De;                                                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ja;                                                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ko;                                                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ru;                                                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Es;                                                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Th;                                                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ar;                                                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExternalLocalizationData) == 0x000008, "Wrong alignment on FExternalLocalizationData");
static_assert(sizeof(FExternalLocalizationData) == 0x0000C0, "Wrong size on FExternalLocalizationData");
static_assert(offsetof(FExternalLocalizationData, En) == 0x000000, "Member 'FExternalLocalizationData::En' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, Pt) == 0x000010, "Member 'FExternalLocalizationData::Pt' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, Zh) == 0x000020, "Member 'FExternalLocalizationData::Zh' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, Yi) == 0x000030, "Member 'FExternalLocalizationData::Yi' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, Fr) == 0x000040, "Member 'FExternalLocalizationData::Fr' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, De) == 0x000050, "Member 'FExternalLocalizationData::De' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, Ja) == 0x000060, "Member 'FExternalLocalizationData::Ja' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, Ko) == 0x000070, "Member 'FExternalLocalizationData::Ko' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, Ru) == 0x000080, "Member 'FExternalLocalizationData::Ru' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, Es) == 0x000090, "Member 'FExternalLocalizationData::Es' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, Th) == 0x0000A0, "Member 'FExternalLocalizationData::Th' has a wrong offset!");
static_assert(offsetof(FExternalLocalizationData, Ar) == 0x0000B0, "Member 'FExternalLocalizationData::Ar' has a wrong offset!");

// ScriptStruct SCT.DLCPackData
// 0x0170 (0x0170 - 0x0000)
struct FDLCPackData final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SteamID;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ps4Id;                                             // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ps5Id;                                             // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EpicId;                                            // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 XboxId;                                            // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoadOrder;                                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Discount;                                          // 0x0074(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThumbnailUrlDoubleSpan;                            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThumbnailUrlSingleSpan;                            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
