#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCT

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SCT_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"


namespace SDK
{

// Class SCT.AccelByteUtilsFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAccelByteUtilsFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FCloudCustomizationPacket CreateCustomizationPacket(class ACustomizationOptions* Options, EPlayerCustomizationType Category, const struct FCloudCustomizationPayload& Payload);
	static struct FDateTime FormatAccelByteDateTimeToUnrealDateTime(const class FString& InConvertToDateTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccelByteUtilsFunctionLibrary">();
	}
	static class UAccelByteUtilsFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccelByteUtilsFunctionLibrary>();
	}
};
static_assert(alignof(UAccelByteUtilsFunctionLibrary) == 0x000008, "Wrong alignment on UAccelByteUtilsFunctionLibrary");
static_assert(sizeof(UAccelByteUtilsFunctionLibrary) == 0x000028, "Wrong size on UAccelByteUtilsFunctionLibrary");

// Class SCT.AbilitySystemComponentSCT
// 0x00C0 (0x13C8 - 0x1308)
class UAbilitySystemComponentSCT : public UAbilitySystemComponent
{
public:
	FMulticastInlineDelegateProperty_             OnAbilityRevoked;                                  // 0x1308(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnAbilityRemoved;                                  // 0x1318(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnTagsChanged;                                     // 0x1328(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPowerInputPressed;                               // 0x1338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPowerInputReleased;                              // 0x1348(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnActiveEffectRemoved;                             // 0x1358(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPowerGranted;                                    // 0x1368(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<class UGameplayAbility*, struct FPowerInitializationSpec> PendingInitializationSpecs;                        // 0x1378(0x0050)(Protected, NativeAccessSpecifierProtected)

public:
	void CancelAllAbilities();
	void RemoveGameplayEffectsUsingType(TSubclassOf<class UGameplayEffect> EffectType);

	class AActor* GetEffectInstigator(const struct FGameplayTag& Tag) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilitySystemComponentSCT">();
	}
	static class UAbilitySystemComponentSCT* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilitySystemComponentSCT>();
	}
};
static_assert(alignof(UAbilitySystemComponentSCT) == 0x000008, "Wrong alignment on UAbilitySystemComponentSCT");
static_assert(sizeof(UAbilitySystemComponentSCT) == 0x0013C8, "Wrong size on UAbilitySystemComponentSCT");
static_assert(offsetof(UAbilitySystemComponentSCT, OnAbilityRevoked) == 0x001308, "Member 'UAbilitySystemComponentSCT::OnAbilityRevoked' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponentSCT, OnAbilityRemoved) == 0x001318, "Member 'UAbilitySystemComponentSCT::OnAbilityRemoved' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponentSCT, OnTagsChanged) == 0x001328, "Member 'UAbilitySystemComponentSCT::OnTagsChanged' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponentSCT, OnPowerInputPressed) == 0x001338, "Member 'UAbilitySystemComponentSCT::OnPowerInputPressed' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponentSCT, OnPowerInputReleased) == 0x001348, "Member 'UAbilitySystemComponentSCT::OnPowerInputReleased' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponentSCT, OnActiveEffectRemoved) == 0x001358, "Member 'UAbilitySystemComponentSCT::OnActiveEffectRemoved' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponentSCT, OnPowerGranted) == 0x001368, "Member 'UAbilitySystemComponentSCT::OnPowerGranted' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponentSCT, PendingInitializationSpecs) == 0x001378, "Member 'UAbilitySystemComponentSCT::PendingInitializationSpecs' has a wrong offset!");

// Class SCT.AgendaEvent
// 0x0000 (0x0030 - 0x0030)
class UAgendaEvent : public UDataAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AgendaEvent">();
	}
	static class UAgendaEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgendaEvent>();
	}
};
static_assert(alignof(UAgendaEvent) == 0x000008, "Wrong alignment on UAgendaEvent");
static_assert(sizeof(UAgendaEvent) == 0x000030, "Wrong size on UAgendaEvent");

// Class SCT.AgendaGenericEvent
// 0x0010 (0x0040 - 0x0030)
class UAgendaGenericEvent final : public UAgendaEvent
{
public:
	FMulticastInlineDelegateProperty_             Event;                                             // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void Call(class AActor* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AgendaGenericEvent">();
	}
	static class UAgendaGenericEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgendaGenericEvent>();
	}
};
static_assert(alignof(UAgendaGenericEvent) == 0x000008, "Wrong alignment on UAgendaGenericEvent");
static_assert(sizeof(UAgendaGenericEvent) == 0x000040, "Wrong size on UAgendaGenericEvent");
static_assert(offsetof(UAgendaGenericEvent, Event) == 0x000030, "Member 'UAgendaGenericEvent::Event' has a wrong offset!");

// Class SCT.AbilitySystemComponentWorld
// 0x0000 (0x13C8 - 0x13C8)
class UAbilitySystemComponentWorld final : public UAbilitySystemComponentSCT
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilitySystemComponentWorld">();
	}
	static class UAbilitySystemComponentWorld* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilitySystemComponentWorld>();
	}
};
static_assert(alignof(UAbilitySystemComponentWorld) == 0x000008, "Wrong alignment on UAbilitySystemComponentWorld");
static_assert(sizeof(UAbilitySystemComponentWorld) == 0x0013C8, "Wrong size on UAbilitySystemComponentWorld");

// Class SCT.CustomGameSettingsComponent
// 0x0068 (0x0118 - 0x00B0)
class UCustomGameSettingsComponent final : public UActorComponent
{
public:
	struct FCustomGameSettings                    AppliedUserSettings;                               // 0x00B0(0x0034)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E4[0x34];                                      // 0x00E4(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_UserSettings();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomGameSettingsComponent">();
	}
	static class UCustomGameSettingsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomGameSettingsComponent>();
	}
};
static_assert(alignof(UCustomGameSettingsComponent) == 0x000008, "Wrong alignment on UCustomGameSettingsComponent");
static_assert(sizeof(UCustomGameSettingsComponent) == 0x000118, "Wrong size on UCustomGameSettingsComponent");
static_assert(offsetof(UCustomGameSettingsComponent, AppliedUserSettings) == 0x0000B0, "Member 'UCustomGameSettingsComponent::AppliedUserSettings' has a wrong offset!");

// Class SCT.FCTGetBlockedPlayerListCallbackProxy
// 0x0020 (0x0050 - 0x0030)
class UFCTGetBlockedPlayerListCallbackProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UFCTGetBlockedPlayerListCallbackProxy* GetBlockedPlayerList();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FCTGetBlockedPlayerListCallbackProxy">();
	}
	static class UFCTGetBlockedPlayerListCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFCTGetBlockedPlayerListCallbackProxy>();
	}
};
static_assert(alignof(UFCTGetBlockedPlayerListCallbackProxy) == 0x000008, "Wrong alignment on UFCTGetBlockedPlayerListCallbackProxy");
static_assert(sizeof(UFCTGetBlockedPlayerListCallbackProxy) == 0x000050, "Wrong size on UFCTGetBlockedPlayerListCallbackProxy");
static_assert(offsetof(UFCTGetBlockedPlayerListCallbackProxy, OnSuccess) == 0x000030, "Member 'UFCTGetBlockedPlayerListCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UFCTGetBlockedPlayerListCallbackProxy, OnError) == 0x000040, "Member 'UFCTGetBlockedPlayerListCallbackProxy::OnError' has a wrong offset!");

// Class SCT.AbilitySystemUtility
// 0x0000 (0x0028 - 0x0028)
class UAbilitySystemUtility final : public UAbilitySystemBlueprintLibrary
{
public:
	static void SendGameplayEvent(class UAbilitySystemComponent* Target, const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilitySystemUtility">();
	}
	static class UAbilitySystemUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilitySystemUtility>();
	}
};
static_assert(alignof(UAbilitySystemUtility) == 0x000008, "Wrong alignment on UAbilitySystemUtility");
static_assert(sizeof(UAbilitySystemUtility) == 0x000028, "Wrong size on UAbilitySystemUtility");

// Class SCT.CharacterSCT
// 0x00D0 (0x0590 - 0x04C0)
class ACharacterSCT : public ACharacter
{
public:
	uint8                                         Pad_4C0[0x10];                                     // 0x04C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponentSCT*             AbilitySystemComponent;                            // 0x04D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoveAttributeSet*                      MoveAttributeSet;                                  // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseTurnRate;                                      // 0x04E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseLookUpRate;                                    // 0x04E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             Portrait;                                          // 0x04E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpringArmComponent*                    CameraBoom;                                        // 0x04F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                       FollowCamera;                                      // 0x04F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UContextSensor*                         ContextSensor;                                     // 0x0500(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UContextInputManager*                   ContextInputManager;                               // 0x0508(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UContextPowerManager*                   ContextPowerManager;                               // 0x0510(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInventory*                             Inventory;                                         // 0x0518(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCheatComponent*                        CheatComponent;                                    // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SensorDistance;                                    // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SensorOffset;                                      // 0x052C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AccelByteId;                                       // 0x0538(0x0010)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bAbilitiesInitialized;                             // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UPower>>             StartupPowers;                                     // 0x0550(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DefaultTags;                                       // 0x0560(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_580[0x10];                                     // 0x0580(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelPowers();
	void ClientInitializeContextSensors();
	void DisableCameraRotationForDuration(float Duration);
	void DisableMovementForFrames(int32 Frames);
	bool IsUsingPower();
	void K2_FellOutOfWorld();
	void K2_OnNameChanged(const class FString& NewName);
	void K2_OnRepPlayerState(const bool IsValid);
	void K2_OnSetCustomization(const class FString& PlayerAccelByteID);
	void OnDamaged(float DamageAmount, const struct FHitResult& HitInfo, const struct FGameplayTagContainer& DamageTags, class ACharacterSCT* InstigatorCharacter, class AActor* DamageCauser);
	void OnHealthChanged(float DeltaValue, const struct FGameplayTagContainer& EventTags);
	void OnManaChanged(float DeltaValue, const struct FGameplayTagContainer& EventTags);
	void OnMoveSpeedChanged(float MovementSpeed);
	void OnNameChanged(const class FString& NewName);
	void OnPreServerTravel();
	void OnRep_AccelByteID();
	void ServerCancelPowers();
	void Silence(float Duration);

	bool CanRotateCamera() const;
	bool CanRotateCharacter() const;
	int32 GetCharacerLevel() const;
	EFate GetFate() const;
	class ASCTPlayerState* GetSCTPlayerState() const;
	bool IsAlive() const;
	bool IsFateKnown() const;
	bool IsImmovable() const;
	bool IsInactive() const;
	bool K2_CanCrouch() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterSCT">();
	}
	static class ACharacterSCT* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACharacterSCT>();
	}
};
static_assert(alignof(ACharacterSCT) == 0x000010, "Wrong alignment on ACharacterSCT");
static_assert(sizeof(ACharacterSCT) == 0x000590, "Wrong size on ACharacterSCT");
static_assert(offsetof(ACharacterSCT, AbilitySystemComponent) == 0x0004D0, "Member 'ACharacterSCT::AbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, MoveAttributeSet) == 0x0004D8, "Member 'ACharacterSCT::MoveAttributeSet' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, BaseTurnRate) == 0x0004E0, "Member 'ACharacterSCT::BaseTurnRate' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, BaseLookUpRate) == 0x0004E4, "Member 'ACharacterSCT::BaseLookUpRate' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, Portrait) == 0x0004E8, "Member 'ACharacterSCT::Portrait' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, CameraBoom) == 0x0004F0, "Member 'ACharacterSCT::CameraBoom' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, FollowCamera) == 0x0004F8, "Member 'ACharacterSCT::FollowCamera' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, ContextSensor) == 0x000500, "Member 'ACharacterSCT::ContextSensor' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, ContextInputManager) == 0x000508, "Member 'ACharacterSCT::ContextInputManager' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, ContextPowerManager) == 0x000510, "Member 'ACharacterSCT::ContextPowerManager' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, Inventory) == 0x000518, "Member 'ACharacterSCT::Inventory' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, CheatComponent) == 0x000520, "Member 'ACharacterSCT::CheatComponent' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, SensorDistance) == 0x000528, "Member 'ACharacterSCT::SensorDistance' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, SensorOffset) == 0x00052C, "Member 'ACharacterSCT::SensorOffset' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, AccelByteId) == 0x000538, "Member 'ACharacterSCT::AccelByteId' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, bAbilitiesInitialized) == 0x000548, "Member 'ACharacterSCT::bAbilitiesInitialized' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, StartupPowers) == 0x000550, "Member 'ACharacterSCT::StartupPowers' has a wrong offset!");
static_assert(offsetof(ACharacterSCT, DefaultTags) == 0x000560, "Member 'ACharacterSCT::DefaultTags' has a wrong offset!");

// Class SCT.AfterlifeCharacter
// 0x0010 (0x05A0 - 0x0590)
class AAfterlifeCharacter : public ACharacterSCT
{
public:
	bool                                          bIsFlying;                                         // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_591[0xF];                                      // 0x0591(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HideSpectatorHUD();
	void ShowSpectatorHUD();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AfterlifeCharacter">();
	}
	static class AAfterlifeCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAfterlifeCharacter>();
	}
};
static_assert(alignof(AAfterlifeCharacter) == 0x000010, "Wrong alignment on AAfterlifeCharacter");
static_assert(sizeof(AAfterlifeCharacter) == 0x0005A0, "Wrong size on AAfterlifeCharacter");
static_assert(offsetof(AAfterlifeCharacter, bIsFlying) == 0x000590, "Member 'AAfterlifeCharacter::bIsFlying' has a wrong offset!");

// Class SCT.AccelByteGIS
// 0x0400 (0x0430 - 0x0030)
class alignas(0x10) UAccelByteGIS final : public UGameInstanceSubsystem
{
public:
	struct FCloudCustomizationPayload             CurrentMaleCustomization;                          // 0x0030(0x0044)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCloudCustomizationPayload             CurrentFemaleCustomization;                        // 0x0074(0x0044)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCloudCustomizationPayload             TempMaleCustomization;                             // 0x00B8(0x0044)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCloudCustomizationPayload             TempFemaleCustomization;                           // 0x00FC(0x0044)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	ECustomizationSavedGender                     CustomizationType;                                 // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         PlayedWithEarlierUserIDs;                          // 0x0148(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SessionID;                                         // 0x0158(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x10];                                     // 0x0168(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LoginCode;                                         // 0x0178(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitialized;                                      // 0x017C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnStartLogin;                                      // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCancelLogin;                                     // 0x0190(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnClientLoggedIn;                                  // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnClientLoginFailed;                               // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnDisconnectedFromLobby;                           // 0x01C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnConnectionClosed;                                // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnConnectionFailed;                                // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnNetworkFailed;                                   // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCancelMatchmakingOnStart;                        // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnUserLinkedToVersusEvil;                          // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	struct FFCTAchievementList                    AchievementList;                                   // 0x0220(0x0028)(BlueprintVisible, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnReconnectedToLobby;                              // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnDLCPurchased;                                    // 0x0258(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UTexture2D*                             ProfilePortrait;                                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimerHandle                           LoginTimerHandle;                                  // 0x0270(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimerHandle                           SyncPurchasesTimerHandle;                          // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAccelByteUserPresenceData             PresenceData;                                      // 0x0280(0x0028)(NativeAccessSpecifierPublic)
	bool                                          bConsolePlayerCommunicationRestricted;             // 0x02A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bXboxCrossPlayFriendsCommunicationRestricted;      // 0x02A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bXboxCrossPlayNonFriendsCommunicationRestricted;   // 0x02AA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AB[0x5];                                      // 0x02AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnAcceptConsoleSessionInvite;                      // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnConsoleLaunchIntent;                             // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnConsoleLaunchMultiplayerIntent;                  // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPartyChatReceived;                               // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnUserPresenceUpdateRecieved;                      // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FFCTFriendsList                        CachedFriendslist;                                 // 0x0300(0x0028)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, struct FAccelByteUserPresenceData> AccelByteFriendsListUserPresenceData;              // 0x0328(0x0050)(NativeAccessSpecifierPublic)
	bool                                          bRequestCrossPlayJoinErrorMessage;                 // 0x0378(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_379[0xF];                                      // 0x0379(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              MatchStartTime;                                    // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_390[0x10];                                     // 0x0390(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTAchievementPopUp*                   CurrentPopUp;                                      // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A8[0x10];                                     // 0x03A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bLoggedIn;                                         // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bXboxCrossPlayRestricted;                          // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bGameCrossPlayEnabled;                             // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3BB[0x5];                                      // 0x03BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AchievementPopUpTimerHandle;                       // 0x03C0(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C8[0x10];                                     // 0x03C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FAccelByteUserPresenceData> AccelByteUserPresenceData;                         // 0x03D8(0x0050)(NativeAccessSpecifierPrivate)
	float                                         LastSyncPlatformPurchasesTimeS;                    // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddNewAchievementToQueue(class UFCTAchievement* NewAchievement);
	void AnimateAchievementPopUpFadeIn();
	void AnimateAchievementPopUpFadeOut();
	void CachePlayedWithLastMatchUser(const class FString& UserId);
	void CancelClientLogin();
	void ClearCrossPlayJoinErrorMessage();
	void ClearPendingConsoleLaunchIntent();
	void ClearPendingConsoleLaunchMultiplayerIntent();
	void ClearPendingConsoleSessionInvite();
	void ClearPlayedWithLastMatchUserCache();
	void ClientLoginFailed();
	struct FFCTRecentlyPlayedWithPayload GetCachedLastMatchUsers();
	bool GetGameCrossplayEnabled();
	class FString GetPlatformPlayerNickname();
	bool GetSyncPlatformPurchasesRateLimited();
	bool GetXboxCrossPlayRestricted();
	bool HasPendingConsoleLaunchIntent();
	bool HasPendingConsoleLaunchMultiplayerIntent();
	bool HasPendingConsoleSessionInvite();
	bool IsLoggedIn();
	void LoginClient();
	void LoginClientWithDelay(float Delay);
	void OnAchievementPopUpCreated(class UTexture2DDynamic* IconTexture);
	void ReopenConsoleSession();
	void RequestCrossPlayJoinErrorMessage();
	void ResetLoginForNewUser();
	void SetGameCrossplayEnabled(bool bInEnabled);
	void SetXboxCrossPlayRestricted(bool bInRestricted);
	void StartTelemetryMatchTimer();
	void UnbindEvents();
	void UpdatePlatformAchievementProgress(const class FString& AchievementID, float Progress);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccelByteGIS">();
	}
	static class UAccelByteGIS* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccelByteGIS>();
	}
};
static_assert(alignof(UAccelByteGIS) == 0x000010, "Wrong alignment on UAccelByteGIS");
static_assert(sizeof(UAccelByteGIS) == 0x000430, "Wrong size on UAccelByteGIS");
static_assert(offsetof(UAccelByteGIS, CurrentMaleCustomization) == 0x000030, "Member 'UAccelByteGIS::CurrentMaleCustomization' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, CurrentFemaleCustomization) == 0x000074, "Member 'UAccelByteGIS::CurrentFemaleCustomization' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, TempMaleCustomization) == 0x0000B8, "Member 'UAccelByteGIS::TempMaleCustomization' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, TempFemaleCustomization) == 0x0000FC, "Member 'UAccelByteGIS::TempFemaleCustomization' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, CustomizationType) == 0x000140, "Member 'UAccelByteGIS::CustomizationType' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, PlayedWithEarlierUserIDs) == 0x000148, "Member 'UAccelByteGIS::PlayedWithEarlierUserIDs' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, SessionID) == 0x000158, "Member 'UAccelByteGIS::SessionID' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, LoginCode) == 0x000178, "Member 'UAccelByteGIS::LoginCode' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, bInitialized) == 0x00017C, "Member 'UAccelByteGIS::bInitialized' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnStartLogin) == 0x000180, "Member 'UAccelByteGIS::OnStartLogin' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnCancelLogin) == 0x000190, "Member 'UAccelByteGIS::OnCancelLogin' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnClientLoggedIn) == 0x0001A0, "Member 'UAccelByteGIS::OnClientLoggedIn' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnClientLoginFailed) == 0x0001B0, "Member 'UAccelByteGIS::OnClientLoginFailed' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnDisconnectedFromLobby) == 0x0001C0, "Member 'UAccelByteGIS::OnDisconnectedFromLobby' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnConnectionClosed) == 0x0001D0, "Member 'UAccelByteGIS::OnConnectionClosed' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnConnectionFailed) == 0x0001E0, "Member 'UAccelByteGIS::OnConnectionFailed' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnNetworkFailed) == 0x0001F0, "Member 'UAccelByteGIS::OnNetworkFailed' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnCancelMatchmakingOnStart) == 0x000200, "Member 'UAccelByteGIS::OnCancelMatchmakingOnStart' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnUserLinkedToVersusEvil) == 0x000210, "Member 'UAccelByteGIS::OnUserLinkedToVersusEvil' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, AchievementList) == 0x000220, "Member 'UAccelByteGIS::AchievementList' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnReconnectedToLobby) == 0x000248, "Member 'UAccelByteGIS::OnReconnectedToLobby' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnDLCPurchased) == 0x000258, "Member 'UAccelByteGIS::OnDLCPurchased' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, ProfilePortrait) == 0x000268, "Member 'UAccelByteGIS::ProfilePortrait' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, LoginTimerHandle) == 0x000270, "Member 'UAccelByteGIS::LoginTimerHandle' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, SyncPurchasesTimerHandle) == 0x000278, "Member 'UAccelByteGIS::SyncPurchasesTimerHandle' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, PresenceData) == 0x000280, "Member 'UAccelByteGIS::PresenceData' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, bConsolePlayerCommunicationRestricted) == 0x0002A8, "Member 'UAccelByteGIS::bConsolePlayerCommunicationRestricted' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, bXboxCrossPlayFriendsCommunicationRestricted) == 0x0002A9, "Member 'UAccelByteGIS::bXboxCrossPlayFriendsCommunicationRestricted' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, bXboxCrossPlayNonFriendsCommunicationRestricted) == 0x0002AA, "Member 'UAccelByteGIS::bXboxCrossPlayNonFriendsCommunicationRestricted' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnAcceptConsoleSessionInvite) == 0x0002B0, "Member 'UAccelByteGIS::OnAcceptConsoleSessionInvite' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnConsoleLaunchIntent) == 0x0002C0, "Member 'UAccelByteGIS::OnConsoleLaunchIntent' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnConsoleLaunchMultiplayerIntent) == 0x0002D0, "Member 'UAccelByteGIS::OnConsoleLaunchMultiplayerIntent' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnPartyChatReceived) == 0x0002E0, "Member 'UAccelByteGIS::OnPartyChatReceived' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, OnUserPresenceUpdateRecieved) == 0x0002F0, "Member 'UAccelByteGIS::OnUserPresenceUpdateRecieved' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, CachedFriendslist) == 0x000300, "Member 'UAccelByteGIS::CachedFriendslist' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, AccelByteFriendsListUserPresenceData) == 0x000328, "Member 'UAccelByteGIS::AccelByteFriendsListUserPresenceData' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, bRequestCrossPlayJoinErrorMessage) == 0x000378, "Member 'UAccelByteGIS::bRequestCrossPlayJoinErrorMessage' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, MatchStartTime) == 0x000388, "Member 'UAccelByteGIS::MatchStartTime' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, CurrentPopUp) == 0x0003A0, "Member 'UAccelByteGIS::CurrentPopUp' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, bLoggedIn) == 0x0003B8, "Member 'UAccelByteGIS::bLoggedIn' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, bXboxCrossPlayRestricted) == 0x0003B9, "Member 'UAccelByteGIS::bXboxCrossPlayRestricted' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, bGameCrossPlayEnabled) == 0x0003BA, "Member 'UAccelByteGIS::bGameCrossPlayEnabled' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, AchievementPopUpTimerHandle) == 0x0003C0, "Member 'UAccelByteGIS::AchievementPopUpTimerHandle' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, AccelByteUserPresenceData) == 0x0003D8, "Member 'UAccelByteGIS::AccelByteUserPresenceData' has a wrong offset!");
static_assert(offsetof(UAccelByteGIS, LastSyncPlatformPurchasesTimeS) == 0x000428, "Member 'UAccelByteGIS::LastSyncPlatformPurchasesTimeS' has a wrong offset!");

// Class SCT.FCTAchievement
// 0x0090 (0x00B8 - 0x0028)
class UFCTAchievement final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AchievedOn;                                        // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              AchievedOnDateTime;                                // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GoalValue;                                         // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentValue;                                      // 0x0064(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUnlocked;                                       // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHidden;                                         // 0x0069(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      IconTexture;                                       // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnIconCreated;                                     // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 Code;                                              // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x20];                                      // 0x0098(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FCTAchievement">();
	}
	static class UFCTAchievement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFCTAchievement>();
	}
};
static_assert(alignof(UFCTAchievement) == 0x000008, "Wrong alignment on UFCTAchievement");
static_assert(sizeof(UFCTAchievement) == 0x0000B8, "Wrong size on UFCTAchievement");
static_assert(offsetof(UFCTAchievement, Name_0) == 0x000028, "Member 'UFCTAchievement::Name_0' has a wrong offset!");
static_assert(offsetof(UFCTAchievement, Description) == 0x000038, "Member 'UFCTAchievement::Description' has a wrong offset!");
static_assert(offsetof(UFCTAchievement, AchievedOn) == 0x000048, "Member 'UFCTAchievement::AchievedOn' has a wrong offset!");
static_assert(offsetof(UFCTAchievement, AchievedOnDateTime) == 0x000058, "Member 'UFCTAchievement::AchievedOnDateTime' has a wrong offset!");
static_assert(offsetof(UFCTAchievement, GoalValue) == 0x000060, "Member 'UFCTAchievement::GoalValue' has a wrong offset!");
static_assert(offsetof(UFCTAchievement, CurrentValue) == 0x000064, "Member 'UFCTAchievement::CurrentValue' has a wrong offset!");
static_assert(offsetof(UFCTAchievement, bIsUnlocked) == 0x000068, "Member 'UFCTAchievement::bIsUnlocked' has a wrong offset!");
static_assert(offsetof(UFCTAchievement, bIsHidden) == 0x000069, "Member 'UFCTAchievement::bIsHidden' has a wrong offset!");
static_assert(offsetof(UFCTAchievement, IconTexture) == 0x000070, "Member 'UFCTAchievement::IconTexture' has a wrong offset!");
static_assert(offsetof(UFCTAchievement, OnIconCreated) == 0x000078, "Member 'UFCTAchievement::OnIconCreated' has a wrong offset!");
static_assert(offsetof(UFCTAchievement, Code) == 0x000088, "Member 'UFCTAchievement::Code' has a wrong offset!");

// Class SCT.AchievementComponent
// 0x0020 (0x00D0 - 0x00B0)
class UAchievementComponent final : public UActorComponent
{
public:
	TArray<class UAchievementObject*>             ActiveObjects;                                     // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class ASCTPlayerState*                        PlayerState;                                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInitialized;                                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementComponent">();
	}
	static class UAchievementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementComponent>();
	}
};
static_assert(alignof(UAchievementComponent) == 0x000008, "Wrong alignment on UAchievementComponent");
static_assert(sizeof(UAchievementComponent) == 0x0000D0, "Wrong size on UAchievementComponent");
static_assert(offsetof(UAchievementComponent, ActiveObjects) == 0x0000B0, "Member 'UAchievementComponent::ActiveObjects' has a wrong offset!");
static_assert(offsetof(UAchievementComponent, PlayerState) == 0x0000C0, "Member 'UAchievementComponent::PlayerState' has a wrong offset!");
static_assert(offsetof(UAchievementComponent, bInitialized) == 0x0000C8, "Member 'UAchievementComponent::bInitialized' has a wrong offset!");

// Class SCT.ProgressionObject
// 0x0010 (0x0038 - 0x0028)
class UProgressionObject : public UObject
{
public:
	int32                                         PlayerId;                                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerController*                   Controller;                                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void K2_Initialize();

	class ACharacterSCT* GetCharacter() const;
	class ASCTPlayerController* GetController() const;
	class ASCTGameState* GetGameState() const;
	int32 GetMaxNumberOfPlayers() const;
	class ASCTPlayerState* GetPlayerState() const;
	class ASCTPlayerState* GetRandomOtherPlayer() const;
	class ASCTPlayerState* GetRandomPlayer(const TArray<class APlayerState*>& Ignore) const;
	class AActor* GetWorldContextObject() const;
	bool IsControllerSelf(class APlayerController* Other) const;
	bool IsPlayerStateSelf(class APlayerState* Other) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProgressionObject">();
	}
	static class UProgressionObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressionObject>();
	}
};
static_assert(alignof(UProgressionObject) == 0x000008, "Wrong alignment on UProgressionObject");
static_assert(sizeof(UProgressionObject) == 0x000038, "Wrong size on UProgressionObject");
static_assert(offsetof(UProgressionObject, PlayerId) == 0x000028, "Member 'UProgressionObject::PlayerId' has a wrong offset!");
static_assert(offsetof(UProgressionObject, Controller) == 0x000030, "Member 'UProgressionObject::Controller' has a wrong offset!");

// Class SCT.CustomizationScrollBoxUserWidgetBase
// 0x0098 (0x02F8 - 0x0260)
class UCustomizationScrollBoxUserWidgetBase : public UUserWidget
{
public:
	class UGridPanel*                             ClassicItemGrid;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGridPanel*                             ElegantItemGrid;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGridPanel*                             LuxuriousItemGrid;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGridPanel*                             ExtravagantItemGrid;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UItemCardUserWidget*                    SelectedCategoryButton;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EItemQuality                                  CurrentQuality;                                    // 0x0288(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UItemCardUserWidget*> ItemCards;                                         // 0x0290(0x0050)(BlueprintVisible, ExportObject, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         WardrobeColumnsPerRow;                             // 0x02E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SelectedRowName;                                   // 0x02E8(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SwapItemCardSelectedStates(const class FString& NewItemRowName);
	void SwapItemCardSelectedStatesByGrid(class UGridPanel* Grid, class FString& CurrentItemRowName, const class FString& NewItemRowName);
	void UpdateCategoryVisibility(class UGridPanel* CategoryGrid);
	void UpdateVisibilityForAllCategories();
	class UWidget* VerticalBoundaryHit(EUINavigation InNavigation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizationScrollBoxUserWidgetBase">();
	}
	static class UCustomizationScrollBoxUserWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationScrollBoxUserWidgetBase>();
	}
};
static_assert(alignof(UCustomizationScrollBoxUserWidgetBase) == 0x000008, "Wrong alignment on UCustomizationScrollBoxUserWidgetBase");
static_assert(sizeof(UCustomizationScrollBoxUserWidgetBase) == 0x0002F8, "Wrong size on UCustomizationScrollBoxUserWidgetBase");
static_assert(offsetof(UCustomizationScrollBoxUserWidgetBase, ClassicItemGrid) == 0x000260, "Member 'UCustomizationScrollBoxUserWidgetBase::ClassicItemGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidgetBase, ElegantItemGrid) == 0x000268, "Member 'UCustomizationScrollBoxUserWidgetBase::ElegantItemGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidgetBase, LuxuriousItemGrid) == 0x000270, "Member 'UCustomizationScrollBoxUserWidgetBase::LuxuriousItemGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidgetBase, ExtravagantItemGrid) == 0x000278, "Member 'UCustomizationScrollBoxUserWidgetBase::ExtravagantItemGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidgetBase, SelectedCategoryButton) == 0x000280, "Member 'UCustomizationScrollBoxUserWidgetBase::SelectedCategoryButton' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidgetBase, CurrentQuality) == 0x000288, "Member 'UCustomizationScrollBoxUserWidgetBase::CurrentQuality' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidgetBase, ItemCards) == 0x000290, "Member 'UCustomizationScrollBoxUserWidgetBase::ItemCards' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidgetBase, WardrobeColumnsPerRow) == 0x0002E0, "Member 'UCustomizationScrollBoxUserWidgetBase::WardrobeColumnsPerRow' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidgetBase, SelectedRowName) == 0x0002E8, "Member 'UCustomizationScrollBoxUserWidgetBase::SelectedRowName' has a wrong offset!");

// Class SCT.CustomizationScrollBoxUserWidget
// 0x0080 (0x0378 - 0x02F8)
class UCustomizationScrollBoxUserWidget : public UCustomizationScrollBoxUserWidgetBase
{
public:
	class UControllerSelectionStateWidget*        ManlyButton;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UControllerSelectionStateWidget*        GirlyButton;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGridPanel*                             PresetGrid;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGridPanel*                             SkintoneGrid;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGridPanel*                             EyeColorGrid;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGridPanel*                             HairColorGrid;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomizationOption                          AppearanceOption;                                  // 0x0328(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayerCustomizationGender                    Gender;                                            // 0x0329(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SelectedPresetRow;                                 // 0x0330(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SelectedSkintoneRow;                               // 0x0340(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SelectedEyeColorRow;                               // 0x0350(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SelectedHairColorRow;                              // 0x0360(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppearanceColumnsPerRow;                           // 0x0370(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* AppearanceVerticalBoundaryHit(EUINavigation InNavigation);
	class UWidget* HorizontalBoundaryHit(EUINavigation InNavigation);
	void K2_UpdateEyeMaterial(const class FString& Selected);
	void K2_UpdateHairColor(const class FString& Selected);
	void K2_UpdatePreset(const class FString& Selected);
	void K2_UpdateSkinMaterial(const class FString& Selected);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizationScrollBoxUserWidget">();
	}
	static class UCustomizationScrollBoxUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationScrollBoxUserWidget>();
	}
};
static_assert(alignof(UCustomizationScrollBoxUserWidget) == 0x000008, "Wrong alignment on UCustomizationScrollBoxUserWidget");
static_assert(sizeof(UCustomizationScrollBoxUserWidget) == 0x000378, "Wrong size on UCustomizationScrollBoxUserWidget");
static_assert(offsetof(UCustomizationScrollBoxUserWidget, ManlyButton) == 0x0002F8, "Member 'UCustomizationScrollBoxUserWidget::ManlyButton' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidget, GirlyButton) == 0x000300, "Member 'UCustomizationScrollBoxUserWidget::GirlyButton' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidget, PresetGrid) == 0x000308, "Member 'UCustomizationScrollBoxUserWidget::PresetGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidget, SkintoneGrid) == 0x000310, "Member 'UCustomizationScrollBoxUserWidget::SkintoneGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidget, EyeColorGrid) == 0x000318, "Member 'UCustomizationScrollBoxUserWidget::EyeColorGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidget, HairColorGrid) == 0x000320, "Member 'UCustomizationScrollBoxUserWidget::HairColorGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidget, AppearanceOption) == 0x000328, "Member 'UCustomizationScrollBoxUserWidget::AppearanceOption' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidget, Gender) == 0x000329, "Member 'UCustomizationScrollBoxUserWidget::Gender' has a wrong offset!");
static_assert(offsetof(UCustomizationScrollBoxUserWidget, SelectedPresetRow) == 0x000330, "Member 'UCustomizationScrollBoxUserWidget::SelectedPresetRow' has a wrong offset!");
