#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCTGameMode_MatchBP

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.EndMatchDispatch__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SCTGameMode_MatchBP_C_EndMatchDispatch__DelegateSignature final
{
public:
	EEndConditions                                End_Condition;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTGameMode_MatchBP_C_EndMatchDispatch__DelegateSignature) == 0x000001, "Wrong alignment on SCTGameMode_MatchBP_C_EndMatchDispatch__DelegateSignature");
static_assert(sizeof(SCTGameMode_MatchBP_C_EndMatchDispatch__DelegateSignature) == 0x000001, "Wrong size on SCTGameMode_MatchBP_C_EndMatchDispatch__DelegateSignature");
static_assert(offsetof(SCTGameMode_MatchBP_C_EndMatchDispatch__DelegateSignature, End_Condition) == 0x000000, "Member 'SCTGameMode_MatchBP_C_EndMatchDispatch__DelegateSignature::End_Condition' has a wrong offset!");

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.ExecuteUbergraph_SCTGameMode_MatchBP
// 0x0100 (0x0100 - 0x0000)
struct SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AController*>                    Temp_wildcard_Variable;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class AController*                            Temp_wildcard_Variable_1;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMatchInProgress_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Temp_float_Variable;                               // 0x0040(0x0010)(ReferenceParm)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOnlyPersonoidsAlive_ReturnValue;       // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOnlyOneResidentAlive_ReturnValue;      // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            K2Node_Event_ExitingController;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_scoreName;                            // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        K2Node_Event_playerState;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumAlivePlayers_ReturnValue;           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHumanoidCharacter*                     K2Node_Event_humanoidCharacter;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_controller;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDestiny                               K2Node_Event_Destiny;                              // 0x00A0(0x0010)(NoDestructor)
	bool                                          K2Node_Event_IsPersonoid;                          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchEnded_ReturnValue;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_NewState;                             // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchEnded_ReturnValue_1;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP) == 0x000008, "Wrong alignment on SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP");
static_assert(sizeof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP) == 0x000100, "Wrong size on SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, EntryPoint) == 0x000000, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Now_ReturnValue) == 0x000008, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, Temp_wildcard_Variable) == 0x000010, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, Temp_wildcard_Variable_1) == 0x000020, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Array_Get_Item) == 0x000028, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_GetTimeSeconds_ReturnValue) == 0x000034, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_IsMatchInProgress_ReturnValue) == 0x000039, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_IsMatchInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, Temp_float_Variable) == 0x000040, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000054, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_HasAuthority_ReturnValue) == 0x00005D, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_GetOnlyPersonoidsAlive_ReturnValue) == 0x00005E, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_GetOnlyPersonoidsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_GetOnlyOneResidentAlive_ReturnValue) == 0x00005F, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_GetOnlyOneResidentAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_Event_ExitingController) == 0x000060, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_Event_ExitingController' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000068, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_Event_scoreName) == 0x00006C, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_Event_scoreName' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_Event_playerState) == 0x000078, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_Event_playerState' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000080, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_GetNumAlivePlayers_ReturnValue) == 0x000088, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_GetNumAlivePlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_Event_humanoidCharacter) == 0x000090, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_Event_humanoidCharacter' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_Event_controller) == 0x000098, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_Event_controller' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_Event_Destiny) == 0x0000A0, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_Event_Destiny' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_Event_IsPersonoid) == 0x0000B0, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_Event_IsPersonoid' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000B1, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_Array_Add_ReturnValue_1) == 0x0000B4, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_HasMatchEnded_ReturnValue) == 0x0000B8, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_HasMatchEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_Event_NewState) == 0x0000BC, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_SwitchName_CmpSuccess) == 0x0000C4, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D8, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_HasMatchEnded_ReturnValue_1) == 0x0000E0, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_HasMatchEnded_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, CallFunc_GetGameInstance_ReturnValue) == 0x0000E8, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_DynamicCast_AsFCTGame_Instance_BP) == 0x0000F0, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_DynamicCast_AsFCTGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'SCTGameMode_MatchBP_C_ExecuteUbergraph_SCTGameMode_MatchBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.K2_OnSetMatchState
// 0x0008 (0x0008 - 0x0000)
struct SCTGameMode_MatchBP_C_K2_OnSetMatchState final
{
public:
	class FName                                   NewState;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTGameMode_MatchBP_C_K2_OnSetMatchState) == 0x000004, "Wrong alignment on SCTGameMode_MatchBP_C_K2_OnSetMatchState");
static_assert(sizeof(SCTGameMode_MatchBP_C_K2_OnSetMatchState) == 0x000008, "Wrong size on SCTGameMode_MatchBP_C_K2_OnSetMatchState");
static_assert(offsetof(SCTGameMode_MatchBP_C_K2_OnSetMatchState, NewState) == 0x000000, "Member 'SCTGameMode_MatchBP_C_K2_OnSetMatchState::NewState' has a wrong offset!");

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.K2_OnCharacterDestiny
// 0x0028 (0x0028 - 0x0000)
struct SCTGameMode_MatchBP_C_K2_OnCharacterDestiny final
{
public:
	class AHumanoidCharacter*                     HumanoidCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            Controller;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDestiny                               Destiny;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          IsPersonoid;                                       // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SCTGameMode_MatchBP_C_K2_OnCharacterDestiny) == 0x000008, "Wrong alignment on SCTGameMode_MatchBP_C_K2_OnCharacterDestiny");
static_assert(sizeof(SCTGameMode_MatchBP_C_K2_OnCharacterDestiny) == 0x000028, "Wrong size on SCTGameMode_MatchBP_C_K2_OnCharacterDestiny");
static_assert(offsetof(SCTGameMode_MatchBP_C_K2_OnCharacterDestiny, HumanoidCharacter) == 0x000000, "Member 'SCTGameMode_MatchBP_C_K2_OnCharacterDestiny::HumanoidCharacter' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_K2_OnCharacterDestiny, Controller) == 0x000008, "Member 'SCTGameMode_MatchBP_C_K2_OnCharacterDestiny::Controller' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_K2_OnCharacterDestiny, Destiny) == 0x000010, "Member 'SCTGameMode_MatchBP_C_K2_OnCharacterDestiny::Destiny' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_K2_OnCharacterDestiny, IsPersonoid) == 0x000020, "Member 'SCTGameMode_MatchBP_C_K2_OnCharacterDestiny::IsPersonoid' has a wrong offset!");

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.GiveScore
// 0x0010 (0x0010 - 0x0000)
struct SCTGameMode_MatchBP_C_GiveScore final
{
public:
	class FName                                   ScoreName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState*                        PlayerState;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTGameMode_MatchBP_C_GiveScore) == 0x000008, "Wrong alignment on SCTGameMode_MatchBP_C_GiveScore");
static_assert(sizeof(SCTGameMode_MatchBP_C_GiveScore) == 0x000010, "Wrong size on SCTGameMode_MatchBP_C_GiveScore");
static_assert(offsetof(SCTGameMode_MatchBP_C_GiveScore, ScoreName) == 0x000000, "Member 'SCTGameMode_MatchBP_C_GiveScore::ScoreName' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GiveScore, PlayerState) == 0x000008, "Member 'SCTGameMode_MatchBP_C_GiveScore::PlayerState' has a wrong offset!");

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.K2_OnLogout
// 0x0008 (0x0008 - 0x0000)
struct SCTGameMode_MatchBP_C_K2_OnLogout final
{
public:
	class AController*                            ExitingController;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTGameMode_MatchBP_C_K2_OnLogout) == 0x000008, "Wrong alignment on SCTGameMode_MatchBP_C_K2_OnLogout");
static_assert(sizeof(SCTGameMode_MatchBP_C_K2_OnLogout) == 0x000008, "Wrong size on SCTGameMode_MatchBP_C_K2_OnLogout");
static_assert(offsetof(SCTGameMode_MatchBP_C_K2_OnLogout, ExitingController) == 0x000000, "Member 'SCTGameMode_MatchBP_C_K2_OnLogout::ExitingController' has a wrong offset!");

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.Do End Match with Condition
// 0x00A8 (0x00A8 - 0x0000)
struct SCTGameMode_MatchBP_C_Do_End_Match_with_Condition final
{
public:
	EEndConditions                                End_Condition;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASCTPlayerState*>                SavedAlivePlayers;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	EFate                                         Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         Temp_byte_Variable_2;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFate                                         Temp_byte_Variable_3;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         Temp_byte_Variable_4;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndConditions                                Temp_byte_Variable_5;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         Temp_byte_Variable_6;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         Temp_byte_Variable_7;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         Temp_byte_Variable_8;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         Temp_byte_Variable_9;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInfoGIS*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerInfoGIS*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchEndData                          CallFunc_CreateEndData_ReturnValue;                // 0x0040(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DisableEndConditionInDevelopment_ReturnValue; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFate                                         K2Node_Select_Default;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         K2Node_Select_Default_1;                           // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         Temp_byte_Variable_10;                             // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASCTPlayerState*>                CallFunc_GetAlivePlayers_Alive_Players;            // 0x0080(0x0010)(ReferenceParm)
	EFate                                         K2Node_Select_Default_2;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         Temp_byte_Variable_11;                             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTGameState_MatchBP_C*                CallFunc_GetSCTGameState_MatchBP_AsSCTGame_State_Match_BP; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFate                                         Temp_byte_Variable_12;                             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFate                                         K2Node_Select_Default_3;                           // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFate                                         K2Node_Select_Default_4;                           // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition) == 0x000008, "Wrong alignment on SCTGameMode_MatchBP_C_Do_End_Match_with_Condition");
static_assert(sizeof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition) == 0x0000A8, "Wrong size on SCTGameMode_MatchBP_C_Do_End_Match_with_Condition");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, End_Condition) == 0x000000, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::End_Condition' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, SavedAlivePlayers) == 0x000008, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::SavedAlivePlayers' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable) == 0x000018, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000019, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_bool_Variable) == 0x00001A, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_1) == 0x000020, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_2) == 0x000021, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_bool_Variable_1) == 0x000022, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_3) == 0x000023, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_4) == 0x000024, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_5) == 0x000025, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_6) == 0x000026, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_7) == 0x000027, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_8) == 0x000028, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_9) == 0x000029, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_CreateEndData_ReturnValue) == 0x000040, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_CreateEndData_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_int_Array_Index_Variable) == 0x000064, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_DisableEndConditionInDevelopment_ReturnValue) == 0x000068, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_DisableEndConditionInDevelopment_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_Array_Get_Item) == 0x000070, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000078, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, K2Node_Select_Default) == 0x000079, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, K2Node_Select_Default_1) == 0x00007A, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_10) == 0x00007B, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_bool_IsClosed_Variable) == 0x00007C, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_bool_Variable_2) == 0x00007D, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_GetAlivePlayers_Alive_Players) == 0x000080, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_GetAlivePlayers_Alive_Players' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, K2Node_Select_Default_2) == 0x000090, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_11) == 0x000091, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_GetSCTGameState_MatchBP_AsSCTGame_State_Match_BP) == 0x000098, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_GetSCTGameState_MatchBP_AsSCTGame_State_Match_BP' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_byte_Variable_12) == 0x0000A0, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, CallFunc_BooleanOR_ReturnValue) == 0x0000A1, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_bool_Variable_3) == 0x0000A2, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, K2Node_Select_Default_3) == 0x0000A3, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, Temp_bool_Has_Been_Initd_Variable) == 0x0000A4, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_Do_End_Match_with_Condition, K2Node_Select_Default_4) == 0x0000A5, "Member 'SCTGameMode_MatchBP_C_Do_End_Match_with_Condition::K2Node_Select_Default_4' has a wrong offset!");

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.GetOnlyPersonoidsAlive
// 0x0010 (0x0010 - 0x0000)
struct SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumAlivePersonoids_ReturnValue;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumAliveResidents_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive) == 0x000004, "Wrong alignment on SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive");
static_assert(sizeof(SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive) == 0x000010, "Wrong size on SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive, ReturnValue) == 0x000000, "Member 'SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive::ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive, CallFunc_GetNumAlivePersonoids_ReturnValue) == 0x000004, "Member 'SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive::CallFunc_GetNumAlivePersonoids_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive, CallFunc_GetNumAliveResidents_ReturnValue) == 0x000008, "Member 'SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive::CallFunc_GetNumAliveResidents_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000D, "Member 'SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'SCTGameMode_MatchBP_C_GetOnlyPersonoidsAlive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.GetOnlyOneResidentAlive
// 0x0010 (0x0010 - 0x0000)
struct SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumAliveResidents_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumAlivePersonoids_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive) == 0x000004, "Wrong alignment on SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive");
static_assert(sizeof(SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive) == 0x000010, "Wrong size on SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive, ReturnValue) == 0x000000, "Member 'SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive::ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive, CallFunc_GetNumAliveResidents_ReturnValue) == 0x000004, "Member 'SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive::CallFunc_GetNumAliveResidents_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive, CallFunc_GetNumAlivePersonoids_ReturnValue) == 0x000008, "Member 'SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive::CallFunc_GetNumAlivePersonoids_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000D, "Member 'SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'SCTGameMode_MatchBP_C_GetOnlyOneResidentAlive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.ScoreOnlyPersonoidsRemain
// 0x0068 (0x0068 - 0x0000)
struct SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain final
{
public:
	int32                                         Personoids_Alive;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValidAmountOfPersonoids;                         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Is_One_Personoid_Alive;                            // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASCTPlayerState*>                CallFunc_GetAlivePersonoids_Personoids;            // 0x0028(0x0010)(ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ASCTPlayerState*>                CallFunc_GetAlivePersonoids_Personoids_1;          // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain) == 0x000008, "Wrong alignment on SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain");
static_assert(sizeof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain) == 0x000068, "Wrong size on SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, Personoids_Alive) == 0x000000, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::Personoids_Alive' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, IsValidAmountOfPersonoids) == 0x000004, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::IsValidAmountOfPersonoids' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, Is_One_Personoid_Alive) == 0x000005, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::Is_One_Personoid_Alive' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, Temp_bool_Variable) == 0x000006, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, Temp_name_Variable) == 0x000008, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, Temp_name_Variable_1) == 0x000010, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, Temp_int_Array_Index_Variable) == 0x000018, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, CallFunc_GetAlivePersonoids_Personoids) == 0x000028, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::CallFunc_GetAlivePersonoids_Personoids' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, CallFunc_Array_Get_Item) == 0x000038, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, K2Node_Select_Default) == 0x000044, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004D, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00004E, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, CallFunc_BooleanOR_ReturnValue) == 0x00004F, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, CallFunc_GetAlivePersonoids_Personoids_1) == 0x000050, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::CallFunc_GetAlivePersonoids_Personoids_1' has a wrong offset!");
static_assert(offsetof(SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'SCTGameMode_MatchBP_C_ScoreOnlyPersonoidsRemain::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");

// Function SCTGameMode_MatchBP.SCTGameMode_MatchBP_C.ScoreCAINShutDown
// 0x00C0 (0x00C0 - 0x0000)
struct SCTGameMode_MatchBP_C_ScoreCAINShutDown final
{
public:
	bool                                          PersonoidPresent;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
