#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCTPlayerController_MatchBP

#include "Basic.hpp"

#include "EJoystickTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function SCTPlayerController_MatchBP.SCTPlayerController_MatchBP_C.ExecuteUbergraph_SCTPlayerController_MatchBP
// 0x0638 (0x0638 - 0x0000)
struct SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0060(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0080(0x0018)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00A8(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x00C0(0x0018)(HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_1;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x00E8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x0100(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingConsoleSessionInvite_ReturnValue; // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0148(0x0018)()
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingConsoleSessionInvite_ReturnValue_1; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UModal*                                 CallFunc_GetModal_ReturnValue;                     // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsThumbVoteMenuVisible_ReturnValue;       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInGameMenuVisible_ReturnValue;          // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UReportPlayerWI_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0198(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue;                   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue_1;          // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UModal*                                 CallFunc_GetModal_ReturnValue_1;                   // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x01D8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsThumbVoteMenuVisible_ReturnValue_1;     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInGameMenuVisible_ReturnValue_1;        // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UReportPlayerWI_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x01F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0218(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_2;   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue_1;           // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0248(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue_2;           // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue_3;           // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x0270(0x0018)(HasGetValueTypeHash)
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue_1;                 // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0298(0x0018)()
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_3;   // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x02BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x02BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x02CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x02E0(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP;          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_4;   // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x031C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32E[0x2];                                      // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue_2;                 // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0340(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTGameInstanceBP_C*                   K2Node_DynamicCast_AsFCTGame_Instance_BP_1;        // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_PendingURL;                           // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ETravelType                                   K2Node_Event_TravelType;                           // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSeamlessTravel;                    // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStartCountdownWI_C*>            CallFunc_GetAllWidgetsOfClass_FoundWidgets_2;      // 0x03A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStartCountdownWI_C*                    CallFunc_Array_Get_Item;                           // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x03B8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DA[0x2];                                      // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x03DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPassengerLogInformation               K2Node_Event_logInformation;                       // 0x03F0(0x0028)(ConstParm)
	class UCharacterWI_C*                         CallFunc_GetSCT_CharacterWidget_CharacterWI;       // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ASCTPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0420(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        K2Node_CustomEvent_PlayerState;                    // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_UnpossessedPawn;                      // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue_3;                 // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue_1;                   // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue_2;                   // 0x045A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45B[0x5];                                      // 0x045B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTGameState_MatchBP_C*                K2Node_DynamicCast_AsSCTGame_State_Match_BP;       // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        CallFunc_GetLocalPlayerState_AsSCTPlayer_State;    // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_5;   // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ServerTime;                     // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateSyncedDelay_ClockOffset;         // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x04CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x04E0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0520(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0560(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x05A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x05B0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x05D8(0x0010)(ZeroConstructor, NoDestructor)
	class UFCTPartyConnectionCallbackProxy*       CallFunc_LeaveParty_ReturnValue_4;                 // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x05F4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxUserLoggedIn_ReturnValue;           // 0x0621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_622[0x2];                                      // 0x0622(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0624(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP) == 0x000008, "Wrong alignment on SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP");
static_assert(sizeof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP) == 0x000638, "Wrong size on SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, EntryPoint) == 0x000000, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue) == 0x000020, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_HasPendingConsoleLaunchMultiplayerIntent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_HasAuthority_ReturnValue) == 0x000034, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_HasAuthority_ReturnValue_1) == 0x000035, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP) == 0x000040, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000049, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_InputKeyEvent_Key) == 0x000060, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_InputKeyEvent_Key_1) == 0x000080, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_CreateDelegate_OutputDelegate_3) == 0x000098, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_MakeLiteralText_ReturnValue) == 0x0000A8, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_InputKeyEvent_Key_2) == 0x0000C0, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_1) == 0x0000D8, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_InputKeyEvent_Key_3) == 0x0000E8, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_InputKeyEvent_Key_4) == 0x000100, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_InputKeyEvent_Key_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000118, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsValid_ReturnValue_1) == 0x000119, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000120, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000128, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Not_PreBool_ReturnValue) == 0x000130, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000131, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000138, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_HasPendingConsoleSessionInvite_ReturnValue) == 0x000140, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_HasPendingConsoleSessionInvite_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000148, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsConsolePlatform_ReturnValue) == 0x000160, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000168, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_HasPendingConsoleSessionInvite_ReturnValue_1) == 0x000170, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_HasPendingConsoleSessionInvite_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_CreateDelegate_OutputDelegate_4) == 0x000174, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetModal_ReturnValue) == 0x000188, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetModal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsThumbVoteMenuVisible_ReturnValue) == 0x000190, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsThumbVoteMenuVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsInGameMenuVisible_ReturnValue) == 0x000191, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsInGameMenuVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000198, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_BooleanOR_ReturnValue) == 0x0001A8, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Array_Length_ReturnValue) == 0x0001AC, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001B0, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001B1, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_LeaveParty_ReturnValue) == 0x0001B8, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_LeaveParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, Temp_int_Loop_Counter_Variable) == 0x0001C0, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Add_IntInt_ReturnValue) == 0x0001C4, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsValid_ReturnValue_2) == 0x0001C8, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsConsolePlatform_ReturnValue_1) == 0x0001C9, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsConsolePlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetModal_ReturnValue_1) == 0x0001D0, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetModal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_InputActionEvent_Key) == 0x0001D8, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsThumbVoteMenuVisible_ReturnValue_1) == 0x0001F0, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsThumbVoteMenuVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsInGameMenuVisible_ReturnValue_1) == 0x0001F1, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsInGameMenuVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x0001F8, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_BooleanOR_ReturnValue_1) == 0x000208, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Array_Length_ReturnValue_1) == 0x00020C, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x000210, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000211, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_InputActionEvent_Key_1) == 0x000218, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Key_IsGamepadKey_ReturnValue) == 0x000230, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Key_IsGamepadKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_2) == 0x000238, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_DynamicCast_bSuccess_2) == 0x000240, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Not_PreBool_ReturnValue_4) == 0x000241, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Key_IsGamepadKey_ReturnValue_1) == 0x000242, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Key_IsGamepadKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000243, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_InputActionEvent_Key_2) == 0x000248, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Key_IsGamepadKey_ReturnValue_2) == 0x000260, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Key_IsGamepadKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsValid_ReturnValue_3) == 0x000261, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Not_PreBool_ReturnValue_5) == 0x000262, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_Key_IsGamepadKey_ReturnValue_3) == 0x000263, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_Key_IsGamepadKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsValid_ReturnValue_4) == 0x000264, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, Temp_int_Array_Index_Variable) == 0x000268, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_InputKeyEvent_Key_5) == 0x000270, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_InputKeyEvent_Key_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_LeaveParty_ReturnValue_1) == 0x000288, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_LeaveParty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsValid_ReturnValue_5) == 0x000290, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000298, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_3) == 0x0002B0, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_DynamicCast_bSuccess_3) == 0x0002B8, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_IsValid_ReturnValue_6) == 0x0002B9, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_HasAuthority_ReturnValue_2) == 0x0002BA, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0002BB, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002BC, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002CC, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_MakeLiteralText_ReturnValue_3) == 0x0002E0, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, CallFunc_GetGameInstance_ReturnValue) == 0x0002F8, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP, K2Node_DynamicCast_AsFCTGame_Instance_BP) == 0x000300, "Member 'SCTPlayerController_MatchBP_C_ExecuteUbergraph_SCTPlayerController_MatchBP::K2Node_DynamicCast_AsFCTGame_Instance_BP' has a wrong offset!");
