#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCTPlayerState_MatchBP

#include "Basic.hpp"

#include "E_KeyCardColors_structs.hpp"
#include "SCT_structs.hpp"
#include "Engine_structs.hpp"
#include "S_Score_structs.hpp"
#include "E_ScoreCategories_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_Karma_structs.hpp"


namespace SDK::Params
{

// Function SCTPlayerState_MatchBP.SCTPlayerState_MatchBP_C.OnAgendaDescriptionChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SCTPlayerState_MatchBP_C_OnAgendaDescriptionChanged__DelegateSignature final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTPlayerState_MatchBP_C_OnAgendaDescriptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on SCTPlayerState_MatchBP_C_OnAgendaDescriptionChanged__DelegateSignature");
static_assert(sizeof(SCTPlayerState_MatchBP_C_OnAgendaDescriptionChanged__DelegateSignature) == 0x000010, "Wrong size on SCTPlayerState_MatchBP_C_OnAgendaDescriptionChanged__DelegateSignature");
static_assert(offsetof(SCTPlayerState_MatchBP_C_OnAgendaDescriptionChanged__DelegateSignature, Value) == 0x000000, "Member 'SCTPlayerState_MatchBP_C_OnAgendaDescriptionChanged__DelegateSignature::Value' has a wrong offset!");

// Function SCTPlayerState_MatchBP.SCTPlayerState_MatchBP_C.OnAgendaProgressionChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SCTPlayerState_MatchBP_C_OnAgendaProgressionChanged__DelegateSignature final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTPlayerState_MatchBP_C_OnAgendaProgressionChanged__DelegateSignature) == 0x000008, "Wrong alignment on SCTPlayerState_MatchBP_C_OnAgendaProgressionChanged__DelegateSignature");
static_assert(sizeof(SCTPlayerState_MatchBP_C_OnAgendaProgressionChanged__DelegateSignature) == 0x000010, "Wrong size on SCTPlayerState_MatchBP_C_OnAgendaProgressionChanged__DelegateSignature");
static_assert(offsetof(SCTPlayerState_MatchBP_C_OnAgendaProgressionChanged__DelegateSignature, Value) == 0x000000, "Member 'SCTPlayerState_MatchBP_C_OnAgendaProgressionChanged__DelegateSignature::Value' has a wrong offset!");

// Function SCTPlayerState_MatchBP.SCTPlayerState_MatchBP_C.OnAgendaStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SCTPlayerState_MatchBP_C_OnAgendaStateChanged__DelegateSignature final
{
public:
	EAgendaObjectState                            State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTPlayerState_MatchBP_C_OnAgendaStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on SCTPlayerState_MatchBP_C_OnAgendaStateChanged__DelegateSignature");
static_assert(sizeof(SCTPlayerState_MatchBP_C_OnAgendaStateChanged__DelegateSignature) == 0x000001, "Wrong size on SCTPlayerState_MatchBP_C_OnAgendaStateChanged__DelegateSignature");
static_assert(offsetof(SCTPlayerState_MatchBP_C_OnAgendaStateChanged__DelegateSignature, State) == 0x000000, "Member 'SCTPlayerState_MatchBP_C_OnAgendaStateChanged__DelegateSignature::State' has a wrong offset!");

// Function SCTPlayerState_MatchBP.SCTPlayerState_MatchBP_C.ExecuteUbergraph_SCTPlayerState_MatchBP
// 0x04B0 (0x04B0 - 0x0000)
struct SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_StatCode;                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_IncementBy;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTStatIncrementCallbackProxy*         CallFunc_UpdateStatistic_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTAchievement*                        K2Node_CustomEvent_AchievementInfo_2;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_10;                     // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UFCTAchievement* AchievementInfo, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAchievement*                        Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTStatIncrementCallbackProxy*         CallFunc_UpdateStatistic_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_9;                      // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAchievement*                        K2Node_CustomEvent_AchievementInfo_1;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_8;                      // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UFCTAchievement* AchievementInfo, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_1;                            // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAchievement*                        Temp_object_Variable_1;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTStatIncrementCallbackProxy*         CallFunc_UpdateStatistic_ReturnValue_2;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_Code_5;                         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_7;                      // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_4;                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_6;                      // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_2;                            // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTIncrementUnlinkedStatsCallbackProxy* CallFunc_IncrementUnlinkedStatistic_ReturnValue;   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerInfoGIS*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 CurrentKarma, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_CurrentKarma_3;                 // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_3;                         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_5;                      // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentKarma_2;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_2;                         // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_4;                      // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 CurrentKarma, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_3;                            // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 CurrentKarma, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_CurrentKarma_1;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_3;                      // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentKarma;                   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Code;                           // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_2;                      // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 CurrentKarma, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable_4;                            // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPS5GameStatsGIS*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UFCTAchievement* AchievementInfo, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	class UFCTAchievement*                        K2Node_CustomEvent_AchievementInfo;                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFCTAchievement*                        Temp_object_Variable_2;                            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTAchievement*                        K2Node_CustomEvent_AchievementInfo_3;              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_12;                     // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue_1;        // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UFCTAchievement* AchievementInfo, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0330(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_11;                     // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEndScenario__IgnoreDataTable_; // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_EndScenarioScore;               // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_DataTableRowName;               // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message_13;                     // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_Score                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0398(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA[0x2];                                      // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x03D0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x03E0(0x0010)(ZeroConstructor, NoDestructor)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_Event_NewPlayerState;                       // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState_MatchBP_C*              K2Node_DynamicCast_AsSCTPlayer_State_Match_BP;     // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_Data_Table_Row_Name;            // 0x041C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Karma                               CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0428(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTStatIncrementCallbackProxy*         CallFunc_UpdateStatistic_ReturnValue_3;            // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFCTAccelByteKarmaStat*                 CallFunc_AddToCurrentKarma_ReturnValue;            // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTAccelByteKarmaStat*                 CallFunc_AddToCurrentKarma_ReturnValue_1;          // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTAchievement*                        Temp_object_Variable_3;                            // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Vote;                           // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_6;                            // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP) == 0x000008, "Wrong alignment on SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP");
static_assert(sizeof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP) == 0x0004B0, "Wrong size on SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, EntryPoint) == 0x000000, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_StatCode) == 0x000008, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_StatCode' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_IncementBy) == 0x000018, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_IncementBy' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_UpdateStatistic_ReturnValue) == 0x000020, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_UpdateStatistic_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_AchievementInfo_2) == 0x000030, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_AchievementInfo_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_10) == 0x000038, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_10' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_string_Variable) == 0x000058, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_object_Variable) == 0x000068, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_UpdateStatistic_ReturnValue_1) == 0x000080, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_UpdateStatistic_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x00008C, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_9) == 0x0000A0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_9' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_AchievementInfo_1) == 0x0000B0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_AchievementInfo_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_8) == 0x0000B8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_8' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_string_Variable_1) == 0x0000D8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_object_Variable_1) == 0x0000E8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_UpdateStatistic_ReturnValue_2) == 0x000100, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_UpdateStatistic_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_IsValid_ReturnValue_2) == 0x000108, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_3) == 0x00010C, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Code_5) == 0x00011C, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Code_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_7) == 0x000120, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_7' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Code_4) == 0x000130, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Code_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_6) == 0x000138, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_6' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_4) == 0x000148, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_string_Variable_2) == 0x000158, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_int_Variable) == 0x000168, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_IncrementUnlinkedStatistic_ReturnValue) == 0x000170, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_IncrementUnlinkedStatistic_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000178, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_IsValid_ReturnValue_3) == 0x000180, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_5) == 0x000184, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_CurrentKarma_3) == 0x000194, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_CurrentKarma_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Code_3) == 0x000198, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Code_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_5) == 0x0001A0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_CurrentKarma_2) == 0x0001B0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_CurrentKarma_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Code_2) == 0x0001B4, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Code_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_4) == 0x0001B8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001C8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_string_Variable_3) == 0x0001D8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_int_Variable_1) == 0x0001E8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_int_Variable_2) == 0x0001EC, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001F0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_CurrentKarma_1) == 0x000200, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_CurrentKarma_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Code_1) == 0x000204, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_3) == 0x000208, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_CurrentKarma) == 0x000218, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_CurrentKarma' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Code) == 0x00021C, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_2) == 0x000220, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_8) == 0x000230, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_string_Variable_4) == 0x000240, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_int_Variable_3) == 0x000250, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_int_Variable_4) == 0x000254, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000258, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_1) == 0x000260, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_9) == 0x000270, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_10) == 0x000280, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_AchievementInfo) == 0x000290, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_AchievementInfo' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message) == 0x000298, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_string_Variable_5) == 0x0002A8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_object_Variable_2) == 0x0002B8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_HasAuthority_ReturnValue) == 0x0002C0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_AchievementInfo_3) == 0x0002C8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_AchievementInfo_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_12) == 0x0002D0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_12' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_HasAuthority_ReturnValue_1) == 0x0002E0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002E1, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0002E2, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_GetCurrentLevelName_ReturnValue) == 0x0002E8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0002F8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_Contains_ReturnValue) == 0x000308, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000310, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_GetCurrentLevelName_ReturnValue_1) == 0x000320, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_GetCurrentLevelName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_11) == 0x000330, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000340, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_Contains_ReturnValue_1) == 0x000350, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000358, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_11) == 0x000368, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_11' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_IsEndScenario__IgnoreDataTable_) == 0x000378, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_IsEndScenario__IgnoreDataTable_' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_EndScenarioScore) == 0x00037C, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_EndScenarioScore' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_DataTableRowName) == 0x000380, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_DataTableRowName' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Message_13) == 0x000388, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Message_13' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_GetDataTableRowFromName_OutRow) == 0x000398, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003C8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_HasAuthority_ReturnValue_2) == 0x0003C9, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_Add_IntInt_ReturnValue) == 0x0003CC, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_12) == 0x0003D0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CreateDelegate_OutputDelegate_13) == 0x0003E0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_GetPlayerPawn_ReturnValue) == 0x0003F0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x0003F8, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_DynamicCast_bSuccess) == 0x000400, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_HasAuthority_ReturnValue_3) == 0x000401, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_Event_NewPlayerState) == 0x000408, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_Event_NewPlayerState' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_DynamicCast_AsSCTPlayer_State_Match_BP) == 0x000410, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_DynamicCast_AsSCTPlayer_State_Match_BP' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_DynamicCast_bSuccess_1) == 0x000418, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Data_Table_Row_Name) == 0x00041C, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Data_Table_Row_Name' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000428, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000450, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_UpdateStatistic_ReturnValue_3) == 0x000458, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_UpdateStatistic_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_AddToCurrentKarma_ReturnValue) == 0x000460, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_AddToCurrentKarma_ReturnValue' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_IsValid_ReturnValue_4) == 0x000468, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_IsValid_ReturnValue_5) == 0x000469, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_AddToCurrentKarma_ReturnValue_1) == 0x000470, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_AddToCurrentKarma_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_IsValid_ReturnValue_6) == 0x000478, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_object_Variable_3) == 0x000480, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, K2Node_CustomEvent_Vote) == 0x000488, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::K2Node_CustomEvent_Vote' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, Temp_string_Variable_6) == 0x000490, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::Temp_string_Variable_6' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0004A0, "Member 'SCTPlayerState_MatchBP_C_ExecuteUbergraph_SCTPlayerState_MatchBP::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");

// Function SCTPlayerState_MatchBP.SCTPlayerState_MatchBP_C.UpdateStatisticOnClient
// 0x0018 (0x0018 - 0x0000)
struct SCTPlayerState_MatchBP_C_UpdateStatisticOnClient final
{
public:
	class FString                                 StatCode;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         IncementBy;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTPlayerState_MatchBP_C_UpdateStatisticOnClient) == 0x000008, "Wrong alignment on SCTPlayerState_MatchBP_C_UpdateStatisticOnClient");
static_assert(sizeof(SCTPlayerState_MatchBP_C_UpdateStatisticOnClient) == 0x000018, "Wrong size on SCTPlayerState_MatchBP_C_UpdateStatisticOnClient");
static_assert(offsetof(SCTPlayerState_MatchBP_C_UpdateStatisticOnClient, StatCode) == 0x000000, "Member 'SCTPlayerState_MatchBP_C_UpdateStatisticOnClient::StatCode' has a wrong offset!");
static_assert(offsetof(SCTPlayerState_MatchBP_C_UpdateStatisticOnClient, IncementBy) == 0x000010, "Member 'SCTPlayerState_MatchBP_C_UpdateStatisticOnClient::IncementBy' has a wrong offset!");

// Function SCTPlayerState_MatchBP.SCTPlayerState_MatchBP_C.Add Level Vote
// 0x0004 (0x0004 - 0x0000)
struct SCTPlayerState_MatchBP_C_Add_Level_Vote final
{
public:
	int32                                         Vote;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTPlayerState_MatchBP_C_Add_Level_Vote) == 0x000004, "Wrong alignment on SCTPlayerState_MatchBP_C_Add_Level_Vote");
static_assert(sizeof(SCTPlayerState_MatchBP_C_Add_Level_Vote) == 0x000004, "Wrong size on SCTPlayerState_MatchBP_C_Add_Level_Vote");
static_assert(offsetof(SCTPlayerState_MatchBP_C_Add_Level_Vote, Vote) == 0x000000, "Member 'SCTPlayerState_MatchBP_C_Add_Level_Vote::Vote' has a wrong offset!");

// Function SCTPlayerState_MatchBP.SCTPlayerState_MatchBP_C.Add Karma Poins Player State
// 0x0008 (0x0008 - 0x0000)
struct SCTPlayerState_MatchBP_C_Add_Karma_Poins_Player_State final
{
public:
	class FName                                   Data_Table_Row_Name;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTPlayerState_MatchBP_C_Add_Karma_Poins_Player_State) == 0x000004, "Wrong alignment on SCTPlayerState_MatchBP_C_Add_Karma_Poins_Player_State");
static_assert(sizeof(SCTPlayerState_MatchBP_C_Add_Karma_Poins_Player_State) == 0x000008, "Wrong size on SCTPlayerState_MatchBP_C_Add_Karma_Poins_Player_State");
static_assert(offsetof(SCTPlayerState_MatchBP_C_Add_Karma_Poins_Player_State, Data_Table_Row_Name) == 0x000000, "Member 'SCTPlayerState_MatchBP_C_Add_Karma_Poins_Player_State::Data_Table_Row_Name' has a wrong offset!");

// Function SCTPlayerState_MatchBP.SCTPlayerState_MatchBP_C.ReceiveCopyProperties
// 0x0008 (0x0008 - 0x0000)
struct SCTPlayerState_MatchBP_C_ReceiveCopyProperties final
{
public:
	class APlayerState*                           NewPlayerState;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SCTPlayerState_MatchBP_C_ReceiveCopyProperties) == 0x000008, "Wrong alignment on SCTPlayerState_MatchBP_C_ReceiveCopyProperties");
static_assert(sizeof(SCTPlayerState_MatchBP_C_ReceiveCopyProperties) == 0x000008, "Wrong size on SCTPlayerState_MatchBP_C_ReceiveCopyProperties");
