#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeizureWarningWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SeizureWarningWI.SeizureWarningWI_C
// 0x0018 (0x0278 - 0x0260)
class USeizureWarningWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                 Image_256;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserWidget*                            ParentUserWidget;                                  // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SeizureWarningWI(int32 EntryPoint);
	void Start_Listening_For_Input_And_TImer();
	void Close();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SeizureWarningWI_C">();
	}
	static class USeizureWarningWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeizureWarningWI_C>();
	}
};
static_assert(alignof(USeizureWarningWI_C) == 0x000008, "Wrong alignment on USeizureWarningWI_C");
static_assert(sizeof(USeizureWarningWI_C) == 0x000278, "Wrong size on USeizureWarningWI_C");
static_assert(offsetof(USeizureWarningWI_C, UberGraphFrame) == 0x000260, "Member 'USeizureWarningWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USeizureWarningWI_C, Image_256) == 0x000268, "Member 'USeizureWarningWI_C::Image_256' has a wrong offset!");
static_assert(offsetof(USeizureWarningWI_C, ParentUserWidget) == 0x000270, "Member 'USeizureWarningWI_C::ParentUserWidget' has a wrong offset!");

}

