#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeizureWarningWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function SeizureWarningWI.SeizureWarningWI_C.ExecuteUbergraph_SeizureWarningWI
// 0x0030 (0x0030 - 0x0000)
struct SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AClientEntryPCBP_C*                     K2Node_DynamicCast_AsClient_Entry_PCBP;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI) == 0x000008, "Wrong alignment on SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI");
static_assert(sizeof(SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI) == 0x000030, "Wrong size on SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI");
static_assert(offsetof(SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI, EntryPoint) == 0x000000, "Member 'SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI, K2Node_DynamicCast_AsClient_Entry_PCBP) == 0x000020, "Member 'SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI::K2Node_DynamicCast_AsClient_Entry_PCBP' has a wrong offset!");
static_assert(offsetof(SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SeizureWarningWI_C_ExecuteUbergraph_SeizureWarningWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

