#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsKeybindingWI_Toggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsKeybindingWI_Toggle.SettingsKeybindingWI_Toggle_C
// 0x0078 (0x02D8 - 0x0260)
class USettingsKeybindingWI_Toggle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCM_CheckboxWI_C*                       CheckBox;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DisplayName;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 InputClass;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SettingsName;                                      // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputInformationToggle                Info;                                              // 0x0288(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UInputSettingsToggleSubComponent*       Settings;                                          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnChanged;                                         // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnChanged__DelegateSignature();
	void ExecuteUbergraph_SettingsKeybindingWI_Toggle(int32 EntryPoint);
	void BndEvt__SettingsKeybindingWI_Toggle_Checkbox_K2Node_ComponentBoundEvent_1_StateChanged__DelegateSignature(bool IsChecked);
	void Construct();
	void SetDisplayName(const class FText& DisplayName_0);
	void SetToggleData(bool Is_Checked);
	void Initialize(const struct FInputInformationToggle& Info_0, class FName SettingsName_0, class UInputSettingsToggleSubComponent* Setting);
	void UpdateUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsKeybindingWI_Toggle_C">();
	}
	static class USettingsKeybindingWI_Toggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsKeybindingWI_Toggle_C>();
	}
};
static_assert(alignof(USettingsKeybindingWI_Toggle_C) == 0x000008, "Wrong alignment on USettingsKeybindingWI_Toggle_C");
static_assert(sizeof(USettingsKeybindingWI_Toggle_C) == 0x0002D8, "Wrong size on USettingsKeybindingWI_Toggle_C");
static_assert(offsetof(USettingsKeybindingWI_Toggle_C, UberGraphFrame) == 0x000260, "Member 'USettingsKeybindingWI_Toggle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsKeybindingWI_Toggle_C, CheckBox) == 0x000268, "Member 'USettingsKeybindingWI_Toggle_C::CheckBox' has a wrong offset!");
static_assert(offsetof(USettingsKeybindingWI_Toggle_C, DisplayName) == 0x000270, "Member 'USettingsKeybindingWI_Toggle_C::DisplayName' has a wrong offset!");
static_assert(offsetof(USettingsKeybindingWI_Toggle_C, InputClass) == 0x000278, "Member 'USettingsKeybindingWI_Toggle_C::InputClass' has a wrong offset!");
static_assert(offsetof(USettingsKeybindingWI_Toggle_C, SettingsName) == 0x000280, "Member 'USettingsKeybindingWI_Toggle_C::SettingsName' has a wrong offset!");
static_assert(offsetof(USettingsKeybindingWI_Toggle_C, Info) == 0x000288, "Member 'USettingsKeybindingWI_Toggle_C::Info' has a wrong offset!");
static_assert(offsetof(USettingsKeybindingWI_Toggle_C, Settings) == 0x0002C0, "Member 'USettingsKeybindingWI_Toggle_C::Settings' has a wrong offset!");
static_assert(offsetof(USettingsKeybindingWI_Toggle_C, OnChanged) == 0x0002C8, "Member 'USettingsKeybindingWI_Toggle_C::OnChanged' has a wrong offset!");

}

