#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsKeybindingWI_Axis

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function SettingsKeybindingWI_Axis.SettingsKeybindingWI_Axis_C.ExecuteUbergraph_SettingsKeybindingWI_Axis
// 0x0008 (0x0008 - 0x0000)
struct SettingsKeybindingWI_Axis_C_ExecuteUbergraph_SettingsKeybindingWI_Axis final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsKeybindingWI_Axis_C_ExecuteUbergraph_SettingsKeybindingWI_Axis) == 0x000004, "Wrong alignment on SettingsKeybindingWI_Axis_C_ExecuteUbergraph_SettingsKeybindingWI_Axis");
static_assert(sizeof(SettingsKeybindingWI_Axis_C_ExecuteUbergraph_SettingsKeybindingWI_Axis) == 0x000008, "Wrong size on SettingsKeybindingWI_Axis_C_ExecuteUbergraph_SettingsKeybindingWI_Axis");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_ExecuteUbergraph_SettingsKeybindingWI_Axis, EntryPoint) == 0x000000, "Member 'SettingsKeybindingWI_Axis_C_ExecuteUbergraph_SettingsKeybindingWI_Axis::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_ExecuteUbergraph_SettingsKeybindingWI_Axis, K2Node_Event_IsDesignTime) == 0x000004, "Member 'SettingsKeybindingWI_Axis_C_ExecuteUbergraph_SettingsKeybindingWI_Axis::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function SettingsKeybindingWI_Axis.SettingsKeybindingWI_Axis_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SettingsKeybindingWI_Axis_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsKeybindingWI_Axis_C_PreConstruct) == 0x000001, "Wrong alignment on SettingsKeybindingWI_Axis_C_PreConstruct");
static_assert(sizeof(SettingsKeybindingWI_Axis_C_PreConstruct) == 0x000001, "Wrong size on SettingsKeybindingWI_Axis_C_PreConstruct");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SettingsKeybindingWI_Axis_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SettingsKeybindingWI_Axis.SettingsKeybindingWI_Axis_C.SetKeyboardData
// 0x0028 (0x0028 - 0x0000)
struct SettingsKeybindingWI_Axis_C_SetKeyboardData final
{
public:
	struct FInputAxisKeyMapping                   CallFunc_GetKeyboardAxis_ReturnValue;              // 0x0000(0x0028)()
};
static_assert(alignof(SettingsKeybindingWI_Axis_C_SetKeyboardData) == 0x000008, "Wrong alignment on SettingsKeybindingWI_Axis_C_SetKeyboardData");
static_assert(sizeof(SettingsKeybindingWI_Axis_C_SetKeyboardData) == 0x000028, "Wrong size on SettingsKeybindingWI_Axis_C_SetKeyboardData");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_SetKeyboardData, CallFunc_GetKeyboardAxis_ReturnValue) == 0x000000, "Member 'SettingsKeybindingWI_Axis_C_SetKeyboardData::CallFunc_GetKeyboardAxis_ReturnValue' has a wrong offset!");

// Function SettingsKeybindingWI_Axis.SettingsKeybindingWI_Axis_C.OnSetKeyboardKey
// 0x0020 (0x0020 - 0x0000)
struct SettingsKeybindingWI_Axis_C_OnSetKeyboardKey final
{
public:
	struct FInputChord                            Chord;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SettingsKeybindingWI_Axis_C_OnSetKeyboardKey) == 0x000008, "Wrong alignment on SettingsKeybindingWI_Axis_C_OnSetKeyboardKey");
static_assert(sizeof(SettingsKeybindingWI_Axis_C_OnSetKeyboardKey) == 0x000020, "Wrong size on SettingsKeybindingWI_Axis_C_OnSetKeyboardKey");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_OnSetKeyboardKey, Chord) == 0x000000, "Member 'SettingsKeybindingWI_Axis_C_OnSetKeyboardKey::Chord' has a wrong offset!");

// Function SettingsKeybindingWI_Axis.SettingsKeybindingWI_Axis_C.Initialize
// 0x0060 (0x0060 - 0x0000)
struct SettingsKeybindingWI_Axis_C_Initialize final
{
public:
	struct FInputInformationAxis                  Info_0;                                            // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UInputSettingsAxesSubComponent*         Setting;                                           // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SettingsName_0;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsKeybindingWI_Axis_C_Initialize) == 0x000008, "Wrong alignment on SettingsKeybindingWI_Axis_C_Initialize");
static_assert(sizeof(SettingsKeybindingWI_Axis_C_Initialize) == 0x000060, "Wrong size on SettingsKeybindingWI_Axis_C_Initialize");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_Initialize, Info_0) == 0x000000, "Member 'SettingsKeybindingWI_Axis_C_Initialize::Info_0' has a wrong offset!");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_Initialize, Setting) == 0x000050, "Member 'SettingsKeybindingWI_Axis_C_Initialize::Setting' has a wrong offset!");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_Initialize, SettingsName_0) == 0x000058, "Member 'SettingsKeybindingWI_Axis_C_Initialize::SettingsName_0' has a wrong offset!");

// Function SettingsKeybindingWI_Axis.SettingsKeybindingWI_Axis_C.ResetKeyboard
// 0x0028 (0x0028 - 0x0000)
struct SettingsKeybindingWI_Axis_C_ResetKeyboard final
{
public:
	struct FInputAxisKeyMapping                   CallFunc_GetKeyboardAxis_ReturnValue;              // 0x0000(0x0028)()
};
static_assert(alignof(SettingsKeybindingWI_Axis_C_ResetKeyboard) == 0x000008, "Wrong alignment on SettingsKeybindingWI_Axis_C_ResetKeyboard");
static_assert(sizeof(SettingsKeybindingWI_Axis_C_ResetKeyboard) == 0x000028, "Wrong size on SettingsKeybindingWI_Axis_C_ResetKeyboard");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_ResetKeyboard, CallFunc_GetKeyboardAxis_ReturnValue) == 0x000000, "Member 'SettingsKeybindingWI_Axis_C_ResetKeyboard::CallFunc_GetKeyboardAxis_ReturnValue' has a wrong offset!");

// Function SettingsKeybindingWI_Axis.SettingsKeybindingWI_Axis_C.CanBind
// 0x0028 (0x0028 - 0x0000)
struct SettingsKeybindingWI_Axis_C_CanBind final
{
public:
	struct FInputChord                            Chord;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsKeybindingWI_Axis_C_CanBind) == 0x000008, "Wrong alignment on SettingsKeybindingWI_Axis_C_CanBind");
static_assert(sizeof(SettingsKeybindingWI_Axis_C_CanBind) == 0x000028, "Wrong size on SettingsKeybindingWI_Axis_C_CanBind");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_CanBind, Chord) == 0x000000, "Member 'SettingsKeybindingWI_Axis_C_CanBind::Chord' has a wrong offset!");
static_assert(offsetof(SettingsKeybindingWI_Axis_C_CanBind, Value) == 0x000020, "Member 'SettingsKeybindingWI_Axis_C_CanBind::Value' has a wrong offset!");

}

