#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillEntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SkillEntryWI.SkillEntryWI_C
// 0x00A8 (0x0308 - 0x0260)
class USkillEntryWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       Ready;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonImage;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControllerIconHelperWI_C*              ControllerIconHelperWI;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              GamepadIcon;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SkillIcon;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemNumber;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Cooldown;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ItemIndex;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPower*                                 Power;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         MinCooldownDuration;                               // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Keybinding;                                        // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FLinearColor                           BackgroundColorGreyed;                             // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColorNotGreyed;                          // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SkillEntryWI(int32 EntryPoint);
	void BndEvt__SkillEntryWI_ControllerIconHelperWI_K2Node_ComponentBoundEvent_3_OnShowControllerKeyText__DelegateSignature(const class FText& Text);
	void BndEvt__SkillEntryWI_ControllerIconHelperWI_K2Node_ComponentBoundEvent_2_OnShowControllerKeyIcon__DelegateSignature(class UTexture2D* Icon_0);
	void BndEvt__SkillEntryWI_ControllerIconHelperWI_K2Node_ComponentBoundEvent_1_OnShowControllerKeyIcon__DelegateSignature(class UTexture2D* Icon_0);
	void BndEvt__SkillEntryWI_ControllerIconHelperWI_K2Node_ComponentBoundEvent_0_OnResetControllerKey__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void UpdateCooldown();
	void GreyOut(bool GreyOut_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkillEntryWI_C">();
	}
	static class USkillEntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillEntryWI_C>();
	}
};
static_assert(alignof(USkillEntryWI_C) == 0x000008, "Wrong alignment on USkillEntryWI_C");
static_assert(sizeof(USkillEntryWI_C) == 0x000308, "Wrong size on USkillEntryWI_C");
static_assert(offsetof(USkillEntryWI_C, UberGraphFrame) == 0x000260, "Member 'USkillEntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, Ready) == 0x000268, "Member 'USkillEntryWI_C::Ready' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, BG) == 0x000270, "Member 'USkillEntryWI_C::BG' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, ButtonImage) == 0x000278, "Member 'USkillEntryWI_C::ButtonImage' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, ControllerIconHelperWI) == 0x000280, "Member 'USkillEntryWI_C::ControllerIconHelperWI' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, Frame) == 0x000288, "Member 'USkillEntryWI_C::Frame' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, GamepadIcon) == 0x000290, "Member 'USkillEntryWI_C::GamepadIcon' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, Img_SkillIcon) == 0x000298, "Member 'USkillEntryWI_C::Img_SkillIcon' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, ItemNumber) == 0x0002A0, "Member 'USkillEntryWI_C::ItemNumber' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, ProgressBar_Cooldown) == 0x0002A8, "Member 'USkillEntryWI_C::ProgressBar_Cooldown' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, Icon) == 0x0002B0, "Member 'USkillEntryWI_C::Icon' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, ItemIndex) == 0x0002B8, "Member 'USkillEntryWI_C::ItemIndex' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, Power) == 0x0002C0, "Member 'USkillEntryWI_C::Power' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, MinCooldownDuration) == 0x0002C8, "Member 'USkillEntryWI_C::MinCooldownDuration' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, Keybinding) == 0x0002D0, "Member 'USkillEntryWI_C::Keybinding' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, BackgroundColorGreyed) == 0x0002E8, "Member 'USkillEntryWI_C::BackgroundColorGreyed' has a wrong offset!");
static_assert(offsetof(USkillEntryWI_C, BackgroundColorNotGreyed) == 0x0002F8, "Member 'USkillEntryWI_C::BackgroundColorNotGreyed' has a wrong offset!");

}

