#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SprintBoostGA

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function SprintBoostGA.SprintBoostGA_C.ExecuteUbergraph_SprintBoostGA
// 0x00A0 (0x00A0 - 0x0000)
struct SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AEquipablePower_SprintBoost_C*          K2Node_DynamicCast_AsEquipable_Power_Sprint_Boost; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNetAuthority_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x006C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0074(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0088(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA) == 0x000008, "Wrong alignment on SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA");
static_assert(sizeof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA) == 0x0000A0, "Wrong size on SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, EntryPoint) == 0x000000, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, CallFunc_WaitDelay_ReturnValue) == 0x000040, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, CallFunc_K2_CommitAbility_ReturnValue) == 0x000049, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, CallFunc_IsDedicatedServer_ReturnValue) == 0x00004A, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, K2Node_DynamicCast_AsEquipable_Power_Sprint_Boost) == 0x000050, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::K2Node_DynamicCast_AsEquipable_Power_Sprint_Boost' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, CallFunc_IsNetAuthority_ReturnValue) == 0x000068, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::CallFunc_IsNetAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00006C, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, Temp_delegate_Variable) == 0x000074, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, Temp_struct_Variable) == 0x000088, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA, CallFunc_PostAkEvent_ReturnValue) == 0x000098, "Member 'SprintBoostGA_C_ExecuteUbergraph_SprintBoostGA::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

