#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartCountdownWI

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function StartCountdownWI.StartCountdownWI_C.ExecuteUbergraph_StartCountdownWI
// 0x0098 (0x0098 - 0x0000)
struct StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeToNextSecond_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory_1; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSecondsLeft_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetSecondsLeft_ReturnValue_1;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSecondsLeft_ReturnValue_2;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI) == 0x000008, "Wrong alignment on StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI");
static_assert(sizeof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI) == 0x000098, "Wrong size on StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, EntryPoint) == 0x000000, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_GetTimeToNextSecond_ReturnValue) == 0x000004, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_GetTimeToNextSecond_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_FMax_ReturnValue) == 0x000008, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000018, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000020, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1) == 0x000028, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_GetSCT_Player_Character_AsCharacter_SCT_1' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_GetSCT_Player_Character_CharacterInventory_1) == 0x000030, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_GetSCT_Player_Character_CharacterInventory_1' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_GetSecondsLeft_ReturnValue) == 0x00003C, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_GetSecondsLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_GetSecondsLeft_ReturnValue_1) == 0x000078, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_GetSecondsLeft_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_BooleanAND_ReturnValue) == 0x000089, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_GetSecondsLeft_ReturnValue_2) == 0x00008C, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_GetSecondsLeft_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000090, "Member 'StartCountdownWI_C_ExecuteUbergraph_StartCountdownWI::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function StartCountdownWI.StartCountdownWI_C.GetTimeToNextSecond
// 0x0020 (0x0020 - 0x0000)
struct StartCountdownWI_C_GetTimeToNextSecond final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StartCountdownWI_C_GetTimeToNextSecond) == 0x000008, "Wrong alignment on StartCountdownWI_C_GetTimeToNextSecond");
static_assert(sizeof(StartCountdownWI_C_GetTimeToNextSecond) == 0x000020, "Wrong size on StartCountdownWI_C_GetTimeToNextSecond");
static_assert(offsetof(StartCountdownWI_C_GetTimeToNextSecond, ReturnValue) == 0x000000, "Member 'StartCountdownWI_C_GetTimeToNextSecond::ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_GetTimeToNextSecond, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'StartCountdownWI_C_GetTimeToNextSecond::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_GetTimeToNextSecond, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000010, "Member 'StartCountdownWI_C_GetTimeToNextSecond::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_GetTimeToNextSecond, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'StartCountdownWI_C_GetTimeToNextSecond::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_GetTimeToNextSecond, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000018, "Member 'StartCountdownWI_C_GetTimeToNextSecond::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");

// Function StartCountdownWI.StartCountdownWI_C.GetSecondsLeft
// 0x0020 (0x0020 - 0x0000)
struct StartCountdownWI_C_GetSecondsLeft final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StartCountdownWI_C_GetSecondsLeft) == 0x000008, "Wrong alignment on StartCountdownWI_C_GetSecondsLeft");
static_assert(sizeof(StartCountdownWI_C_GetSecondsLeft) == 0x000020, "Wrong size on StartCountdownWI_C_GetSecondsLeft");
static_assert(offsetof(StartCountdownWI_C_GetSecondsLeft, ReturnValue) == 0x000000, "Member 'StartCountdownWI_C_GetSecondsLeft::ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_GetSecondsLeft, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'StartCountdownWI_C_GetSecondsLeft::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_GetSecondsLeft, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000010, "Member 'StartCountdownWI_C_GetSecondsLeft::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_GetSecondsLeft, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'StartCountdownWI_C_GetSecondsLeft::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_GetSecondsLeft, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'StartCountdownWI_C_GetSecondsLeft::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartCountdownWI_C_GetSecondsLeft, CallFunc_Max_ReturnValue) == 0x00001C, "Member 'StartCountdownWI_C_GetSecondsLeft::CallFunc_Max_ReturnValue' has a wrong offset!");

}

