#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_AAS_Parameters

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_AAS_Parameters.Struct_AAS_Parameters
// 0x0034 (0x0034 - 0x0000)
struct FStruct_AAS_Parameters final
{
public:
	struct FVector                                MinRotation_16_E637F18641B64F5866ECF69D62AEBBEF;   // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MaxRotation_17_9EE600D44F0749BA14A599835B6F1B42;   // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseUniformScaling_15_7915EF534D2A8CD316344BB7EFABB826; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MinScale_18_838F9E4B4432FF94B8017ABACF977BD9;      // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MaxScale_19_E826F68A43879E9A87E3488B4FC2D080;      // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_AAS_Parameters) == 0x000004, "Wrong alignment on FStruct_AAS_Parameters");
static_assert(sizeof(FStruct_AAS_Parameters) == 0x000034, "Wrong size on FStruct_AAS_Parameters");
static_assert(offsetof(FStruct_AAS_Parameters, MinRotation_16_E637F18641B64F5866ECF69D62AEBBEF) == 0x000000, "Member 'FStruct_AAS_Parameters::MinRotation_16_E637F18641B64F5866ECF69D62AEBBEF' has a wrong offset!");
static_assert(offsetof(FStruct_AAS_Parameters, MaxRotation_17_9EE600D44F0749BA14A599835B6F1B42) == 0x00000C, "Member 'FStruct_AAS_Parameters::MaxRotation_17_9EE600D44F0749BA14A599835B6F1B42' has a wrong offset!");
static_assert(offsetof(FStruct_AAS_Parameters, UseUniformScaling_15_7915EF534D2A8CD316344BB7EFABB826) == 0x000018, "Member 'FStruct_AAS_Parameters::UseUniformScaling_15_7915EF534D2A8CD316344BB7EFABB826' has a wrong offset!");
static_assert(offsetof(FStruct_AAS_Parameters, MinScale_18_838F9E4B4432FF94B8017ABACF977BD9) == 0x00001C, "Member 'FStruct_AAS_Parameters::MinScale_18_838F9E4B4432FF94B8017ABACF977BD9' has a wrong offset!");
static_assert(offsetof(FStruct_AAS_Parameters, MaxScale_19_E826F68A43879E9A87E3488B4FC2D080) == 0x000028, "Member 'FStruct_AAS_Parameters::MaxScale_19_E826F68A43879E9A87E3488B4FC2D080' has a wrong offset!");

}

