#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeleporterDisplayWI

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TeleporterDisplayWI.TeleporterDisplayWI_C.FadeDisplay
// 0x0010 (0x0010 - 0x0000)
struct TeleporterDisplayWI_C_FadeDisplay final
{
public:
	bool                                          In;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeleporterDisplayWI_C_FadeDisplay) == 0x000008, "Wrong alignment on TeleporterDisplayWI_C_FadeDisplay");
static_assert(sizeof(TeleporterDisplayWI_C_FadeDisplay) == 0x000010, "Wrong size on TeleporterDisplayWI_C_FadeDisplay");
static_assert(offsetof(TeleporterDisplayWI_C_FadeDisplay, In) == 0x000000, "Member 'TeleporterDisplayWI_C_FadeDisplay::In' has a wrong offset!");
static_assert(offsetof(TeleporterDisplayWI_C_FadeDisplay, Temp_bool_Variable) == 0x000001, "Member 'TeleporterDisplayWI_C_FadeDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TeleporterDisplayWI_C_FadeDisplay, Temp_byte_Variable) == 0x000002, "Member 'TeleporterDisplayWI_C_FadeDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TeleporterDisplayWI_C_FadeDisplay, Temp_byte_Variable_1) == 0x000003, "Member 'TeleporterDisplayWI_C_FadeDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TeleporterDisplayWI_C_FadeDisplay, K2Node_Select_Default) == 0x000004, "Member 'TeleporterDisplayWI_C_FadeDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TeleporterDisplayWI_C_FadeDisplay, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'TeleporterDisplayWI_C_FadeDisplay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

