#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextChatActorObject

#include "Basic.hpp"


namespace SDK::Params
{

// Function TextChatActorObject.TextChatActorObject_C.ExecuteUbergraph_TextChatActorObject
// 0x0020 (0x0020 - 0x0000)
struct TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject) == 0x000008, "Wrong alignment on TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject");
static_assert(sizeof(TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject) == 0x000020, "Wrong size on TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject");
static_assert(offsetof(TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject, EntryPoint) == 0x000000, "Member 'TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject, CallFunc_GetPlayerControllerFromID_ReturnValue) == 0x000008, "Member 'TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject::CallFunc_GetPlayerControllerFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject, CallFunc_GetObjectName_ReturnValue) == 0x000010, "Member 'TextChatActorObject_C_ExecuteUbergraph_TextChatActorObject::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");

}

