#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextChatActorObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TextChatActorObject.TextChatActorObject_C
// 0x0018 (0x0238 - 0x0220)
class ATextChatActorObject_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UTextChatComponent_C*                   TextChatComponent;                                 // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TextChatActorObject(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TextChatActorObject_C">();
	}
	static class ATextChatActorObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATextChatActorObject_C>();
	}
};
static_assert(alignof(ATextChatActorObject_C) == 0x000008, "Wrong alignment on ATextChatActorObject_C");
static_assert(sizeof(ATextChatActorObject_C) == 0x000238, "Wrong size on ATextChatActorObject_C");
static_assert(offsetof(ATextChatActorObject_C, UberGraphFrame) == 0x000220, "Member 'ATextChatActorObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATextChatActorObject_C, TextChatComponent) == 0x000228, "Member 'ATextChatActorObject_C::TextChatComponent' has a wrong offset!");
static_assert(offsetof(ATextChatActorObject_C, DefaultSceneRoot) == 0x000230, "Member 'ATextChatActorObject_C::DefaultSceneRoot' has a wrong offset!");

}

