#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThumbsVotingMenuEntrySCT

#include "Basic.hpp"

#include "SCT_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.ExecuteUbergraph_ThumbsVotingMenuEntrySCT
// 0x0140 (0x0140 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FFCTPlatformPlayerInfo& PlatformInfo, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTPlatformPlayerInfo                 K2Node_CustomEvent_PlatformInfo_1;                 // 0x0028(0x0020)()
	int32                                         K2Node_CustomEvent_Code_1;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFCTPlatformPlayerInfo                 K2Node_CustomEvent_PlatformInfo;                   // 0x0060(0x0020)()
	int32                                         K2Node_CustomEvent_Code;                           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFCTPlatformPlayerInfo& PlatformInfo, int32 Code, const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCTPlatformPlayerInfo                 Temp_struct_Variable;                              // 0x00C0(0x0020)()
	bool                                          CallFunc_Has_Downvoted_ReturnValue;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Has_Upvoted_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance_1;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWinGDKPlatform_ReturnValue;             // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFCTGetUserPlatformInfoCallbackProxy*   CallFunc_GetUserPlatformInfo_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxLivePlayer_XboxLivePlayer;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT) == 0x000140, "Wrong size on ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, EntryPoint) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::EntryPoint' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_CustomEvent_PlatformInfo_1) == 0x000028, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_CustomEvent_PlatformInfo_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_CustomEvent_Code_1) == 0x000048, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_CustomEvent_Code_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_CustomEvent_Message_1) == 0x000050, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_CustomEvent_PlatformInfo) == 0x000060, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_CustomEvent_PlatformInfo' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_CustomEvent_Code) == 0x000080, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_CustomEvent_Message) == 0x000088, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, Temp_string_Variable) == 0x0000A8, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, Temp_int_Variable) == 0x0000B8, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, Temp_struct_Variable) == 0x0000C0, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, CallFunc_Has_Downvoted_ReturnValue) == 0x0000E0, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::CallFunc_Has_Downvoted_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, CallFunc_Has_Upvoted_ReturnValue) == 0x0000E1, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::CallFunc_Has_Upvoted_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_Event_IsDesignTime) == 0x0000E2, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, CallFunc_GetGameInstance_ReturnValue) == 0x0000E8, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_DynamicCast_AsSCTGame_Instance) == 0x0000F0, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_DynamicCast_AsSCTGame_Instance' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, CallFunc_GetGameInstance_ReturnValue_1) == 0x000100, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_DynamicCast_AsSCTGame_Instance_1) == 0x000108, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_DynamicCast_AsSCTGame_Instance_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, CallFunc_GetOwner_ReturnValue) == 0x000118, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_DynamicCast_AsSCTPlayer_State) == 0x000120, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_DynamicCast_AsSCTPlayer_State' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, CallFunc_IsWinGDKPlatform_ReturnValue) == 0x000129, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::CallFunc_IsWinGDKPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, CallFunc_GetUserPlatformInfo_ReturnValue) == 0x000130, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::CallFunc_GetUserPlatformInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT, CallFunc_IsXboxLivePlayer_XboxLivePlayer) == 0x000139, "Member 'ThumbsVotingMenuEntrySCT_C_ExecuteUbergraph_ThumbsVotingMenuEntrySCT::CallFunc_IsXboxLivePlayer_XboxLivePlayer' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_PreConstruct) == 0x000001, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_PreConstruct");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_PreConstruct) == 0x000001, "Wrong size on ThumbsVotingMenuEntrySCT_C_PreConstruct");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.OnSuccess_E48E40FF4AF09999D9A89CA694D4440B
// 0x0038 (0x0038 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B final
{
public:
	struct FFCTPlatformPlayerInfo                 PlatformInfo;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Code;                                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B) == 0x000038, "Wrong size on ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B, PlatformInfo) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B::PlatformInfo' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B, Code) == 0x000020, "Member 'ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B::Code' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B, Message) == 0x000028, "Member 'ThumbsVotingMenuEntrySCT_C_OnSuccess_E48E40FF4AF09999D9A89CA694D4440B::Message' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.OnError_E48E40FF4AF09999D9A89CA694D4440B
// 0x0038 (0x0038 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B final
{
public:
	struct FFCTPlatformPlayerInfo                 PlatformInfo;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Code;                                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B) == 0x000038, "Wrong size on ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B, PlatformInfo) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B::PlatformInfo' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B, Code) == 0x000020, "Member 'ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B::Code' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B, Message) == 0x000028, "Member 'ThumbsVotingMenuEntrySCT_C_OnError_E48E40FF4AF09999D9A89CA694D4440B::Message' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.Init
// 0x0010 (0x0010 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_Init final
{
public:
	class UThumbsVoteInfoComponent*               ThumbsInfoSource_0;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UThumbsVoteInfoComponent*               ThumbsInfoTarget_0;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_Init) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_Init");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_Init) == 0x000010, "Wrong size on ThumbsVotingMenuEntrySCT_C_Init");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Init, ThumbsInfoSource_0) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_Init::ThumbsInfoSource_0' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Init, ThumbsInfoTarget_0) == 0x000008, "Member 'ThumbsVotingMenuEntrySCT_C_Init::ThumbsInfoTarget_0' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.UpVote
// 0x0018 (0x0018 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_UpVote final
{
public:
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOwnerPlayerID_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_UpVote) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_UpVote");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_UpVote) == 0x000018, "Wrong size on ThumbsVotingMenuEntrySCT_C_UpVote");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_UpVote, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_UpVote::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_UpVote, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000008, "Member 'ThumbsVotingMenuEntrySCT_C_UpVote::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_UpVote, CallFunc_GetOwnerPlayerID_ReturnValue) == 0x000010, "Member 'ThumbsVotingMenuEntrySCT_C_UpVote::CallFunc_GetOwnerPlayerID_ReturnValue' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.DownVote
// 0x0018 (0x0018 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_DownVote final
{
public:
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOwnerPlayerID_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_DownVote) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_DownVote");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_DownVote) == 0x000018, "Wrong size on ThumbsVotingMenuEntrySCT_C_DownVote");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_DownVote, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_DownVote::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_DownVote, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000008, "Member 'ThumbsVotingMenuEntrySCT_C_DownVote::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_DownVote, CallFunc_GetOwnerPlayerID_ReturnValue) == 0x000010, "Member 'ThumbsVotingMenuEntrySCT_C_DownVote::CallFunc_GetOwnerPlayerID_ReturnValue' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.Set Upvote Color
// 0x0010 (0x0010 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_Set_Upvote_Color final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_Set_Upvote_Color) == 0x000004, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_Set_Upvote_Color");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_Set_Upvote_Color) == 0x000010, "Wrong size on ThumbsVotingMenuEntrySCT_C_Set_Upvote_Color");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Upvote_Color, Color) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Upvote_Color::Color' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.Set Downvote Color
// 0x0010 (0x0010 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_Set_Downvote_Color final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_Set_Downvote_Color) == 0x000004, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_Set_Downvote_Color");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_Set_Downvote_Color) == 0x000010, "Wrong size on ThumbsVotingMenuEntrySCT_C_Set_Downvote_Color");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Downvote_Color, Color) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Downvote_Color::Color' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.Set Upvote Based On Data
// 0x0001 (0x0001 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_Set_Upvote_Based_On_Data final
{
public:
	bool                                          CallFunc_Has_Upvoted_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_Set_Upvote_Based_On_Data) == 0x000001, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_Set_Upvote_Based_On_Data");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_Set_Upvote_Based_On_Data) == 0x000001, "Wrong size on ThumbsVotingMenuEntrySCT_C_Set_Upvote_Based_On_Data");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Upvote_Based_On_Data, CallFunc_Has_Upvoted_ReturnValue) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Upvote_Based_On_Data::CallFunc_Has_Upvoted_ReturnValue' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.Set Downvote Based On Data
// 0x0001 (0x0001 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_Set_Downvote_Based_On_Data final
{
public:
	bool                                          CallFunc_Has_Downvoted_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_Set_Downvote_Based_On_Data) == 0x000001, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_Set_Downvote_Based_On_Data");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_Set_Downvote_Based_On_Data) == 0x000001, "Wrong size on ThumbsVotingMenuEntrySCT_C_Set_Downvote_Based_On_Data");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Downvote_Based_On_Data, CallFunc_Has_Downvoted_ReturnValue) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Downvote_Based_On_Data::CallFunc_Has_Downvoted_ReturnValue' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.Remove Vote
// 0x0018 (0x0018 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_Remove_Vote final
{
public:
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOwnerPlayerID_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_Remove_Vote) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_Remove_Vote");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_Remove_Vote) == 0x000018, "Wrong size on ThumbsVotingMenuEntrySCT_C_Remove_Vote");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Remove_Vote, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_Remove_Vote::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Remove_Vote, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000008, "Member 'ThumbsVotingMenuEntrySCT_C_Remove_Vote::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Remove_Vote, CallFunc_GetOwnerPlayerID_ReturnValue) == 0x000010, "Member 'ThumbsVotingMenuEntrySCT_C_Remove_Vote::CallFunc_GetOwnerPlayerID_ReturnValue' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.Set Player Name
// 0x0040 (0x0040 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_Set_Player_Name final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           K2Node_DynamicCast_AsPlayer_State;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_Set_Player_Name) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_Set_Player_Name");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_Set_Player_Name) == 0x000040, "Wrong size on ThumbsVotingMenuEntrySCT_C_Set_Player_Name");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Player_Name, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Player_Name::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Player_Name, K2Node_DynamicCast_AsPlayer_State) == 0x000008, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Player_Name::K2Node_DynamicCast_AsPlayer_State' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Player_Name, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Player_Name::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Player_Name, CallFunc_GetPlayerName_ReturnValue) == 0x000018, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Player_Name::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Player_Name, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Player_Name::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.Set Trust Text
// 0x0018 (0x0018 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_Set_Trust_Text final
{
public:
	class FText                                   CallFunc_GetTrustStatus_TrustTextPositiveVote;     // 0x0000(0x0018)()
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_Set_Trust_Text) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_Set_Trust_Text");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_Set_Trust_Text) == 0x000018, "Wrong size on ThumbsVotingMenuEntrySCT_C_Set_Trust_Text");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Trust_Text, CallFunc_GetTrustStatus_TrustTextPositiveVote) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Trust_Text::CallFunc_GetTrustStatus_TrustTextPositiveVote' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.SetupPortrait
// 0x0018 (0x0018 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_SetupPortrait final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_SetupPortrait) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_SetupPortrait");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_SetupPortrait) == 0x000018, "Wrong size on ThumbsVotingMenuEntrySCT_C_SetupPortrait");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetupPortrait, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_SetupPortrait::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetupPortrait, K2Node_DynamicCast_AsSCTPlayer_State) == 0x000008, "Member 'ThumbsVotingMenuEntrySCT_C_SetupPortrait::K2Node_DynamicCast_AsSCTPlayer_State' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetupPortrait, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ThumbsVotingMenuEntrySCT_C_SetupPortrait::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.Set Faction Text
// 0x00F0 (0x00F0 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_Set_Faction_Text final
{
public:
	EPlayerFaction                                Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Temp_struct_Variable;                              // 0x0008(0x0028)()
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	EPlayerFaction                                Temp_byte_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPersonoidInformationComponent*         CallFunc_GetPersonoidInformationComponent_OutputPin; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerFaction                                CallFunc_GetFaction_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x00A8(0x0028)()
	class FText                                   K2Node_Select_Default_1;                           // 0x00D0(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_Set_Faction_Text");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text) == 0x0000F0, "Wrong size on ThumbsVotingMenuEntrySCT_C_Set_Faction_Text");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, Temp_byte_Variable) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, Temp_struct_Variable) == 0x000008, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, Temp_text_Variable) == 0x000030, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, Temp_text_Variable_1) == 0x000048, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, Temp_text_Variable_2) == 0x000060, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, Temp_byte_Variable_1) == 0x000078, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, CallFunc_GetPersonoidInformationComponent_OutputPin) == 0x000080, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::CallFunc_GetPersonoidInformationComponent_OutputPin' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, CallFunc_GetOwner_ReturnValue) == 0x000088, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, K2Node_DynamicCast_AsSCTPlayer_State) == 0x000098, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::K2Node_DynamicCast_AsSCTPlayer_State' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, CallFunc_GetFaction_ReturnValue) == 0x0000A1, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::CallFunc_GetFaction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, K2Node_Select_Default) == 0x0000A8, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, K2Node_Select_Default_1) == 0x0000D0, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E8, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000E9, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Set_Faction_Text, CallFunc_BooleanOR_ReturnValue) == 0x0000EA, "Member 'ThumbsVotingMenuEntrySCT_C_Set_Faction_Text::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.Init Mute Toggle Widget
// 0x0040 (0x0040 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget final
{
public:
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVivoxMuteWI_C*                         CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           K2Node_DynamicCast_AsPlayer_State;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget) == 0x000040, "Wrong size on ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget, CallFunc_Create_ReturnValue) == 0x000018, "Member 'ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000020, "Member 'ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget, K2Node_DynamicCast_AsPlayer_State) == 0x000030, "Member 'ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget::K2Node_DynamicCast_AsPlayer_State' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ThumbsVotingMenuEntrySCT_C_Init_Mute_Toggle_Widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.SetCurrent
// 0x0060 (0x0060 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_SetCurrent final
{
public:
	bool                                          IsCurrent;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerIDString;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue_1;  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_SetCurrent) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_SetCurrent");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_SetCurrent) == 0x000060, "Wrong size on ThumbsVotingMenuEntrySCT_C_SetCurrent");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, IsCurrent) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::IsCurrent' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, PlayerIDString) == 0x000008, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::PlayerIDString' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_GetRenderOpacity_ReturnValue) == 0x000018, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001C, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x000020, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_Less_FloatFloat_ReturnValue) == 0x000024, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x000025, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000026, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000028, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_PauseAnimation_ReturnValue) == 0x000030, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_IsAnimationPlayingForward_ReturnValue_1) == 0x000034, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_IsAnimationPlayingForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000040, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_PauseAnimation_ReturnValue_1) == 0x000050, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_PauseAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_SetCurrent, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'ThumbsVotingMenuEntrySCT_C_SetCurrent::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.ShowSystemProfile
// 0x0008 (0x0008 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_ShowSystemProfile final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_ShowSystemProfile) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_ShowSystemProfile");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_ShowSystemProfile) == 0x000008, "Wrong size on ThumbsVotingMenuEntrySCT_C_ShowSystemProfile");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_ShowSystemProfile, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_ShowSystemProfile::CallFunc_GetOwner_ReturnValue' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.RefreshControllerType
// 0x0020 (0x0020 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_RefreshControllerType final
{
public:
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USCTGameInstance*                       K2Node_DynamicCast_AsSCTGame_Instance;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESCTControllerType                            CallFunc_GetLastControllerType_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_RefreshControllerType) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_RefreshControllerType");
static_assert(sizeof(ThumbsVotingMenuEntrySCT_C_RefreshControllerType) == 0x000020, "Wrong size on ThumbsVotingMenuEntrySCT_C_RefreshControllerType");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_RefreshControllerType, CallFunc_IsConsolePlatform_ReturnValue) == 0x000000, "Member 'ThumbsVotingMenuEntrySCT_C_RefreshControllerType::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_RefreshControllerType, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'ThumbsVotingMenuEntrySCT_C_RefreshControllerType::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_RefreshControllerType, K2Node_DynamicCast_AsSCTGame_Instance) == 0x000010, "Member 'ThumbsVotingMenuEntrySCT_C_RefreshControllerType::K2Node_DynamicCast_AsSCTGame_Instance' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_RefreshControllerType, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ThumbsVotingMenuEntrySCT_C_RefreshControllerType::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_RefreshControllerType, CallFunc_GetLastControllerType_ReturnValue) == 0x000019, "Member 'ThumbsVotingMenuEntrySCT_C_RefreshControllerType::CallFunc_GetLastControllerType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThumbsVotingMenuEntrySCT_C_RefreshControllerType, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'ThumbsVotingMenuEntrySCT_C_RefreshControllerType::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C.IsPSNPlayer
// 0x0020 (0x0020 - 0x0000)
struct ThumbsVotingMenuEntrySCT_C_IsPSNPlayer final
{
public:
	bool                                          PSNPlayer;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASCTPlayerState*                        K2Node_DynamicCast_AsSCTPlayer_State;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ThumbsVotingMenuEntrySCT_C_IsPSNPlayer) == 0x000008, "Wrong alignment on ThumbsVotingMenuEntrySCT_C_IsPSNPlayer");
