#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThumbsVotingMenuEntrySCT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SCT_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ThumbsVotingMenuEntrySCT.ThumbsVotingMenuEntrySCT_C
// 0x0228 (0x0488 - 0x0260)
class UThumbsVotingMenuEntrySCT_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       ShowHighlight;                                     // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomLine;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DownFrame;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DownVoted;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FactionText;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_status_bg;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_status_frame;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mid_status_bg;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mid_status_frame;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PassengerLog;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlatformIcon_C*                     PlatformIconWidget;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerPortrait_C*                      Portrait;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReportButtonWI_C*                      ReportButtonWI;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_status_bg;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_status_frame;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectionHighlight;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopLine;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrustStatus;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpFrame;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Upvoted;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_VivoxMuteWI;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                XboxGamercardButton;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Debugging;                                         // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DefaultColor;                                      // 0x0324(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PositiveColor;                                     // 0x0334(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NegativeColor;                                     // 0x0344(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TopColorScheme;                                    // 0x0354(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NegativeColorScheme;                               // 0x0364(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PositiveColorScheme;                               // 0x0374(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UThumbsVoteInfoComponent*               ThumbsInfoSource;                                  // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UThumbsVoteInfoComponent*               ThumbsInfoTarget;                                  // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DownvoteCachedBackgroundColor;                     // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UpvoteCachedBackgroundColor;                       // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TrustTextNoVote;                                   // 0x03B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TrustTextPositiveVote;                             // 0x03D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TrustTextNegativeVote;                             // 0x03E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAkAudioEvent*                          AudioRemoveVote;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AudioUpvote;                                       // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AudioDownVote;                                     // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            PersonoidColor;                                    // 0x0418(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ResidentColor;                                     // 0x0440(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           BorderColor;                                       // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             Avatar;                                            // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVivoxMuteWI_C*                         VivoxMuteWidget;                                   // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ThumbsVotingMenuEntrySCT(int32 EntryPoint);
	void BndEvt__ThumbsVotingMenuEntrySCT_XboxGamercardButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void OnAddPresence();
	void Destruct();
	void OnSCTControllerTypeChanged();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BndEvt__ReportButtonWI_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature();
	void BndEvt__Upvoted_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Downvoted_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void OnSuccess_E48E40FF4AF09999D9A89CA694D4440B(const struct FFCTPlatformPlayerInfo& PlatformInfo, int32 Code, const class FString& Message);
	void OnError_E48E40FF4AF09999D9A89CA694D4440B(const struct FFCTPlatformPlayerInfo& PlatformInfo, int32 Code, const class FString& Message);
	void Init(class UThumbsVoteInfoComponent* ThumbsInfoSource_0, class UThumbsVoteInfoComponent* ThumbsInfoTarget_0);
	void UpVote();
	void SetUpvotedCosmetics();
	void ResetVotedCosmetics();
	void SetDownvotedCosmetics();
	void DownVote();
	void Set_Upvote_Color(const struct FLinearColor& Color);
	void Set_Downvote_Color(const struct FLinearColor& Color);
	void Set_UI_State_Based_On_Data();
	void Set_Upvote_Based_On_Data();
	void Set_Downvote_Based_On_Data();
	void Remove_Vote();
	void Set_Player_Name();
	void Set_Trust_Text();
	void SetupPortrait();
	void Set_Faction_Text();
	void Init_Mute_Toggle_Widget();
	void SetCurrent(bool IsCurrent);
	void ShowSystemProfile();
	void RefreshControllerType();
	void IsPSNPlayer(bool* PSNPlayer);
	void ToggleVivoxMute();
	void IsXboxLivePlayer(bool* XboxLivePlayer);

	bool Has_Upvoted() const;
	bool Has_Downvoted() const;
	void GetTrustStatus(class FText* TrustTextPositiveVote_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ThumbsVotingMenuEntrySCT_C">();
	}
	static class UThumbsVotingMenuEntrySCT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThumbsVotingMenuEntrySCT_C>();
	}
};
static_assert(alignof(UThumbsVotingMenuEntrySCT_C) == 0x000008, "Wrong alignment on UThumbsVotingMenuEntrySCT_C");
static_assert(sizeof(UThumbsVotingMenuEntrySCT_C) == 0x000488, "Wrong size on UThumbsVotingMenuEntrySCT_C");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, UberGraphFrame) == 0x000260, "Member 'UThumbsVotingMenuEntrySCT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, ShowHighlight) == 0x000268, "Member 'UThumbsVotingMenuEntrySCT_C::ShowHighlight' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, BottomLine) == 0x000270, "Member 'UThumbsVotingMenuEntrySCT_C::BottomLine' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, DownFrame) == 0x000278, "Member 'UThumbsVotingMenuEntrySCT_C::DownFrame' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, DownVoted) == 0x000280, "Member 'UThumbsVotingMenuEntrySCT_C::DownVoted' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, FactionText) == 0x000288, "Member 'UThumbsVotingMenuEntrySCT_C::FactionText' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, Left_status_bg) == 0x000290, "Member 'UThumbsVotingMenuEntrySCT_C::Left_status_bg' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, Left_status_frame) == 0x000298, "Member 'UThumbsVotingMenuEntrySCT_C::Left_status_frame' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, Mid_status_bg) == 0x0002A0, "Member 'UThumbsVotingMenuEntrySCT_C::Mid_status_bg' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, Mid_status_frame) == 0x0002A8, "Member 'UThumbsVotingMenuEntrySCT_C::Mid_status_frame' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, PassengerLog) == 0x0002B0, "Member 'UThumbsVotingMenuEntrySCT_C::PassengerLog' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, PlatformIconWidget) == 0x0002B8, "Member 'UThumbsVotingMenuEntrySCT_C::PlatformIconWidget' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, PlayerName) == 0x0002C0, "Member 'UThumbsVotingMenuEntrySCT_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, Portrait) == 0x0002C8, "Member 'UThumbsVotingMenuEntrySCT_C::Portrait' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, ReportButtonWI) == 0x0002D0, "Member 'UThumbsVotingMenuEntrySCT_C::ReportButtonWI' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, Right_status_bg) == 0x0002D8, "Member 'UThumbsVotingMenuEntrySCT_C::Right_status_bg' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, Right_status_frame) == 0x0002E0, "Member 'UThumbsVotingMenuEntrySCT_C::Right_status_frame' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, SelectionHighlight) == 0x0002E8, "Member 'UThumbsVotingMenuEntrySCT_C::SelectionHighlight' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, TopLine) == 0x0002F0, "Member 'UThumbsVotingMenuEntrySCT_C::TopLine' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, TrustStatus) == 0x0002F8, "Member 'UThumbsVotingMenuEntrySCT_C::TrustStatus' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, UpFrame) == 0x000300, "Member 'UThumbsVotingMenuEntrySCT_C::UpFrame' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, Upvoted) == 0x000308, "Member 'UThumbsVotingMenuEntrySCT_C::Upvoted' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, WrapBox_VivoxMuteWI) == 0x000310, "Member 'UThumbsVotingMenuEntrySCT_C::WrapBox_VivoxMuteWI' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, XboxGamercardButton) == 0x000318, "Member 'UThumbsVotingMenuEntrySCT_C::XboxGamercardButton' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, Debugging) == 0x000320, "Member 'UThumbsVotingMenuEntrySCT_C::Debugging' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, DefaultColor) == 0x000324, "Member 'UThumbsVotingMenuEntrySCT_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, PositiveColor) == 0x000334, "Member 'UThumbsVotingMenuEntrySCT_C::PositiveColor' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, NegativeColor) == 0x000344, "Member 'UThumbsVotingMenuEntrySCT_C::NegativeColor' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, TopColorScheme) == 0x000354, "Member 'UThumbsVotingMenuEntrySCT_C::TopColorScheme' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, NegativeColorScheme) == 0x000364, "Member 'UThumbsVotingMenuEntrySCT_C::NegativeColorScheme' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, PositiveColorScheme) == 0x000374, "Member 'UThumbsVotingMenuEntrySCT_C::PositiveColorScheme' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, ThumbsInfoSource) == 0x000388, "Member 'UThumbsVotingMenuEntrySCT_C::ThumbsInfoSource' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, ThumbsInfoTarget) == 0x000390, "Member 'UThumbsVotingMenuEntrySCT_C::ThumbsInfoTarget' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, DownvoteCachedBackgroundColor) == 0x000398, "Member 'UThumbsVotingMenuEntrySCT_C::DownvoteCachedBackgroundColor' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, UpvoteCachedBackgroundColor) == 0x0003A8, "Member 'UThumbsVotingMenuEntrySCT_C::UpvoteCachedBackgroundColor' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, TrustTextNoVote) == 0x0003B8, "Member 'UThumbsVotingMenuEntrySCT_C::TrustTextNoVote' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, TrustTextPositiveVote) == 0x0003D0, "Member 'UThumbsVotingMenuEntrySCT_C::TrustTextPositiveVote' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, TrustTextNegativeVote) == 0x0003E8, "Member 'UThumbsVotingMenuEntrySCT_C::TrustTextNegativeVote' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, AudioRemoveVote) == 0x000400, "Member 'UThumbsVotingMenuEntrySCT_C::AudioRemoveVote' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, AudioUpvote) == 0x000408, "Member 'UThumbsVotingMenuEntrySCT_C::AudioUpvote' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, AudioDownVote) == 0x000410, "Member 'UThumbsVotingMenuEntrySCT_C::AudioDownVote' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, PersonoidColor) == 0x000418, "Member 'UThumbsVotingMenuEntrySCT_C::PersonoidColor' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, ResidentColor) == 0x000440, "Member 'UThumbsVotingMenuEntrySCT_C::ResidentColor' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, BorderColor) == 0x000468, "Member 'UThumbsVotingMenuEntrySCT_C::BorderColor' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, Avatar) == 0x000478, "Member 'UThumbsVotingMenuEntrySCT_C::Avatar' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuEntrySCT_C, VivoxMuteWidget) == 0x000480, "Member 'UThumbsVotingMenuEntrySCT_C::VivoxMuteWidget' has a wrong offset!");

}

