#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThumbsVotingMenuSCT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ThumbsVotingMenuSCT.ThumbsVotingMenuSCT_C
// 0x00F8 (0x0378 - 0x0280)
class UThumbsVotingMenuSCT_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       OpenAnim;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomLine1;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bottomline2;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GamepadHelpIcons;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Players;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHiddenAgendaWI_C*                      HiddenAgendaWI;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThumbsVotingHelpIconsWI_C*             Navigate_ThumbsVotingHelpIconsWI;                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PassengerInformationBox;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerLine;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerPortrait_C*                      PlayerPortrait;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsTabButtonWI_C*                  ReportButton;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ResidentStatus;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThumbsVotingHelpIconsWI_C*             ShowProfile_ThumbsVotingHelpIconsWI;               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThumbsVotingMenuPassengerLogWI_C*      ThumbsVotingMenuPassengerLogWI;                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThumbsVotingHelpIconsWI_C*             ToggleMute_ThumbsVotingHelpIconsWI;                // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Topline1;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Topline2;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThumbsVotingHelpIconsWI_C*             Vote_ThumbsVotingHelpIconsWI;                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             YourName;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class APlayerState*>                   FakePlayerArray;                                   // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FLinearColor                           ResidentFactionColor;                              // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PersonoidFactionColor;                             // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AudioToggle;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UThumbsVotingMenuEntrySCT_C*>    ThumbsVotingMenuEntryArray;                        // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         CurrentThumbsVotingMenuEntry;                      // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ThumbsVotingMenuSCT(int32 EntryPoint);
	void OnVoteMenuMute();
	void OnSCTControllerTypeChanged();
	void Destruct();
	void OnVoteMenuReport();
	void OnVoteMenuShowProfile();
	void OnVotemenuDownVote();
	void OnVoteMenuUpVote();
	void OnVoteMenuRight();
	void OnVoteMenuLeft();
	void BndEvt__ReportButton_K2Node_ComponentBoundEvent_0_Pressed__DelegateSignature();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetPlayerFaction();
	void DoDesignTime();
	void GetPlayerColorFromInfoComponent(class UThumbsVoteInfoComponent* ThumbsVoteEntry, struct FLinearColor* Color, class UTexture2D** Portrait);
	void NavigatePlayers(bool ShouldNavigateRight);
	void VoteCurrentPlayer(bool ShouldVoteDown);
	void ShowCurrentPlayerSystemProfile();
	void RefreshGamepadButtonsDisplay();
	void ToggleCurrentPlayerMute();
	void ReportCurrentPlayer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ThumbsVotingMenuSCT_C">();
	}
	static class UThumbsVotingMenuSCT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThumbsVotingMenuSCT_C>();
	}
};
static_assert(alignof(UThumbsVotingMenuSCT_C) == 0x000008, "Wrong alignment on UThumbsVotingMenuSCT_C");
static_assert(sizeof(UThumbsVotingMenuSCT_C) == 0x000378, "Wrong size on UThumbsVotingMenuSCT_C");
static_assert(offsetof(UThumbsVotingMenuSCT_C, UberGraphFrame) == 0x000280, "Member 'UThumbsVotingMenuSCT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, OpenAnim) == 0x000288, "Member 'UThumbsVotingMenuSCT_C::OpenAnim' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, BG) == 0x000290, "Member 'UThumbsVotingMenuSCT_C::BG' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, BottomLine1) == 0x000298, "Member 'UThumbsVotingMenuSCT_C::BottomLine1' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, Bottomline2) == 0x0002A0, "Member 'UThumbsVotingMenuSCT_C::Bottomline2' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, GamepadHelpIcons) == 0x0002A8, "Member 'UThumbsVotingMenuSCT_C::GamepadHelpIcons' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, HBox_Players) == 0x0002B0, "Member 'UThumbsVotingMenuSCT_C::HBox_Players' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, HiddenAgendaWI) == 0x0002B8, "Member 'UThumbsVotingMenuSCT_C::HiddenAgendaWI' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, Navigate_ThumbsVotingHelpIconsWI) == 0x0002C0, "Member 'UThumbsVotingMenuSCT_C::Navigate_ThumbsVotingHelpIconsWI' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, PassengerInformationBox) == 0x0002C8, "Member 'UThumbsVotingMenuSCT_C::PassengerInformationBox' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, PlayerLine) == 0x0002D0, "Member 'UThumbsVotingMenuSCT_C::PlayerLine' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, PlayerPortrait) == 0x0002D8, "Member 'UThumbsVotingMenuSCT_C::PlayerPortrait' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, ReportButton) == 0x0002E0, "Member 'UThumbsVotingMenuSCT_C::ReportButton' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, ResidentStatus) == 0x0002E8, "Member 'UThumbsVotingMenuSCT_C::ResidentStatus' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, ShowProfile_ThumbsVotingHelpIconsWI) == 0x0002F0, "Member 'UThumbsVotingMenuSCT_C::ShowProfile_ThumbsVotingHelpIconsWI' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, ThumbsVotingMenuPassengerLogWI) == 0x0002F8, "Member 'UThumbsVotingMenuSCT_C::ThumbsVotingMenuPassengerLogWI' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, ToggleMute_ThumbsVotingHelpIconsWI) == 0x000300, "Member 'UThumbsVotingMenuSCT_C::ToggleMute_ThumbsVotingHelpIconsWI' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, Topline1) == 0x000308, "Member 'UThumbsVotingMenuSCT_C::Topline1' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, Topline2) == 0x000310, "Member 'UThumbsVotingMenuSCT_C::Topline2' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, Vote_ThumbsVotingHelpIconsWI) == 0x000318, "Member 'UThumbsVotingMenuSCT_C::Vote_ThumbsVotingHelpIconsWI' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, YourName) == 0x000320, "Member 'UThumbsVotingMenuSCT_C::YourName' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, FakePlayerArray) == 0x000328, "Member 'UThumbsVotingMenuSCT_C::FakePlayerArray' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, ResidentFactionColor) == 0x000338, "Member 'UThumbsVotingMenuSCT_C::ResidentFactionColor' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, PersonoidFactionColor) == 0x000348, "Member 'UThumbsVotingMenuSCT_C::PersonoidFactionColor' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, AudioToggle) == 0x000358, "Member 'UThumbsVotingMenuSCT_C::AudioToggle' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, ThumbsVotingMenuEntryArray) == 0x000360, "Member 'UThumbsVotingMenuSCT_C::ThumbsVotingMenuEntryArray' has a wrong offset!");
static_assert(offsetof(UThumbsVotingMenuSCT_C, CurrentThumbsVotingMenuEntry) == 0x000370, "Member 'UThumbsVotingMenuSCT_C::CurrentThumbsVotingMenuEntry' has a wrong offset!");

}

