#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialOverlaySCTsmall_WI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_TutorialContent_structs.hpp"
#include "SCT_structs.hpp"
#include "SCT_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialOverlaySCTsmall_WI.TutorialOverlaySCTsmall_WI_C
// 0x0098 (0x0318 - 0x0280)
class UTutorialOverlaySCTsmall_WI_C final : public UWidgetSCT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       In;                                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         Body;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Headline;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackground;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTut;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             BackgroundTexture;                                 // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RemoveOnItemEquip;                                 // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TutorialName;                                      // 0x02BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TutorialContent                     TutData;                                           // 0x02C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TutorialOverlaySCTsmall_WI(int32 EntryPoint);
	void Remove();
	void Construct();
	void RemoveEquipmentTutorial(class UPower* PowerChanged, EInventorySlotID SlotId);
	void Set_Images_And();
	void SetVariablesFromTutData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutorialOverlaySCTsmall_WI_C">();
	}
	static class UTutorialOverlaySCTsmall_WI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialOverlaySCTsmall_WI_C>();
	}
};
static_assert(alignof(UTutorialOverlaySCTsmall_WI_C) == 0x000008, "Wrong alignment on UTutorialOverlaySCTsmall_WI_C");
static_assert(sizeof(UTutorialOverlaySCTsmall_WI_C) == 0x000318, "Wrong size on UTutorialOverlaySCTsmall_WI_C");
static_assert(offsetof(UTutorialOverlaySCTsmall_WI_C, UberGraphFrame) == 0x000280, "Member 'UTutorialOverlaySCTsmall_WI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTutorialOverlaySCTsmall_WI_C, In) == 0x000288, "Member 'UTutorialOverlaySCTsmall_WI_C::In' has a wrong offset!");
static_assert(offsetof(UTutorialOverlaySCTsmall_WI_C, Body) == 0x000290, "Member 'UTutorialOverlaySCTsmall_WI_C::Body' has a wrong offset!");
static_assert(offsetof(UTutorialOverlaySCTsmall_WI_C, Headline) == 0x000298, "Member 'UTutorialOverlaySCTsmall_WI_C::Headline' has a wrong offset!");
static_assert(offsetof(UTutorialOverlaySCTsmall_WI_C, ImageBackground) == 0x0002A0, "Member 'UTutorialOverlaySCTsmall_WI_C::ImageBackground' has a wrong offset!");
static_assert(offsetof(UTutorialOverlaySCTsmall_WI_C, ImageTut) == 0x0002A8, "Member 'UTutorialOverlaySCTsmall_WI_C::ImageTut' has a wrong offset!");
static_assert(offsetof(UTutorialOverlaySCTsmall_WI_C, BackgroundTexture) == 0x0002B0, "Member 'UTutorialOverlaySCTsmall_WI_C::BackgroundTexture' has a wrong offset!");
static_assert(offsetof(UTutorialOverlaySCTsmall_WI_C, RemoveOnItemEquip) == 0x0002B8, "Member 'UTutorialOverlaySCTsmall_WI_C::RemoveOnItemEquip' has a wrong offset!");
static_assert(offsetof(UTutorialOverlaySCTsmall_WI_C, TutorialName) == 0x0002BC, "Member 'UTutorialOverlaySCTsmall_WI_C::TutorialName' has a wrong offset!");
static_assert(offsetof(UTutorialOverlaySCTsmall_WI_C, TutData) == 0x0002C8, "Member 'UTutorialOverlaySCTsmall_WI_C::TutData' has a wrong offset!");

}

