#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialOverlaySCT_MenuWI

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "S_TutorialContent_structs.hpp"


namespace SDK::Params
{

// Function TutorialOverlaySCT_MenuWI.TutorialOverlaySCT_MenuWI_C.ExecuteUbergraph_TutorialOverlaySCT_MenuWI
// 0x00A8 (0x00A8 - 0x0000)
struct TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_GetSCT_Player_Character_AsCharacter_SCT;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSCT_Player_Character_CharacterInventory; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TutorialContent                     CallFunc_GetTutorialDataFromRowName_Out_Row;       // 0x0030(0x0050)(ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0080(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0090(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI) == 0x000008, "Wrong alignment on TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI");
static_assert(sizeof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI) == 0x0000A8, "Wrong size on TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI");
static_assert(offsetof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI, EntryPoint) == 0x000000, "Member 'TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI, CallFunc_GetSCT_Player_Character_AsCharacter_SCT) == 0x000018, "Member 'TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI::CallFunc_GetSCT_Player_Character_AsCharacter_SCT' has a wrong offset!");
static_assert(offsetof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI, CallFunc_GetSCT_Player_Character_CharacterInventory) == 0x000020, "Member 'TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI::CallFunc_GetSCT_Player_Character_CharacterInventory' has a wrong offset!");
static_assert(offsetof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000028, "Member 'TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI, CallFunc_GetTutorialDataFromRowName_Out_Row) == 0x000030, "Member 'TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI::CallFunc_GetTutorialDataFromRowName_Out_Row' has a wrong offset!");
static_assert(offsetof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI, Temp_delegate_Variable) == 0x000080, "Member 'TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI, Temp_struct_Variable) == 0x000090, "Member 'TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI, CallFunc_PostAkEvent_ReturnValue) == 0x0000A0, "Member 'TutorialOverlaySCT_MenuWI_C_ExecuteUbergraph_TutorialOverlaySCT_MenuWI::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

