#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserInputSettingsBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UserInputSettingsBP.UserInputSettingsBP_C.Get Invert Scale
// 0x0014 (0x0014 - 0x0000)
struct UserInputSettingsBP_C_Get_Invert_Scale final
{
public:
	class FName                                   EntryName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Output;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UserInputSettingsBP_C_Get_Invert_Scale) == 0x000004, "Wrong alignment on UserInputSettingsBP_C_Get_Invert_Scale");
static_assert(sizeof(UserInputSettingsBP_C_Get_Invert_Scale) == 0x000014, "Wrong size on UserInputSettingsBP_C_Get_Invert_Scale");
static_assert(offsetof(UserInputSettingsBP_C_Get_Invert_Scale, EntryName) == 0x000000, "Member 'UserInputSettingsBP_C_Get_Invert_Scale::EntryName' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Get_Invert_Scale, Output) == 0x000008, "Member 'UserInputSettingsBP_C_Get_Invert_Scale::Output' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Get_Invert_Scale, CallFunc_Map_Find_Value) == 0x00000C, "Member 'UserInputSettingsBP_C_Get_Invert_Scale::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Get_Invert_Scale, CallFunc_Map_Find_ReturnValue) == 0x00000D, "Member 'UserInputSettingsBP_C_Get_Invert_Scale::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Get_Invert_Scale, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'UserInputSettingsBP_C_Get_Invert_Scale::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function UserInputSettingsBP.UserInputSettingsBP_C.Set Camera Inversion
// 0x00A0 (0x00A0 - 0x0000)
struct UserInputSettingsBP_C_Set_Camera_Inversion final
{
public:
	class FName                                   CameraInputName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InversionName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Invert_Scale_Output;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item;                           // 0x0048(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping;             // 0x0078(0x0028)()
};
static_assert(alignof(UserInputSettingsBP_C_Set_Camera_Inversion) == 0x000008, "Wrong alignment on UserInputSettingsBP_C_Set_Camera_Inversion");
static_assert(sizeof(UserInputSettingsBP_C_Set_Camera_Inversion) == 0x0000A0, "Wrong size on UserInputSettingsBP_C_Set_Camera_Inversion");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, CameraInputName) == 0x000000, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::CameraInputName' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, InversionName) == 0x000008, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::InversionName' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, CallFunc_Get_Invert_Scale_Output) == 0x000010, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::CallFunc_Get_Invert_Scale_Output' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, CallFunc_GetInputSettings_ReturnValue) == 0x000020, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, CallFunc_GetInputSettings_ReturnValue_1) == 0x000028, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::CallFunc_GetInputSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, CallFunc_GetAxisMappingByName_OutMappings) == 0x000030, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::CallFunc_GetAxisMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, CallFunc_Array_Get_Item) == 0x000048, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000074, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserInputSettingsBP_C_Set_Camera_Inversion, K2Node_MakeStruct_InputAxisKeyMapping) == 0x000078, "Member 'UserInputSettingsBP_C_Set_Camera_Inversion::K2Node_MakeStruct_InputAxisKeyMapping' has a wrong offset!");

}

