#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoteGivenWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function VoteGivenWI.VoteGivenWI_C.ExecuteUbergraph_VoteGivenWI
// 0x0008 (0x0008 - 0x0000)
struct VoteGivenWI_C_ExecuteUbergraph_VoteGivenWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoteGivenWI_C_ExecuteUbergraph_VoteGivenWI) == 0x000004, "Wrong alignment on VoteGivenWI_C_ExecuteUbergraph_VoteGivenWI");
static_assert(sizeof(VoteGivenWI_C_ExecuteUbergraph_VoteGivenWI) == 0x000008, "Wrong size on VoteGivenWI_C_ExecuteUbergraph_VoteGivenWI");
static_assert(offsetof(VoteGivenWI_C_ExecuteUbergraph_VoteGivenWI, EntryPoint) == 0x000000, "Member 'VoteGivenWI_C_ExecuteUbergraph_VoteGivenWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(VoteGivenWI_C_ExecuteUbergraph_VoteGivenWI, K2Node_Event_IsDesignTime) == 0x000004, "Member 'VoteGivenWI_C_ExecuteUbergraph_VoteGivenWI::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function VoteGivenWI.VoteGivenWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct VoteGivenWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoteGivenWI_C_PreConstruct) == 0x000001, "Wrong alignment on VoteGivenWI_C_PreConstruct");
static_assert(sizeof(VoteGivenWI_C_PreConstruct) == 0x000001, "Wrong size on VoteGivenWI_C_PreConstruct");
static_assert(offsetof(VoteGivenWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'VoteGivenWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function VoteGivenWI.VoteGivenWI_C.SetVoted
// 0x0008 (0x0008 - 0x0000)
struct VoteGivenWI_C_SetVoted final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoteGivenWI_C_SetVoted) == 0x000008, "Wrong alignment on VoteGivenWI_C_SetVoted");
static_assert(sizeof(VoteGivenWI_C_SetVoted) == 0x000008, "Wrong size on VoteGivenWI_C_SetVoted");
static_assert(offsetof(VoteGivenWI_C_SetVoted, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'VoteGivenWI_C_SetVoted::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function VoteGivenWI.VoteGivenWI_C.SetUnvoted
// 0x0008 (0x0008 - 0x0000)
struct VoteGivenWI_C_SetUnvoted final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoteGivenWI_C_SetUnvoted) == 0x000008, "Wrong alignment on VoteGivenWI_C_SetUnvoted");
static_assert(sizeof(VoteGivenWI_C_SetUnvoted) == 0x000008, "Wrong size on VoteGivenWI_C_SetUnvoted");
static_assert(offsetof(VoteGivenWI_C_SetUnvoted, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'VoteGivenWI_C_SetUnvoted::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

}

