#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VruumbaPreviewTrackAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function VruumbaPreviewTrackAnimBP.VruumbaPreviewTrackAnimBP_C.ExecuteUbergraph_VruumbaPreviewTrackAnimBP
// 0x0004 (0x0004 - 0x0000)
struct VruumbaPreviewTrackAnimBP_C_ExecuteUbergraph_VruumbaPreviewTrackAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VruumbaPreviewTrackAnimBP_C_ExecuteUbergraph_VruumbaPreviewTrackAnimBP) == 0x000004, "Wrong alignment on VruumbaPreviewTrackAnimBP_C_ExecuteUbergraph_VruumbaPreviewTrackAnimBP");
static_assert(sizeof(VruumbaPreviewTrackAnimBP_C_ExecuteUbergraph_VruumbaPreviewTrackAnimBP) == 0x000004, "Wrong size on VruumbaPreviewTrackAnimBP_C_ExecuteUbergraph_VruumbaPreviewTrackAnimBP");
static_assert(offsetof(VruumbaPreviewTrackAnimBP_C_ExecuteUbergraph_VruumbaPreviewTrackAnimBP, EntryPoint) == 0x000000, "Member 'VruumbaPreviewTrackAnimBP_C_ExecuteUbergraph_VruumbaPreviewTrackAnimBP::EntryPoint' has a wrong offset!");

// Function VruumbaPreviewTrackAnimBP.VruumbaPreviewTrackAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct VruumbaPreviewTrackAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(VruumbaPreviewTrackAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on VruumbaPreviewTrackAnimBP_C_AnimGraph");
static_assert(sizeof(VruumbaPreviewTrackAnimBP_C_AnimGraph) == 0x000010, "Wrong size on VruumbaPreviewTrackAnimBP_C_AnimGraph");
static_assert(offsetof(VruumbaPreviewTrackAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'VruumbaPreviewTrackAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

