#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VruumbaSpeedBooster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VruumbaSpeedBooster.VruumbaSpeedBooster_C
// 0x0090 (0x02B0 - 0x0220)
class AVruumbaSpeedBooster_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class USpotLightComponent*                    SpotLight;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight3;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight2;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem3;                                   // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem2;                                   // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem1;                                   // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger;                                           // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             CheckPointCleared;                                 // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AVruumbaSCTBP_C*                        VruumbaPlayer;                                     // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoostAmount;                                       // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckPointCleared__DelegateSignature(int32 NextCheckPoint);
	void ExecuteUbergraph_VruumbaSpeedBooster(int32 EntryPoint);
	void BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VruumbaSpeedBooster_C">();
	}
	static class AVruumbaSpeedBooster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVruumbaSpeedBooster_C>();
	}
};
static_assert(alignof(AVruumbaSpeedBooster_C) == 0x000008, "Wrong alignment on AVruumbaSpeedBooster_C");
static_assert(sizeof(AVruumbaSpeedBooster_C) == 0x0002B0, "Wrong size on AVruumbaSpeedBooster_C");
static_assert(offsetof(AVruumbaSpeedBooster_C, UberGraphFrame) == 0x000220, "Member 'AVruumbaSpeedBooster_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, SpotLight) == 0x000228, "Member 'AVruumbaSpeedBooster_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, SpotLight3) == 0x000230, "Member 'AVruumbaSpeedBooster_C::SpotLight3' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, SpotLight2) == 0x000238, "Member 'AVruumbaSpeedBooster_C::SpotLight2' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, SpotLight1) == 0x000240, "Member 'AVruumbaSpeedBooster_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, ParticleSystem) == 0x000248, "Member 'AVruumbaSpeedBooster_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, ParticleSystem3) == 0x000250, "Member 'AVruumbaSpeedBooster_C::ParticleSystem3' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, ParticleSystem2) == 0x000258, "Member 'AVruumbaSpeedBooster_C::ParticleSystem2' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, ParticleSystem1) == 0x000260, "Member 'AVruumbaSpeedBooster_C::ParticleSystem1' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, StaticMesh1) == 0x000268, "Member 'AVruumbaSpeedBooster_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, Ak) == 0x000270, "Member 'AVruumbaSpeedBooster_C::Ak' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, Trigger) == 0x000278, "Member 'AVruumbaSpeedBooster_C::Trigger' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, StaticMesh) == 0x000280, "Member 'AVruumbaSpeedBooster_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, Scene) == 0x000288, "Member 'AVruumbaSpeedBooster_C::Scene' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, CheckPointCleared) == 0x000290, "Member 'AVruumbaSpeedBooster_C::CheckPointCleared' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, VruumbaPlayer) == 0x0002A0, "Member 'AVruumbaSpeedBooster_C::VruumbaPlayer' has a wrong offset!");
static_assert(offsetof(AVruumbaSpeedBooster_C, BoostAmount) == 0x0002A8, "Member 'AVruumbaSpeedBooster_C::BoostAmount' has a wrong offset!");

}

