#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VruumbaPreviewTrackAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass VruumbaPreviewTrackAnimBP.VruumbaPreviewTrackAnimBP_C
// 0x0340 (0x0600 - 0x02C0)
class UVruumbaPreviewTrackAnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x02F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0370(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0398(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0418(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0448(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x04C8(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x04F8(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0510(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0540(0x00B0)()
	bool                                          Hovering;                                          // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_VruumbaPreviewTrackAnimBP(int32 EntryPoint);
	void EndHover();
	void BeginHover();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VruumbaPreviewTrackAnimBP_C">();
	}
	static class UVruumbaPreviewTrackAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVruumbaPreviewTrackAnimBP_C>();
	}
};
static_assert(alignof(UVruumbaPreviewTrackAnimBP_C) == 0x000010, "Wrong alignment on UVruumbaPreviewTrackAnimBP_C");
static_assert(sizeof(UVruumbaPreviewTrackAnimBP_C) == 0x000600, "Wrong size on UVruumbaPreviewTrackAnimBP_C");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UVruumbaPreviewTrackAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_TransitionResult_3) == 0x0002F8, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000320, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000348, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_TransitionResult) == 0x000370, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000398, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_StateResult_2) == 0x000418, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_SequencePlayer) == 0x000448, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_StateResult_1) == 0x0004C8, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_LocalRefPose) == 0x0004F8, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_StateResult) == 0x000510, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, AnimGraphNode_StateMachine) == 0x000540, "Member 'UVruumbaPreviewTrackAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UVruumbaPreviewTrackAnimBP_C, Hovering) == 0x0005F0, "Member 'UVruumbaPreviewTrackAnimBP_C::Hovering' has a wrong offset!");

}

