#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WalkSlowlyGA

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function WalkSlowlyGA.WalkSlowlyGA_C.ExecuteUbergraph_WalkSlowlyGA
// 0x0038 (0x0038 - 0x0000)
struct WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA) == 0x000008, "Wrong alignment on WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA");
static_assert(sizeof(WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA) == 0x000038, "Wrong size on WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA");
static_assert(offsetof(WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA, EntryPoint) == 0x000000, "Member 'WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA, K2Node_CustomEvent_TimeHeld) == 0x000004, "Member 'WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA, Temp_float_Variable) == 0x000018, "Member 'WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA, CallFunc_WaitInputRelease_ReturnValue) == 0x000020, "Member 'WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA, K2Node_Event_bWasCancelled) == 0x000029, "Member 'WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00002C, "Member 'WalkSlowlyGA_C_ExecuteUbergraph_WalkSlowlyGA::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function WalkSlowlyGA.WalkSlowlyGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct WalkSlowlyGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WalkSlowlyGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on WalkSlowlyGA_C_K2_OnEndAbility");
static_assert(sizeof(WalkSlowlyGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on WalkSlowlyGA_C_K2_OnEndAbility");
static_assert(offsetof(WalkSlowlyGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'WalkSlowlyGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function WalkSlowlyGA.WalkSlowlyGA_C.OnRelease_FCF66A994B004A6376ED5AAE8035EBFD
// 0x0004 (0x0004 - 0x0000)
struct WalkSlowlyGA_C_OnRelease_FCF66A994B004A6376ED5AAE8035EBFD final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WalkSlowlyGA_C_OnRelease_FCF66A994B004A6376ED5AAE8035EBFD) == 0x000004, "Wrong alignment on WalkSlowlyGA_C_OnRelease_FCF66A994B004A6376ED5AAE8035EBFD");
static_assert(sizeof(WalkSlowlyGA_C_OnRelease_FCF66A994B004A6376ED5AAE8035EBFD) == 0x000004, "Wrong size on WalkSlowlyGA_C_OnRelease_FCF66A994B004A6376ED5AAE8035EBFD");
static_assert(offsetof(WalkSlowlyGA_C_OnRelease_FCF66A994B004A6376ED5AAE8035EBFD, TimeHeld) == 0x000000, "Member 'WalkSlowlyGA_C_OnRelease_FCF66A994B004A6376ED5AAE8035EBFD::TimeHeld' has a wrong offset!");

}

