#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallTeleporterSCTBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseInteractableSCTBP_classes.hpp"
#include "E_interactionAnim_structs.hpp"
#include "AkAudio_structs.hpp"
#include "E_interactionAnimState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WallTeleporterSCTBP.WallTeleporterSCTBP_C
// 0x00B0 (0x0300 - 0x0250)
class AWallTeleporterSCTBP_C final : public ABaseInteractableSCTBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WallTeleporterSCTBP_C;              // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class USpotLightComponent*                    SpotLight;                                         // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Personoid_Tube_Light_Thin_200;                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Personoid_Tube_Light_Thin_201;                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Personoid_Tube_Shortcut_Door;                   // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShortcutKeyInteractionComponent_C*     ShortcutKeyInteractionComponent;                   // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OutlineMesh;                                       // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   XrayBillboard;                                     // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   XrayMesh;                                          // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionProgressBarCreator*         InteractionProgressBarCreatorTeleport;             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      ExitLocation;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UContextStaticMeshComponent*            ContextStaticMeshSecondary;                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CharacterOverlapper;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       PreviewCamera;                                     // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AWallTeleporterSCTBP_C*                 Destination;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Activating_Actor;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Traveling_Actor;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TopTube;                                           // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          BendWallTube;                                      // 0x02FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WallTeleporterSCTBP(int32 EntryPoint);
	void BndEvt__WallTeleporterSCTBP_ShortcutKeyInteractionComponent_K2Node_ComponentBoundEvent_6_InteractionSuccessfulDelegate__DelegateSignature();
	void BndEvt__WallTeleporterSCTBP_ShortcutKeyInteractionComponent_K2Node_ComponentBoundEvent_2_InteractionEndedDelegate__DelegateSignature(const struct FInteractionPayload& Payload, bool WasCancelled);
	void BndEvt__WallTeleporterSCTBP_ShortcutKeyInteractionComponent_K2Node_ComponentBoundEvent_0_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void EndFade();
	void StartFade();
	void Audio_Stop_Hold();
	void Play_Animation_Server(class AActor* Actor, E_interactionAnim Animation, E_interactionAnimState State);
	void ReceiveBeginPlay();
	void Audio_Start_Hold();
	void Audio_Camera_Disabled();
	void Audio_Camera_Enabled();
	void InteractionCompleted();
	void ReceiveTick(float DeltaSeconds);
	void BndEvt__CharacterOverlapper_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_1_InteractionDelegate__DelegateSignature(const struct FInteractionPayload& Payload);
	void UserConstructionScript();
	void Play_Audio_on_Actor(class AActor* Actor, class UAkAudioEvent* AkEvent);
	void Commit_Destination_Cooldown();
	struct FVector Get_Destination_Location_and_Rotation(float* ReturnValue_Yaw);
	void Toggle_Destination_Camera_UI(bool Enable);
	void RenderXray(bool On);
	TArray<class UPrimitiveComponent*> GetOutlineMeshes();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WallTeleporterSCTBP_C">();
	}
	static class AWallTeleporterSCTBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWallTeleporterSCTBP_C>();
	}
};
static_assert(alignof(AWallTeleporterSCTBP_C) == 0x000008, "Wrong alignment on AWallTeleporterSCTBP_C");
static_assert(sizeof(AWallTeleporterSCTBP_C) == 0x000300, "Wrong size on AWallTeleporterSCTBP_C");
static_assert(offsetof(AWallTeleporterSCTBP_C, UberGraphFrame_WallTeleporterSCTBP_C) == 0x000250, "Member 'AWallTeleporterSCTBP_C::UberGraphFrame_WallTeleporterSCTBP_C' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, SpotLight) == 0x000258, "Member 'AWallTeleporterSCTBP_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, Cube) == 0x000260, "Member 'AWallTeleporterSCTBP_C::Cube' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, SM_Personoid_Tube_Light_Thin_200) == 0x000268, "Member 'AWallTeleporterSCTBP_C::SM_Personoid_Tube_Light_Thin_200' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, SM_Personoid_Tube_Light_Thin_201) == 0x000270, "Member 'AWallTeleporterSCTBP_C::SM_Personoid_Tube_Light_Thin_201' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, SM_Personoid_Tube_Shortcut_Door) == 0x000278, "Member 'AWallTeleporterSCTBP_C::SM_Personoid_Tube_Shortcut_Door' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, ShortcutKeyInteractionComponent) == 0x000280, "Member 'AWallTeleporterSCTBP_C::ShortcutKeyInteractionComponent' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, OutlineMesh) == 0x000288, "Member 'AWallTeleporterSCTBP_C::OutlineMesh' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, XrayBillboard) == 0x000290, "Member 'AWallTeleporterSCTBP_C::XrayBillboard' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, XrayMesh) == 0x000298, "Member 'AWallTeleporterSCTBP_C::XrayMesh' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, InteractionProgressBarCreatorTeleport) == 0x0002A0, "Member 'AWallTeleporterSCTBP_C::InteractionProgressBarCreatorTeleport' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, Ak) == 0x0002A8, "Member 'AWallTeleporterSCTBP_C::Ak' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, Arrow) == 0x0002B0, "Member 'AWallTeleporterSCTBP_C::Arrow' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, ExitLocation) == 0x0002B8, "Member 'AWallTeleporterSCTBP_C::ExitLocation' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, ContextStaticMeshSecondary) == 0x0002C0, "Member 'AWallTeleporterSCTBP_C::ContextStaticMeshSecondary' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, CharacterOverlapper) == 0x0002C8, "Member 'AWallTeleporterSCTBP_C::CharacterOverlapper' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, SceneCaptureComponent2D) == 0x0002D0, "Member 'AWallTeleporterSCTBP_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, PreviewCamera) == 0x0002D8, "Member 'AWallTeleporterSCTBP_C::PreviewCamera' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, Destination) == 0x0002E0, "Member 'AWallTeleporterSCTBP_C::Destination' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, Activating_Actor) == 0x0002E8, "Member 'AWallTeleporterSCTBP_C::Activating_Actor' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, Traveling_Actor) == 0x0002F0, "Member 'AWallTeleporterSCTBP_C::Traveling_Actor' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, Success) == 0x0002F8, "Member 'AWallTeleporterSCTBP_C::Success' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, TopTube) == 0x0002F9, "Member 'AWallTeleporterSCTBP_C::TopTube' has a wrong offset!");
static_assert(offsetof(AWallTeleporterSCTBP_C, BendWallTube) == 0x0002FA, "Member 'AWallTeleporterSCTBP_C::BendWallTube' has a wrong offset!");

}

