#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wi_Score

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_ScoreCategories_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass wi_Score.wi_Score_C
// 0x00A0 (0x0300 - 0x0260)
class UWi_Score_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                       DeductionAnimation;                                // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NormalAnimation;                                   // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Normal;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelClean;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelDeduction;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_95;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QuestionMark_0;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QuestionMark_1;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QuestionMark_2;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QuestionMark_3;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScoreCategory_Normal;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScoreCategory_Normal_Title;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_ScoreCategories                             Category;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Points;                                            // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         ShortDelay;                                        // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideCat;                                       // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_wi_Score(int32 EntryPoint);
	void Construct();
	class FText TextForNormalScore();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"wi_Score_C">();
	}
	static class UWi_Score_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWi_Score_C>();
	}
};
static_assert(alignof(UWi_Score_C) == 0x000008, "Wrong alignment on UWi_Score_C");
static_assert(sizeof(UWi_Score_C) == 0x000300, "Wrong size on UWi_Score_C");
static_assert(offsetof(UWi_Score_C, UberGraphFrame) == 0x000260, "Member 'UWi_Score_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, DeductionAnimation) == 0x000268, "Member 'UWi_Score_C::DeductionAnimation' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, NormalAnimation) == 0x000270, "Member 'UWi_Score_C::NormalAnimation' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, Border_Normal) == 0x000278, "Member 'UWi_Score_C::Border_Normal' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, CanvasPanel) == 0x000280, "Member 'UWi_Score_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, CanvasPanelClean) == 0x000288, "Member 'UWi_Score_C::CanvasPanelClean' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, CanvasPanelDeduction) == 0x000290, "Member 'UWi_Score_C::CanvasPanelDeduction' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, Image) == 0x000298, "Member 'UWi_Score_C::Image' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, Image_1) == 0x0002A0, "Member 'UWi_Score_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, Image_2) == 0x0002A8, "Member 'UWi_Score_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, Image_95) == 0x0002B0, "Member 'UWi_Score_C::Image_95' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, QuestionMark_0) == 0x0002B8, "Member 'UWi_Score_C::QuestionMark_0' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, QuestionMark_1) == 0x0002C0, "Member 'UWi_Score_C::QuestionMark_1' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, QuestionMark_2) == 0x0002C8, "Member 'UWi_Score_C::QuestionMark_2' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, QuestionMark_3) == 0x0002D0, "Member 'UWi_Score_C::QuestionMark_3' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, ScoreCategory_Normal) == 0x0002D8, "Member 'UWi_Score_C::ScoreCategory_Normal' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, ScoreCategory_Normal_Title) == 0x0002E0, "Member 'UWi_Score_C::ScoreCategory_Normal_Title' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, WidgetSwitcher) == 0x0002E8, "Member 'UWi_Score_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, Category) == 0x0002F0, "Member 'UWi_Score_C::Category' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, Points) == 0x0002F4, "Member 'UWi_Score_C::Points' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, ShortDelay) == 0x0002F8, "Member 'UWi_Score_C::ShortDelay' has a wrong offset!");
static_assert(offsetof(UWi_Score_C, OverrideCat) == 0x0002FC, "Member 'UWi_Score_C::OverrideCat' has a wrong offset!");

}

