#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TrophyCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SCT_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TrophyCustomization.WI_TrophyCustomization_C
// 0x00B0 (0x0310 - 0x0260)
class UWI_TrophyCustomization_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UButton*                                BackButton;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackButton_Arrow;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bottombarbg;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cabinbox;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboCustomizationTrophyWI_C*          ComboCustomizationTrophyWI;                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Container;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Topbarbg;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UComboCustomizationTrophyWI_C*>  TrophyComboBoxes;                                  // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnCreateTrohpyList;                                // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FCloudTrophyInfo                       TrophyRecord;                                      // 0x02C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           LoginWaitTimerHandle;                              // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnBackCalled;                                      // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ATrophyBaseBP_C*                        CurrentTrophyBase;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATrophyBaseBP_C*>                TrophyBaseList;                                    // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void OnCreateTrohpyList__DelegateSignature();
	void OnBackCalled__DelegateSignature();
	void ExecuteUbergraph_WI_TrophyCustomization(int32 EntryPoint);
	void OnClientLoggedIn();
	void Construct();
	void BndEvt__ComboCustomizationTrophyWI_K2Node_ComponentBoundEvent_0_OnReturnFromTrophySelection__DelegateSignature();
	void BndEvt__BackButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void OnSaveSelectedTrophies();
	void OnSuccess_55BB949C4099F2780F4BADA4B0042E2A(const class FString& Message);
	void OnError_55BB949C4099F2780F4BADA4B0042E2A(const class FString& Message);
	void InitializeFromRecord(struct FCloudTrophyInfo& TrophyInfo);
	void Initialize_for_Editor();
	void GetSelectedTrophies(TArray<struct FCloudTrophy>* OutTrophyList);
	void Edit_Trophy_Base(class ATrophyBaseBP_C* SelectedTrophyBase);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TrophyCustomization_C">();
	}
	static class UWI_TrophyCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TrophyCustomization_C>();
	}
};
static_assert(alignof(UWI_TrophyCustomization_C) == 0x000008, "Wrong alignment on UWI_TrophyCustomization_C");
static_assert(sizeof(UWI_TrophyCustomization_C) == 0x000310, "Wrong size on UWI_TrophyCustomization_C");
static_assert(offsetof(UWI_TrophyCustomization_C, UberGraphFrame) == 0x000260, "Member 'UWI_TrophyCustomization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, BackButton) == 0x000268, "Member 'UWI_TrophyCustomization_C::BackButton' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, BackButton_Arrow) == 0x000270, "Member 'UWI_TrophyCustomization_C::BackButton_Arrow' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, bottombarbg) == 0x000278, "Member 'UWI_TrophyCustomization_C::bottombarbg' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, Cabinbox) == 0x000280, "Member 'UWI_TrophyCustomization_C::Cabinbox' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, ComboCustomizationTrophyWI) == 0x000288, "Member 'UWI_TrophyCustomization_C::ComboCustomizationTrophyWI' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, Container) == 0x000290, "Member 'UWI_TrophyCustomization_C::Container' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, Topbarbg) == 0x000298, "Member 'UWI_TrophyCustomization_C::Topbarbg' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, TrophyComboBoxes) == 0x0002A0, "Member 'UWI_TrophyCustomization_C::TrophyComboBoxes' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, OnCreateTrohpyList) == 0x0002B0, "Member 'UWI_TrophyCustomization_C::OnCreateTrohpyList' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, TrophyRecord) == 0x0002C0, "Member 'UWI_TrophyCustomization_C::TrophyRecord' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, LoginWaitTimerHandle) == 0x0002E0, "Member 'UWI_TrophyCustomization_C::LoginWaitTimerHandle' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, OnBackCalled) == 0x0002E8, "Member 'UWI_TrophyCustomization_C::OnBackCalled' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, CurrentTrophyBase) == 0x0002F8, "Member 'UWI_TrophyCustomization_C::CurrentTrophyBase' has a wrong offset!");
static_assert(offsetof(UWI_TrophyCustomization_C, TrophyBaseList) == 0x000300, "Member 'UWI_TrophyCustomization_C::TrophyBaseList' has a wrong offset!");

}

