#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TrophyCustomization

#include "Basic.hpp"

#include "SCT_structs.hpp"


namespace SDK::Params
{

// Function WI_TrophyCustomization.WI_TrophyCustomization_C.ExecuteUbergraph_WI_TrophyCustomization
// 0x00E0 (0x00E0 - 0x0000)
struct WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message_1;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccelByteGIS*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggedIn_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATrophyBaseBP_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCloudTrophy>                   CallFunc_GetSelectedTrophies_OutTrophyList;        // 0x0078(0x0010)(ReferenceParm)
	class UFCTSetTrophyRecordCallbackProxy*       CallFunc_SetTrophyCustomizationRecord_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrophyBaseBP_C*                        CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrophyBaseBP_C*                        CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization) == 0x000008, "Wrong alignment on WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization");
static_assert(sizeof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization) == 0x0000E0, "Wrong size on WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, EntryPoint) == 0x000000, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, K2Node_CustomEvent_Message_1) == 0x000008, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, K2Node_CustomEvent_Message) == 0x000018, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, Temp_string_Variable) == 0x000038, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000050, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_IsLoggedIn_ReturnValue) == 0x000058, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_IsLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_GetAllActorsOfClass_OutActors) == 0x000060, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_GetSelectedTrophies_OutTrophyList) == 0x000078, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_GetSelectedTrophies_OutTrophyList' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_SetTrophyCustomizationRecord_ReturnValue) == 0x000088, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_SetTrophyCustomizationRecord_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, Temp_int_Loop_Counter_Variable_1) == 0x0000A4, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000AC, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, Temp_int_Array_Index_Variable_1) == 0x0000B0, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000CC, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D0, "Member 'WI_TrophyCustomization_C_ExecuteUbergraph_WI_TrophyCustomization::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WI_TrophyCustomization.WI_TrophyCustomization_C.OnSuccess_55BB949C4099F2780F4BADA4B0042E2A
// 0x0010 (0x0010 - 0x0000)
struct WI_TrophyCustomization_C_OnSuccess_55BB949C4099F2780F4BADA4B0042E2A final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TrophyCustomization_C_OnSuccess_55BB949C4099F2780F4BADA4B0042E2A) == 0x000008, "Wrong alignment on WI_TrophyCustomization_C_OnSuccess_55BB949C4099F2780F4BADA4B0042E2A");
static_assert(sizeof(WI_TrophyCustomization_C_OnSuccess_55BB949C4099F2780F4BADA4B0042E2A) == 0x000010, "Wrong size on WI_TrophyCustomization_C_OnSuccess_55BB949C4099F2780F4BADA4B0042E2A");
static_assert(offsetof(WI_TrophyCustomization_C_OnSuccess_55BB949C4099F2780F4BADA4B0042E2A, Message) == 0x000000, "Member 'WI_TrophyCustomization_C_OnSuccess_55BB949C4099F2780F4BADA4B0042E2A::Message' has a wrong offset!");

// Function WI_TrophyCustomization.WI_TrophyCustomization_C.OnError_55BB949C4099F2780F4BADA4B0042E2A
// 0x0010 (0x0010 - 0x0000)
struct WI_TrophyCustomization_C_OnError_55BB949C4099F2780F4BADA4B0042E2A final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TrophyCustomization_C_OnError_55BB949C4099F2780F4BADA4B0042E2A) == 0x000008, "Wrong alignment on WI_TrophyCustomization_C_OnError_55BB949C4099F2780F4BADA4B0042E2A");
static_assert(sizeof(WI_TrophyCustomization_C_OnError_55BB949C4099F2780F4BADA4B0042E2A) == 0x000010, "Wrong size on WI_TrophyCustomization_C_OnError_55BB949C4099F2780F4BADA4B0042E2A");
static_assert(offsetof(WI_TrophyCustomization_C_OnError_55BB949C4099F2780F4BADA4B0042E2A, Message) == 0x000000, "Member 'WI_TrophyCustomization_C_OnError_55BB949C4099F2780F4BADA4B0042E2A::Message' has a wrong offset!");

// Function WI_TrophyCustomization.WI_TrophyCustomization_C.InitializeFromRecord
// 0x0048 (0x0048 - 0x0000)
struct WI_TrophyCustomization_C_InitializeFromRecord final
{
public:
	struct FCloudTrophyInfo                       TrophyInfo;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrophyBaseBP_C*                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WI_TrophyCustomization_C_InitializeFromRecord) == 0x000008, "Wrong alignment on WI_TrophyCustomization_C_InitializeFromRecord");
static_assert(sizeof(WI_TrophyCustomization_C_InitializeFromRecord) == 0x000048, "Wrong size on WI_TrophyCustomization_C_InitializeFromRecord");
static_assert(offsetof(WI_TrophyCustomization_C_InitializeFromRecord, TrophyInfo) == 0x000000, "Member 'WI_TrophyCustomization_C_InitializeFromRecord::TrophyInfo' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_InitializeFromRecord, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WI_TrophyCustomization_C_InitializeFromRecord::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_InitializeFromRecord, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WI_TrophyCustomization_C_InitializeFromRecord::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_InitializeFromRecord, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WI_TrophyCustomization_C_InitializeFromRecord::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_InitializeFromRecord, CallFunc_Array_Find_ReturnValue) == 0x00002C, "Member 'WI_TrophyCustomization_C_InitializeFromRecord::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_InitializeFromRecord, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WI_TrophyCustomization_C_InitializeFromRecord::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_InitializeFromRecord, CallFunc_Array_Get_Item) == 0x000038, "Member 'WI_TrophyCustomization_C_InitializeFromRecord::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_InitializeFromRecord, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WI_TrophyCustomization_C_InitializeFromRecord::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WI_TrophyCustomization.WI_TrophyCustomization_C.Initialize for Editor
// 0x00C8 (0x00C8 - 0x0000)
struct WI_TrophyCustomization_C_Initialize_for_Editor final
{
public:
	TArray<struct FCloudTrophy>                   TempAllTrophies;                                   // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrophyBaseBP_C*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCloudTrophyInfo                       K2Node_MakeStruct_CloudTrophyInfo;                 // 0x0040(0x0020)()
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0060(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCloudTrophy                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TrophyCustomization_C_Initialize_for_Editor) == 0x000008, "Wrong alignment on WI_TrophyCustomization_C_Initialize_for_Editor");
static_assert(sizeof(WI_TrophyCustomization_C_Initialize_for_Editor) == 0x0000C8, "Wrong size on WI_TrophyCustomization_C_Initialize_for_Editor");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, TempAllTrophies) == 0x000000, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::TempAllTrophies' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_Array_Get_Item) == 0x000030, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, K2Node_MakeStruct_CloudTrophyInfo) == 0x000040, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::K2Node_MakeStruct_CloudTrophyInfo' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000060, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000C0, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C1, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Initialize_for_Editor, CallFunc_Array_Add_ReturnValue) == 0x0000C4, "Member 'WI_TrophyCustomization_C_Initialize_for_Editor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WI_TrophyCustomization.WI_TrophyCustomization_C.GetSelectedTrophies
// 0x0048 (0x0048 - 0x0000)
struct WI_TrophyCustomization_C_GetSelectedTrophies final
{
public:
	TArray<struct FCloudTrophy>                   OutTrophyList;                                     // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FCloudTrophy>                   TempTrophyList;                                    // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrophyBaseBP_C*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TrophyCustomization_C_GetSelectedTrophies) == 0x000008, "Wrong alignment on WI_TrophyCustomization_C_GetSelectedTrophies");
static_assert(sizeof(WI_TrophyCustomization_C_GetSelectedTrophies) == 0x000048, "Wrong size on WI_TrophyCustomization_C_GetSelectedTrophies");
static_assert(offsetof(WI_TrophyCustomization_C_GetSelectedTrophies, OutTrophyList) == 0x000000, "Member 'WI_TrophyCustomization_C_GetSelectedTrophies::OutTrophyList' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_GetSelectedTrophies, TempTrophyList) == 0x000010, "Member 'WI_TrophyCustomization_C_GetSelectedTrophies::TempTrophyList' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_GetSelectedTrophies, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WI_TrophyCustomization_C_GetSelectedTrophies::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_GetSelectedTrophies, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WI_TrophyCustomization_C_GetSelectedTrophies::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_GetSelectedTrophies, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WI_TrophyCustomization_C_GetSelectedTrophies::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_GetSelectedTrophies, CallFunc_Array_Get_Item) == 0x000030, "Member 'WI_TrophyCustomization_C_GetSelectedTrophies::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_GetSelectedTrophies, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WI_TrophyCustomization_C_GetSelectedTrophies::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_GetSelectedTrophies, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WI_TrophyCustomization_C_GetSelectedTrophies::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_GetSelectedTrophies, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'WI_TrophyCustomization_C_GetSelectedTrophies::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WI_TrophyCustomization.WI_TrophyCustomization_C.Edit Trophy Base
// 0x0028 (0x0028 - 0x0000)
struct WI_TrophyCustomization_C_Edit_Trophy_Base final
{
public:
	class ATrophyBaseBP_C*                        SelectedTrophyBase;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrophyBaseBP_C*                        CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WI_TrophyCustomization_C_Edit_Trophy_Base) == 0x000008, "Wrong alignment on WI_TrophyCustomization_C_Edit_Trophy_Base");
static_assert(sizeof(WI_TrophyCustomization_C_Edit_Trophy_Base) == 0x000028, "Wrong size on WI_TrophyCustomization_C_Edit_Trophy_Base");
static_assert(offsetof(WI_TrophyCustomization_C_Edit_Trophy_Base, SelectedTrophyBase) == 0x000000, "Member 'WI_TrophyCustomization_C_Edit_Trophy_Base::SelectedTrophyBase' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Edit_Trophy_Base, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WI_TrophyCustomization_C_Edit_Trophy_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_TrophyCustomization_C_Edit_Trophy_Base, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WI_TrophyCustomization_C_Edit_Trophy_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
