#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WideMenuTutorialWI

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WideMenuTutorialWI.WideMenuTutorialWI_C
// 0x0018 (0x0278 - 0x0260)
class UWideMenuTutorialWI_C final : public UUserWidget
{
public:
	class UImage*                                 ImageTut;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTut_2;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_59;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WideMenuTutorialWI_C">();
	}
	static class UWideMenuTutorialWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWideMenuTutorialWI_C>();
	}
};
static_assert(alignof(UWideMenuTutorialWI_C) == 0x000008, "Wrong alignment on UWideMenuTutorialWI_C");
static_assert(sizeof(UWideMenuTutorialWI_C) == 0x000278, "Wrong size on UWideMenuTutorialWI_C");
static_assert(offsetof(UWideMenuTutorialWI_C, ImageTut) == 0x000260, "Member 'UWideMenuTutorialWI_C::ImageTut' has a wrong offset!");
static_assert(offsetof(UWideMenuTutorialWI_C, ImageTut_2) == 0x000268, "Member 'UWideMenuTutorialWI_C::ImageTut_2' has a wrong offset!");
static_assert(offsetof(UWideMenuTutorialWI_C, RichTextBlock_59) == 0x000270, "Member 'UWideMenuTutorialWI_C::RichTextBlock_59' has a wrong offset!");

}

