#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XrayGA

#include "Basic.hpp"


namespace SDK::Params
{

// Function XrayGA.XrayGA_C.ExecuteUbergraph_XrayGA
// 0x0048 (0x0048 - 0x0000)
struct XrayGA_C_ExecuteUbergraph_XrayGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue_1;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(XrayGA_C_ExecuteUbergraph_XrayGA) == 0x000008, "Wrong alignment on XrayGA_C_ExecuteUbergraph_XrayGA");
static_assert(sizeof(XrayGA_C_ExecuteUbergraph_XrayGA) == 0x000048, "Wrong size on XrayGA_C_ExecuteUbergraph_XrayGA");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, EntryPoint) == 0x000000, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, CallFunc_WaitDelay_ReturnValue) == 0x000018, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, CallFunc_IsDedicatedServer_ReturnValue) == 0x000021, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000022, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, CallFunc_WaitDelay_ReturnValue_1) == 0x000028, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::CallFunc_WaitDelay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, CallFunc_K2_CommitAbility_ReturnValue) == 0x000041, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, K2Node_Event_bWasCancelled) == 0x000042, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(XrayGA_C_ExecuteUbergraph_XrayGA, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000043, "Member 'XrayGA_C_ExecuteUbergraph_XrayGA::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");

// Function XrayGA.XrayGA_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct XrayGA_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(XrayGA_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on XrayGA_C_K2_OnEndAbility");
static_assert(sizeof(XrayGA_C_K2_OnEndAbility) == 0x000001, "Wrong size on XrayGA_C_K2_OnEndAbility");
static_assert(offsetof(XrayGA_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'XrayGA_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function XrayGA.XrayGA_C.GetContextDescription
// 0x0018 (0x0018 - 0x0000)
struct XrayGA_C_GetContextDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(XrayGA_C_GetContextDescription) == 0x000008, "Wrong alignment on XrayGA_C_GetContextDescription");
static_assert(sizeof(XrayGA_C_GetContextDescription) == 0x000018, "Wrong size on XrayGA_C_GetContextDescription");
static_assert(offsetof(XrayGA_C_GetContextDescription, ReturnValue) == 0x000000, "Member 'XrayGA_C_GetContextDescription::ReturnValue' has a wrong offset!");

// Function XrayGA.XrayGA_C.GetCharacterCamera
// 0x0020 (0x0020 - 0x0000)
struct XrayGA_C_GetCharacterCamera final
{
public:
	class UCameraComponent*                       FollowCamera;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(XrayGA_C_GetCharacterCamera) == 0x000008, "Wrong alignment on XrayGA_C_GetCharacterCamera");
static_assert(sizeof(XrayGA_C_GetCharacterCamera) == 0x000020, "Wrong size on XrayGA_C_GetCharacterCamera");
static_assert(offsetof(XrayGA_C_GetCharacterCamera, FollowCamera) == 0x000000, "Member 'XrayGA_C_GetCharacterCamera::FollowCamera' has a wrong offset!");
static_assert(offsetof(XrayGA_C_GetCharacterCamera, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'XrayGA_C_GetCharacterCamera::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_GetCharacterCamera, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000010, "Member 'XrayGA_C_GetCharacterCamera::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
static_assert(offsetof(XrayGA_C_GetCharacterCamera, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'XrayGA_C_GetCharacterCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function XrayGA.XrayGA_C.SetXrayPostProcess
// 0x0058 (0x0058 - 0x0000)
struct XrayGA_C_SetXrayPostProcess final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFCTPostProcessVolume_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	TArray<class AFCTPostProcessVolume_C*>        CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0028(0x0010)(ReferenceParm)
	class AFCTPostProcessVolume_C*                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFCTPostProcessVolume_C*                CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(XrayGA_C_SetXrayPostProcess) == 0x000008, "Wrong alignment on XrayGA_C_SetXrayPostProcess");
static_assert(sizeof(XrayGA_C_SetXrayPostProcess) == 0x000058, "Wrong size on XrayGA_C_SetXrayPostProcess");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, On) == 0x000000, "Member 'XrayGA_C_SetXrayPostProcess::On' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, Temp_int_Variable) == 0x000004, "Member 'XrayGA_C_SetXrayPostProcess::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'XrayGA_C_SetXrayPostProcess::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, Temp_int_Variable_1) == 0x00000C, "Member 'XrayGA_C_SetXrayPostProcess::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'XrayGA_C_SetXrayPostProcess::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'XrayGA_C_SetXrayPostProcess::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000028, "Member 'XrayGA_C_SetXrayPostProcess::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, CallFunc_Array_Get_Item) == 0x000038, "Member 'XrayGA_C_SetXrayPostProcess::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'XrayGA_C_SetXrayPostProcess::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'XrayGA_C_SetXrayPostProcess::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'XrayGA_C_SetXrayPostProcess::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'XrayGA_C_SetXrayPostProcess::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetXrayPostProcess, CallFunc_Less_IntInt_ReturnValue_1) == 0x000051, "Member 'XrayGA_C_SetXrayPostProcess::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function XrayGA.XrayGA_C.SetCustomRenderDepthOnActors
// 0x0150 (0x0150 - 0x0000)
struct XrayGA_C_SetCustomRenderDepthOnActors final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AButton_DoorOpener_Chandelier_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	class AButton_DoorOpener_Chandelier_C*        CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATrashCompactorBP_C*>            CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0060(0x0010)(ReferenceParm)
	class ATrashCompactorBP_C*                    CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASurveilanceCameraSCTBP_C*>      CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0080(0x0010)(ReferenceParm)
	TArray<class AWallTeleporterSCTBP_C*>         CallFunc_GetAllActorsOfClass_OutActors_3;          // 0x0090(0x0010)(ReferenceParm)
	class ASurveilanceCameraSCTBP_C*              CallFunc_Array_Get_Item_2;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWallTeleporterSCTBP_C*                 CallFunc_Array_Get_Item_3;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALootStand_PassengerlogBP_C*>    CallFunc_GetAllActorsOfClass_OutActors_4;          // 0x00C0(0x0010)(ReferenceParm)
	TArray<class AOxygenGeneratorBP_C*>           CallFunc_GetAllActorsOfClass_OutActors_5;          // 0x00D0(0x0010)(ReferenceParm)
	class ALootStand_PassengerlogBP_C*            CallFunc_Array_Get_Item_4;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOxygenGeneratorBP_C*                   CallFunc_Array_Get_Item_5;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALootStandPersonoidBP_C*>        CallFunc_GetAllActorsOfClass_OutActors_6;          // 0x0100(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALootStandPersonoidBP_C*                CallFunc_Array_Get_Item_6;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacterSCTBP_C*>              CallFunc_GetAllActorsOfClass_OutActors_7;          // 0x0128(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterSCTBP_C*                      CallFunc_Array_Get_Item_7;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(XrayGA_C_SetCustomRenderDepthOnActors) == 0x000008, "Wrong alignment on XrayGA_C_SetCustomRenderDepthOnActors");
static_assert(sizeof(XrayGA_C_SetCustomRenderDepthOnActors) == 0x000150, "Wrong size on XrayGA_C_SetCustomRenderDepthOnActors");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, On) == 0x000000, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::On' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, Temp_int_Variable) == 0x000004, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, Temp_int_Variable_1) == 0x000008, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, Temp_int_Variable_2) == 0x000014, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, Temp_int_Variable_3) == 0x000018, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Add_IntInt_ReturnValue_2) == 0x00001C, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Add_IntInt_ReturnValue_3) == 0x000020, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, Temp_int_Variable_4) == 0x000024, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, Temp_int_Variable_5) == 0x000028, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Add_IntInt_ReturnValue_4) == 0x00002C, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Add_IntInt_ReturnValue_5) == 0x000030, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, Temp_int_Variable_6) == 0x000034, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Add_IntInt_ReturnValue_6) == 0x000038, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Get_Item) == 0x000050, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000060, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Less_IntInt_ReturnValue_1) == 0x00007C, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000080, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_GetAllActorsOfClass_OutActors_3) == 0x000090, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_GetAllActorsOfClass_OutActors_3' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Get_Item_2) == 0x0000A0, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Get_Item_3) == 0x0000A8, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Length_ReturnValue_2) == 0x0000B0, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Length_ReturnValue_3) == 0x0000B4, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000B8, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000B9, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_GetAllActorsOfClass_OutActors_4) == 0x0000C0, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_GetAllActorsOfClass_OutActors_4' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_GetAllActorsOfClass_OutActors_5) == 0x0000D0, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_GetAllActorsOfClass_OutActors_5' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Get_Item_4) == 0x0000E0, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Get_Item_5) == 0x0000E8, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Length_ReturnValue_4) == 0x0000F0, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Length_ReturnValue_5) == 0x0000F4, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Less_IntInt_ReturnValue_4) == 0x0000F8, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Less_IntInt_ReturnValue_5) == 0x0000F9, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_GetAllActorsOfClass_OutActors_6) == 0x000100, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_GetAllActorsOfClass_OutActors_6' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, Temp_int_Loop_Counter_Variable) == 0x000110, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Get_Item_6) == 0x000118, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Add_IntInt_ReturnValue_7) == 0x000120, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Length_ReturnValue_6) == 0x000124, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_GetAllActorsOfClass_OutActors_7) == 0x000128, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_GetAllActorsOfClass_OutActors_7' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Less_IntInt_ReturnValue_6) == 0x000138, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Get_Item_7) == 0x000140, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Array_Length_ReturnValue_7) == 0x000148, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(XrayGA_C_SetCustomRenderDepthOnActors, CallFunc_Less_IntInt_ReturnValue_7) == 0x00014C, "Member 'XrayGA_C_SetCustomRenderDepthOnActors::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");

// Function XrayGA.XrayGA_C.XrayAudio
// 0x0028 (0x0028 - 0x0000)
struct XrayGA_C_XrayAudio final
{
public:
	class UAkAudioEvent*                          XraySound;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterSCTBP_C*                      K2Node_DynamicCast_AsCharacter_SCTBP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(XrayGA_C_XrayAudio) == 0x000008, "Wrong alignment on XrayGA_C_XrayAudio");
static_assert(sizeof(XrayGA_C_XrayAudio) == 0x000028, "Wrong size on XrayGA_C_XrayAudio");
static_assert(offsetof(XrayGA_C_XrayAudio, XraySound) == 0x000000, "Member 'XrayGA_C_XrayAudio::XraySound' has a wrong offset!");
static_assert(offsetof(XrayGA_C_XrayAudio, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'XrayGA_C_XrayAudio::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_XrayAudio, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000010, "Member 'XrayGA_C_XrayAudio::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(XrayGA_C_XrayAudio, K2Node_DynamicCast_AsCharacter_SCTBP) == 0x000018, "Member 'XrayGA_C_XrayAudio::K2Node_DynamicCast_AsCharacter_SCTBP' has a wrong offset!");
